{"address": ["210 Andover St", "Peabody, MA 01960"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.5], [4, 3.5], [5, 3.5], [6, 4.0], [7, 4.0], [8, 3.5], [9, 3.0], [10, 3.0], [11, 3.0]], "2017": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 2.5], [4, 2.5], [5, 2.5], [6, 3.0], [7, 2.5], [8, 2.5], [9, 2.5], [10, 2.5], [11, 2.5]], "2020": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.5], [5, 3.5], [6, 2.5], [7, 2.0], [8, 2.0], [9, 2.5], [10, 3.0], [11, 3.0]], "2018": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.0], [4, 4.0], [5, 4.0], [6, 4.0], [7, 4.0], [8, 4.0], [9, 3.5], [10, 4.0], [11, 3.5]], "2021": [[0, 3.0], [1, 3.0]]}, "reviews": [{"text": "Checked in at 6:05 for a 6:15 reservation which was made via Yelp.  Checked on the status three times and was told each time our table was just being cleared.  We were finally seated a little before 7.  Why bother with reservations if they don&amp;#39;t actually mean anything?  Food and service were good once we finally got to our table.", "rating": 2, "date": "10/2/2020"}, {"text": "Worst pick up experience ever. Text me order was ready at 732 waiting in long car line got to the front of bldg at 755 they ask name 15 min later approx 810 worker says the manager is trying to find u your order part of it is missing. 830 another worker asks me to pull up I replied no sorry ia have been siting her since 755 with no explanation of the status of my paid order. 830 worker comes back can you move up now I am angry 835 waited over q and a half hour while 30 to 40 othe r people received their order i said just cancel my order this is ridiculous. OK no problem. Whatever he replied. No where else open . Horrible.  They ruined my mothers day dinner with my 7 children shame on you cheesecake factory Peabody Ma", "rating": 1, "date": "5/10/2020"}, {"text": "I ordered from Cheesecake Factory in Peabody last night. I understand times are tough but my living situation just changed and my only option was take out. I ordered orange chicken which I always get at other locations (In Boston) with white rice. It was ready early, great. One bite into the white rice it tasted fishy. I have severe allergies with fish. I&amp;#39;m not sure if they serve sushi, or had the same scooper as something they use with fish also for the rice mound. Second bite tasted like the ocean or seaweed. I have been up all night now getting sick as it was for sure an allergic reaction. This is the second time I&amp;#39;ve had food cross contaminated from this location. Sorry won&amp;#39;t be ordering again. Luckily I used my epi-pen and didn&amp;#39;t have to be seen via ER with this covid-19 filling them up.<br&gt;<br&gt;I don&amp;#39;t appreciate the automatic, fill out our survey response. I&amp;#39;ve waisted enough time and risked my health cheesecake has heard enough from my commentary above.", "rating": 1, "date": "4/10/2020"}, {"text": "This is my favorite of all chain restaurants. I don&amp;#39;t think any of the other ones to compare. My favorite thing is a miso Salmon in the avocado eggrolls.", "rating": 5, "date": "2/21/2020"}, {"text": "Awful social distancing where you have to check in in the small vestibule, embarrassingly awful, I don&amp;#39;t know why they don&amp;#39;t utilize their larger foyer or have it outside with tape where each party should stand and wait 6ft apart. I had pretty good service. I was very unhappy with my meal. &amp;#34;Four cheese pasta no chicken.&amp;#34; It had chicken and I&amp;#39;m a vegetarian, also they were out of penne which makes the dish I wish I had known before I ordered and could have gotten something else. The pasta it came with was so chewy and couldn&amp;#39;t eat any pieces that were touching the chicken which was mixed in and hidden. Disappointing usually I love this place.", "rating": 2, "date": "8/22/2020"}, {"text": "I scheduled a reservation for 5 people for 6:00pm. We all get to the restaurant, check in at the desk and they tell us that the people who are at our booth have not left yet, but they would text us when our table was ready. Meanwhile, there were many other open tables, but okay. I figured they had one large table reserved for larger parties. We were not seated until 6:45, which was frustrating in itself. Come to find out, they shoved all 5 of us in a small booth! We didn&amp;#39;t appreciate being on top of each other, especially during COVID. It was like we couldn&amp;#39;t even move. We ask to move to a larger table with chairs, the man at the bar said he wasn&amp;#39;t sure there were any open (meanwhile, we were looking at about 10 open tables). Another waitress comes over, we ask her if we can sit outside on the patio, to which she says &amp;#39;The patio is closed.&amp;#39; with an attitude. There were people eating on the patio! At that point, we got up an left. On our way out we noted that tables of people were bunched up, NOT 6 feet apart. Meanwhile, half the restaurant was empty! Why have people sitting so close to each other? Horrible wait time, horrible service.", "rating": 1, "date": "8/20/2020"}, {"text": "My favorite chain restaurant does it again, offers a delicious meal, mouth watering cheesecake, and attentive service. <br&gt;<br&gt;I went out on a limb and ordered the coconut lime chicken curry. It was delicious. I was almost licking the sauce off of my plate. Thankfully, I had the house bread to help me out.<br&gt;<br&gt;I ordered the 30th anniversary cheesecake which was layered with plain cheesecake and chocolate cake. Not my favorite option, but I&amp;#39;m not complaining. <br&gt;<br&gt;The downside is that they were not accepting reservations and therefore, our party of 6 waited one hour in the lobby while everyone else was being sat.", "rating": 4, "date": "5/19/2018"}, {"text": "Whenever i can afford it... I come to the cheesecake factory. <br&gt;Yes, the wait lines are a pain in the but. Yes, you need to save like 3 month in advance to be able to affors it BUT, the service is good and the food is great. At least you know there&amp;#39;s someone cooking your food and not putting it on the microwave because it has been already premade and frozen.", "rating": 5, "date": "3/23/2019"}, {"text": "We made a reservation in October at 5pm and requested the patio and spoke to someone the night before the reservation to make sure we have a spot on the patio. We did not get to sit until 5:45pm and were told patio was closed. However there were other people sitting outside and dining on the patio so I don&amp;#39;t understand why. So finally we sit at our table. The food is overpriced and the servers have no idea what allergies are. I ordered the impossible bolognese vegan and gluten free. When the server brought my food I asked if this was the vegan one and they said yes. I started eating it and then a few minutes later a different lady came out with my pasta and said &amp;#34;sweetie no this is your food not what you are eating now&amp;#34;. I have a dairy sensitivity so they are so lucky I wasn&amp;#39;t severely allergic to any of the things I said no to. I did get a bad stomach ache for the rest of the night and the next day. I got stared at by every employee for the rest of the time there, the girl who lied and said it was vegan never apologized. The manager at least came over to check in. They did not comp my food they messed up I had to ask for them to remove it off the check. Worst place I&amp;#39;ve ever been to. We were celebrating 2 of my friends birthdays and it was my first time there. I will NEVER be going back to Cheesecake Factory ever! And I recommend anyone with an allergy should not go since the managers don&amp;#39;t educate their staff on what food allergies are and how important it is. If you have no allergies and wanna spend a lot of money you might like the food. Servers please learn the food you are serving, it&amp;#39;s very important since it can cost someone&amp;#39;s life and ruin their day. Us customers want to go out for a nice good meal and do NOT receive that. Also server was super slow and barely showed up at the table.", "rating": 1, "date": "11/10/2020"}, {"text": "A very hard working waitstaff just couldn&amp;#39;t overcome the Saturday night crowd to provide us with a timely table, drinks, food and bill. The one bench couldn&amp;#39;t accommodate the crowd, so there wasn&amp;#39;t enough seating for my handicapped mother and son suffering from a very painful leg hematoma and on crutches. CF wasn&amp;#39;t our first choice, but it was Lucy&amp;#39;s 7th birthday and her vote was non-negotiable. <br&gt;<br&gt;Our dishes were ambrosial. My Thai chicken with brown rice included shiitake mushrooms and a sauce that took my breath away.  Mother said her chicken riesling was delicious. The cheesecake was light and fluffy. We counted at least 8 groups having &amp;#39;Happy Birthday&amp;#34; sung to them - it must be Beverly birthday central.<br&gt;<br&gt;Why three stars? Two of our party who shared the carrot cake and whipped cream had explosive tummy issues that night. Minus 3 for that issue and the overwhelmed staff and reservation refusal policy, not to mention a menu so confusing that it lists items twice under different categories. <br&gt;<br&gt;They do deserve one additional star for all the birthday boys and girls who choose The Cheesecake Factory to celebrate their important day. That&amp;#39;s worth something.", "rating": 3, "date": "6/3/2018"}, {"text": "I decided to take my mom here for and early lunch. Place is very nice. We were seated right away, ordered our drinks, my mom got a soda, I got a water and also the strawberry creamsicle &amp;#34;spiked&amp;#34; drink. We we got the drinks as I was drinking my strawberry creamsicle i was crunching on something at the bottom, which at first appeared to be rock sugar, then my teeth started to hurt and I thought my tooth had broke cause the sound was NoT as if I was chewing sugar. Apparently the was pieces of glass at the bottom of my drink. The server offered to replace the drink with a new one and said he would take it off the bill, then when we got the bill it was there. Very disappointing.. I may need to go to the hospital because my teeth and gums hirt mo<br&gt;<br&gt;Update: contacted customer services as they had asked. And still nothing. You figure they would be on top of this due to their high standards!", "rating": 1, "date": "4/16/2018"}, {"text": "This is for the North Shore Mall Peabody location.  Horrible service.  Called in for them to drop to my car.  Waited an extra 15 minutes past the time they promised it and finally went in to pick it up.  No one at desk so waited longer.  No apology, nothing.  Driving out of the mall I reached into bag to grab a fry and it was ICE COLD.<br&gt;Got home, tried the burger and it pretty bad.  Had a funny taste part of the way through it.<br&gt;This is just a warning to others.  GO somewhere else!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "rating": 1, "date": "10/18/2019"}, {"text": "Waited 1 hour &amp;amp; 1/2  for our food for two people and when we got our food it was cold, the steak wasn&amp;#39;t well done it was rare.", "rating": 1, "date": "7/6/2020"}, {"text": "For an enormous restaurant made even more famous by the Big Bang Theory, the Cheesecake Factory surprised us with a varied and very good menu.  The chopped salad had grilled chicken and avocado and the vinaigrette dressing was quite tasty.  My wife raved about the Tuscany chicken which had a substantial amount of chicken and asparagus.  The wait staff was efficient and the bread was fresh.<br&gt;Again, for a huge and busy place, they make going to the mall a desirable experience.  We will return.", "rating": 4, "date": "4/29/2018"}, {"text": "My mother really likes this place but honestly, I&amp;#39;m not much of a fan. Their menu is huge which makes me wonder how freshly made the food really is. The real reason to visit is the cheesecake. They&amp;#39;ve got an amazing selection.<br&gt;We went for lunch and I was really disappointed. My mother went with regular spaghetti and meatballs and it was great (tried some of hers as I couldn&amp;#39;t eat mine). I tried the chicken and biscuit dish and it was terrible. The sauce tasted weird, the veggies were not even thoroughly cooked and the chicken tasted rotten. I ate maybe two bites and decided I didn&amp;#39;t want to get sick. Our waiter was nice about it and to their credit they took it off of the bill but I don&amp;#39;t think I&amp;#39;d trust buying another meal there.<br&gt;We did get cheesecake for dessert. It&amp;#39;s good but overpriced. I went with the lemon raspberry. Very good. My mother got a celebration one and it was huge. She liked it but couldn&amp;#39;t eat all of it (she took it home). <br&gt;Very long wait for seriously mediocre food. I didn&amp;#39;t like being seated near the waiter station either as I got to hear a waiter describe to a new waiter how much it all sucked and what kind of customers to avoid. Maybe discuss that away from customers?", "rating": 2, "date": "1/2/2019"}, {"text": "I could write endless reviews about all the food from here because every time I come I try a new entree and cheesecake. I&amp;#39;m deciding to write a review now to talk about their flatbread pizza. People may be skeptical about it from here, but I really enjoyed the fresh basil, tomato, and mozzarella flatbread. The seasonings on top were really nice except it was a little bit too salty (probably because of the fontina and mozzarella cheese combo+the seasoning), but I still enjoyed it. I usually ask for pizzas well done, but I forgot and will make sure to next time even though the crust still had a crunchy bite to it. My boyfriend got the New York steak and he said he LOVED it; I can confirm this because I had a bite lol. <br&gt;Moving onto dessert. We shared the lemon meringue cheesecake and it was perfect. So light and creamy and the lemon flavor was great and tangy. I loved the torched part on top.", "rating": 5, "date": "5/30/2019"}, {"text": "The food is awesome but the customer service is a flipping joke. I called in for a pick up and the girl on the phone puts me on hold for 15:29 minutes . Sorry but no place is THAT busy on take out to not Atleast take my order and tell me it&amp;#39;s going to be an hour or longer . The girl that I  finally ordered from seemed so annoyed and rude  . I was so annoyed that my husband went in to see if I was being irrational and maybe they were really busy ... he said there were 4-6 people just sitting there taking to one another . Really good  food but I&amp;#39;d rather order from some place else that actually cares about the customer", "rating": 3, "date": "11/2/2019"}, {"text": "I went there got a 30 dollar meal tipped them 3 dollars then I went to my billing and it said I owed them 2,000,000", "rating": 1, "date": "2/7/2020"}, {"text": "The wait was a little long but that was expected on a Saturday night . After about and hour wait we were finally sat . Our waitress was nice but very forgetful and  inattentive.We were greeted right away and took our drink order at that time we put in an appetizer right away .. after a hour wait we were quite hungry. Well 10-15 minutes later when the waitress came back to take our order asked if we would like to start with an appetizer? Umm we ordered one 10-15 minutes ago she stated oh yes no worries I put that in ...30 minutes later the appetizer arrived .Our entrée came out about 30 minutes later . The food runner dropped our food off , our waitress never came back to check on us I had to ask the runner for knives, salt and pepper and water because our waitress never came back until we were ready for boxes and a check, The food was hot and delicious but the service was terrible.It was like drop and go and here is the check ! Don&amp;#39;t get me started about the bakery decided to grab 2 cheesecakes to go 20 minutes later ... seriously!! Very Disappointing and Disorganized!!! Staff was more interested in socializing. Won&amp;#39;t be back anytime soon!", "rating": 2, "date": "7/25/2020"}, {"text": "Got take out, drove all the way home to find a huge dead moth-like bug on the lettuce.", "rating": 1, "date": "12/17/2019"}, {"text": "My family and I came for a Sunday dinner, and what a busy evening it was! Despite the craziness  inside, our server was very attentive and friendly. If  you can request to have Kevin as your server. He made  our experience! Kevin always approached us with a warm smile. He came to the table while we were telling a story in Spanish and provided the perfect  response in our culture. It made us feel more comfortable and ready to enjoy the phenomenal food! Thank you for a wonderful dinner experience, Kevin!", "rating": 5, "date": "1/19/2020"}, {"text": "My daughter &amp;amp; I went to the CF for lunch. So many choices! My daughter had the chicken parm sandwich with standard French Fries. I ordered the Cubano sandwich.  I was very excited about my selection! For my side item a house salad; I upgraded to make that a Greek salad by requesting feta cheese &amp;amp; kalamata olives.  I was accommodated with plenty of each for a modest upcharge.   I highly recommend the Cubano - pork was so moist and delicious.  The amount of Swiss cheese, pickles &amp;amp; mustard was a perfect ratio.  My daughter was very pleased with her chicken parm sandwich.  I&amp;#39;m looking forward to my next visit to the Cheesecake Factory!   Our waiter, Cristian, was excellent &amp;amp; super accommodating.", "rating": 4, "date": "12/1/2018"}, {"text": "Came here today with my sister&amp;#39;s family and my family. I was the first to order and last to get mine. When my food came out my plate was hotter than my food. Food was luke warm. Disappointed that you spend a lot of money for quality food and this is what happens. Stick to selling Cheese Cake because at least that won&amp;#39;t bother people when it comes out cold.", "rating": 1, "date": "12/29/2019"}, {"text": "This location is my favorite one. The waiting time isn&amp;#39;t long. The customer service is always good. Quick service and always on top with refilling your drinks. I always got the Louisiana chicken pasta. The fried chicken is seasoned just right and always crunchy. The sauce is absolutely amazing. The portion is always huge! Their chicken Marsala is great too. The sauce isn&amp;#39;t too heavy but perfect. Ohh and their fries are delicious too. Always crispy and fried perfectly. I always have to order a side plate of their fries whenever I am here. Only if their prices are a little on the lower side then I would come here every week just for their awesome Louisiana chicken pasta.", "rating": 4, "date": "5/17/2017"}, {"text": "I really love this place. Specially sitting at the bar. Always get good service. Food is great. Only reason I can&amp;#39;t give it the 5th star is the lack of options for vegans. Come on guys. A good tofu dish???", "rating": 4, "date": "5/28/2018"}, {"text": "So a disappointing experience, actually a better word would be aggravating. My wife and I stopped by for dinner the other night and I always get the same thing &amp;#34;bang bang chicken and shrimp&amp;#34;. The waitress was great but when the food came it tasted off. I realized that there were chunks of apples and apple sauce in it which has never been in it before. The waitress wanted to double check and when the manager finally came over she told me that the dish was supposed to have apple sauce in it and they just didn&amp;#39;t crush them enough and that&amp;#39;s why there  were chunks of apples in it. She asked if I wanted them to remake it without the apple sauce but since my wife was almost done I just had them remake it to go. When I got home I tried some and it tasted perfect (no apples). I looked at the menu online and there are no apples or sauce in this dish. So the manager came over and didn&amp;#39;t want to admit they made a mistake and made me feel as if I was stupid and didn&amp;#39;t know what I was ordering. Like I said really aggravating. With dinner drinks and dessert I paid over $100 for a dinner for this woman to treat me like I didn&amp;#39;t know what I ordered.", "rating": 2, "date": "9/5/2019"}, {"text": "I went there last Saturday  for lunch <br&gt;It was pretty packed<br&gt;We sat down in near bar areas <br&gt;Our waiter took our orders then  after that  he disappeared  I wasn&amp;#39;t sure what happened then we had other waiter there was no communication that he left <br&gt;Service was lacking that day <br&gt;Foods was okay not great  <br&gt;Needs lots of improvement  in Service and dealing with deaf people", "rating": 3, "date": "3/13/2018"}, {"text": "Such an extensive menu of meals and drinks. I can never decide what to order. It&amp;#39;s beyond pages and pages. <br&gt;<br&gt;The ambience and decor sets a nice mood, although I&amp;#39;m not one for the extra dim lighting. I get the whole romantic vibe but I would really prefer to not eat my dinner in the dark. <br&gt;<br&gt;Service is usually a hit or miss. Sometimes they&amp;#39;re on point while others including my visit last night was terrible. We waited an extra 30 mins or so for our meals after finishing our app. By the time dinner arrived I no longer wanted it. I would&amp;#39;ve gotten desert but I was afraid I&amp;#39;d have to wait an eternity for it as well.<br&gt;<br&gt;Plenty of parking. You will most likely struggle during the mall rush though. Prices are on the higher side but the portions are huge.", "rating": 4, "date": "5/17/2015"}, {"text": "They get the 2 stars for SA on tap no starts for food. Ordered a pepperoni flat bread. What I got was a misshaped pizzia not a flat bread", "rating": 2, "date": "1/8/2020"}, {"text": "Waited 40 mins for our food to come out despite the restaurant being empty and it came out cold. We didn&amp;#39;t even receive everything we ordered even 10 mins of having the first few things come out. Took forever for our server to come to the table so we could tell him it was cold, he took everything back and sent the manager over who basically said I can heat it up for you. We said no and left after sitting there for 45 mins with just water. He didn&amp;#39;t even offer to buy a dessert or do anything to make us think about coming back. Won&amp;#39;t be returning.", "rating": 1, "date": "9/10/2019"}, {"text": "Love this place! Awesome kids menu. Largest kids pizza ever (really too big!) Wish I had taken a picture.", "rating": 5, "date": "4/3/2019"}, {"text": "All I&amp;#39;m gonna say is: order the nachos extra crispy and request CARLOS for your server! Pure man! Great service!", "rating": 5, "date": "11/30/2018"}, {"text": "Great food and Best service we&amp;#39;ve ever had. Wayne was amazing and made our night so special. We will definitely be back !!", "rating": 5, "date": "11/1/2019"}, {"text": "I love the Cheesecake Factory because of its menu and it&amp;#39;s cocktails but this location goes above and beyond. Mike the bartender is so attentive and makes the best espresso martinis!!! Gary the manager was so accommodating and made sure our meals and experience were top notch. I highly recommend going in and giving them all your business because you will not only get a PERFECT experience but you&amp;#39;ll get the best of the best service. <br&gt;<br&gt;Thank you for always giving me a reason to come back!!!!!", "rating": 5, "date": "5/7/2018"}, {"text": "Always good service, the food is pretty good. I prefer the appetizers, weekend Brunch and the cheesecakes. Nothing is amazing but everything is flavorful and they are accommodating to changes to the order.", "rating": 4, "date": "2/22/2018"}, {"text": "We had a great family meal at Cheesecake tonight. I know the portions are very large, so I wouldn&amp;#39;t let me son order an appetizer. We loved their warm bread, though. My daughter&amp;#39;s full-size salad was massive, as expected. She took half home because she enjoyed it. I got the Skinny Chopped salad. It was just right along with the bread and to save room for dessert. Initially my son was overwhelmed by the number of menu items. He settled on the Mac and Cheese burger. Pretty cool choice. We shared a couple of slices of cheesecake. I preferred the lemon raspberry variety over the chocolate chip.<br&gt;Our services was very good. We dined outside. The view wasn&amp;#39;t much, but it was great weather.", "rating": 5, "date": "8/31/2016"}, {"text": "Had good fettuccine alfredo the first time I came here. The large menu is what I appreciate because they have tacos, steak, pasta, pizza, hamburgers, everything. I&amp;#39;m not a fan of cheesecake but I&amp;#39;ve had their fudge cake and tiramisu and both were very good. Last night when I went, our service was good despite the slightly long wait.", "rating": 4, "date": "2/23/2019"}, {"text": "My son and I had dinner at the bar last weekend. It was the usual busy. But not craZy. I had a couple drinks. We both had dinner and desert. The food tasted ok not great but not bad. The bar service however was terrible. The two guys were more interested in picking up dates than waiting on us. Never checked on us", "rating": 2, "date": "3/20/2019"}, {"text": "Extremely busy even on a Sunday night at 8pm. The parking lot was pitch black -- none of the parking lot lights were working -- kinda dangerous. Noise levels inside were ultra loud. A lot of the lights in the restaurant were also not working which made the place feel unmaintained. Most of the food was good but the French fries were actually some of the worst I&amp;#39;ve tasted (on par with Burger King fries)", "rating": 3, "date": "11/8/2018"}, {"text": "Service was very slow. Our server was fine but was helpless to make the kitchen move any faster. Even drinks were slow in arriving.  After a seemingly endles wait for our meals, my order of Fish Tacos was cold. In full disclosure my son and grandson&amp;#39;s steaks were fine, served at  proper temperature and were very tasty. Should have known better. my daughter and her mother were there last summer and experienced similar problems with the service.", "rating": 2, "date": "9/13/2019"}, {"text": "Still amazing!  This may be &amp;#34;just a chain&amp;#34; but the food is great (Louisiana Chicken pasta, Cajun Jambalaya pasta, Avocado egg rolls, and the Ultimate Red Velvet cheesecake are highly recommended, but I&amp;#39;ve honestly never had a bad dish here) and the service is the best which is what keeps me coming back.  I&amp;#39;ve never had a rude host or server here and on my most recent visit during Saturday peak there was apparently a long wait for us after we ordered our apps but I honestly didn&amp;#39;t even notice until the manager, Amanda, came to our table and apologized for the wait explaining that they were catching up on orders in the kitchen.  She was kind and courteous and offered to bring us more drinks and bread which not a lot managers make the effort to do at other chains unless a customer complains but the fact that she took the initiative to come to our booth tucked away in the corner of the restaurant was much appreciated.  The food ended up coming right after she left anyways so we weren&amp;#39;t waiting for much longer.  Keep up the great work!", "rating": 5, "date": "9/8/2019"}, {"text": "This was my first time at a Cheesecake Factory in over 15 years. We were told the wait for a party of seven would be 60-80 minutes. We decided to wait because it was a Saturday evening and figured we&amp;#39;d wait anywhere. After an hour and a half, we still hadn&amp;#39;t been seated and when we asked, were told that we had been assigned a table and when the current guests were done, we&amp;#39;d been seated. At this point we&amp;#39;d already seen people come in after us and we&amp;#39;re now watching them leave. Finally after an hour and 50 minutes were were seated at a booth for six people and they brought a chair up to the end of the table. They didn&amp;#39;t even provide a table large enough for all of us. I ordered a chicken mango avacado salad which was good but had no avacado. Overall, this experience was very disappointing and I would not go back.", "rating": 2, "date": "5/19/2019"}, {"text": "Cheesecake factory has been one of my go to restaurants for a few years. Due to a recent experience I&amp;#39;m going to be limiting my time spent at the cheesecake factory. After ordering our food it took about 45 minutes for it to come out, and it wasn&amp;#39;t that busy in there. My Margherita pizza came out completely burnt and not even cut. After our meal, we ordered cheesecake. After about 15 to 20 minutes of waiting for the cheesecake they got our orders completely wrong which we didn&amp;#39;t notice until we got home. Very disappointed.", "rating": 3, "date": "2/25/2019"}, {"text": "This review was based on a take out only and it was just Cheesecake. Although I&amp;#39;ve come here and other locations many different times I&amp;#39;ve either forgotten or wasn&amp;#39;t a Yelper at the time. I&amp;#39;ve always enjoyed the Cheesecake Factory it&amp;#39;s decent it&amp;#39;s not expensive and I love Cheesecake. Only thing I hate is they put the calories on the menu I don&amp;#39;t like that I don&amp;#39;t like it one bit !!! Listen I know there&amp;#39;s a lot of calories in Cheesecake but damn do you have to remind me of what a glutton I am lol. We were out doing errands Saturday afternoon which turned into early evening and was craving something sweet was either ice cream or cheesecake and cheesecake won. We were gonna sit down and grab a quick bite to eat then get dessert with coffee but I obviously have never been in there on a Saturday evening about 6:30-7pm the place was packed we asked how long wait was and was a bit longer than I felt like waiting so I decided to grab a couple slices to go. God I could&amp;#39;ve gotten at least another 2 and ate them easily but thank God I didn&amp;#39;t cause the calorie count would&amp;#39;ve been absolutely staggering. I got a slice of celebration cheesecake 1st time trying it definitely won&amp;#39;t be my last and my go to vanilla bean both with whipped cream. Both slices were absolutely delicious and writing this now and thinking about them I feel like driving there now for same order", "rating": 4, "date": "5/15/2018"}, {"text": "Ok, I&amp;#39;m not super into writing reviews, but I had the strangest experience here last night. Ordered the spicy buffalo chicken sandwich. They forgot to put  on the buffalo sauce. No big deal. The waitress apologized, took it away, and said they&amp;#39;d remake it. Less than a minute later a different server brings me a sandwich. It&amp;#39;s my sandwich I had just sent back...except mangled. I opened it up, and it&amp;#39;s the same plain chicken again, except they turned the chicken breast upside down to hide the toppings I had already put on, squirted it with a few drops of buffalo sauce, and smashed the top bun back on. Totally not okay. I was honestly kind of shocked.   Told the waitress who got the manager. Manager comes over, apologizes and says she is embarrassed. I ordered something different (by this time the person I was eating with had already finished their meal). My &amp;#34;replacement&amp;#34; meal was fine. When we got the bill, they had still charged us for my replacement meal I had to get after the original sandwich debacle. They sent us home with a tiny piece of free cheesecake as consolation. Anyways, long story short, won&amp;#39;t be returning to this mess.", "rating": 1, "date": "1/15/2020"}, {"text": "I now live in Seacoast, NH and I had not been to the Cheesecake Factory in Peabody, MA since 2015.  <br&gt;<br&gt;My two girlfriends and I met there today for a Christmas lunch.  The <br&gt;AST time I was there I had a delicious dish: Large Shrimp Sautéed with Tomatoes, Lemon, Garlic, Herbs and Fresh Basil on Top of Angel Hair Pasta with a Touch of Marinara Sauce.  We all ordered this dish.  First it was not what was printed online.  It did not have marinara.  It had a lemon cream sauce.  The angel hair was a small portion.  It was cold and stuck together I a ball and the shrimp has so much breadcrumb batter you cold not find the shrimp.  We mentioned our disappointment to our server, who got the manager, Amanda.   She was very nice. We told her we were not satisfied and she had three new dishes prepared.  One of us changed her dish, but me and my other friend asked for the same dish, but wanted no batter on our shrimp and we would like newly cooked pasta.  After 15 more minutes passed our three dishes came out.  The pasta was once again cold and all clumped together and my shrimp were raw in the middle so I left the raw shrimp on the table.  We told the server, but the manager never came back.  We ordered coffee and I ordered a dessert.  When we got the check, I was very surprised not to see any adjustment for our far less than optimum meals.  I would have though the least they could have done was offer to comp is coffee and the dessert, but no way.  Our bill for three lunch entrees, soda, iced tea, coffee and one dessert was $92+ and no one finished the second meal.  Bad food, bad service.  None of us will go to the Cheesecake Factory again.", "rating": 1, "date": "12/19/2018"}, {"text": "I&amp;#39;m giving this Cheesecake Factory five stars. The fish tacos and lettuce chicken wraps were delicious. The pumpkin cheesecake, excellent. And last but not least, our server, Al, was very friendly and attentive.", "rating": 5, "date": "10/18/2018"}, {"text": "Wow thanks for giving everyone else who had a birthday cheesecake but you give my nephew whipped cream? The service is the worst- the waiters/waitresses and even the male bartender we&amp;#39;re so busy on a Wednesday night they left my table waiting for bread. After waiting about 20 mins I asked where our starter bread was and the Manager apologized and finally brought it out. I ordered steak medium rare and my mother in law medium and when they brought both steaks out they didn&amp;#39;t specify which was which. Go to a different cheesecake or a different restaurant. This location is a JOKE.", "rating": 1, "date": "5/24/2017"}, {"text": "There was a wait on a Sunday afternoon but it was so worth it. The decor is nice, sky high ceilings, ample seating-although they do pack you in close to other diners. My husband had chicken enchiladas and said that they were very good. I had a simple burger with cheddar and sautéed onions, and a small garden salad with vinagarette (instead of fries). It was all delicious and we were stuffed so got cheesecake to go to eat later. Our server was super friendly and efficient. We can&amp;#39;t wait to go back again! Lost a star only because of the seating so close to other diners.", "rating": 4, "date": "2/12/2018"}, {"text": "We loved it!! Awesome food, waiter was great, place is very clean and colorful. I recommend the farfalle garlic chicken pasta. It was delicious!! Brought 3 pieces of cheesecake back to our hotel and it took us 2 days to eat it. Will definitely be back", "rating": 5, "date": "7/4/2019"}, {"text": "Love their chicken marsala it&amp;#39;s the best dish I always get it tasted really good this time for some reason definitely will come back again good server and it came out pretty quick", "rating": 5, "date": "3/26/2018"}, {"text": "Great restaurant. Only thing is the wait is pretty long depending on what time you go. I&amp;#39;ve waited as long as 1 hour and 30 minutes, almost 2 hours.", "rating": 4, "date": "5/10/2019"}, {"text": "Get the fried zucchini and thank me later!!! I absolutely love the small plate menu!! Cuban rolls are to die for!!! Excellent service, very clean restaurant!! I personally love the carrot cake even though I know it&amp;#39;s a cheesecake place!! The chicken madera is amazing! Don&amp;#39;t know how s chain restaurant can make such perfect mashed potatoes but they do.", "rating": 5, "date": "7/9/2017"}, {"text": "So I am someone who likes to eat at the Cheesecake Factory, but not today!!!  Went around 4:00 hoping to avoid crowds. It was nice a quiet. I ordered my meal and waited a half hour to receive a Luke warm plate.  When I finally could flag down staff (my waiter was MIA throughout) everyone was apologetic and assured me I would get a nice hot meal. So I waited another 20 minutes to receive my same meal back burned and nuked and again only just warm. What the heck and my missing waiter tries to argue with me. I had purposely mixed some rice with the first meal so I could tell if they were going to hand back my same meal and they did. <br&gt;<br&gt;I just walked out after my waiter chose to agrue me with.  Really bad service, food, and customer service. <br&gt;<br&gt;Peabody Cheesecake Factory epic fail!!", "rating": 1, "date": "1/13/2017"}, {"text": "The Cheesecake Factory is a restaurant that everyone can find something to eat. The menu is over twenty pages with foods from different cuisines. The lines are typically very long because everyone enjoys this place. They do not take reservations that I&amp;#39;m aware of. I normally get the Chicken Romano. I like this dish a lot, it is always very consistent. The servers always tell me that the food is made from scratch. So you can change the dish to your liking. The reason I gave it four stars is because this place is called the Cheesecake Factory yet they were out of several different cheesecakes tonight. Otherwise, this place is very good.", "rating": 4, "date": "7/19/2018"}, {"text": "Tonight was my first time here. The food was delicious; I had the Mac&amp;#39;n Cheese Burger with sweet potato fries thennnn Red Velvet cheesecake. All of my party ordered burgers and they were tasty. I downgraded the star because 2 of our 8 meals come to the table incorrectly and they were &amp;#34;out of strawberries&amp;#34; to make strawberry shortcake. :( it&amp;#39;s Saturday night, where are the berries. Our server did a good job overall taking care of our larger party and several other tables.", "rating": 4, "date": "6/10/2017"}, {"text": "The Cheesecake Factory has always been a top favorite for me. They have a large menu selection, and great drinks. I have been to this location probably over 10 times, but I&amp;#39;m going to review the most recent visit.<br&gt;<br&gt;The restaurant and mall was absolutely packed, as I believe it was the first Saturday where everyone and their mother wanted to prepare for Christmas shopping. The entire front was filled with about 50 people, and 15-20 strollers. I walked in and asked how long the wait would be for 2 and she said there was no wait which was awesome. Of course we sat in a crowded area with one bench and one uncomfortable chair but beggars can&amp;#39;t be choosers. So our server came over to us almost immediately. We ordered waters while we waited to decide but didn&amp;#39;t want to spend the extra cash. The waitress forgot to bring the bread, which I reminded her. No harm, no foul but the bread is so key!!! We got Fried Mac n Cheese for an appetizer which was pretty good. I&amp;#39;d give them a 3 out of 5. I love mac and cheese, mac and cheese bites, anything to do with mac and cheese. I believe the ricotta was what threw off the taste a little. And I would have preferred 6 smaller ones than 4 larger ones but that&amp;#39;s just me being a pain. Not the best but I&amp;#39;m a sucker for mac and cheese so. For my meal I ordered the Chicken Avocado Club because I couldn&amp;#39;t commit to all of the flavors all the other dishes offer, while my mom ordered the Louisiana Chicken Pasta. It took about 10-15 minutes to get which was great because we were starving. My mom said her pasta was spicy but delicious, she really enjoyed it. My sandwich was very good but hard to eat because of how tall it was. Then I had the Chocolate Godiva Cheesecake with Glazed Strawberries for dessert, while my mom ordered the Raspberry Lemon Cake Cheesecake? I always get the same dessert because I don&amp;#39;t want to commit to and $8 slice of something I may not like. The Raspberry Lemon Cake Cheesecake was really good. I like how the bottom half isa  cake and the top half is cheesecake. The whipped cream at TCF is too heavy for such rich cheesecakes. We ordered 1 appetizer to split, 2 meals, and 2 slices of cheesecake and it was still almost $70. I thought skipping on the alcohol would make it less expensive. Nope! <br&gt;<br&gt;In a past visit, I have wanted one of their signature drinks that they took off the menu and they were able to make it for me. I really appreciate that. Also found out they serve omelettes/breakfast all day. May be worth a try sometime. <br&gt;<br&gt;TCF has good food, great dessert, great drinks, nice ambiance/ decor, friendly busy servers, and is definitely a spot you go for a casual hangout, or get together.", "rating": 4, "date": "11/24/2014"}, {"text": "I&amp;#39;ve been here multiple times and the food is always really delicious. I&amp;#39;ve gotten multiple dishes and always have been extremely satisfied. My boyfriend and I went the other day and we realized just how much this restaurant had to offer with their broad and diverse menu. We decided we are gonna be more of regulars!", "rating": 4, "date": "11/28/2018"}, {"text": "Best chain restaurant. I love the four cheese pasta, it&amp;#39;s always so good. The low calorie flatbread pizza is good. Tried the garlic shrimp pasta (subbed penne for angel hair) and it was so good. Cheesecakes are always amazing including their low carb cheesecake if you&amp;#39;re looking for a lighter one.", "rating": 4, "date": "5/16/2018"}, {"text": "Came to the cheesecake last minute on a random weekday night and had the pleasure of having Amanda G as my server! My husband and I have many food allergies and have many (annoying) requests lol. She was amazing! She accommodated to our every needs with that beautiful smile on her face and was just so lovely! Thank you Amanda!!", "rating": 5, "date": "4/3/2019"}, {"text": "the restaurant was awesome I love the waiters the food was good and nice [especially Kevin​]<br&gt;<br&gt;show this to Kevin, ​please. <br&gt;the​ best", "rating": 5, "date": "2/20/2019"}, {"text": "The service was good. The food was beyond disappointing. I got the Skinnylicious Tuscan Chicken To Go....  there are 3 dried out chicken breasts that my plastic knife can&amp;#39;t cut through, 1 measly artichoke, a few tomatoes, and asparagus spears that look like a 4 year old cut them with a dull blade. I&amp;#39;m also being generous by saying there&amp;#39;s 1 tablespoon of farro. Super disappointed.", "rating": 2, "date": "10/16/2018"}, {"text": "My family LOVES The Cheesecake Factory, just NOT this location. This is the 2nd time we&amp;#39;ve given this location a try and we were disappointed both times. Today was definitely the LAST time I&amp;#39;ll be back to the location.<br&gt;The waitress was really nice so we tipped her well but the food was horrible. We got the nachos with chicken as an appetizer which is our fave app, they burnt it for the 2nd time. The chicken was literally so hard that we didn&amp;#39;t even eat the chicken because we couldn&amp;#39;t chew it. My husband loved his Cuban sand which but both ends of it were burnt. My daughter ate NONE of her meal the grilled chicken was burned and hard just like the nacho chicken, mashed potatoes looked like it had more skin then potatoes and the broccoli needed to be steamed longer. I got the lunch sized chicken Caesar salad and I didn&amp;#39;t even at half of it. I was better off getting a salad from Nicks Bistro for $10, seriously. The first time we went just my husband and I spend $73 tipped well and the food was gross we complained about the service and food on the survey and thy sent us a $25 gift card to come back and give them another try. Seriously? So that&amp;#39;s what we did this evening. We spend over $100 tonight my husband said he should&amp;#39;ve just put a $100 bill in the toilet and flushed it and saved his gas. If that helps you at all. Oh and by the way ALL the utensils were GROSS.", "rating": 1, "date": "8/19/2017"}, {"text": "Had an amazing night tonight and it&amp;#39;s been a very long time since I&amp;#39;ve gone to a restaurant and 1 enjoyed the food and 2 enjoyed the service as well TALIA M. was absolutely amazing me and my fiancé were having trouble on deciding what we wanted to eat my fiancé was torn between carbonara and the filet mignon so she suggested the carbonara needless to say it was amazing and me with my many menu questions she answered them all perfectly, it was my fiancé birthday dinner so she got everyone together and had them sing for him even though he wanted his to go cause he was so full from eating everything again her personality was amazing, friendly, and personal made us feel like we knew her for a while and always making sure We were okay and had everything We needed through out our meal when We go back Well  be making sure she&amp;#39;s working that day or just wait for a time she is working thank you again for making this night so awesome", "rating": 5, "date": "5/13/2019"}, {"text": "Hard to find a negative thing to say about the cheesecake, it&amp;#39;s always been on my list favorite restaurants. Love their consistency when it comes to the service and quality of food. <br&gt;<br&gt;This particular one in Peabody was no exception. Well located, usual great ambiance that you  expect from a CF. Only complaint during this evening was that they had no wasabi ahi tuna, (maybe the best item on the menu) no big deal really, except for the fact that I was not made aware till about 15-20 minutes after placing my order, stomach was growling... when the manager came over to apologize I asked if he would throw in a free drink and he responded with a NO with a somewhat sarcastic laugh. He said he couldn&amp;#39;t do that... you are a manager, you made a mistake, don&amp;#39;t tell me u can&amp;#39;t throw in a drink, of course u can!! <br&gt;<br&gt;Anyhow, four stars it is, not a flawless experience but a very good experience nonetheless. Food was fantastic.", "rating": 4, "date": "8/7/2014"}, {"text": "Excellent service, Joana was our waitress and a very sweet lady. The food is delicious and the deserts really to die for. I used to love the seafood casserole, hopefully they&amp;#39;ll have it back in their menu soon!", "rating": 5, "date": "6/21/2018"}, {"text": "Place is trash. 16 booths open and they sit me at a table next to some squids when the entire row of tables were still open. I said I&amp;#39;d rather a booth because I was with my kids and they let me know I&amp;#39;d have to wait another 15 minutes.  Again, there were booths open all over the restaurant. Someone needs to train the host to get her act together. Poor attitude and customer service. If I&amp;#39;m beating fair, the brunch wasn&amp;#39;t bad at all, just the service was horrendous. Do yourself a favor and go to the Bancroft next store.", "rating": 1, "date": "4/7/2019"}, {"text": "Fruit flies were buzzing around us the whole time we ate and that just grosses me out.  That being said, the proportions are huge so if you&amp;#39;re really hungry this could be a good stop.  I won&amp;#39;t return because of the gnats.  Staff was the best part of the experience.  We were seated quickly even though a ton of people were waiting so that was nice too.", "rating": 3, "date": "2/14/2018"}, {"text": "So, I originally gave this place more stars than I should have with all the mistakes my orders have received but I was lenient because I love the food. <br&gt;<br&gt;Anyways, last night I came here with 3 other people and our server was great. Listened to our orders, got everything right and was very helpful. Him and my amazing fried macaroni and cheese balls earned the two stars! I think his name was Mike if I remember right.<br&gt;<br&gt;Anyways, my sister and I ordered the smokehouse burgers and my wife and sister in law ordered the ribeye steaks for $27. Their plates were small and definitely far from worth the price but at least their steaks were cooked right so they were fine. My sister and I both ordered our burgers well done. We bite into them and they&amp;#39;re still bleeding. My sister didn&amp;#39;t want to be a pain so she just ate hers but I had to send mine back because the thought of eating bleeding meat made my stomach turn. The server was nice about it and sent it back. Took about 15 min to get a new one and by the time I got it back I was full from picking at my fries so I just got it wrapped to go. I live all the way in Southbridge and Boston traffic was ridiculous so we didn&amp;#39;t get home until about 1 am. I was hungry so I decided to heat up my burger. I bite it...looked fine...took a second bite and there was all pink meat in the middle. I was very upset. Not only my toppings weren&amp;#39;t packed in the box or even my bbq sauce but my meat was not cooked thoroughly AGAIN. We had a $130 bill plus tip and I can&amp;#39;t even get my burger cooked right after the second time. <br&gt;<br&gt;This is very frustrating since this happens EVERY time I go here. I never eat dinner with my family I get to sit there and watch them and then they feel bad for eating while I&amp;#39;m waiting and it definitely ruins the mood. <br&gt;<br&gt;Safe to say I won&amp;#39;t be returning to this location. I may give the one in Boston another chance since I really do enjoy the food and especially the cheesecake. Sad.", "rating": 2, "date": "4/10/2016"}, {"text": "Great Service and good came hot ! Great great communication. The wait was not long and we were served within 15 minutes from entering the restaurant. The brunch menu is detailed and has many different items that are great for all ages.", "rating": 5, "date": "3/31/2019"}, {"text": "I had one of the best meals of the summer here tonight.  My wife had the hibachi steak and I had the Sheila&amp;#39;s Chicken and Avocado salad.  The Long Island ice teas were strong and delicious.  <br&gt;<br&gt;Excellent service, excellent food and dessert.  An all-around perfect night out.", "rating": 5, "date": "8/21/2016"}, {"text": "Went there for dinner are waiter was very good fast and very friendly I order the stuff mushrooms awesome but I order chicken parmesan and it had no taste what so ever", "rating": 1, "date": "3/29/2019"}, {"text": "We sat at the bar. Excellent service. We ordered off the &amp;#34;light&amp;#34; lunch menu. I had the lettuce wraps. Sooo good. The rest of us had a chopped salad, huge and delicious, and another order of chicken lettuce wraps. <br&gt;Two pieces of cheesecake to go and we were off to continue shopping", "rating": 4, "date": "3/9/2014"}, {"text": "WHAT HAPPENED!!! Cheesecake, you were so consistently predictable. I enjoyed your food because I knew what to expect and I got it. Food -YUM! Waitstaff-Great! <br&gt;<br&gt;Now, not so much (saying this with thick disappointment in my voice while slowly shaking my head side to side).<br&gt;Cheesecake Factory, you were my go-to restaurant for everything and anything. Birthdays. Anniversaries. Graduations. Valentine&amp;#39;s Day. Mothers&amp;#39;s Day. Tuesday...<br&gt;<br&gt;Over the last year I started to notice a greasy sheen developing on, well, every surface. I tolerated it. The food was still exceptionally consistent. <br&gt;<br&gt;Next point. <br&gt;<br&gt;When my husband and I started going to Cheesecake years ago we had a waiter named Chris. We always asked for him. Chris was attentive, funny, real. He never forgot my extra sauces on the side. He was just the right amount of chat and personality. If Chris wasn&amp;#39;t working, no problem, all the servers were great!<br&gt;<br&gt;Now when we go, we get &amp;#34;Lauren&amp;#34; (made up name). Lauren has all the conversational skills of a potato. Lauren has a deadpan voice with monotone inflections. Lauren is one of three or four waitstaff that end up bringing food and such to our table. They might as well all be &amp;#34;Lauren&amp;#34;.<br&gt;<br&gt;Two more points of consternation:<br&gt;<br&gt;1) The last two times I went to Cheesescake, while I was leafing through the (now slimy with residue) menu, I came across food smoothed between the pages. <br&gt;Both times. <br&gt;<br&gt;2) This last point should be the first point and highlighted at that! <br&gt;The last two times I/we went to Cheesecake Factory the food was NOT CONSISTANT!!! The first time the Alfredo sauce in the Fettuccine was split and sour. My Shrimp Scampi was delicious, but my daughter was out a meal. My husbands burger was extra well done when he ordered it medium rare. <br&gt;The last visit was the clincher. <br&gt;Split sauce (my daughter always orders the Fettuccine Alfredo (picky eater)), Burger over cooked, skimpy sauce on the Mac and Cheese Balls aaaaand my Pasta Carbonara was dry. Dry, dry, dry. Top that off with food in my slimy menu and &amp;#34;Lauren&amp;#34; as our waitress and Cheesecake Factory made its debut on my &amp;#34;Blacklist&amp;#34;. <br&gt;<br&gt;Side note (I&amp;#39;m not a jerk. I waited tables for years!!!)<br&gt;I/we tip 20% to the penny if the food and/or service stinks. <br&gt;<br&gt;I will truly miss you, Cheesecake Factory I used to know... <br&gt;(Head in hand. Tear rolling down cheek. Curtain closes.)", "rating": 1, "date": "5/22/2016"}, {"text": "It is the Cheesecake factory, so why bother with a review huh? <br&gt;<br&gt;It is the best franchise restaurant for sure.  Try the cajun pasta...<br&gt;<br&gt;The service at this one is much better than previous visits in other locations.  This place is great.", "rating": 4, "date": "4/5/2014"}, {"text": "Let me tell you about my FIRST and ONLY visit to the cheese cake factory, or as I now call it, ass cake factory. The wait for 4 people was about 1 hour and 15 minutes, which is okay because it was a Friday night. When we got to our seats, our waitress took our orders and there was no problem. BUT, the problem occurred when the food took more than a hour and a half to get our food, which we never got because the manager said it was delivered to the wrong table. WOW how could a well known restaurant mess up so bad on my first and only visit. Really disappointed in this place, but my party ended up going to Polcari&amp;#39;s<br&gt; in Saugus. If there&amp;#39;s anything I want you fellow yelpers to take from this, go to Polcari&amp;#39;s first.", "rating": 1, "date": "2/3/2017"}, {"text": "It&amp;#39;s a known fact that the Cheesecake Factory is the place to go when you can&amp;#39;t decide where to eat. The servings are huge and the cheesecake is cheesecake. As far as food goes I&amp;#39;d say it&amp;#39;s always a safe move to try the fried mac &amp;amp; cheese balls. Those are pretty good and the nachos are good too but it&amp;#39;s a HUGE portion!!! Meal wise I&amp;#39;d say to try the Parmesan Herb Crusted Chicken. It&amp;#39;s a good size and pretty good as well as a safe choice if you don&amp;#39;t know what to get.", "rating": 3, "date": "3/29/2018"}, {"text": "I have been to some I loved.   But lately this one...for starters the service has seemed pretty impersonal where it used to be fun and friendly.    I love Caesar salad, even if they don&amp;#39;t have anchovies, but the dressing only tasted of garlic and a lot of it.   I didn&amp;#39;t finish, and neither did the server seek to notice that most was left.   Chicken was moist enough. And the pasta was ok, but nothing to write home about.   They need to up the ante again.   The only thing I really enjoy here is the brown bread....unless of course you want cheese cake lol!", "rating": 2, "date": "5/26/2016"}, {"text": "The food is pretty standard at any Cheesecake Factory, so I can&amp;#39;t complain there. I go in knowing what to expect with what I am eating and haven&amp;#39;t been disappointed.<br&gt;<br&gt;I was, however, very disappointed with the service. In a couple words: severely lacking. We were seated and waited for our server. And waited. And waited. After about 15 minutes, she finally comes over and gets our drink order and hands us menus. My husband asked for strawberry lemonade. I asked for water. Pretty simple, I think. The table(s) next to us had a group of about 10 people and all ordered cocktails....after we place our water and lemonade order. It&amp;#39;s not that I care about what they are drinking. It&amp;#39;s the fact that all their cocktails take time to prepare and mix (especially when there are several of them) as opposed to our very quick drink order, one of which is WATER. So how is it that they get their drinks several minutes before we do? I mean it&amp;#39;s the same server.<br&gt; <br&gt;We actually did get to order food before they did, which was surprising given how the server was bending over backwards for them and seemingly ignoring us. While waiting, baskets of bread kept being given to them. We had to ask for ours...more than once. Not surprisingly, their food came out first, getting it in about 10-15 minutes while we waited almost double that. How does a group of at least 10 people get all their food before a table of two when we ordered first? I&amp;#39;ll tell you how: they kept reordering cocktail which is $$$$ for the restaurant. And when they are spending that money, I guess the server doesn&amp;#39;t care much about the table right next to them that she is also serving. <br&gt;<br&gt;Extremely disappointing. For a chain, I rather like Cheesecake Factory. But this location seriously needs to work on their service. As for alcoholic drinks, we happily went elsewhere after dinner and enjoyed several where the service was infinitely better.", "rating": 2, "date": "6/3/2016"}, {"text": "Ummm...yeah. I&amp;#39;m all done with this place. Last two visits were a disaster.  Both times either the pager didn&amp;#39;t work (&amp;#34;oh, that just happens sometimes, sorry&amp;#34;) or another silly story as to why they filled seats ahead of you that did not make sense - simply put - poor, inattentive staffing at the desk. <br&gt;They are always busy, they really don&amp;#39;t care if they lose a customer - there are plenty others to pick from. It&amp;#39;s too bad, I liked this place, but it&amp;#39;s just a big chain now and not worth the hassle for me.", "rating": 1, "date": "3/22/2018"}, {"text": "Its like any other Cheesecake Factory... Drinks are over priced, meals are over priced but the food is OOHHH SOOO GOOODDD!!!!   This was our Diet cheat night birthday dinner!!! <br&gt;<br&gt;We ate too much, drank too much, but had a damn good time doing it... We were seated at the bar area which I hate but then after all it was a decent time... I understand the more tables you cram in the place the more people you can seat... but I hate that we sit soo close to other tables...<br&gt;<br&gt;This night was decent, the waitress could have been more attentive, but it was good... <br&gt;<br&gt;We will go again, and then just complain after that we ate too much &amp;amp; spent entirely way too much!", "rating": 3, "date": "5/5/2012"}, {"text": "Cheesecake Factory is one of those restaurants that can be great for a group of people all with different likes when it comes to food. With a menu of more than 18 pages,  each member of your party is sure to find something they like. Salads are very good and plentiful and they have very good pasta dishes. A personal favorite of mine is the Chicken Romano which is thin chicken breasts pounded and prepared with Romano cheese crust served with pasta with a tomato cream sauce.", "rating": 5, "date": "3/22/2014"}, {"text": "Come here all the time. This is one of the best chain restaurants! Food can take a long time sometimes. Banana cream pie is <a href=\"/redir?url=http%3A%2F%2Fbomb.com&amp;amp;s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\"&gt;bomb.com</a&gt;", "rating": 4, "date": "4/27/2016"}, {"text": "Great atmosphere and wonderful service.  Just had the chick potstickers and they are simply scrumptious.  Our waitress is very pleasant and now I can&amp;#39;t wait for more.  I&amp;#39;m getting one of their signature burgers.  Great place all around, recommend this place to anyone who is either in town or not from around this area.", "rating": 5, "date": "1/22/2018"}, {"text": "If I could give zero stars I would, my partner and I were just in this location for lunch, we sat for 10 minutes before anyone asked us our drink order, as we were waiting the two tables beside of us were seated they both got their drinks Before we did, we waited patiently because we are both in the service industry, 25 minutes went by we still never got our drinks or the appetizer we ordered, we decided to leave, told the hostess what happend and she just looked at us like we had 5 heads, my partner decided to call and speak to the manager who said sorry, it wasn&amp;#39;t me, and that was it. What a terrible experience. I will make sure I tell everyone I know and share on all social media about the terrible service you get at this location", "rating": 1, "date": "1/11/2019"}, {"text": "Waited for an hour for our food! Gave up and left. Absolutely did not expect such a poor level of service especially from such a well- known restaurant. The appetiser; lettuce wraps an absolute no brainer took very long to arrive and the entrees never even reached our table. The only thing that came in time was the IcedTea!", "rating": 1, "date": "4/13/2017"}, {"text": "Always a great place to go when you can&amp;#39;t decide where to head for lunch or dinner.  As you must know, the menu is extensive and I&amp;#39;m pretty sure there&amp;#39;s even a table of contents.  Cheesecake is expensive per slice but is a novelty.  Two people could easily split one.  I gave this review four stars since it can be noisy, wait is long, and all the tables are on top of each other.  <br&gt;<br&gt;You have to be smart when ordering if you don&amp;#39;t want to spend a lot since some of the choices are pricey or overpriced.  For instance, some pasta dishes are pricey where you have to think----pasta is $1 a box in the store.  LOL. Portions are large however. There was an issue once at our table with food being incorrect, but the manager came over and was super nice and took it off the bill.    Never a bad experience.", "rating": 4, "date": "7/8/2015"}, {"text": "The food was okay. Definitely overpriced. The presentation of the food was overkill. Tasty egg roll sampler and macaroni and cheese.", "rating": 3, "date": "10/9/2017"}, {"text": "Probably the slowest serviced &amp;#34;The Cheesecake Factory&amp;#34; I&amp;#39;ve ever been to. And they keep getting our orders wrong. But they were apologetic which made it up.", "rating": 3, "date": "8/4/2018"}, {"text": "So as someone who has worked in restaurants most of my working life, I actually really appreciate what this chain does.<br&gt;<br&gt;The skinilicious menu has some very tasty options with good portions considering the caloric content. It&amp;#39;s great of them to be looking out for health conscious people.<br&gt;<br&gt;I had the spicy Jamaican peppered shrimp with brown rice - excellent, excellent. Perfectly spicy, perfectly cooked rice, and of course a large enough portion to take some home (and I have a very healthy appetite)<br&gt;<br&gt;Also, LOVE their sugar-free cheesecake. One of the only places I know of offering a real and tasty carb-conscious dessert.<br&gt;<br&gt;My biggest issue is that every time I go in, I end up seated at a banquette in the bar area about 6 inches from another occupied table when there is no one else at this 12 seat banquette. I understand it is someone&amp;#39;s section, but when it is dead like that, maybe putting a table between my party and the other one would be wise. This is happened three out of four times I&amp;#39;ve been there in the last couple of months. Very awkward.", "rating": 4, "date": "7/3/2013"}, {"text": "I didn&amp;#39;t have a good experience. Waiter was rude and unprofessional. I enjoyed the appetizer. Took 2 bites of the food and was gagging. I was disappointed in taking over 20 minutes to seat and over 30+ minutes for the food to get out there.", "rating": 2, "date": "12/8/2018"}, {"text": "I drive 2 hours and cross 2 state lines to get here because the cheesecake is amazing. They&amp;#39;re a little pricey but the food is really good which makes the drive and check worth it. They have quite an extensive menu so there is something just about anybody. Located in the mall is great so you can do some shopping before eating. The service was pretty great considering we were a group of 9 young adults 6 of which were crazy guys. My sister is a picky eater and didn&amp;#39;t care for her meal and they didn&amp;#39;t have a problem exchanging it for her. Overall great experience will definitely be back.", "rating": 4, "date": "5/20/2015"}, {"text": "I do not believe in chain restaurants, but I believe in The Cheesecake Factory.<br&gt;<br&gt;This is a very specific review. I cannot speak of the dessert or of the dining atmosphere. I always go alone for lunch- straight to the small bar. I get the seared tuna tataki salad. Every time, the service is wonderful, and the food is reliably delicious.<br&gt;<br&gt;Their coffee is good and strong- a rarity in these types of eateries.<br&gt;<br&gt;Thank you Cheesecake Factory. Five thumbs up.", "rating": 5, "date": "3/21/2015"}, {"text": "food always great here...every visit but one was ok....can never forget about a blond hair in my food,  a coupled months  back, but we gave THEm a revisit...if itwasnt for that, it be 4 stars atleast", "rating": 3, "date": "8/25/2017"}, {"text": "My daughter&amp;#39;s birthday is on Easter this year and she requested to go to the Cheesecake Factory. The closest one is an hour away. I decided to call and make sure they&amp;#39;re open on Easter Sunday. <br&gt;Our conversation follows:<br&gt;<br&gt;Me: Are you open on Easter?<br&gt;<br&gt;Cheesecake Factory: Yep<br&gt;<br&gt;Me: Are you open during your regular hours?<br&gt;<br&gt;Them: Yep<br&gt;<br&gt;Me: Okay, thank you!<br&gt;<br&gt;Them: (silence and click)<br&gt;<br&gt;Hmm...I think we&amp;#39;ll find another restaurant to celebrate her birthday.", "rating": 1, "date": "4/11/2017"}, {"text": "Ordered take out.  Just wanted a dinner sized portion of Mac and cheese.  They said the only way they could do this was to order 2 sides of Mac and cheese and put it in one bowl which was fine, about 14.00.  Thats on par with Smokey Bones which has dinner plates of Mac and cheese.  They tell me 15 to 20 minutes for my food.  I get down to the restaurant in that time frame.  Food isn&amp;#39;t ready.  I wait maybe another 5 to 8 minutes and they bring the food out.  I pay and rush back to work.  My food was barely room temperature. (I was only walking back to Macy&amp;#39;s). The best part of the meal was the brown bread and butter.", "rating": 3, "date": "10/20/2017"}, {"text": "Had lunch here today and was not impressed at all with our entrees.  The avocado egg roll app  was excellent, so tasty.  The two pasts dishes were a huge disappointment.  First, we ordered off the dinner portion and the quantity was rather small. I got the garlic noodles with shrimp and it was flavorless and real cheap on the mushrooms and other items. For 19.99 I expected so much more.", "rating": 3, "date": "1/17/2017"}, {"text": "The spaghetti and meatballs were very good. The spaghetti was to die for! The meatballs were sweet. I always go with my family even though I have to wait a few minutes. (written by Stella H., 7 years old)", "rating": 5, "date": "5/9/2017"}, {"text": "The food is always good here. Wait times can get longer during busy hours but staff works quickly, and provides accurate wait times. Food is always fresh, kid friendly, and they have a few craft beer selections. Will return.", "rating": 5, "date": "5/4/2018"}, {"text": "Food is absolutely delicious and the menu is great BUT when you order pick-up the girls always keep you on hold for so long. A couple times they hung up on me. While I thought this was a one time thing, my friend told me the exact same thing happened to her. Then I ordered again the other day and I kept getting passed on to different people.. just very strange. So if you want food from here, don&amp;#39;t get take out.", "rating": 3, "date": "6/23/2017"}, {"text": "My daughter had an inexplicable bloody nose tonight. The staff couldn&amp;#39;t have been more helpful, providing towels, napkins, ice etc.!<br&gt;<br&gt;PS the regular table service and food was very good as usual.", "rating": 5, "date": "8/23/2017"}, {"text": "I just got home from a shocking experience at this restaurant and felt I had to get this out there.<br&gt;<br&gt;Wait time: 60 minutes, probably pretty standard for 7:15 on a Saturday, but the host was entirely too rude about it when I said I didn&amp;#39;t hear the time. Luckily we ended up snagging a high top in the bar area.<br&gt;Atmosphere: the music was WAY too loud, especially considering the number of people in the restaurant. I couldn&amp;#39;t hear my friend sitting right next to me. The server was pushy to get food in, until she &amp;#34;got us&amp;#34;. Not sure what that means, but yeah we&amp;#39;d like a moment to talk, relax, and take a look at the menu. She ended up being alright though.<br&gt;Drinks: we ordered the Mumm napa split and only got one of the bottles.<br&gt;Food: avocado egg rolls were good, chicken piccata was a problem, the sauce was bland, the chicken was undercooked on one side, and I&amp;#39;m pretty sure they didn&amp;#39;t salt the pasta water, veggie burger was very loose and fell apart. <br&gt;The biggest issue by far though: there were two small children SITTING AT THE BAR! For almost an hour and not one single employee said a word!! The bartender took orders, served them food and drinks, etc! They couldn&amp;#39;t have been more than 8 years old! This is a busy restaurant! Dozens of servers, bartenders, hosts, busers. How did no one know that&amp;#39;s ILLEGAL? Finally, on the way out I asked for the manager and he said he hadn&amp;#39;t noticed. This blew me away. I never thought much of Cheesecake Factory, but this experience takes the cake (pun intended).", "rating": 1, "date": "10/22/2016"}, {"text": "I come here all the time with my family and boyfriend. The food and drinks are always amazing. The staff is always professional, friendly, and attentive. This is also my mom&amp;#39;s favorite restaurant, and I can definitely see why!", "rating": 5, "date": "3/1/2017"}, {"text": "The only reason this review is receiving even two stars is because of that magnificent chocolate cookie dough cheesecake. <br&gt;<br&gt;When we walked in, it was going to be a 25-30 minute wait-- not bad and we were willing to wait. Luckily I was able to snag two bar stools while my boyfriend headed to the restroom and then out to his truck for something in the lot. I sat there for some time-- possibly 10 minutes and the same male bartender walked by a multitude of times. Now, I work in a restaurant and I&amp;#39;m the editor of a newspaper so I know all about busy. However, he didn&amp;#39;t even acknowledge me, as we was serving the male on one side of me and the other male on the opposite side. When my boyfriend came over, I went to the host stand to  cancel our names for the table, which took a mere 60 seconds. As I was heading back, my boyfriend had a napkin and plate in front of him immediately. I got back and he was asked what he wanted to drink immediately. I was never asked, throughout the course of the meal, if I wanted a drink even though my boyfriend was asked multiple times if he wanted a refill. Not sure if the bartender just didn&amp;#39;t like serving women or if there was something else wrong because all of the men at the bar were taken care of at great length while I was barely acknowledged. <br&gt;<br&gt;THE FOOD was okay but pretty boring. My boyfriend had the bang bang chicken, which was good but not spectacular. I had the Large Sautéed Shrimp with Angel Hair. The sauce was boring and didn&amp;#39;t have that kick of flavor or even a punch of garlic. Also, it didn&amp;#39;t taste like they cooked with wine as advertised. It tasted like it was strictly diced tomatoes warmed up on pasta with a few large shrimp tossed on the outside of the plate. And I&amp;#39;m pretty sure they did not season the water when they cooked the pasta. It was just an all-around flat dish. <br&gt;<br&gt;I do NOT recommend this location. It looks great on the outside with a large menu (possibly too large?) but you certainly only get your wallet&amp;#39;s worth at the take-out cheesecake stand by the door. Otherwise, go no further.", "rating": 2, "date": "1/5/2017"}, {"text": "This is my favorite restaurant. Every time I go I have a fantastic experience. Service and food are both always great quality. I like to try some new on the menus every time and have never been disappointed. First of all I always get the fried mac and cheese balls because they are my favorite. As for the main course I have ordered the steak and cheese, spicy crispy chicken sandwich with chipotle sauce (my boyfriends favorite and he gets it every time), orange chicken (amazing), Parmesan crusted chicken (can&amp;#39;t go wrong), montecristo sandwich (brunch menu on Sunday and it sure was yummy), bacon cheese burger, and my most recent the chicken Parmesan pizza style (this was amazing). Then the cheesecake oh boy it&amp;#39;s top of the line. I highly recommend the lemon raspberry, Adams Peanut butter, red velvet or tuxedo. I absolutely love this place and have always been satisfied with each visit!", "rating": 5, "date": "4/9/2017"}, {"text": "Cheesecake Factory has become a staple for the boo and I, we just love it. Wait is never ridiculous, and service is always on point.<br&gt;<br&gt;I usually get the same thing and the other night noticed what I get wasn&amp;#39;t on the menu anymore. Waitress &amp;amp; Chef were amazing and still made it for me anyway, and that is what I call SERVICE !<br&gt;<br&gt;BBQ Salmon is to die for, perfectly cooked salmon, mashed potatoes, yummy corn medley, and topped off with the best onion rings !<br&gt;<br&gt;I&amp;#39;ve also come and just got a bunch of apps, as well as brunch. You truly cannot go wrong with coming here. Friendly staff, and huge portions of food.", "rating": 4, "date": "2/25/2015"}, {"text": "Cheesecake Factory has always been a favorite for our family, no matter where we travel in NE.  If there&amp;#39;s a Cheesecake in the vicinity of where we are visiting, you&amp;#39;ll find us dining for lunch or dinner &amp;#39;at least&amp;#39; once.<br&gt;<br&gt;Tonight when we took a consensus of where everyone wanted to go, the answer &amp;#34;Cheesecake&amp;#34;!  So off we go, with the anticipation of great food and great service!!<br&gt;<br&gt;Thank you Cheesecake for providing such great quality restaurants for our dining enjoyment, and which offer a family friendly environment!!  =)", "rating": 5, "date": "2/22/2015"}, {"text": "Outstanding!!! Our server, Tim was great. He was friendly, funny, and full of life. Food was delicious and the name cheesecake does not disappoint. The coffee cheesecake was to die for. Cannot wait to return.", "rating": 5, "date": "7/17/2018"}, {"text": "Wonderful gluten free and veggie options. We had a table of three people with food sensitivities and gluten intolerance. The waiter, Malcom L, was excellent and accommodated our complicated orders easily. I got the Kobe beef burger which was not good, but all of the other food was delicious.", "rating": 4, "date": "2/12/2017"}, {"text": "5 stars for the Cheesecake 2 stars for the food. The menu is seriously ridiculous here. There must be over 50 items on it ranging from American to Asian, Mexican, Italian, and so on. It definitely needs some slimming down! I&amp;#39;ve never been overly impressed by anything that I&amp;#39;ve ordered. The cheesecake however...heaven on a plate! So many delicious cheesecakes to choose from! Skip the food...get a seat at the bar, have some drinks, grab some cheesecake and enjoy!", "rating": 3, "date": "1/7/2017"}, {"text": "The best food I have ever had has been from the cheesecake factory. There mac and cheese balls are the best thing I have ever eaten in my whole life. It is great for a casual meal with friends, or even a date. It is a little pricey, but you pay for what you get. and youre getting th best food and experience that any food establishment has to offer!", "rating": 5, "date": "12/1/2016"}, {"text": "Went last night with my wife. Was very disappointed with the meal and a little dissatisfied with the service. I ordered the New York style steak, medium. What I received was a quarter inch thick medium well done piece of beef that had no flavor whatsoever. I really do think the cook forgot to season it. I was going to send it back but the waitress took 20 minutes to check on us. I didn&amp;#39;t have time waiting for them to fix it for me so I sucked it up and ate half of it. My wife had the chicken Marsala, she thought it was ok but a little below what she would expect. I&amp;#39;ve come to the conclusion that unless you order &amp;#34;the comfort food&amp;#34; items, the food is nothing special.  Probably won&amp;#39;t go back.", "rating": 2, "date": "6/3/2018"}, {"text": "I love The Cheesecake Factory. I don&amp;#39;t care if I&amp;#39;m consuming three days worth of calories in one sitting, the food is simply too delicious to resist.<br&gt;<br&gt;I came here with my roommate because we had received a $10 off coupon, and we figured that we should take advantage of it. I ordered the Chicken and Shrimp Gumbo, and it was amazeballs, naturally. The gumbo has such a nice kick to it, giving the dish that extra something. Our waitress was incredibly pleasant and accommodating. Despite the restaurant being crazy busy (like it usually is) we were seated within 15 minutes and were out of there within an hour and 15.<br&gt;<br&gt;Overall, a wonderful experience and I would definitely return!", "rating": 4, "date": "5/15/2014"}, {"text": "Always a great experience. We enjoy bringing the kids here for lunch. Food is always good.  Wait Staff is friendly and knowledgeable about menu. Love the decor and the deserts are fabulous!", "rating": 4, "date": "3/21/2015"}, {"text": "Food was good. Service was horrible. Order nachos and a beer. Nachos beat the beer out which should absolutely never happen. Was checked on once in an hour and then it took 15 minutes to run my card to checkout. Server went and took orders of food and drink from 2 other tables. Nothing like what this place should be run like for the prices and atmosphere.", "rating": 2, "date": "12/23/2016"}, {"text": "I honestly can say that I don&amp;#39;t go here as often because the restaurant just isn&amp;#39;t what it used to be.<br&gt;<br&gt;1- the food hasn&amp;#39;t been as good lately. It hasn&amp;#39;t been completely hot out of the kitchen or as flavorful lately. We ordered the Chicken Quesadilla and 2 pieces were almost empty and there was barely any chicken. When I got my pasta, it seemed like it had been sitting for a while, as the top was barely warm. <br&gt;<br&gt;2- service has been severely lacking. Tonight, we started with one server who was great and on her game. Then she transferred the table to another server. That wasn&amp;#39;t the issue, I understand she wanted to get out of there ( although she was still there when we left? ) The server that took over was nice, but obviously unable to handle the extra table. I&amp;#39;m sure her section was no where near our table, as we were sitting for a while in between visits. Our food was taking a while, which she noticed, but it was still a little too long. After we got our food, she didn&amp;#39;t come back until my boyfriend was done. I hadn&amp;#39;t even gotten to eat most of my food because I needed to drink something (because of a throat condition) and didn&amp;#39;t have anything to drink. Then when she took my plate, instead of asking if we wanted coffee or dessert ( which I did) she just walked away and came back 10 minutes later with menus. At this point, I was sick of waiting and decided to forget about the cheesecake. I understand she has other tables and such, but it&amp;#39;s not fun to sit there waiting while everyone else just walks by and looks at your table. Multiple servers saw our empty drink glasses at the edge of the table and no one offered to help. Yeah, it&amp;#39;s not their table, but it&amp;#39;s a good practice. <br&gt;<br&gt;I really hope that Cheesecake Factory can turn it around. It was one of my favorites, but lately, I&amp;#39;ve been wishing we went somewhere else.", "rating": 2, "date": "5/6/2016"}, {"text": "It was fine, service was OK, however I was really craving and in need of a cappuccino, not a latte...  And I got it also to go. What I really got was 12 ounces of milk and a shot of expresso. If you plan on making cappuccinos and lattes you should know the difference. Also asked for cinnamon and the woman never heard of it apparently ? Also advice, maybe offer soy or almond milk.", "rating": 3, "date": "2/10/2017"}, {"text": "This location is very lucky that CF has a good reputation... Food is always below standard (we have eaten in locations in multiple states), and service is horrible. We ate there today, and our server couldn&amp;#39;t be bothered. My daughter&amp;#39;s Bow Tie Alfredo sat in the window so long that it had separated and needed to be sent back to be retossed with sauce. Wasn&amp;#39;t offered an iced tea refill, though we had an appetizer, lunch, and cheesecake... Our meal time took almost 2 hours, due to poor service - we continually ask ourselves why we go back...", "rating": 2, "date": "7/11/2017"}, {"text": "I have to say, that my usual experience with this location is about an 8 out of 10.<br&gt;It&amp;#39;s a chain restaurant. Shouldn&amp;#39;t expect anything else.<br&gt;<br&gt;This last visit was a 2 to 3.<br&gt;<br&gt;Ordered my son past. With butter only. No garish, just plain. Simple enough. <br&gt;It&amp;#39;s not a dietary restriction, just it&amp;#39;s what he enjoys the most. <br&gt;<br&gt;All our tables dinners come out and his is covered in parsley.<br&gt;His is taken back to be re-done.<br&gt;Our plates sit there getting cold. <br&gt;Second plate comes out, and now it&amp;#39;s in Alfredo Sauce.<br&gt;Back it goes again.<br&gt;<br&gt;All the other food at this point is cold. (20 minutes after presenting the first plates)<br&gt;Not even enjoyable to say the least.<br&gt;<br&gt;Manager offers us a free dessert. <br&gt;Would have rather had my meal reheated than a free dessert.<br&gt;Manager and wait staff, not even concerned, that we are waiting to eat.<br&gt;Due to the fact that my son doesn&amp;#39;t have any food in front of him.<br&gt;<br&gt;Just a lack of communication and common sense.<br&gt;I know it&amp;#39;s a chain, but if this is the new standard of what I should expect, there are other choices in the area.", "rating": 2, "date": "1/31/2017"}, {"text": "The Cheesecake Factory (TCF) is a pretty solid dining option offering a very extensive menu which reads like a storybook with several pages. It can take a while to decide on what to eat since there are so many choices. They also offer small (skinny) plates for those with smaller appetites and watching calories. Lunch specials are offered until 5PM, brunch is offered on Sundays and they also have specials in the bar area (Mondays-Fridays 4PM-6PM) offering selected full size appetizers for only $5.00.<br&gt;<br&gt;I&amp;#39;ve been to several TCF locations throughout the US and have had very good meals each time, but there was usually quite a wait to be seated. I found some TCF gift cards (a few years old)  which I needed to use up. My friend and I decided to make a special trip from NH to The Cheesecake Factory at the Northshore Mall for an early dinner and arrived here around 3:55PM on a Monday. We were seated immediately at a table in the bar area. Our server Todd arrived promptly and went over the specials and also informed us about the &amp;#34;bar menu&amp;#34; with several $5 appetizers listed.<br&gt;<br&gt;For appetizers ($5 each/normally $9.95 each), we ordered the Fried Calamari and the Fire Roasted Fresh Artichoke. The Fried Calamari (rings &amp;amp; tentacles) were coated in a light and crisp tempura batter (not too greasy) and served with a creamy garlic dip and tangy cocktail sauce. The Artichokes (3) were messy to eat, but were very good and fresh and the artichoke hearts were very tender, served with a creamy garlic dip and vinaigrette dressing.<br&gt;<br&gt;For dinner, the Cajun Jambalaya Pasta ($16.95-full sized portion) was very spicy which had tender shrimp, soft boneless chicken sauteed with tomato, onions, and peppers over soft linguini (regular and green noodles) and topped with fresh grated parmesan cheese (optional). My friend ordered the Vietnamese Shrimp Summer Rolls ($5/normally $9.95) three rice paper rolled with bean sprouts, carrots, asparagus, shittake mushrooms, green onion, cilantro, &amp;amp; shrimp, served chiiled over crispy rice noodle &amp;amp; red cabbage and spicy peanut dipping sauce.<br&gt;<br&gt;The food was enjoyable and filling and we needed a box for the leftovers. Unfortunately, we did not save room for cheesecake and coffee, but probably next time. The service was very good, very attentive and informative. The food arrived in timely fashion, the ice waters were refilled and our server made recommendations from the menu. <br&gt;<br&gt;We will be back!", "rating": 4, "date": "1/16/2012"}, {"text": "Came in tonight looking for a good relaxing meal with my honey . The food was good the service was HORRIBLE our server was MIA most of our meal. I don&amp;#39;t expect to have rose petals thrown at my feet or be hand fed but I do expect good service.  She barely checked on us, kept forgetting drinks, and left our plates even after we were clearly finished and finished for sometime. We spent most of our meal just waiting oh and I&amp;#39;m waiting now still which is AWESOME. I am literally writing this review as I&amp;#39;m wait <br&gt;for it....WAITING!!!! FYI it&amp;#39;s a Thursday night not busy at all. I won&amp;#39;t be coming back for a while.", "rating": 2, "date": "1/28/2014"}, {"text": "My friend and I had dinner here the other night. We had to wait, so we headed to the bar. The bartender was friendly and efficient, and we both enjoyed a drink before eating. My buddy had a beer, and I had a Tanqueray martini; his beer was seven dollars, my cocktail was fourteen- yes, a bit pricey, but very good. For an appetizer we got the Tex Mex eggrolls. They were crispy, and the filling was tasty. Just enough of a spicy kick. For entrees, my friend got a burger- I can&amp;#39;t remember which one, and I ordered the Hibachi steak. My friend woofed his burger down in no time! He loved it. I really enjoyed my steak- it was tender and flavorful. My only complaint would be that the mashed potatoes that came with it were a little on the cool side. Other than that, I would definitely order the Hibachi steak again. Our server was personable, and on point. I would go back to try other tempting items on the menu.", "rating": 4, "date": "1/21/2018"}, {"text": "My friend and I were wandering around the North Shore Mall and decided to go to The Cheesecake Factory for dinner. It was a beautiful night, so we requested outdoor seating.   There are two large patio areas that can accommodate parties of various sizes.  Our waiter was very attentive and promptly took our drink order. I tried the skinny cosmopolitan, which is a lighter version of a Cosmo but still had delicious taste and flavor- at only 150 calories. The dark and sourdough bread were both were both warm and the waiter brought more throughout our meal. The Chinese Chicken Salad was just as described on the menu- and a very large portion! Mounds of rice noodles and wontons covered the tons of romaine and chicken. The salad dressing was sweet and I has the dressing on the side so that I could use the amount that I wanted.<br&gt;<br&gt;We had a delicious meal and will be heading back again soon.", "rating": 3, "date": "6/24/2014"}, {"text": "I have been to this particular location multiple times and the experiences have been fine. Recently I went with a group of 9 to celebrate a friend&amp;#39;s birthday during their Sunday brunch. The food took almost an hour to come out and when it did two of the orders were wrong. We started with one waitress that transferred our table to another waiter and never told us about the switch. When the staff noticed we were antsy for our meals, the manager came to our table saying &amp;#34;they would do anything to make our experience enjoyable.&amp;#34; Said in the most non-believable tone ever. Though the waiter that was transferred to our table was very friendly and nice, he did not check in once to see how our meals were and if we needed anything, which we did. <br&gt;<br&gt;One girl ordered a breakfast sandwich eggs over hard another girl ordered a breakfast sandwich eggs over easy with no mayo and no ham. Both sandwiches, which we were told were the reason our meals took so long because they got messed up and had to be fixed, came out wrong in the end anyway. Both had ham and mayo with the eggs cooked at the wrong temperature. The waiter asked one girl &amp;#34;if she had touched hers yet&amp;#34; and &amp;#34;if they just wanted to switch&amp;#34;. Which wouldn&amp;#39;t make a difference because one girl didn&amp;#39;t want ham and mayo anyway. Side note, the birthday girl had to suffer through dry toast because our table was completely avoided after the incident. <br&gt;<br&gt;The food was okay. Reading the menu we were excited for our meals but nobody was blown away by the quality. Should&amp;#39;ve gone to a diner instead.", "rating": 2, "date": "10/27/2015"}, {"text": "The food here is average and the service is also average. The menu is very large and offers something for everyone. If your looking for a quiet place to have lunch or dinner, this is not the place. The prices are a bit high and a bottle of Bud Light was 5.75, an outrageous price to charge. Overall, this place is 3 stars.", "rating": 3, "date": "8/28/2016"}, {"text": "Went with wife and niece. Niece got spaghetti and meatballs but they were too salty the waitress kindly took it off the menu was very fast and my food was outstanding will be back again", "rating": 4, "date": "11/10/2015"}, {"text": "Steak tacos, highly recommend, the guacamole is very good, plenty of flavor which is what I have found missing at Mexican restaurants, we keep getting the same waiter who is very good at his job.", "rating": 4, "date": "9/18/2016"}, {"text": "This place is going down hill.  Particularly if you happen to eat at the bar.  While waiting 20 mins for my chicken piccata they were going to bring me some bread.  Which after about 10 min. they did.  Unfortunately they didn&amp;#39;t give me a napkin or more importantly silverware to at least spread butter on the bread.  After literally another 10 min. of being ignored by the female bartender and still no piccata either I just got up and left.  Probably won&amp;#39;t be back.", "rating": 2, "date": "9/13/2015"}, {"text": "I went here for lunch today because had been here multiple times An had enjoyed my self you will always wait for a table 20 min wait they was out of macaroni an cheese bites my silver wear was dirty twice my waitress only seemed to be concerned with everything thing else but me when my food got to the table the pasta was raw An dry it tasted like my waitress was so everything but her job an not checking to see if my food was done so it sat under a heat lamp for 30 minutes on top of the the the management only took my food off the bill when I told them I was never coming back there could had care less this place is horrible do not eat there", "rating": 1, "date": "3/12/2017"}, {"text": "First, a &amp;#34;20 minute wait time&amp;#34; turned into a 45 minute wait.<br&gt;Second, the noise of kids banging silverware on the tables reached harassment levels.  No one from the restaurant would talk to these parents about their kids.<br&gt;Third, despite the fact that we had 8 conversation about dietary restrictions, still they messed the dish up.<br&gt;I would advise people with allergies or dietary restrictions to never eat at the Cheesecake Factory.  These people are ignorant and have no respect for people.  They serve low quality food for the masses at high end restaurant prices.", "rating": 1, "date": "1/10/2014"}, {"text": "I have been to this Cheesecake Factory several times. The food isn&amp;#39;t that great and the focus has shifted lately to quantity than quality. The ambiance is good, but lately on the weekends its so crowded like i feel that I&amp;#39;m not at ease in my space. The service is going from okay to worse, my friend ordered a vegetarian dish and specifically told them to not put mushrooms, but they did anyways, and we told the server when our dishes were served, she said she can handpick them out. It was gross! I&amp;#39;m not going back there.", "rating": 2, "date": "2/9/2016"}, {"text": "My husband and I frequent the cheesecake factory often and we have never had a bad experience at this location! The staff is always extremely accommodating and professional. The food is always great and the menu has so many options we never leave displeased. My two favorites are the chicken avocado club and the luau salad. My mother has a food allergy which they also handle very well, we have met a manager named Charlie more than once who goes above and beyond. I know often times people like to avoid &amp;#34;chains&amp;#34; but this is a great option when going out to eat!", "rating": 5, "date": "11/22/2015"}, {"text": "The Cheesecake Factory rarely disappoints; most of my experiences in dining there have been positive. I have been to a few different locations, and the one in Peabody did not stand out to me in any specific way from the rest, which I consider to be a good thing, since it is part of a chain. The design of the restaurant is intricate and warm, and the bathrooms are always glistening with cleanliness, which I highly value in an establishment. The service I received when I went there yesterday was lunch was great; our waitress was extremely friendly, professional, and polite, while also being laid-back enough to feel comfortable around as the youthful diners that my boyfriend and myself are. <br&gt;<br&gt;I enjoyed going there during the day, not only for the lunch prices (lunch menu is available until 5:00!) but also because of the amount of natural light let into the restaurant. On other occasions, I have been there in the evening and the lamps and chandeliers give off a very dim yellow glow that can make it hard to see at times. It is a bit straining on the eyes, especially when reading the menu, but it is all a part of the unique atmosphere that the Factory creates.<br&gt;<br&gt;Last time, I ordered the Fettucini with Chicken and Sun-Dried Tomatoes and cannot say that I will get it again, although I had ordered it last year and my memory of it was better than what I tasted when I tried it a second time. It is not to say it was unacceptably un-tasty; I was simply not a fan of the sauce this time-I blame it on my ever-changing taste buds! The pasta was cooked well, though the dish itself has both times been a bit too &amp;#34;dry&amp;#34; for me; better than swimming in sauce, I suppose.<br&gt;<br&gt;Cheesecake Factory has an amazing menu; it is truly extensive in all areas: appetizers, sandwiches, pasta dishes, meat dishes, desserts, and drinks. (Blueberry mojitos are a favorite choice of mine). They also have a &amp;#34;skinny menu&amp;#34; for those of you who prefer or need to eat &amp;#34;lighter&amp;#34;. I definitely love the freshly grated cheese that is offered before every meal, and their Dynamite Shrimp appetizer is bomb! No pun intended ;)", "rating": 4, "date": "6/27/2014"}, {"text": "Good food. So much on the menu to choose from. Too full from dinner to eat dessert so we took a mango keylime cheesecake to go. Can&amp;#39;t wait to try it later tonight.", "rating": 4, "date": "8/17/2015"}, {"text": "Went here for drinks tonight. Had strawberry daiquiris! Planned on getting cheesecake also but the drinks turned out to be enough.Our server jesse was wonderful! So nice and always asking if we needed anything! Such a great experience!", "rating": 5, "date": "1/18/2017"}, {"text": "I just had dinner here on Monday January 22,18 with my boyfriend and our friend. They both had burgers my dinner was chicken Marsala with bow tie pasta which was yummy had the rest of it for my lunch with my boyfriend on Tuesday. They enjoyed their burgers cooked just right for them both. I go to Cheesecake Factory at least twice a year either here or in Boston. Tons of choices of things u can eat for lunch or dinner something for everyone even I believe a kids menu too. I will be returning again.", "rating": 5, "date": "1/23/2018"}, {"text": "There&amp;#39;s always a wait but it&amp;#39;s worth it. The food and cheesecake are. always good and the waitress we had tonight was awesome! Cecelia made the night with her humor, helpfulness and great conversation. We&amp;#39;ll definitely be back.", "rating": 5, "date": "1/20/2018"}, {"text": "The spicy chicken sandwich is huge and amazing. I love the fries at the Cheesecake Factory and how they package them. Both items have great flavor. Best part is the spicy chipotle mayo.", "rating": 5, "date": "5/12/2016"}, {"text": "This review concerns service only, specifically a dishonest charge. My son goes to school near this restaurant and frequents it on occasion. 4/8/16 he went there for dinner with friends and used a credit card to pay his bill. Today I got the credit card statement and the charge had been rounded up a couple bucks! I think that&amp;#39;s dishonest and shameful! It&amp;#39;s not a lot of money and likely not worth the hassle of disputing the charge with the credit card company, but I think we have all visited Cheesecake Factory for the last time, here in Peabody or the Braintree one we usually go to. Pay close attention to your bill!!", "rating": 1, "date": "5/4/2016"}, {"text": "I ate here a couple years ago, ordered a pizza and it was excellent. The service was great and everything I had was very good. I over heard the customers at the next table over joking about always getting dessert, because no matter how full they were from the meal they always had room in their &amp;#34;dessert stomach&amp;#34; to order dessert. I took their advice, and had dessert and it was excellent.", "rating": 5, "date": "9/10/2015"}, {"text": "I&amp;#39;m not really a huge fan of this place. I really liked the atmosphere and it was really roomy and big. but the food quality wasn&amp;#39;t the best, i was expecting a lot better because everybody talks about this place very highly. I was disappointed.<br&gt;<br&gt;Food: 7<br&gt;Environment: 9<br&gt;Service: 5<br&gt;Cleanliness: 10<br&gt;Price: 7<br&gt;<br&gt;Overall: 6", "rating": 3, "date": "11/25/2014"}, {"text": "Wtf is wrong with me. I&amp;#39;ve never reviewed my favorite chain resturant.<br&gt;<br&gt;Cheesecake Factory Peabody is my favorite place to visit when I just need something nice and familiar to eat. I go there with friends, family, or alone. It&amp;#39;s a clean place with a huge menu. I&amp;#39;ve got my usuals, and when I choose soemthing new, I&amp;#39;m never disappointed. I love the Thai lettuce wraps and the deep-fried avocado rolls. Damn good.<br&gt;<br&gt;The drinks are great too. I love the whiskey sours and even the blended shakes. But I go for the food more than for drinks. I&amp;#39;m a big fan of the Pasta Da Vinci, Carbonara and chicken dishes. Cheesecakes are lovely too, but even then I can only handle half or less. Thankfully you can box up whatever you can&amp;#39;t stuff into your face.<br&gt;<br&gt;The skinnylicious menu is not my fave, but it is nice to have. I do recommend the agave nectar mojito, it&amp;#39;s really yummy.<br&gt;<br&gt;The staff are accomodating, funny and easy to get along with, and always offer a recommendation. I love this place, and I know it&amp;#39;s a chain, but I always feel right at home there.", "rating": 5, "date": "10/17/2013"}, {"text": "Although I have never had anything here I haven&amp;#39;t liked, I always end up getting sick later on at night when I&amp;#39;m at home. Still... I like their food. The shepherd&amp;#39;s pie is a great choice, as is their fried chicken salad (ask for extra dressing on the side, though, because it is a little dry). <br&gt;<br&gt;The only complaint I have is that their menu is too big. It takes too long to flip through the pages and figure out what in hell I want whenever I&amp;#39;m here.", "rating": 3, "date": "7/20/2013"}, {"text": "Love the Cheesecake Factory! I always get two slices after lunch or dinner so that I can take one home with me - my favorite food ever. <br&gt;<br&gt;Yes, their food is not that healthy, but when I want to eat out there is really nothing else like it and nothing I want more than some of their comfort food and desert... mmmm love it", "rating": 5, "date": "6/18/2013"}, {"text": "Food was really delicious but Jessie our waitress was horrible. I was with my 3 friends and she insulted me and one of my friends saying that we ordered too much food. Then she continued to tell my other friend that she hates him because he paid $2 in change. Money is money. She also asked my other friend if she was talking about her when she was in fact just singing to her boyfriend.  Fantastic food, you can never go wrong at the Cheesecake Factory but very poor service. If you get Jessie as a waitress I suggest just leaving.", "rating": 2, "date": "10/13/2016"}, {"text": "BLACK MYSTERY HAIR<br&gt;<br&gt;I came here with 2 of my friends. I ordered a Chicken Parm. Sandwich.  I asked for NO peppers.  My sandwich came with peppers, which I would have just picked off but there was a BLACK HAIR on the plate.  GROSS!  I sent the sandwich back and the Waiter took it off the bill and said the manager would come by.  He never did and I left hungry and grossed out.  Like shouldn&amp;#39;t there be precaution&amp;#39;s to avoid this such as HAIR NETS OR WEARING UNDERWEAR TO WORK?   Seriously, I think the manager should have followed up on this health violation.", "rating": 2, "date": "2/22/2013"}, {"text": "Sat at bar for dinner around 5:15pm. It was pretty much empty and I was pretty much ignored.  Hard to get a drink. Hard to get my food order...hard to get second drink. Had leftovers...wasn&amp;#39;t even asked if I wanted to take it home. Not good service :(", "rating": 2, "date": "4/27/2016"}, {"text": "Normally, I love this place, so at my boyfriend&amp;#39;s request I took him there on April 12, 2017 to celebrate his special day.  My food came 10 minutes before his and without a very important side dish, making me not want to eat it until it arrived.  When the waiter delivered the main dish, I asked for extra applesauce (the side dish I was missing).  15 minutes later he delivered a very tiny bowl filled with little apples, not applesauce.  It was obviously nuked as it was so hot I had to wait to eat it.  I told him that I was supposed to have applesauce.  The manager then came over and gave me some lame excuse that the reason it didn&amp;#39;t come out in time was because it took them a while &amp;#34;to heat it.&amp;#34;  I told the manager that I didn&amp;#39;t enjoy my meal because it was not delivered as promised.  He just said...&amp;#34;oh sorry,&amp;#34; and that was it...no comps for dessert...NOTHING.  Terrible manager.", "rating": 2, "date": "5/2/2017"}, {"text": "Sunday brunch is until 2.  Came here at 1 and was seated right away, no lines!  They have an appetizer sweet corn tamale cakes.  You have to try these!  Very yummy.", "rating": 4, "date": "4/12/2015"}, {"text": "Horrible wait and rude staff. Never again.  The wait was 45 minutes and that passed then another ten minutes and then another 15 minutes. This is awful. The food isn&amp;#39;t that good that I&amp;#39;ll wait and hour and a half. For that I&amp;#39;ll go to a grocery store and then go home and cook. Thanks for the bad service but for saving the money.  We&amp;#39;ll never be back again!", "rating": 1, "date": "11/4/2017"}, {"text": "I don&amp;#39;t like cheesecake, but I love pasta! The Cheesecake Factory probably has the best pasta I have ever tasted. There were times where it was still hard, but I&amp;#39;m glad they can do it over and keep me satisfied. <br&gt;<br&gt;I love coming here and won&amp;#39;t stop :)", "rating": 5, "date": "3/3/2014"}, {"text": "Our server, Courtnie O, was super attentive and personable and didn&amp;#39;t hover.<br&gt;The food was better than average. The dessert portion was more than enough for two.<br&gt;The atmosphere was conducive to an enjoyable dinner date.  We were sat right away.  Monday&amp;#39;s are a good day/night to stop in.<br&gt;At the end of the dinner the manager, Bobby, came over to hear about our experience. <br&gt;Being a person with a food allergy, he heard how appreciative I was of Courtnie&amp;#39;s attractiveness. <br&gt;I would highly recommend a visit.", "rating": 5, "date": "7/21/2014"}, {"text": "I absolutely love the Cheesecake Factory. Although their menu is a labyrinth to navigate through because it is so big, the kitchen is very capable of making all of the dishes well. The dishes are huge too! I&amp;#39;m always stuffed when I go here, which is something of an accomplishment since I&amp;#39;m almost always hungry and have a large appetite. I suppose it&amp;#39;s somewhat of a cliche to enjoy chain restaurants, but I don&amp;#39;t really care when the food is excellent. The best part of this place is of course, the cheesecake. My personal favorite is the key lime cheesecake.", "rating": 5, "date": "3/28/2015"}, {"text": "What can I say about TCF. The food comes in huge portions and the menu rarely changes. We were the first people through the door today. The wait staff were walking around in a daze. It took several minutes for staff to come to the front to seat us. I ordered an ice tea and my son ordered a beer. It took at least 10 minutes to receive the drinks. We ordered a appetizer, Cuban sandwich and fish taco. The dishes were very tasty with plenty to take home including slices of Key Lime Cheesecakes which are to die for. Our lunch came to $75 and change plus tip. TCF hasn&amp;#39;t changed.", "rating": 4, "date": "3/4/2017"}, {"text": "I tried the chilaquiles on the Sunday brunch menu today -- very good, and the black out cake -- best dessert on the planet if you&amp;#39;re a chocolate lover!!", "rating": 4, "date": "6/16/2013"}, {"text": "I have a 9 month old and the waitress asked if she should bring him banana&amp;#39;s and bread- that&amp;#39;s a first!  <br&gt;She brought us our food in perfect timing.  Wasn&amp;#39;t too pushy about ordering anything specific.  The only thing I wasn&amp;#39;t happy about is, she didn&amp;#39;t put a lemon in my water and that&amp;#39;s how I asked for my water.<br&gt;<br&gt;I would recommend this location!", "rating": 4, "date": "2/24/2013"}, {"text": "Don&amp;#39;t go there on a Sunday night. Before I begin this review has nothing to do with our server, she was great, everything a  server should be, well worth a 25% tip. However, very loud music and now I know why I have a flash light app on my phone. Very dark. With the amount of people there you&amp;#39;d think it would be quicker service. Waited a while for our food and desert. Food was good but the wait...yikes. It was 9 PM. That&amp;#39;s why I try not to go out on Sundays. Again I wish I got the waitress&amp;#39;s name. She was the best.", "rating": 3, "date": "4/11/2016"}, {"text": "The only time in my life I have ever left less than a 20% tip. The waitress only took our order and then disappeared. The waiter serving the table next to us was the one that refilled our drinks, another random waitress brought our food out, and our waitress was only seen when it was time to pay. But she took her sweet time coming back for the card. As we were leaving we realized the problem, she was too busy chit chatting at the hostess desk to pay any sort of attention to her tables. Don&amp;#39;t waste your time with this place, there are so many amazing restaurants in the area. Cheesecake factory is over priced and the food isn&amp;#39;t worth it. Go here for cheese cake but only if you don&amp;#39;t feel like driving into Boston, because you will find much better there!", "rating": 2, "date": "7/5/2015"}, {"text": "Walked in on a Saturday afternoon with a couple friends. Wait was about 20 minutes. Food was great! Tried a few apps and the luau salad as my meal! We split a couple cheesecakes as well and both were amazing! Salted Carmel and snores cheesecakes are a can&amp;#39;t miss! Can&amp;#39;t ever really go wrong here!", "rating": 4, "date": "1/14/2017"}, {"text": "Good selection of wines and food at the bar. The crowd is usually quiet so it&amp;#39;s nice for dinner.", "rating": 4, "date": "3/18/2016"}, {"text": "Walked into the restaurant with an open mind.  Server was having a bad day apparently.  Inattentive, grumpy, and short...with talking.  Food was...meh.  Cheesecake was good until we found a long black hair baked into it.  The customer service manager had to asked to come over to the table twice.  When he finally arrived I informed him of the hair and that the rest of the cake should be pulled from the line.  He agreed grabbed the cake and walked away.  He walked up a few minutes later...after we paid...and said that he has to take it off of our bill.  Almost like he was obligated or forced.  Weird...  See needless to say not a very good experience.  I expected better honestly....", "rating": 2, "date": "6/23/2015"}, {"text": "Very classy as are all the cheescake factorys :) the menu is a little on the overwhelming side as they offer a million things haha the food is very good but im a little lost on what type if restaurant they are still would recommend them", "rating": 4, "date": "3/7/2016"}, {"text": "It use to be my favorite place but my food has stinked everytime I went. The pasta is awful very gross from being too salty to not being cooked. I think for the price it shouldn&amp;#39;t be so yucky", "rating": 2, "date": "10/14/2014"}, {"text": "I called a little before 7pm to place an order for take out. I was on hold for 15 minutes before placing an order and being promised it would be ready in 20 minutes. When I go in to pick up, there was a line that took 30 minutes to get to the cashier. Once I got to the register and paid I was told it would be another 10 minutes. That was now 30 minutes after I placed the order. It&amp;#39;s been 15 minutes since then and I still don&amp;#39;t have my food. I ordered take out after working 12 hours and really just wanting to get home, eat and go to bed. If I knew it would take 1.5 hours for a simple take out order I would have gone someplace else else. This is absolutely disgraceful customer service and I will never be back.", "rating": 1, "date": "8/15/2017"}, {"text": "Cheesecake Factory is my go-to spot for weekday drinks with the girls. Service is up &amp;amp; down, depending on who is on that night. Usually decent, so we keep coming back.<br&gt;<br&gt;I love that the menu is so big -- and I should note that while I say that, I typically order the same thing time and time again, so I don&amp;#39;t even know why a big menu is important. I guess it&amp;#39;s like living near the beach: you don&amp;#39;t always go, but it&amp;#39;s nice to know that it&amp;#39;s there. It&amp;#39;s my menu security blanket, if you will.<br&gt;<br&gt;Almost everything I&amp;#39;ve ordered is has been really, really good. Which is impressive coming from (1) a chain (2) a 40-page menu (I mean, how can you get EVERYTHING right?) (3) a more than reasonable price tag. Included in my yummy favs: chicken sliders, factory chopped salad, margherita pizza flatbread, lettuce wraps. <br&gt;<br&gt;Things to avoid (IMO): Chicken Pot Stickers (too salty), Pear Feta Arugula Flatbread, Crabcakes. <br&gt;<br&gt;Love the whole Skinnylicious menu, but especially the Skinnylicious mojitos. Yum!", "rating": 4, "date": "9/30/2012"}, {"text": "I try my best to avoid national chains altogether. To me, The Cheesecake Factory is just a fancier, expensive sit down McDonald&amp;#39;s that serves alcohol with a minimum 30 minute wait; sometimes 1 hour. <br&gt;<br&gt;Recently, the chain was sued because they purposely don&amp;#39;t list prices for their adult beverages. It&amp;#39;s appalling to know that after two drinks, the price you pay is more expensive than your meal. <br&gt;<br&gt;I don&amp;#39;t understand the fascination about this place. Yes, the food is decent in massive portions. But, I&amp;#39;ve had better for cheaper. And, does this nation truly need massive portions and quantities? Isn&amp;#39;t there an epidemic going on? I&amp;#39;m certainly confused.<br&gt;<br&gt;Based on my recent visit, I met with friends who live in the area. To avoid a large tab, I ordered the cheapest listed drink: warm caramel macchiato and an ice water. $5!  <br&gt;(I think that&amp;#39;s even cheaper than a slice of cheesecake.) My service was prompt and pleasant. Well trained, I&amp;#39;ll give him that.<br&gt;<br&gt;In all honesty, there isn&amp;#39;t much that impresses me about this place. It&amp;#39;s over priced, waits are usually long, it&amp;#39;s always frigid. Not my cup of tea.<br&gt;<br&gt;Why go to the Cheesecake Factory when there are 1000 great restaurants in the area?", "rating": 3, "date": "6/29/2012"}, {"text": "This is the 2nd time we visited the Factory - once for breakfast and a second time for dinner.<br&gt;<br&gt;I was disappointed both times: the food looked nice but tasted bland. Had I not ordered myself, I could not have told by taste that I was having fish tacos.<br&gt;My family members had the same impression of their food.<br&gt;<br&gt;In addition, it was freezing cold inside due to the AC running at full throttle on a day with pleasant 70 degrees outside.<br&gt;<br&gt;Don&amp;#39;t think I will come back a third time.", "rating": 1, "date": "8/8/2015"}, {"text": "I was SO excited to finally be eating at the Cheesecake Factory!<br&gt;It was our first time and I wanted to love everything. I liked the design of the space and the colors.I expected to love everything but sadly I didn&amp;#39;t. First crab and artichoke dip .Didn;t like it. There wasn&amp;#39;t a hint of crab. I decided on appetisers instead of a dinner.I ordered their version of crab Rangoon,chicken pot stickers and beer battered onion rings. The crab Rangoon was burnt. I sent it back and it was removed from the bill.The onion rings were literally dripping with grease.I couldn&amp;#39;t eat them. I didn&amp;#39;t like the flavor of the potstickers or the sauce.This wasn&amp;#39;t anything wrong on their part, just I didn&amp;#39;t like the flavor at all. I ate two  anyway because I was hungry and mostly because I didn&amp;#39;t want to dampen my husband&amp;#39;s experience.He liked his potatoes but the breaded chicken patties didn&amp;#39;t taste fresh and were greasy. I ordered a piece of key lime cheese cake to go. It tasted extremely bitter and sour! For that price! bummer!  Sad and disappointing all around.", "rating": 1, "date": "5/21/2015"}, {"text": "I really like this place! The atmosphere is very nice! It&amp;#39;s clean and nicely decorated. A lot of detail and thought was put into designing this restaurant. I understand that this is a chain restaurant and all the others are probably built like it, but that just means that you won&amp;#39;t be disappointed no matter which one you go to! My only complaint is that the tables are very close together, therefore, you can hear both conversations that are being had on each side of you while you&amp;#39;re eating. The food is very delicious with large portions, and the service is friendly. Oh, and of course, the cheesecake is AMAZING!", "rating": 4, "date": "4/21/2015"}, {"text": "I met a class act Mgr Kevin he made me feel like a first class customer my wife and I we&amp;#39;re very impressed by him the service and the food many thanks Dennis Grocki", "rating": 5, "date": "5/27/2015"}, {"text": "Terrible service. We have been here numerous times in the past. It used to be quick great service with very good wait staff. Today was a complete disappointing disaster. I had the day off from work with my wife which is a very rare occasion and we decided to go to cheesecake factory for lunch. We had to wait about 10 minutes to even see a waiter. When the waiter came by, my wife wasn&amp;#39;t  ready to order so the waiter came back about 10 minutes later. We gave our order and she asked if we wanted bread and we said yes. So, about 15 minutes later she walked by and said oh you wanted bread? We got bread about 5 minutes later. Then we don&amp;#39;t see her for about 30 to 45 minutes and she came by and said that our order never went through that we would have to wait even longer. She treated it like no big deal. I was pissed and hadn&amp;#39;t eaten all  day. She offered to let us talk to the manager which never happened. She then disappeared yet again. This completely ruined a very rare day off for us. I am so disappointed in the service we received here. I cant believe there was no manager oversight like every other restaurant. Just horrible overall.", "rating": 1, "date": "6/8/2016"}, {"text": "One of my all time favorite restaurants.  Excellent food- fish tacos are awesome but there are a lot of other excellent entrees too.  Great service, beautiful décor.", "rating": 5, "date": "9/29/2015"}, {"text": "Came in 2 weeks ago with my boyfriend for dinner. Very impressed with the service, pricing, &amp;amp; the portion.  The menu was huge and the even had a low cal menu! I will definitely be coming back..... I also loved the vibe of the restaraunt, it&amp;#39;s beautifully decorated with a modern feel.", "rating": 4, "date": "2/16/2015"}, {"text": "This location has had a few missteps today. Service was fine but the kitchen has been missing its mark.", "rating": 2, "date": "4/11/2015"}, {"text": "Orange chicken all the way.  Also, the Chinese salad is to die for.  Very good and worth going to if you have never been.", "rating": 4, "date": "1/1/2016"}, {"text": "Food was good, server was really nice. At the start there was some confusion with the service though. We had a server come over and take our order for drinks and then a couple minutes later another server came over. Turns out it was a shift change.", "rating": 4, "date": "6/26/2016"}, {"text": "Our server Tony who was working the bar area was very pleasant friendly and had many great suggestions! A taller white gentleman who knows more about the food we would like to order than your average waiter. I was very pleased with the service as well as the quality of the food. I&amp;#39;ve been a chef for many years for more restaurants than I can keep track of. However, their recipe for Shrimp Scampi is simply balls to the walls. My fiancé was overly satisfied as well overly stuffed may I add, thanks to the fettuccini Alfredo. Mind you, compliments from us two very well rounded Italians. Now, let&amp;#39;s discuss the pricey bar drinks we ordered...<br&gt;Well you know what, you get what you pay for here. These are not watered down and iced up mixed drinks. Many bars will not serve a Long Island ice tea, or if they do its not made the right way. Order one here! Try not to drive home after 5 of them though.<br&gt;Midori Sour? Excellent! All in all had a great time rang up a $130 bill for two people, and yet I am most certainly happy I chose here. Will be going back soon :)", "rating": 5, "date": "3/2/2015"}, {"text": "great desserts but my boss almost killed herself on the GREASY floor near the rest room.  I said something to the hostess as we were walking out and I got a SARCASTIC FAKE sorry and the dude next to her rolled his stupid eyes.  CLEAN your floor jeez your desserts are money makers so use that $ to CLEAN your floor.  Do you want a lawsuit from someone who falls?  I&amp;#39;m not the type to sue but someone else will be.  Take heed and do the right thing. It&amp;#39;s like a skating rink.", "rating": 2, "date": "1/2/2016"}, {"text": "Place is always packed because of the clientele being on the younger side and traffic from the malls. Waiters are horrible. Drinks are good. I got served over cooked steak and then asked for it to be changed to the pork chop that came out raw. The food is always overcooked or under, stay safe with burgers, pastas, and salads. Otherwise, eat at your own risk. The drinks are good but way over priced compared to what you can get at surrounding restaurants with better service and quality.", "rating": 2, "date": "4/22/2017"}, {"text": "Went last night with two friends and three kids under the age of 8.  Decent food for a chain, HUGE portions - I got three meals out of my order of Chicken Piccata.  We also got a burger with sweet potato fries.  And Thai Lettuce Wraps, which is an appetizer, had such a large portion, that it was perfect for dinner size.  The kids got burgers with fries.  <br&gt;<br&gt;Our waitress was nice and attentive.  The cheesecakes we had were delicious - original with strawberry, red velvet, and pina colada, but needed to walk around the mall after eating them.  Lol.", "rating": 3, "date": "2/1/2013"}, {"text": "You&amp;#39;ll probably love the food, but you&amp;#39;ll hate the wait. I&amp;#39;m talking up to 90 minutes on a Friday or Saturday night (eek!). However, the menu is ridiculously comprehensive, and there is absolutely something for everybody.  Most of the food is outstanding for a chain restaurant of this magnitude. The food prices are ok, if not a little high, but the drink prices are wayyyyy too expensive. Do your wallet a favor and don&amp;#39;t drink here. <br&gt;<br&gt;Our favorite food: the burger sliders, all the salads, and the spicy chicken chipotle pasta<br&gt;Our favorite drink: the white sangria<br&gt;<br&gt;We liked the Cambridge and Boston locations much more than this one, so if you live close to those, go there instead.", "rating": 4, "date": "3/12/2012"}, {"text": "For an 8pm crowd, the restaurant was busy and very loud. The food and drinks were grossly overpriced for the quality. While the waitstaff around us seemed friendly and engaging, our waiter was about as interesting as dry Bisquick. He was slow, never smiled, and barely asked us how our food or experience was. We got more attention out of a waitress from another station who offered to come over and clear our dinner plates.", "rating": 2, "date": "4/2/2017"}, {"text": "Best part of the Cheesecake Factory is their extensive menu.  <br&gt;<br&gt;Sad they got rid of the Navajo Sandwich.  it was the best item on their menu!!!<br&gt;<br&gt;Recently I ordered the curbside and was seriously disappointed with the meal.  There was NO food!  Cheesecake is known for large portions.  Hope they&amp;#39;re not scrimping!", "rating": 4, "date": "4/29/2015"}, {"text": "Went in last night (Wednesday) and waited about 5-10 minutes to be seated during peak dinner time. I&amp;#39;ve had great service at other cheesecakes but at this one it was pretty awful. Our waitress was nice and would have done a decent job if she had better time management. After we sat down it took 15 minutes to be greeted, another 15 for her to bring our drinks and ask what we wanted but we had questions for the kitchen so it took even longer to put the order in but I didn&amp;#39;t take note of the time at that point. It then took 15 minutes from getting the drinks to get bread. The food finally came out 50ish minutes after we sat down. I want to give her the benefit of the doubt and I&amp;#39;m assuming she&amp;#39;s new based off how she handles her tables. The tables around us with different servers were getting much better service (table next to us&amp;#39; server went over twice before she even brought us our drinks). We considered not even getting desert because we didn&amp;#39;t want to tack on another 15 minutes. Don&amp;#39;t go here if you want to be out in under an hour and a half.", "rating": 3, "date": "2/22/2018"}, {"text": "News flash: The Cheesecake Factory is not a fancy restaurant.<br&gt;<br&gt;It amazes me how many people think it is and come to this place decked out in their Sunday&amp;#39;s best. It&amp;#39;s forgivable, I understand, look at their fancy website, the bigass columns and Egyptian-esque artwork, the way the food is plated, shit the wait staff wears ties for godsakes. But really, anywhere that sells mac n cheese bites, corn dogs and burgers topped with pulled pork can not be considered fancy. In fact, I would barely even consider this place a restaurant. This place is a monument to American excess and gluttony, so leave the ties, fancy skirts and cuff-links at home and bring your stretchiest sweatpants and a hoody to cover the shame you&amp;#39;re going to feel when you finish eating here. <br&gt;<br&gt;It&amp;#39;s important to remember when you come here that the the goal isn&amp;#39;t to have an enjoyable meal, no sir. The Cheesecake Factory challenges you to stuff as much shit into your mouth as you possibly can and still have room for dessert. This place doesn&amp;#39;t make it easy because the portions of everything are stupidly huge. Oh, and there&amp;#39;s like 100 appetizers and they all look good so sack up and order a few to go with the free bread they give you (which is delicious).<br&gt;<br&gt;The last time I went here I ordered a burrito and thing was literally the size of my forearm and came with a big side of black beans and sour cream. I couldn&amp;#39;t tell you what was in it or even how good it was, I could barely remember by the time I finished the thing. Oh yeah, you bet your ass I finished the thing, The Factory threw down the gauntlet when they put that thing on my table and I had to answer the challenge. I finished my meal off with red velvet cheesecake because it&amp;#39;s the cheesecake factory and if you don&amp;#39;t get cheesecake at the end of your meal you&amp;#39;re an asshole. A slice is about the size of your head and yeah, it&amp;#39;s good, really good, for a place called the Cheesecake Factory it damn well better be. <br&gt;<br&gt;An important side note to remember is that the size of the menu here rivals the goddamn bible. This place seriously has everything ever and the reason why the wait is always so long is because it takes about 2 hours to figure out what the hell you want. It&amp;#39;s great if you have a date that is a picky eater and can&amp;#39;t figure out where you want to go for dinner. It&amp;#39;s also a good test because if she can&amp;#39;t find something she likes she&amp;#39;s way too high maintenance and you should ditch her ass. Honestly, it&amp;#39;s probably for the better because the time you are done with this place you are going to have trouble walking and breathing and probably weren&amp;#39;t going to get laid anyway.", "rating": 5, "date": "7/16/2011"}, {"text": "BEST SERVICE in MA!  Our food was served on time and the service was the friendliest for a busy place on Mother&amp;#39;s Day!!", "rating": 5, "date": "2/12/2015"}, {"text": "Getting into the restaurant can be tough. The mall is very busy and you might have to park a little bit far away. We went on a Saturday afternoon and finding parking was a bit annoying.<br&gt;<br&gt;We (a party of three) had to wait less than 5 minutes to get a table despite the restaurant being packed. I was impressed with the short wait. The greeter guy was a friendly introduction to the restaurant.<br&gt;<br&gt;The decor in the restaurant was nice. It was fancy in my eyes. We found ourselves commenting on the decor every so often. <br&gt;<br&gt;The waiter was great. We knew he was extremely busy; the restaurant was full. He brought us our drinks right away and was courteous. My sister got crispy chicken sliders. She asked for some extra sauces on the side which she got. I tried one of the sliders and it was great. Crispy, tender, and flavorful chicken. No complaints there. <br&gt;<br&gt;I had a a barbecue chicken salad. It was phenomenal. The lettuce was crisp; none of it was wilted. It had flavorful, tender grilled chicken and crispy fried onion strings. It was an expensive dish at $15. I should have gotten the lunch sized portion because this salad was huge. <br&gt;<br&gt;My girlfriend got a lunch sized salad similar to mine. She enjoyed it, also commenting that the veggies tasted fresh. We both ended up with leftovers. <br&gt;<br&gt;We had a Hersey chocolate cheesecake with chocolate chips. It was rich, sweet, and flavorful. <br&gt;<br&gt;They basically forced me to give them a 5/5. The staff was friendly attentive. They did all the little things like extra water refills, politeness, and attentiveness. The service was quick even though the place was so busy which I thought was remarkable. The food was exceptional. Maybe it was our lucky day, but this lunch was perfect. Only gripe would be the high prices, but with good staff, food, and ambiance, it is worth it.", "rating": 5, "date": "4/28/2012"}, {"text": "Very disappointed with The eggs Benedict. After our party consumed six drinks made by the impeccable bartender, Brittney, we should of left...eggs hard, hardly any hollandaise sauce, and the manager did nothing other than to offer another dish made when everyone was done eating. Don&amp;#39;t think I will ever go back...tired of giving this place second chances for their food. There are plenty of places that make good drinks...work on your kitchen!", "rating": 2, "date": "3/24/2014"}, {"text": "By far our favorite restaurant in the Northshore Mall area. The food is always great. The service can be slow even when there&amp;#39;s not very many people there. If your bread isn&amp;#39;t warm be sure to ask for a warm batch.", "rating": 5, "date": "11/7/2013"}, {"text": "Had a great Mother&amp;#39;s Day lunch dinner with my mom and dad. Our server Kayla was awesome very attentive to our needs and was right on top of everything. Food was great I had the Kobe burger cooked perfect mom had pasta which she loved. Make sure when you go you treat your servers well, they work hard on special days like today (Mother&amp;#39;s Day) thanks again Kayla for making it a good dinner", "rating": 5, "date": "5/11/2014"}, {"text": "Table for 2 on a quite Thursday afternoon &amp;amp; the service was like it was a busy weekend dinner. I don&amp;#39;t understand why everything took so long. My son had the chicken Marsala which was a huge plate, but he had no problem knocking it out. I had the grilled chicken avocado club w/ fries, the club was very tasty but so sloppy to eat I needed a napkin for my napkin.", "rating": 3, "date": "1/16/2014"}, {"text": "Friends and I eat here when we get the chance. Sometimes the wait is a little long but the food and service is great :) our waitress Chantal was amazing!", "rating": 4, "date": "7/11/2014"}, {"text": "The food is great ... it&amp;#39;s just getting there that&amp;#39;s the problem. We were told the wait was 20 minutes when we arrived. After 30 minutes we started noticing people getting called ahead of us. I finally asked the hostess if we were forgotten and she assured me we were next. We then watched 3 other couples get called up and seated with me standing right there. 45 minutes later we finally get seated because I had to ask again.<br&gt;<br&gt;I would rather a restaurant is honest with me and tells me up front I&amp;#39;m going to be waiting an hour rather than lowballing so I might stay. This happened in my previous visit as well although I wasn&amp;#39;t waiting as long.<br&gt;<br&gt;Moral of the story? Go here for great food but prepare to wait a lot longer than you are told. Also be sure to check in regularly to see if they forgot to seat you.", "rating": 2, "date": "2/15/2012"}, {"text": "Overall, I rate the &amp;#34;chain&amp;#34; at a 3 or a 4... but this PARTICULAR location (Northshore Mall) rates much lower.<br&gt;<br&gt;I base my critique on several visits (it&amp;#39;s tough to condemn a place on one or even two bad experiences).<br&gt;<br&gt;Negatives:<br&gt;<br&gt;- Menu: (chain-wide) If I have to fault the Cheesecake chain, I would say that the over-extensive menu dominated by advertisements is a major turnoff... as is the overwhelming number of food choices. Sometimes, less is more.<br&gt;<br&gt;- Cleanliness: A VERY disappointing common thread of our visits was cleanliness. It was almost comical (almost). Over the span of several (up to a dozen?) visits, we would almost ALWAYS have at least one utensil (usually more) with dried food encrusted on it, the glasses usually had food particles stuck on them and/or arrived VERY sticky from sloppy beverage dispensing, two of the times (yes, TWO) we had lipstick stains on the water glass and one time, lipstick stains on the white coffee mug. About 1/2 the time, the tables were BARELY wiped down... sticky residue, crumbs, it just got ridiculous.<br&gt;<br&gt;- Food: MOST of the time, the food was satisfactory or better, but there were a few times where it was just plain unacceptable.<br&gt;<br&gt;As of this writing, it has been over 2-years since we&amp;#39;ve returned. Things MAY have gotten better. I cannot comment on their current assessment. I may give them another chance soon - just because.<br&gt;<br&gt;What they do very well (obviously) is the Cheesecake. Heck, it&amp;#39;s in their name... I&amp;#39;d hope so. When prepared properly... On CLEAN plates and glasses, the food is good.<br&gt;<br&gt;---<br&gt;<br&gt;Update: FAIL!<br&gt;I tried their curbside takeout and went with something REALLY easy. One of their special cheeseburgers but asked them to hold the ranch dressing, cooked medium, fries, slice of cheesecake. Picked up my food, when I got home, the burger was between rare &amp;amp; med/rare, there was ranch dressing on the burger, and they forgot to put the fries in the container even thou I paid for them. Again, the cheesecake slice was just fine, but the burger (which should have been a no brainer) was a disappointment. How many more chances do I need to give them?", "rating": 1, "date": "6/5/2011"}, {"text": "I normally do not like chain restaurants but I will eat at a Cheesecake factory again. Last night their was a half hour wait for a table, the place was packed and the service and food did not miss a beat.  Recommendations all around here,", "rating": 5, "date": "6/28/2013"}, {"text": "Oh a great experience.  Wife and daughtar ordered the orange chicken. Chicken was soggy and saturated with grease. Ordered something different burgers took a long time were just okay. The bill came and they charged us fur a more expensive burger took 15 minutes to fix my bill. The restaurant was dead. Not a great experience the second time in two weeks.", "rating": 2, "date": "2/5/2017"}, {"text": "Pros: We always enjoy the food. My mom gets Renee&amp;#39;s lunch special, which includes a chicken salad or turkey sandwich, a side salad, and soup. I got the turkey club. Our waiter Todd was helpful, and the person who delivered our food was funny. My water was refilled frequently.<br&gt;<br&gt;Con: The seating!  It wasn&amp;#39;t busy during lunch on a Thursday, but that put us at a tiny table for two. This was forgivable...I think it was just me. However, they then proceeded to surround us with two other parties with about 18 inches between the tables. There was plenty of space to leave at least one table between different groups. It was awkward. I can understand the squishing if it&amp;#39;s crowded, but it wasn&amp;#39;t. I took off a star because of this.<br&gt;<br&gt;We&amp;#39;ll go back, but next time I&amp;#39;ll ask for a booth to avoid the overcrowding.", "rating": 3, "date": "5/17/2014"}, {"text": "Great service, fun wait staff, and good food makes this a nice place. But boy do they jam everyone into small places. Hey, I am 6&amp;#39; 4&amp;#34; and 200 lbs. You would think they could accommodate me. And they really were herding us to keep us moving. Sorrythis was more of a cattle call than a fine dining experience.", "rating": 3, "date": "7/8/2013"}, {"text": "Food was pretty good. On par with other cheesecake factories. Service was good. Our waitress checked up drinks and food on a routinely basis. 3 stars because my patron&amp;#39;s on ice were quite lacking in flavor", "rating": 3, "date": "11/24/2013"}, {"text": "Cheesecake! Mmmmm....Good.....!<br&gt;<br&gt;I really don&amp;#39;t understand what all the fuss is about concerning the Cheesecake Factory? I am not a fan of any place where the wait time is more than 15 minutes. It must be my ADD working. So I decided to plan a pre-lunch raid on the local CF at North Shore mall. My first impression is wow this place is really tall from the doors to the walls. The hostess was very bubbly as she sat me down for lunch. The waiter was very professional and did a great job.<br&gt;<br&gt;The CF menu is like the bible only larger. I am not joking. The offerings are all over the place so you can&amp;#39;t say you can&amp;#39;t find SOMETHING you would like to eat. <br&gt;<br&gt;I decided to try the lunch portion of Beer Battered Fish and Chips. It came out fairly quickly from the kitchen. The fish was just right in terms of portion and a huge pile of shoestring fries. The coleslaw was just a glob of disappointment after one bite it was swiftly placed aside. I would say my lunch was just ok. <br&gt;<br&gt;Now no visit to the CF would be complete without grabbing some cheesecake. I mean come on. It is like going to a baseball game and not grabbing a beer and hot dog or getting a massage without a happy ending! The dessert menu was just as stocked with delicious choices. Who knew they could make so many types of cheesecakes. I decided to go with the Turtle Cheesecake to go. This piece of cheesecake was packed to go delicately and weighed a ton. I walked to my car with my left arm hanging slightly down. <br&gt;<br&gt;The cheesecake was very rich and tasty causing a sudden spike in the  insulin levels in my body. I swore I was going to become a diabetic eating it! Damn it was good! <br&gt;<br&gt;I can&amp;#39;t say that this would become a regular place but if you are out for a sugar fix. The CF would make a nice score.", "rating": 4, "date": "12/28/2008"}, {"text": "Ok, I know this is a new location for the Cheesecake and I wen there on their third day of opening.  But COME ON, it was 3pm on a Friday.  Hardly anyone is there and the host staff still manages to take half hour to seat us.  We walk up and request a table for two, fine.  The host starts looking at her stupid screen and hands over a piece of paper with our table number on it to some other host.  The first host says, &amp;#34;she&amp;#39;ll be right with you.&amp;#34;  So we wait, and wait, and wait.  <br&gt;<br&gt;Finally, I&amp;#39;m like &amp;#34;what&amp;#39;s going on, parties of 4 that just walked in are being sat before us.&amp;#34;  She looks confused and says, &amp;#34;OH, sorry Hold on&amp;#34; and comes back and tells us our host is dealing with a difficult customer.  This should have been a sign to leave now.  <br&gt;<br&gt;The original host that was supposed to seat us keeps looking over at us and rolling her eyes, &amp;#34;uhhh seriously?&amp;#34;  Are you jealous of the girl I was with?  Why do girls act like this? <br&gt;<br&gt; FInally some guy seats us.  While our waitress was friendly, my lunch portion salad must have had a bottle of dressing on it.  It was basically soup with lettuce in it.  Gross.  I couldn&amp;#39;t finish it.  3 stars because I *think* they&amp;#39;ll get better with practice.", "rating": 3, "date": "10/24/2007"}, {"text": "Came to the Cheesecake Factory for lunch on our way to Gloucester. We had several issues here. One being the staff. Our waitress was so grumpy and made us feel like we were inconveniencing her. Then the food came. My child&amp;#39;s spaghetti was fine, with one small meatball. My mother in law got some chicken thing with a side of pasta, it was more salt and pasta than chicken. I ordered their Margarita pizza. The crust was obviously previously frozen the cheese was so over cooked it was gummy. It was gross. Last but not least, the temperature. It was like a meat locker in there. It was so cold and uncomfortable. Couldn&amp;#39;t wait to get out. Never again going back.", "rating": 1, "date": "8/22/2014"}, {"text": "This location does a good job, but somehow I feel like the food is better at the Burlington location.<br&gt;<br&gt;Everything is good and they have a nice space with patio.  Service can sometimes be not so great but it is normally okay.  Their small apps are great and not too expensive.", "rating": 4, "date": "10/11/2013"}, {"text": "I&amp;#39;ve ate here or at this food chain several times now. I still think the food is good, maybe even great. The portion is more than generous. I&amp;#39;ve seen the monster salads, but I have never ordered them since I fear eating salad in a public place when I am such a tiny person and fear that spectators would think that I am on a strict diet or have some sort of eating disorder. lol. But wouldn&amp;#39;t it be strange to be on a diet and have such a monstrous salad, one in which you can&amp;#39;t even see the eyes of the person sitting accross from you? Lol. I am over exaggerating. <br&gt;<br&gt;Let&amp;#39;s see, the first time I went here I went in a large group with my boyfirend and his co-workers. I ordered a virgin pina coloda. I didn&amp;#39;t feel like showing my id. I swear, it sucks sometimes to look like you are under 21. For my main entree, I had the bistro shrimp pasta. I like to try shrimp dishes first, then beef, then chicken when I try new places. I prefer seafood over poultry. I liked my dish. I didn&amp;#39;t absolutely love it, but I was having a good time and I enjoyed the busy restaurant atmosphere and wanted to come back. I tried my boyfirend&amp;#39;s hibachi steak dish and it was not so good though. I agreed with him that it was a bit chewy and a terribly small portion. The mushroom tasted...gritty, like it wasn&amp;#39;t cleaned properly. The wasabi mash potatoes was plentiful but it was also very dry. What is the point of serving a lot of unedible mashpotatoe? I&amp;#39;d rather be served a small portion that was excellent and be left wanting more.  As for service, service was not so good. The cook messed up one of my bf&amp;#39;s co-workers order. The waiters were not sympathetic. They came out of the kitchen with a plate with dry chicken pieces on it and ask us to toss it in with the bow tie pasta. Tisk, tisk. And a very long wait for a table.<br&gt;<br&gt;The second time I went here I went with my boyfriend and his best friend and his girlfriend. I had and liked a lot the spicy chicken chipotle pasta. It was very tasty. I love the asparagus in it, it was like a treat. Sorry, I love my vegetables.  Let&amp;#39;s see, I love their deserts. Who doesn&amp;#39;t? Cheesecake. Yum. Fresh strawberry. Yum. Actually, the second time I went to the Cheesecake Factory, I went to the one in Burlington. The wait was longer but our waitress was nice and the food seemed to taste better. Maybe I got lucky this time and ordered the right stuff.<br&gt;<br&gt;I have tried the canjun Jambalaya pasta twice. It is absolutely spicy goodness. The first time I didn&amp;#39;t like it because my chicken was overcooked and dry, but the second time when I had it in Braintree, MA adjacent to the South Shore Mall, it was supberb. The chicken was super juicy. If you love spicy, this dish is the one. I highly recommend this. I rate this over the spicy chicken chipotle pasta.", "rating": 4, "date": "7/31/2008"}, {"text": "I absolutely love the cheesecake factory! Their avocado egg rolls are to die for! Staff was super friendly and service was fast! Food was delicious! Easy to find.  Menu was huge.. A lot to choose from! A great spot to go with the family!", "rating": 5, "date": "7/16/2014"}, {"text": "Only 3 stars here, because 5 of my friends and I waited 2 hours for a table Saturday night.  I do not understand why, when this place has been open for months now, there is still a 2 hour wait!!!<br&gt;<br&gt;I have always liked the food here.  I have been to the Burlington and Prudential locations several times. They have a huge menu selection, and taking the cheesecake &amp;#34;to go&amp;#34; after dinner is the best part. The one down side was that because we were seated at 9 p.m.,  they were out of a lot of flavors of cheesecake. <br&gt;<br&gt;You&amp;#39;ll pay a bit more than your average restaurant, but the portion sizes are huge and make it worth every penny. Be warned that if you order a &amp;#34;small garden salad&amp;#34; you could pretty much eat it as a regular meal. I took like 2 bites and had to call it quits so I wouldn&amp;#39;t be too full for dinner. <br&gt;<br&gt;On the up side, its at the mall, so I DID find ways to entertain myself while waiting for the buzzer to go off.", "rating": 3, "date": "1/7/2008"}, {"text": "Had a great experience tonight at the Cheesecake. We&amp;#39;ve been to multiple Cheesecake Factory locations but tonight&amp;#39;s visit was worth a positive review.  We arrived around 6 pm on a Sat. evening and expected a wait of over an hour but were told 15-20 minutes, which was true.  We were seated within 20 minutes and our lovely waitress came over immediately. During our wait, we had reviewed the menu so knew immediately what we wanted to order.  We started with the Skinny Artichoke appetizer which included two artichoke halves, grilled and served with a mayo/aoli dip (delicious).  I have never had artichokes before served this way and must say it was great!.  I ordered the Skinny Mexican Tortilla Salad and my husband, the Skinny Chinese Chicken Salad.  Our waitress offered and brought bread, which I love!  The restaurant was quite busy so it took a little longer (than other experiences we have had at Cheesecake&amp;#39;s) for our meals to arrive but not unreasonable based on the volume.   Our meals were excellent and hit the spot.  The only disappointing fact about this chain are the many entrees that are loaded with calories ...and watching the many diners who probably should be ordering from the &amp;#34;skinny&amp;#34; menu chow down on poor choices.   Hate to pass judgment but I wish the menu posted the calorie counts on the face on the menu for those who don&amp;#39;t have a clue about making better choices.  The Skinny Menu is a great idea and surprisingly offers many delicious options.", "rating": 4, "date": "8/3/2013"}, {"text": "First off I never write bad reviews.  I actually created a Yelp account to write this I feel so strongly about it.  The Cheesecake Factory in Peabody is an atrocity of a restaurant.  Even though it&amp;#39;s a chain their food is very tasty and I do enjoy my meals when they&amp;#39;re made correctly.  The problems come with the way this location is managed.  It all seems to come down to the kitchen staff and not following directions and not caring to make something right.  Tonight I ordered the Tuscan Chicken as a to go order for dinner.  Getting someone to answer the phone at the bakery is hard enough so usually I&amp;#39;m irritated by the time my order is placed.  I don&amp;#39;t understand why they can&amp;#39;t staff one more person in that area or have one person solely in charge of to go orders.  Or why the girls making the cheesecakes aren&amp;#39;t allowed to use the operating system on the computers.  This would speed things up a lot during peak hours.  Anyways, I have had issues with this meal before so I know to ask for extra farrow because it does not come with a lot (which is fine I don&amp;#39;t mind paying more for something I want).  When I went to pick up my order there was no farrow which has happened more than once.  When they substitute in the computer they put &amp;#39;no farrow&amp;#39; and under it &amp;#39;extra farrow&amp;#39; so it is definitely confusing however I&amp;#39;m sure the kitchen gets substitutions all day long.  It should be one of those things they are looking at carefully when reading over a ticket.  The nice girl at the bakery said she would go get them to put more farrow on and she did.  So I paid and left and when I went to eat my meal (which is very tasty.. That&amp;#39;s why I keep getting it) I took a bite of the farrow and it was ice cold.  Whoever handled it in the kitchen took some extra from the refrigerator and threw it in my to go container without heating it up at all.  If I wanted cold rice or farrow I could  have definitely found that in my own fridge at home.  I was on a time limit so I didn&amp;#39;t have the energy or time to go fight with them over this otherwise I would have.  Not that that would make any difference.  I had another order about a year ago that I had asked for extra sauce on my pasta and when I got home which is in another town I realized they put no sauce on my food.  Just plain pasta noodles.  When I called to talk to a manager he said they would refund my meal to my debit card and he never did.  Clearly this restaurant doesn&amp;#39;t give two F&amp;#39;s about a good experience because these are repeat issues that I know happen to more than just myself.  Do yourself a favor and skip this restaurant and go somewhere else where you&amp;#39;ll be heard and taken care of.  I work in customer service and I still can&amp;#39;t get over how horrible this place is.  I won&amp;#39;t be going back it&amp;#39;s not worth it.", "rating": 1, "date": "7/2/2016"}, {"text": "Within the past couple of months I&amp;#39;ve ended up here at least on two separate occasions. I tend to have a habit of waiting until I&amp;#39;m absolutely starving and just diving into the first restaurant I see. A little hazardous I must say. <br&gt;<br&gt;As a chain, you can pretty much expect the same thing every time you go here. Luckily I haven&amp;#39;t had to wait any obscene amount of time, but the waitstaff is never exceptional. <br&gt;<br&gt;Yesterday I ordered the fettuccine and sun dried tomatoes pasta, which was really quite tasty, but instead of chicken I asked for shrimp. My waiter asked me if I wanted 3 or 4, seeing as how it was a one shrimp difference I didn&amp;#39;t quite think it was a big deal saying 4. It wasn&amp;#39;t like 5.. or lets say 10. <br&gt;<br&gt;When I got the bill they had charged me $7 for the 4 shrimp. A little absurd. Had I known that I would have gone with the 3. I suppose he was just trying to make money since I ordered the lunch size dish. The shrimp wasn&amp;#39;t even that tasty. <br&gt;<br&gt;After our waiter man dropped off the check, I sat for a good 10 minutes while he stood at his station staring at me. Maybe he was just swamped at 2:30 on a Monday...", "rating": 2, "date": "7/21/2009"}, {"text": "I have never had a bad meal at the Cheesecake Factory...until today. I ordered a pasta dish which came with watery, soupy sauce and overcooked noodles. I didn&amp;#39;t think you could mess up pasta, but apparently you can! The waiter asked if I wanted to pack it bc I didn&amp;#39;t eat it and I explained it wasn&amp;#39;t good. What&amp;#39;s worse is the waiter didn&amp;#39;t take it off the check, even after we had to order another meal to take home. He seemed new and nervous so my husband and I didn&amp;#39;t want to get into the whole &amp;#34;get the manager&amp;#34;bit, but every restaurant  I&amp;#39;ve ever been to automatically does if you aren&amp;#39;t happy! I&amp;#39;m so disappointed, never thought I&amp;#39;d say that about my once favorite place.", "rating": 2, "date": "6/18/2016"}, {"text": "I only end up here when trying to please many people. I&amp;#39;m not a huge fan of restaurants that have over 200 menu items... but I suppose there is something to be said for the convenience. <br&gt;<br&gt;I&amp;#39;m never impressed with the quality of food, but ya know, to me it&amp;#39;s no different than Olive Garden, Friday&amp;#39;s, Chili&amp;#39;s etc.. nothing special.<br&gt;<br&gt;I&amp;#39;ve always had good service though.", "rating": 2, "date": "9/19/2009"}, {"text": "Usually pretty good when I go but not tonight. Went specifically for the Mac n cheese bites and they were sold out.. not their fault but that sucks. Ordered potato tots, had to wait at least 5min after getting them just to ask for ketchup and one of them was completely brown and burnt. Also got buffalo blasts.. 3 out of the 5 were also brown and burnt, clearly their oil needs to be changed, nasty. but we ate the ones we could and they were good. Our meals came and I got chicken picatta no mushrooms. Found 4 pieces of mushrooms, not a big deal cause I&amp;#39;m not allergic, just annoying. The worst part, my angel hair was tangled all in a big clump stuck together, couldn&amp;#39;t even eat it. Over all, I&amp;#39;d say they need to have an expeditor that cares a whole lot more.", "rating": 2, "date": "6/9/2014"}, {"text": "Lunch at the CF in Peabody was enjoyable. Though the noise level is annoying and a major negative.. Love the decor. Menu is so large one does not have time to look at it all and truly decide on what you might really like to order if it&amp;#39;s your 1st time. ***Wish they would have a special weekly or monthly buffet by reservation only so that diners could try a number of items on their huge menu. ***GOOD IDEA***  :) I ordered from the lunch options and had a delicious, yet small portion of grilled salmon. It was accompanied by a disappointing portion of only 4 mini broccoli florets (tops only for non broccoli fans) and their signature mashed potatoes that someone had added an excessive amount of black pepper to prior to serving. WHOA! If I had the extra time I would have sent the plate back and requested no pepper be added. My server was tired, but quite personable. If you are looking for a relaxing atmosphere, the cheesecake factory is not the right choice. Do take out.  IF you are looking for an eye catching interior, high energy, LOUD, yet decent food and decadent dessert, then you have found your destination. Not inexpensive. Entree and dessert, no beverage plus tip ran $30 for one.  ENJOY!", "rating": 4, "date": "3/10/2015"}, {"text": "The food is always fantastic but my daughter just returned from eating with 2 friends and the waitress brought the wrong meal and then it took 25 minutes for her to return with the correct meal, long after her friends had finished their meal.  An apology was given but no offer for a complimentary meal which given the circumstances, I believe would have been appropriate.  It makes you wonder if it were three adults if the outcome would have been different.", "rating": 2, "date": "5/15/2016"}, {"text": "Honesty just a shitty experience probably won&amp;#39;t ever come back to this location. Took us over 45 minutes to get our food, and we ordered a dish to go while we ordered our food. Every time we said excuse me to our waiter Jennifer C she just walked away, maybe if she spent less time chatting with her friends at another table... finally ordered cheesecakes and said it&amp;#39;s for the birthday boy because we heard lots of people being sung to and we were brought our cake with no happy birthday. Finally our check came and she didn&amp;#39;t put our to go meal in so we had to wait even longer for that meal she said it was &amp;#34;so crazy&amp;#34; but if you looked around the place was almost empty.... we heard more people being sung happy birthday to so I stood up and yelled YA HAPPY BIRTHDAY FROM THE CHEESECAKE FACTORY to my friend and Jennifer came over and said &amp;#34;did someone take away her coke yet???&amp;#34; So rude will probably never come back after this experience what a shame.", "rating": 2, "date": "6/2/2017"}, {"text": "I am partial to smaller restaurants which may be why I was not a fan of the cheesecake factory.<br&gt;We went on a Saturday afternoon and there was a wait.  My friend wanted to try it so we did wait the <br&gt;20 minutes.   When we were sat at our table, I could tell right away that it wasn&amp;#39;t cleaned properly from<br&gt;the last patrons.  Still crumbs on our seats... and the side of the table was a little sticky.  After waiting 10 minutes for our waiter/waitress to come over and they never did, we left.", "rating": 2, "date": "4/5/2011"}, {"text": "When they opened a TCF at Northshore Mall my mom and I were overjoyed.  We used to love this restaurant but hated having to go al the way to Burlington.  Now we don&amp;#39;t like it as much.  BTW I don&amp;#39;t like Cheesecake and that is never my reason to go.<br&gt;<br&gt;The GOOD:<br&gt;<br&gt;-huge selection of dishes (highly recommend the Chinese Chicken Salad)<br&gt;-huge portions of said dishes<br&gt;-generally very friendly staff<br&gt;-beautiful decor and lighting<br&gt;-right next to the mall<br&gt;-nice music<br&gt;<br&gt;The BAD:<br&gt;<br&gt;-no reservations<br&gt;-can be very noisy when there are a lot of people<br&gt;-take-out is unpredictable and sometimes horrible<br&gt;-pricey<br&gt;-sometimes I have to pray and do Hail Marys and hope that they give my family and I a booth seating rather than those rickety chairs and the table <br&gt;-often notice flies around the kitchen area<br&gt;<br&gt;The UGLY:<br&gt;<br&gt;Seriously, this restaurant is always crowded with people.  I think people secretly live there.  The only time I&amp;#39;ve ever seen the restaurant dead empty was when the Pats faced the Giants in the Super Bowl.  Total ghosttown, but complete heaven-on-earth for us :)  No wait time, we got to pick our own seating, our food came in no time.<br&gt;<br&gt;Also, the wait time for a table can be ridiculous.  Sometimes we&amp;#39;ve waited for 2 hours for a table.<br&gt;<br&gt;Even when ordering over the phone for takeout I&amp;#39;ve waited for 30 min. at times.  I suggest dining in as opposed to take-out.", "rating": 3, "date": "1/6/2009"}, {"text": "Food is pretty good! Prices are okay. My two highlights for this restaurant are they breakfast all day, and their menu is huge! The biggest downside is the wait, really", "rating": 3, "date": "7/29/2013"}, {"text": "I came here today with my mother after a somewhat stressful morning with the toddler trying to get last minute Christmas stuff done and seeing Santa, the Santa is where it was stressful but this is about The Cheesecake Factory so let&amp;#39;s continue...<br&gt;<br&gt;We got there at the beginning of lunch around 11:30 and were pleased to be seated immediately. My mother who had tried on numerous occasions to come to several different Cheesecake Factories was impressed that it wasn&amp;#39;t a three hour wait. Apparently she doesn&amp;#39;t understand the fine art of having lunch there, well now she does! <br&gt;<br&gt;With toddler in tow and hungry bellies we looked over the menu and were pleased to find several lunch options which I thought would be much smaller portions but to our happy surprise were HUGE. They also brought out a small plate of sliced bananas and bread for the kid to munch on as well as a small cup of milk. Both of which went over great.<br&gt;<br&gt;As I mentioned we got lunch sized meals. I ordered a Pizza and Salad Lunch meal and could not believe how huge both items were. The pizza was really good and the salad was loaded with all kinds of greens and veggies. I had to take both home!<br&gt;<br&gt;My mother got Baja Chicken Tacos and the meal came with a generous sides of black beans, rice and assorted veggies. It also was 3 tacos large and she couldn&amp;#39;t finish it at all. <br&gt;<br&gt;All in all the meal was perfect. Our waitress, Ashley, was awesome and luckily because the kid is so social she was more than pleased with the laid back atmosphere.<br&gt;<br&gt;This is my favorite Cheesecake Factory and after this experience it seals the deal.", "rating": 4, "date": "12/21/2009"}, {"text": "I have to say the first time I went to Cheesecake I was surprised.  All my friends rave to no end how end how awesome it is.<br&gt;<br&gt;First of, Cheesecake is really tall, when you walk in it reminds you of Disney World--almost tacky but thought out ambiance.  We did not make a reservation, being a Friday night I thought it we would have to wait at least a half an hour.  After 15 minutes we were promptly seated and confronted with a menu that rivals the Da Vinci Code.  Granted they did have advertisements plastered on every other page, nevertheless they have a plethora of options to choose from.<br&gt;<br&gt;The best way to describe the staff is somewhat orderly chaos.  Our waiter made no effort to spend a second more than he had to with us.  Also he was rather difficult to flag down when we wanted to change our order.<br&gt;<br&gt;Good food can just about make up for any bad qualities a restaurant can retain.  Not only is the food quite good, you get a lot of it.  The salmon I recall correctly was not farmed and surprisingly for a chain they did not over cook it.  <br&gt;<br&gt;Now we could not go to Cheesecake and not get some cheesecake, I had their 40th anniversary cheesecake--half and half chocolate and vanilla split into 1/4ths.  Not the best cheesecake I have had on the planet, but overall the entire experience is worth it and makes for a nice meal/evening.  If you want fine dining, look elsewhere but if you want a sort of cheesy ambiance and decent food do not miss the Cheesecake Factory.", "rating": 4, "date": "2/17/2009"}, {"text": "Over the last year or so this place has really gone down hill. Slow service. loud, bland servers and too much transferring tables from one server to another, portions sizes have also gone way down on just about everything (especially the sandwiches/burgers items) and I agree that the food overall has Not been good... It&amp;#39;s just not as fresh and flavorful as one other reviewer wrote. Last few times I&amp;#39;ve been here food tastes like it&amp;#39;s been leftover/sitting in the pick up window for at least 10 - 15 minutes. This Peabody location Used to be one of the best Cheesecake locations to go to - Not anymore. Hopefully they&amp;#39;ll get their act together or they&amp;#39;re going to be another failure like a lot of these restaurants today that start out great for a while, and then go down like a German airplane. Consistency folks!!!!", "rating": 2, "date": "2/2/2016"}, {"text": "I am a fan of Cheese cake.  I know they are a chain and I go to several in the Seattle area often where I live.  They are all the same but then you know the level of food and service to expect which is great!  This factory I have been to several times because I come out to the Peabody area often.  It is always busy so that should tell you something.  The food is good and the selection like all factories is one of the largest.  <br&gt;The service was great and always prompt.<br&gt;It is located in the Northshore Mall and a great place to hit for lunch or dinner after a full day of shopping.   <br&gt;I am a big fan of the roasted artichokes and always get them.  I like the upscale eclectic decor too!<br&gt;We had lunch and our waitperson, a young man from New Hampshire had the coolest accent.  He was so much fun and added a lot to the meal.  <br&gt;I love to try different restaurants but when I am busy,  need a nice predictable place, at a good price,  I often choose Cheese Cake.  <br&gt;This one is in my GPS for sure !", "rating": 4, "date": "1/30/2014"}, {"text": "While the service can be hit-or-miss, they don&amp;#39;t take reservations, and the wait times are ridiculous, I do enjoy the food.  My favorites are the Miso Salmon and the Grilled Chicken and Avocado Club sandwich.  The menu is overwhelmingly large, and I&amp;#39;ve only tried a few other dishes, usually defaulting to my faves, which are always guaranteed to be good.  The cheesecake is good, very rich, and if I do opt for a piece (which is rare), I will split it with whoever I&amp;#39;m with.  <br&gt;<br&gt;Whatever you do, avoid the Buffalo Wings.  Unless of course you like insane 10-alarm heat and a numb tongue for the rest of the night!  You&amp;#39;ve been warned.", "rating": 4, "date": "7/12/2009"}, {"text": "If I could give this place a minus one star I would. Had lunch with my daughter saw a lot of bugs flying around had one fly in my bread when I was eating it could not eat my dinner after that this place was so gross!", "rating": 1, "date": "8/3/2015"}, {"text": "Where do I start? My family and I came here to eat a quick lunch/dinner after we found out PF Changs next door recently closed. Since we don&amp;#39;t live nearby, we always grab a few slices of cheesecake before we leave, but we don&amp;#39;t usually eat in. We decided what the heck, let&amp;#39;s do it. So we went in and after admiring the eye opening cheesecake display we waited to be seated. After finding the hostess, she took our name and told us it would be a few minutes. We got seated in a booth that had food underneath it so the young women swept it up before we sat down. A few minutes later, our waiter came over and asked what we wanted to drink. We then looked at the menu and ordered. I tried to order the $19.95 Seared Ahi Tuna, but, of course, they were out of Tuna. I then ordered the grilled salmon. When the food finally arrived, it was quite bland and didn&amp;#39;t have much flavor. I think I ate more of the bread we were given than my actually dish. After the disappointing food, we ordered cheesecake and hoped for something. I ordered the Oreo Extreme Cheesecake with hot fudge on the side. This came pretty quick and looked pretty good. After eating about half and saving the rest for home, I got the 85 dollar bill. With tip, this $100 dollar dinner was not worth any of it. If I could&amp;#39;ve given this experience 0 stars I would&amp;#39;ve if I didn&amp;#39;t have the cheesecake. All in all, the Cheesecake Factory should stick to cheesecake and that&amp;#39;s it. We will not be going back to eat in there anytime soon.", "rating": 1, "date": "7/5/2017"}, {"text": "Came here with my girlfriend to grab a quick bite for dinner. The cheesecake factory never ceases to disappoint me. We ordered the Miso Salmon for her and the Moroccan Chicken for myself. After 20 minutes of waiting, a manager came by and apologized for the wait. I began to say that it was okay, and she proceeded to say that the wrong size salmon had been cooked and it&amp;#39;d fallen apart. She went back, and after 20 more minutes we received our food. I was excited to try my Moroccan chicken, yet it was so dry, I felt as if I were sawing a piece of wood. They had obviously left my food at the hot line for the whole twenty minutes it took them to remake my girlfriend&amp;#39;s salmon. I sent the food back, and waited about 10 minutes for another plate. I&amp;#39;m giving an extra star because the server was helpful and sweet. Don&amp;#39;t waste your time here. Go to a non-chain restaurant.", "rating": 2, "date": "3/2/2013"}, {"text": "Not happy went to get my favorite there spaghetti &amp;amp; meat sauce and they took it off the menu...", "rating": 1, "date": "8/20/2014"}, {"text": "I was happy with my experience here. I got a meal takeout after being at an appointment at the hospital near by. The staff were pleasant although they didn&amp;#39;t really approach me, I had to ask where to place my takeout order. For this reason I took one star away. When you walk into a restaurant and your not familiar with it someone should recognize your confusion and ask if you need help.<br&gt;<br&gt;I got the Chicken Madeira which was delicious. It came with a few Asparagus spears and a ton of mashed potatoes.  The pricing was reasonable and comparable to other restaurants.", "rating": 4, "date": "1/14/2010"}, {"text": "2011: I went there with a group of six and we were seated in about 15 minutes on a Thursday evening. Not bad. The atmosphere is kind of Egyptian/Disney-ish, clean, busy but not too loud. Comfortable seating, with adequate privacy. Great food, and an amazing selection.  Our waitress was excellent, friendly, informative and efficient.  And, of course, they have all kinds of cheesecake, which several in our group had, and loved.<br&gt;Update: Our same group went back again this year (2013) and I did not enjoy the food this time. Still a large selection of food, but it was overcooked and several dishes were too sweet (a chicken and a tuna dish), which overpowered the taste of the food, and one raw tuna dish had tuna that was grainy. A lot of carbs: rice, potato etc. filled up the plates. I don&amp;#39;t think I will go back again. The cheesecake was still good though.", "rating": 3, "date": "10/24/2010"}, {"text": "I have never had much luck with this location. I returned after not choosing to dine at this establishment for roughly 4 years on 1/19 . My wife and i chose to give it another go after receiving a gift card. I was reminded how bad the menus were after being seated, but eventually decided on an app and entree after searching threw the unappealing menu. We started with nachos that had very little cheese on them. Followed by my wife getting her steak which was fine, and I got chicken carbonara. The first problem was that the carbonara was bland, the second problem was the very small amount of chicken that was there, and the third/worst  problem  it made me sick for several days.  I have just now been able to write this review and would also not recommend this establishment.", "rating": 1, "date": "1/24/2015"}, {"text": "I actually went here for a Birthday Dinner for my 18 year old son, his choice.   This was the first time I&amp;#39;ve eaten at this restaurant and I was not impressed.  I think the best part of the meal was the bread.  I ordered The Chicken Piccata and honestly I&amp;#39;ve never had this dish in a thick creamy alfredo type sauce.  I should have returned it when it was served but I didn&amp;#39;t want to make a fuss since it was a special occasion. The dish was very bland, not a hint of lemon and the capers were sparce.  I actually felt sick halfway through my meal and didn&amp;#39;t finish it.  My youngest ordered the steak which was served to her about 15 minutes after everyone else&amp;#39;s dish which was really annoying because we had already waited 45 minutes to be seated and another 30-40 for our meals.  We went during a week night, so I&amp;#39;m not sure that the issue was.  I felt it was extremely expensive for what it was which is basically gourmet fast food.   We ordered desert to go since we had a cake waiting at home.  The Chocolate Tower cake was massive however once again, not impressive, the quantity was there but not the quality that you would expect with the high price.  My stomach ached the entire way home.    I won&amp;#39;t be returning, I&amp;#39;d rather go to a non-chain restaurant and get the quality I&amp;#39;m paying for.", "rating": 2, "date": "11/4/2016"}, {"text": "Received excellent service tonight, a Saturday, from Tony our waiter tonight at cheesecake. He was quick to refill an empty glass and checked on us appropriately but not over bearing. Prices are a little high and the size of plates has shrunk somewhat but overall it&amp;#39;s a great location and not a stuffy environment so I enjoy it as a treat every now and then.", "rating": 4, "date": "10/27/2012"}, {"text": "Went in for a joint birthday dinner for my stepdads 50th and my brothers 7th birthday since they both fall on the same day.  Our experience was terrible. I called 5 days before our visit to set up a reservation for 12 people and the hostess told me they do not take reservation and to come in 45 minutes before we wish to be seated. Most of us in the party know it would be at least an hour so come Sunday my sister went in to put her name on the list. She was told she would wait minimum 2 hours. She told the hostess that we called and were told to be there 45 before we wished to be seated. My sister told the hostess that we were misinformed and had planned around the information we were given before which is why we did not make a reservation. The hostess told my sister that they do not reservations because it does not benefit the restaurant and that we did not meet their requirements to their policy so we had to wait. The manager was then evolved and showed interest in accommodating us for about 10 minutes. At this point the restaurant was still not busy. He told my sister he would do everything he could to have us sat in an hour and apologized. An hour and a half later we ask the hostess if she had any idea how much longer and she told us they were just waiting for tables to clear so they can be cleaned. At this point everyone in my party was hungry and frustrated as people were coming in and being sat a lot faster then we were. One girl was pregnant and asked for a water which she never received. The manager was no where to be seen and no one came up to us to keep us updated on the status of the tables. After over two hours waiting, we decided we were going to leave. At this point the manager was at the cheesecake station ignoring us and doing work on the POS system. In the 2 hours we waited we were not offered a drink or any thing during our wait. All the staff ignored us and did not try to be friendly with us. We asked about our tables a few times and were answered rudely as if we were being annoying. After almost 2 hours and a half my sister went up to the manager and told him we had waited over two hours and that we were frustrated and we were leaving. Apparently he had forgotten about us because he spoke to my sister as if he had no idea who she was. She repeated back to him what he had told her earlier and said ok has it been that long? she replied with yes its been way longer its been over two hours. He said ok and walked away. Less than a minute later we were sat. At this point everyone in the party was already cranky and hungry. The waiter was nice and quick. However during our dinner not once did the manager come by to check on us or apologize for our inconvenience. The food came out quick but was not very good. At the end of the meal we at least expected the birthday boys dessert to be comp from a $317 tab. However we were not compensated for anything and we were shown no remorse for our inconvenience. On top of that, they brought dessert over and sang when the birthday boys were not even at the table! The 7 year old was so disappointed because that&amp;#39;s all he had waited for all night was to blow out his candle. When my sister told them this one of the servers gave her attitude and told her they could sing again if it was a huge deal. She told him to forget it. The staff seemed to be very annoyed with us and seemed even more annoyed when we told them it was someone&amp;#39;s birthday dinner. The whole dinner was ruined and the whole night was a disaster.  We experienced terrible customer service and will not be returning to this cheesecake.", "rating": 1, "date": "4/3/2017"}, {"text": "A very beautiful restaurant. I got the swordfish, it was delicious and we got the turkey burger and it wasnt that great, very bland. The prices are a little high but I knew that before going. Overall it was a very nice experience.", "rating": 4, "date": "9/12/2013"}, {"text": "5 stars for TIm!!!!! <br&gt;<br&gt;My daughter was turning 7 and she picked the Cheesecake Factory for her birthday dinner. He was so amazing!! He made her feel like it was a special night for them to have HER there. Did the whole candle in the dessert and singing. But it was the one on one interaction that was the nice touch. Unfortunatley, you don&amp;#39;t see people go above and beyond anymore and I wanted to give credit where it is due. Thanks Tim, you really made her special dinner that much better! <br&gt;<br&gt;As far as everything else. I immediatley got a bad feeling when we walked in and it was a quiet night and 4 employees were standing at the hostess station and not one of them greeted us. The not so friendly hostess showed us to the table as if we were annoying her... EEK. <br&gt;<br&gt;Well, then Tim came and what a nice change of pace. Things were looking up. The food was good. Not out of this world good but definatley a step up from your typical chain. But, lets be honest we come here for the dessert. It&amp;#39;s in their name. Let&amp;#39;s just say it did not dissapoint. <br&gt;<br&gt;I would definatley come back. Maybe not for a meal but DEF for the cheesecake and maybe a few cocktails.", "rating": 4, "date": "4/29/2013"}, {"text": "You get a consistent product with decent food and theur signature cheesecake,  Its OK for a casual lunch or dinner but why settle for the routine when there are so many other options.", "rating": 3, "date": "7/30/2012"}, {"text": "I live in the area and whenever my friends and I want a good meal out or a delicious slice of the best cheesecake I&amp;#39;ve ever had we always head to The Cheesecake Factory. I&amp;#39;ve never been let down there - the wait staff is always kind and friendly, the food is delicious, and most of all they are consistent!<br&gt;<br&gt;My favorites are the Shrimp and Bacon Club and the Dulce de Leche cheesecake but the menu is so inclusive it is hard to go wrong.", "rating": 5, "date": "6/12/2010"}, {"text": "Love the food at the &amp;#34;Factory&amp;#34;. The Asian Chicken Salad is beautifully presented and delicious. The salmon is always cooked to perfection and mouthwatering. Tonight I had &amp;#34;skinny lettuce wraps (Asian)&amp;#34;. Not sure why they call them &amp;#34;skinny&amp;#34;, because they were full of chicken and veggies with two side sauces. My son had the Baja Chicken Tacos and cleaned his plate. My husband had the Factory Grande Burrito, which was also delicious, but much too large a portion for him. No complaints with the quality of the food or the service. Our server was friendly and helpful. Unfortunately, the ladies room was trashed! Paper towels overflowing everywhere and half of the stalls had no toilet paper. There were used tissues and other personal trash overflowing the receptacles in the stalls. I reported it to the main desk, and they said they&amp;#39;d tell someone. So, hopefully that&amp;#39;ll do it. Otherwise, I would&amp;#39;ve given them 5 stars. Did I mention the cheesecake???", "rating": 4, "date": "2/1/2017"}, {"text": "I got take out from here and I was so excited. They did a great job. They gave me the bread and extra sauce that I had asked for. I love the cheesecake factory. I will be back and I hope that my dine in experience was as pleasant as my take out experience. I enjoy the chicken potstickers to start with and the chicken Madera as my meal. Most of the time I am way to full for dessert after.", "rating": 5, "date": "9/18/2011"}, {"text": "My wife and i dined here last night.  We have been to this place a lot and we like it.  It is an old standby and favorite.  We have stopped going for a while because the menu is always the same nothing new.  We went last night because my wife told me there were new menu items.  We went waited the usual hour, and then were seated in the same tight small table with strangers so close to you that I felt like we were family. the waiter came over and quickly took our order.  I got garlic noodles with chicken my wife got a new salad.  The noodles were good i was upset with the chicken i was waiting for chicken breast cut into strips but i got a chicken thigh and leg on the bone in my pasta.  My wife said her salad was good.  My dish was tasty not much garlic, but tasty.  We good cheesecakes that were very good.  Our waiter checked on us once and then took forever to come back, because he had way to many tables.  The name Factory is a good one because that&amp;#39;s what it is there a factory in and out next, no real personality.  But to get a good consistent meal and a hearty one and no real changes this is a good old standby place to go.", "rating": 3, "date": "4/3/2016"}, {"text": "One of my favorite places to go to for dinner with friends. The wait is a bit of a downer but, the food makes it all worth it. The chicken chipotle pasta is delicious and their sangrias are quite tasty as well. Don&amp;#39;t even get me started on their desserts.. there&amp;#39;s a reason why its called the cheesecake factory!<br&gt;<br&gt; I only wish they took reservations!", "rating": 4, "date": "11/15/2012"}, {"text": "Called in an order 3 hours ahead so cake would be thawed when I arrived they said there wasn&amp;#39;t an order. Person was very rude saying they were the only one doing takeouts so would they would know. Received a frozen cake so I will have to wait another 3 hours for the cake to be edible. Will not come back to this location for a birthday cake again.", "rating": 1, "date": "9/28/2014"}, {"text": "went for dinner with my parents the other night, food was very good as always. tried the fish tacos and LOVED them! parents both loved their meals (fish sandwich which is new, and a Cuban sandwich). our waiter was Amazing! (Tim). definitely recommend this restaurant for anyone who hasn&amp;#39;t been!", "rating": 4, "date": "8/28/2013"}, {"text": "The Cheesecake Factory at the Northshore Mall is amazing. I always get different meals each time I go there and I just love the atmosphere. My boyfriend and I usually go just for cheesecake because of how pricy it is but I like how its not actually in the mall, its just attached to the mall so you dont hear the loud noise of the mall like you do if youre sitting in the food court. Only thing I dont like is some weekend nights when im craving it, we go there and its an hour- hour and a half wait so I usually go on a week night.", "rating": 4, "date": "6/13/2014"}, {"text": "Pretty average Cheesecake Factory. The decor and atmosphere is all the same, however, the wait staff and the greeters in the front are a mixed bag. Sometimes they&amp;#39;re rude, and other times they&amp;#39;re very nice.", "rating": 4, "date": "6/12/2014"}, {"text": "My favorite dish at the cheesecake factory is the Louisiana chicken pasta.  So delicious, I&amp;#39;m tempted to try another dish but once I get to the Cheese Cake Factory I weaken, I can&amp;#39;t pass up the Louisiana Chicken Pasta.  The salad&amp;#39;s are amazing, and the fried mac and cheese is to die for.", "rating": 5, "date": "2/21/2014"}, {"text": "We have been to this restaurant several times for lunch, dinner &amp;amp; brunch. They even have call ahead service called &amp;#34;Curbside To-Go&amp;#34; &amp;amp; catering. The menu is loaded w/over 200 selections.  Our servers Christine, Amanda(s), &amp;amp; Sara are always very thoughtful &amp;amp; accommodating--kids want chocolate chips or raspberry sauce for their pancakes-No Problem. One time the general manager even came out to personally accommodate us because Cheesecake knows how much we love to experiment. We love the Eggs Benedict for brunch, as well as all the different pancakes, the Energy Breakfast is a healthy choice w/a side of grilled chicken.  We highly recommend the small plates &amp;amp; appetizers:  Vietnamese Tacos were 3 delicious steamed moist Asian buns with tender roasted pork, crunchy marinated cucumbers &amp;amp; carrot strips, and onion with chiles, cilantro and sesame seeds.  Shrimp &amp;amp; grits were sweet n creamy corn-white cheddar grits (or any cheese you&amp;#39;d like--YUM!!). It&amp;#39;s comfort food, but sadly only a very small portion. We opted for no shrimp, but enjoyed the delicious, tangy spicy tasso sauce on the side.  We love the Thai Lettuce Wraps where there&amp;#39;s plenty to share &amp;amp; you can choose how you want to fill the lettuce leave wraps with: Satay Chicken Strips, Carrots, Bean Sprouts, yummy Coconut Curry Noodles with three delicious Spicy Thai Sauces: ** Peanut, Sweet Red Chili, and **Tamarind-Cashew.  Also recommended are the Pasta Carbonara &amp;amp; the Four Cheese Pasta. These standard, but comforting pastas are hearty creamy, cheesy pasta dishes. We liked how a scoop of creamy ricotta was set atop w/fresh basil in the latter, &amp;amp; the peas &amp;amp; bacon were the right touch for the carbonara. Even the lunch sizes are big enough to share. If you have room for dessert, try the one of the 50 deliciously creative cheesecakes such as Chocolate Coconut Cream Cheesecake: Coconut Cheesecake Topped with Coconut Cream Custard, all on a Chocolate Macaroon Crust. And the kids loved sharing the Reese&amp;#39;s Peanut Butter Chocolate Cake Cheesecake: Chunks of Reese&amp;#39;s® Peanut Butter Cups in their Original Cheesecake with Layers of Delicious Fudge Cake and Caramel--pure decadence!! Ask for enough spoons for the table or take a piece home.  You can even order these cakes online to have them shipped anywhere in the US.  The pictures on Yelp do not do the food justice. There&amp;#39;s something for everyone here.  What&amp;#39;s not to love?!", "rating": 3, "date": "7/2/2012"}, {"text": "A bit too crowded for a relaxing lunch, but the service was good and the food was quite yummy.  No complaints but not overly outstanding.", "rating": 3, "date": "2/17/2009"}, {"text": "After spending the weekend mingling with spirits, witches, and other supernatural creatures (Ah, the joys of Halloween weekend in Salem!), Kelley (my girlfriend) and I decided we would finally check out the Cheesecake Factory we had driven by so many times on our way on and off I-95!<br&gt;<br&gt;First off, let me say that I kind of dislike chain restaurants. I don&amp;#39;t hate them, exactly. I&amp;#39;ll eat at them from time to time and usually I&amp;#39;m satisfied enough with the experience. Most of them are simply unremarkable. The service is always standard. The food is decent. I can go to one and pretty much know what to expect. Some I really do dislike, though. Either their atmosphere is bad or their food is disappointing or something is just not right.<br&gt;<br&gt;Entering The Cheesecake Factory was like entering a nightmare for me. The doors are huge and heavy. The restaurant itself is gigantic, far bigger than any restaurant I&amp;#39;ve ever eaten in before. I felt like there were tables for miles around! The ceilings tower above everyone like in an airport, train station, or factory of some sort! I saw staff standing around but no one greeted us when we entered. After a few bewildering and discouraging moments, I finally noticed the desk that was sort of in the middle of the lobby and asked the attendant standing there if we were supposed to check in with him. My guess turned out to be correct, he took my name, and we found a spot to wait for a table. They really need to have that desk marked somehow or have staff waiting at the door to greet people. We were entirely ignored until we figured out how to check in.<br&gt;<br&gt;We waited less than ten minutes, I think, for a table. The hostess who led us to the table seemed lifeless, possibly annoyed that she actually had to work. Our waiter, though, turned out to be a friendly guy who seemed eager to please. <br&gt;<br&gt;The menu, frankly, is intimidating at twenty-one pages long! It goes against everything I&amp;#39;ve read about good restaurant management, where the right choice is usually to keep it short. Do a few things well, no more than three or four pages of great menu items that taste great, and people will come back over and over again. Twenty-pages, with what I&amp;#39;m told is over two hundred items, seems insane. I don&amp;#39;t know how they pull it off! They may have kidnapped Willy Wonka&amp;#39;s Oompa Loompas and put them to work in Cheesecake Factory kitchens.<br&gt;<br&gt;We both ordered peach smoothies to drink. They arrived in completely full, very large glasses and tasted absolutely delicious! I ordered the seared tuna tataki salad. Kelley ordered the crispy chicken costoletta. I&amp;#39;ve never had rare tuna before but I was feeling a little adventurous! The food didn&amp;#39;t take long to arrive, despite the place being quite busy and very large. My meal came presented very nicely, with several slices of lovely tuna (seared brown on the outside, nice and pink on the inside), four majestic slices of beef steak tomato, a bit of avocado, and a large pile of greens. The tuna tasted fantastic and felt great in my mouth. The seasoning was a little &amp;#34;hot&amp;#34; for my tastes but that&amp;#39;s just personal preference. (I&amp;#39;m still working up my resistance to hot, spicy foods!) The greens, avocado, and tomato were fresh and delicious. I toned the spicy sensations from the tuna down by quickly following tuna slices with other things from my plate or eating tuna with other things at the same time. It worked well and tasted wonderful! I also tried Kelley chicken costoletta and found it excellent. The chicken was perfectly tender and tasted fantastic!<br&gt;<br&gt;Between my huge peach smoothie and my tuna tataki salad, I was stuffed to the gills when it was time for dessert. I couldn&amp;#39;t turn down the chance to try the famous Cheesecake Factory cheesecake, though. So I got a piece of the seasonal Pumpkin Pecan Cheesecake to go. I just ate it, siting here at home in Maine, and found it delicious. It&amp;#39;s just what I expect cheesecake to be. I am pretty sure I&amp;#39;ve never had cheesecake with pecans, though, and now I&amp;#39;m looking forward to holiday pies, hoping pecan will be among them.<br&gt;<br&gt;The Cheesecake Factory is one of those chain restaurants I really should hate. The atmosphere definitely doesn&amp;#39;t do it for me. It really is too big and too impersonal. The service, at least at first, was really quite poor. However, the food really &amp;#34;did it&amp;#34; for me. I just looked at their menu on their website and noticed several items listed that I didn&amp;#39;t notice when looking at the menu in the restaurant. There are so many things I&amp;#39;d love to try! If all the food is as good as we got, it&amp;#39;s definitely going to be worth going back from time to time. Cheesecake Factory, you aren&amp;#39;t perfect, but you&amp;#39;ve won me over!<br&gt;<br&gt;A final note, other than the incredibly heavy doors one must manage in order to enter the restaurant, the place is pretty handicapped accessible. No steps or steep inclines, generally enough room to comfortably navigate the dining room floor, and the bathrooms easily accommodate a wheelchair.", "rating": 4, "date": "11/1/2010"}, {"text": "The food is only so-so &amp;amp; the service is extremely inconsistent.  Sometimes you get a terrific server, other times it appears as though the staff is unsure who is covering what tables.  MAJOR PROBLEM:  What&amp;#39;s with serving the meals at different times...some at our table got their dinner, while others got their&amp;#39;s about five-ten minutes later...this has occured twice!    Has that become a norm?   I think not.", "rating": 2, "date": "6/29/2009"}, {"text": "This place is always packed and I&amp;#39;m not sure if it&amp;#39;s about the service or the location.  At any rate, our 10 minute wait was more like 20.  We ended up with a fantastic server who didn&amp;#39;t make a big deal of my fiance switching out his entree since the marsala sauce had a funky taste.  The rest of our food was awesome and the dulce de leche cheesecake is to die for!", "rating": 4, "date": "8/6/2009"}, {"text": "if you are a fan of the big bang theory, you need to go to see where Penny works.  they specialize in over 200 items, which is far more than most restaurants can do well.<br&gt;if you get bored you can read the advertisements in their menu, which helps keep them afloat, I guess.    I also found that their food helps me lose weight because it does not sit in my body very long.   The cheesecake was good though.", "rating": 2, "date": "2/15/2013"}, {"text": "The food is good, the cocktails are ok.....the food is generous portions, the cocktails are weak and not worth the pricetag. I have yet to have enough room for the cheesecake. However, a doggy bag with a piece of cheesecake for later, is a good idea.", "rating": 3, "date": "10/25/2009"}, {"text": "I&amp;#39;ve been to several Cheesecake Factories. The one in Peabody is very good overall. The menu is huge !! The decor is great. My 2 yr old loves the appearance &amp;amp; the constant traffic of the waitstaff. This is his favorite restaurant by far. My 14 yr old loves the Orange Chicken. My fav&amp;#39;s are the Miso Salmon, The Tuna Carpaccio, The Avocado Spring Rolls &amp;amp; the Black out Cake. As for Cheesecakes, they are creamy, fresh &amp;amp; always tasty. Last time, I had one with a blondie crust, macadamia, nuts, caramel, white chocolate, etc... It was unbelievable, maybe the best &amp;amp; sweetest piece of cheesecake I&amp;#39;ve ever had. ** Diabetics should avoid this place **  The only negative in the 10+ times I&amp;#39;ve visited is the take-out process could be better", "rating": 4, "date": "8/22/2011"}, {"text": "Went here with my family a week ago, the food was great came out hot and plated neatly, our waitress made sure we had our drinks refilled and checked on us throughout dinner. I had the new pina colada cheesecake it was super yummy, only negitive i wish the slice was bigger.", "rating": 5, "date": "8/5/2011"}, {"text": "The Cheesecake Factory, North Shore Mall, Peabody. Very busy all the time. You have to wait to be seated. The food is delicious and the menu is extensive. Food is of generous portions. I have yet to have had enough room for the CHEESECAKE.  Get CHEESECAKE to take home.  BEST IDEA.", "rating": 5, "date": "3/9/2011"}, {"text": "Food here is always amazing. Never had a problem with customer service or food. Though on special occasions there are wait times. But they are very good about getting you seated in the time frame they give you. I tried their breakfast once. I got their pancakes with a side of eggs. The eggs were yummy and the pancakes were quite big but just ok. Overall I still will be eating here.", "rating": 5, "date": "6/25/2011"}, {"text": "Not prepared for  brunch group.  One guest of twelve got their eggs 15 minutes after everyone else. One dish of eggs was cold.  The server failed to return to see if everyone was satisfied with their meals which we were not.  No one ever got coffee refills after the dishes were served.  I had to ask the server to bring over the manager.  The manager asked what he could do to make it up.  At that point the meals and our happy time was ruined so there was nothing.  I told him I found the deplorable service to be outrageous.  He replied that he thought I was outrageous.  What a shame that the manager is incapable of resolving customer satisfaction issues at a national chain which normally is synonymous with quality.  I travel for work and eat out 4-5 days/week.  I was sooo surprised the manager didn&amp;#39;t offer anything and put the onus on me - I was expecting him to take the initiative and comp us the 2 defective meals and take a % off everyone&amp;#39;s for the incredible poor service.  I would keep this incident in mind for Mother&amp;#39;s Day.", "rating": 1, "date": "4/27/2014"}, {"text": "Dined at Cheesecake Factory with my wife last week for dinner.  Crowded as always but that&amp;#39;s expected at the Northshore Mall. Decor is very nice with high ceilings and intimate lighting.  We waited about a half hour, there was probably 30 people waiting as well.  For two people, you will not sit in a booth.  Rather a very small table that you can&amp;#39;t even have more than two plates on.  Food is a bit pricey here, cheesecake starts at $6.99/slice.  Service was pretty good.  Our waitress got everything we needed.  Food portions are good, we had leftovers.  I give two stars due to the small table, lack of seating or waiting guests, and you can&amp;#39;t have much of a conversation with your significant other because the people next to you are literally 2 feet away.  If I had known it would be that crowded and noisy, I would have just sat in the bar.  Also, sadly this is becoming a teenager hangout.  One couple was getting pretty physical in the lobby.", "rating": 2, "date": "11/9/2014"}, {"text": "This place is alright. Its always crazy busy, I&amp;#39;ve waited for a able for an hour and a half one time, and it&amp;#39;s not quiet either. I usually can&amp;#39;t hear who I&amp;#39;m with over a small table. Probably the most annoying thing is they don&amp;#39;t even take reservations, not even for larger parties. <br&gt;<br&gt;The food is alright, not the greatest thing you&amp;#39;ve ever eaten, but it&amp;#39;s just fine. Also, everything comes in huge, I&amp;#39;m talking HUGE portions, so if you planned on getting cheesecake, don&amp;#39;t eat 2/3 of your meal. <br&gt;<br&gt;The cheesecake is mostly the reason I come to this place. It&amp;#39;s absolutely amazing, and I never have room for it. This is a decent place to eat, but they&amp;#39;ve got to get their act together.", "rating": 3, "date": "7/27/2011"}, {"text": "just in case you missed it the first time: if you love to be treated like cattle eat here. you&amp;#39;ll wait hours in a pushy crowd of starving people, be gruffly seated at a table a full 4 inches from the next table, your server will visit you to take your order and to drop off your bill, and your food will be sub par, poorly cooked, and enough to feed a small village in cambodia. i have no i dea why people like this place, i guess it just goes to prove that some people like to be treated like crap. dont waste your hard earned money on this corporate junk, support a local business who is more interested in providing a truly enjoyable dining experience.", "rating": 1, "date": "6/1/2009"}, {"text": "I don&amp;#39;t mind this place at all, I had lunch here last week, had Farfalle with chicken and roasted garlic. It was GOOD! Piping hot! Yum-O! My companion, Patty, a Co-worker, had chicken salad, which was HUGE and she loved it! We also split Crispy Crab Wontons, and they rocked! Delish! We sat at the bar, and Brett the bartender was great, so were the people sitting to my right, a husband and wife who were celebrating husband&amp;#39;s birthday. There was also a hysterically funny kid who was the runner. Lots of personality. I also like how they lay down a napkin for you when you sit at the bar to eat, as the top of the bar is some sort of granite or stone and is slippery. I would have given 5 stars but for the guy next to Patty, he was just a complaining caca head. He complained about everything from the time he sat down. He was mad that they didn&amp;#39;t have a huge chopped salad, only a small size. Kinda ruined it for me. He was just not a nice man. I hate when people blame the server for something not being offered. It&amp;#39;s probably not offered cuz only YOU would actually order it. I did like the fact that we were out of there in less than an hour tho! Nice when you&amp;#39;re working on a lunch break!", "rating": 4, "date": "4/27/2009"}, {"text": "This is one of my favorite Cheesecake Factories ever... the service, with the exception of 2 times, has been excellent (I visit about twice a month for the last year).  They hire great waiters who are attentive (the best being Debbie and Celeste) and take their jobs seriously.  Only twice did I have 2 different people who had absolutely dreadful, slow service (others brought out drinks, food as she just stood there and said, &amp;#34;O yeah, your water!&amp;#34; and another tried, too hard, to upsell dessert.  No means no...)  I really enjoy the fish entrees here because the fish is fresh, served in large servings and everything tastes great.", "rating": 5, "date": "12/19/2011"}, {"text": "We have been to this location 4 times now, yesterday on a Saturday night was the worst experience. We orderd curbside take out, was promised the food in 20 min. So we waited in the designated spot but we soon realized that there were no food being delivered to anyone while we were waiting there. So I walked into the restaurants, it was like mayhem. So many lines of people. Food sitting on the counter ready to to delivered. It&amp;#39;s somply mis-managed. Food was average for the price.", "rating": 3, "date": "6/3/2012"}, {"text": "For it being my first visit to this restaurant--let alone to any cheesecake factory I was impressed. Got there 6:30pm on a Friday night only had to wait about 10 mins for a table. Cozy seating. Atmosphere was awesome. The servers were friendly and food was even better. Big orders which makes it worth the money. Prices are not bad compared to other restaurants and I love the large menu. We almost went to Bugaboo Creek but really glad we chose this place.", "rating": 5, "date": "5/30/2008"}, {"text": "Its hard to give them 4stars.I like the place.its really nice and have great foods.they are a bit pricey but well portioned.and that&amp;#39;s all the good stuff I have to say. So recently I went there with my gf for dinner... here comes the bad part, it was busy on a saturday night go figure, so call ahead n check the wait.the front desk are <a href=\"/redir?url=http%3A%2F%2Fgood.im&amp;amp;s=7a7693dbde0148bdf02760d6e3c4dcfa0805632d83f83f8b3d7e769efb7fb5a1\" target=\"_blank\" rel=\"nofollow\"&gt;good.im</a&gt; not really good with eating in front of strangers I just find it weird that I can hear there business since im sitting right next to them.but this place is so cramped up if your sitting @one of those long tables where u are literally side by side with another group of people.the waiters over there are too occupied n rude to help u with anything I had to run down a staff just to get a <a href=\"/redir?url=http%3A%2F%2Frefill.here&amp;amp;s=f9e5210221b049638032e241daf7c4be6cae51462b321694820d85abede73409\" target=\"_blank\" rel=\"nofollow\"&gt;refill.here</a&gt; is how they serve us &amp;#34;hey what do u want?&amp;#34;I was like excuse me? I was really thrown off because it was really rude. the table we were sitting was small it couldn&amp;#39;t even fit our 2dish n drinks.but I would go to a different spot since I do like this restaurant.", "rating": 3, "date": "5/1/2011"}, {"text": "Went here for dinner on 8/27.  It was around 6PM and my wife and kids were in the mall and I wanted to make sure we get a table since we didn&amp;#39;t made any reservations.  So I went over to check and spoke with the hostess about holding a table for us at 7PM.  Unfortunately, they&amp;#39;re unable to do that.  I told them it would be for 2 adults and 2 kids and 1 baby stroller so we definitely need a table with some space.   The hostess said there&amp;#39;s a table that can accomodate that, but again they can&amp;#39;t hold it or put our names down for it.  So I left a little disappointed.  Later, after I gathered the family and headed back to the restaurant, the hostess remembered what I needed and informed me that she can put us at the table that could accomodate 4 of us and the baby stroller.  Well done.  Thank you for that.  I really appreciated the effort.  Also, our server was pretty cool and very patient with us.   He even helped took pictures of the family since it was our daugher&amp;#39;s birthday.  Overall, the food was tasty, the price was reasonable, and the customer service was outstanding.", "rating": 5, "date": "8/30/2013"}, {"text": "Last week when we went our waitress was awful but the food was good.  Today we sat at a table and I noticed that even though it had been set it was filthy- wet spots from drinks and crumbs everywhere.  We asked the waiter to clean the table and reset it since some of the silverware was less than clean. He did but left the dirty rag on the table next to us.  He then took our order for drinks and appetizers and we asked for bread.  10 min later our drinks and appetizers arrived and we asked for bread again.  When he came to take our plates away later my teenage daughter said, &amp;#34;we would still really like some bread&amp;#34;. He said, &amp;#34;oh&amp;#34; and a few minutes later tossed it on the table. The food arrived and although I had told our waiter that we were splitting the meal no extra dish was brought over. The kitchen is doing a good job the food tastes good but their lunch wait staff is not doing a good job.  Talking with the bartender rather than being attentive to their tables means that they need to be retrained. I would rather go someplace that appreciates my business and that means I won&amp;#39;t be eating there again.", "rating": 3, "date": "7/30/2013"}, {"text": "I will NEVER frequent this restaurant again.  They ruined my son&amp;#39;s 18th birthday.  I know they don&amp;#39;t reserve tables; however, I made a special trip to see if I could persuade them to help me out since my son needed a place to go with 20 friends.  The manager was a very nice guy (I think his name was Mike) and said ABSOLUTELY NOT A PROBLEM.  Well...when my son and his friends arrived 10 minutes early as they requested, they said it would only be a 20 minute wait.  What was supposed to be a 20 minute wait was 2 hours without any seating.  They were finally turned away after waiting over 2 hours.  The manager was rude and nasty even though these boys and girls behaved in a very adult and appropriate manner showing much patience.  I guess there were three business men eating and sitting in the middle of the 4 tables reserved for the kids.  Instead of offering to buy them a drink at the bar, they let them sit for 2 hours after their dinner was over.  This is very poor management.  The nicest restaurants will ask if they can get them another seat because the space is needed.  I speculate that because there were 20 kids, the wait staff just figured there would not be a big enough tip and decided to wear them down until they left.  So...bottom line...my son spent his birthday in the food court.  Just remember...what goes around comes around!  Again, I will NEVER go back there!  Just like every other mediocre chain restaurant, they will keep this up and eventually bite the dust!", "rating": 1, "date": "2/6/2012"}, {"text": "The atmosphere is not that nice, feels like a chain as it is one, and like a factory, just like it name says. The food is huge portions and really heavy, but there cheesecake is the real reason you would come here, why waste your hard earned money on mediocre, entrees, that just don&amp;#39;t seem to do anything for me. Okay I cook alot, so maybe I&amp;#39;m just picky. But if you like huge portions, and a loud atmosphere, then maybe this your place", "rating": 2, "date": "8/4/2009"}, {"text": "We&amp;#39;ve always had good service and the food is tasty, but not of a great quality and full of hidden fat.  We received a gift certificate and decided to use it recently, but would choose many other restaurants in the area over this one.", "rating": 3, "date": "10/28/2009"}]}