{"address": ["199 Boylston St", "Chestnut Hill, MA 02467"], "monthly_reviews": {"2019": [[0, 3.5], [1, 3.0], [2, 3.5], [3, 3.5], [4, 3.5], [5, 4.0], [6, 4.0], [7, 4.0], [8, 3.0], [9, 2.5], [10, 2.5], [11, 2.5]], "2017": [[0, 2.5], [1, 2.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.0], [6, 3.0], [7, 2.5], [8, 2.0], [9, 2.0], [10, 2.5], [11, 3.0]], "2020": [[0, 2.5], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.5], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.0], [11, 3.0]], "2018": [[0, 3.0], [1, 2.5], [2, 2.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 2.5], [7, 2.0], [8, 2.0], [9, 3.0], [10, 3.5], [11, 3.5]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "Update: customer relations reached out to me and was very communicative and concerned about my experience. They offered me a gift card. I have to say, I&amp;#39;m pretty impressed with this customer service!<br&gt;<br&gt;I ordered take out from here tonight and was told it would be ready at 6:15 and to wait for a text to come inside and get it. At 6:40, I hadn&amp;#39;t received a text so I called and a team member told me to keep waiting. I called back at 7:05 after waiting FIFTY minutes and still not receiving a text and was told someone would bring my food out. I finally received my food at 7:10 (never wound up getting a textNow I&amp;#39;m eating cold food and was not offered any type of apology. I will not be returning to this location.", "rating": 1, "date": "7/3/2020"}, {"text": "When they get it right the food is actually good. However it seems like the last several times I&amp;#39;ve gotten curbside takeout something is wrong! This time the sides were ice cold not even warm and the sauces they didn&amp;#39;t put the lids on all the way so the sauce went all over the food and the chicken was soggy from where it had been sitting in it. They should definitely speak to their back of house people putting the food together.", "rating": 3, "date": "5/5/2020"}, {"text": "Pros:<br&gt;- Nice interiors and atmosphere<br&gt;- Smooth and safe curbside pickup experience (during COVID-19)<br&gt;- Pleasant service<br&gt;- Delicious food, big portions, good value in my book (like any other cheesecake factory)<br&gt;<br&gt;Cons:<br&gt;- Early on when they were transitioning to curbside pickup, they didn&amp;#39;t include the complimentary bread a couple of times even when I asked for it in the online order. However, this issue seems fixed based on my recent orders.", "rating": 4, "date": "5/20/2020"}, {"text": "The Chestnut Hill restaurant is the worst one in the chain--compared to others I&amp;#39;ve been to in Florida and California. The food is mediocre at this one, and put on the lights!!!  It&amp;#39;s like a dungeon in there!", "rating": 1, "date": "9/3/2020"}, {"text": "Carlos Valencia, our waiter did a wonderful job of taking care of my family and I. Even with our rambunctious toddler he remained very accommodating.  The menu has something for everyone&amp;#39;s particular taste. We&amp;#39;ll be back for sure.<br&gt;<br&gt;I must say the bathrooms are very clean and modern.  I&amp;#39;ve learned over the years that one can tell a lot about a restaurant by how they maintain their bathrooms.<br&gt;<br&gt;The brunch is surprisingly delicious.", "rating": 5, "date": "3/2/2019"}, {"text": "Thank you, Cheesecake for taking the time to review and respond to my initial review. We returned a month later to get take out and the process was fast and seamless. We were very pleased and will return again. Thank you for listening and for taking customer service seriously.", "rating": 5, "date": "7/9/2020"}, {"text": "No, we ordered a low carb low calorie cheesecake from this location. Big mistake. First of all, it was frozen on arrival when we picked it up curbside. They were supposed to thaw it out as we had ordered it in the morning. My girlfriend and I both had major gas all the night and the next day. Something was not right with this factory made cheesecake that cost $52 dollars.", "rating": 1, "date": "8/11/2020"}, {"text": "If I could give 0 stars I would! I made a reservation hours in advance and got there on time to find out that I had to wait &amp;#34;20-30 minutes to be seated.&amp;#34; Truthfully, It was more than hour wait for a table. The best decision I made tonight was to go to the Besito Restaurant next door. I was seated right away without a reservation and enjoyed great dood and drinks. I recommend trying The Besito Restaurant.", "rating": 1, "date": "8/23/2020"}, {"text": "This was absolutely disgusting to see. I wanted to go in and have a nice dinner with my mother that I haven&amp;#39;t seen for a while (both of us are of Latin descent). We decided to go to this specific location after having a nice day in the mall. Then we saw that The Cheesecake Factory was there, and remembered how good the spinach dip was. <br&gt;<br&gt;The man, for the purpose of this review is named Fred, asked for my name to put me on the list. He said 15-20 minutes. He was dressed in a server uniform. He had black glasses, full beard. <br&gt;<br&gt;An old man and his wife come in (white couple). Fred tells them that their wait time is 5-10 minutes. <br&gt;<br&gt;I tell my mother that if Fred sears this old white couple first, we are going to have an issue. <br&gt;<br&gt;Fred sears this couple within a minute of them waiting, while my mother and I have already been waiting 8 minutes. I timed the whole thing. <br&gt;<br&gt;A tall white woman dressed in all black (presumably the host) comes up the the host stand and gets three menus ready. Based on this information, my mother and I were not going to be seating next. Another group of three that arrived *after* my mother and I were going to be seated. <br&gt;<br&gt;I let the white host know that she can take my name off the list because of Fred&amp;#39;s inability to discern who was actually next because he was blinded by his own projection of internal hatred. The woman was also rude and looked oblivious about everything. <br&gt;<br&gt;Don&amp;#39;t go here if you&amp;#39;re not visibly white, other wise you&amp;#39;d be waiting for 15 minutes while everyone that came after you gets seated before you.", "rating": 1, "date": "10/6/2019"}, {"text": "If you&amp;#39;ve ever been to a cheesecake factory then you&amp;#39;ll know precisely what to expect. Service was pleasant though not anything special (they were prompt in refilling our drinks which I always appreciate). The menu is huge (normal for cheesecake factory) and is also littered with ads which doesn&amp;#39;t really bother me.  <br&gt;<br&gt;Overall if you like cheesecake after your meal this is the place to go since they have me huge selection! Ironically the only real complain is there listing of the calories in each dish since the meals can be ridiculously high in them (ignorance is bliss!). <br&gt;<br&gt;Ample parking here!", "rating": 4, "date": "8/8/2017"}, {"text": "Great service! I&amp;#39;ve been there twice and had Briana as our server both times. She is incredibly sweet and doesn&amp;#39;t rush you to order. She checks on you just enough. The food is really good. Much better than the Cheesecake Factory in Braintree. I highly recommend and ask for Briana!", "rating": 5, "date": "1/6/2020"}, {"text": "I have been to The Cheesecake Factory quite a few times and I always either leave super satisfied and full from a great meal or the opposite, feeling annoyed. <br&gt;At the Chestnut Hill location (both here at the Shops at Chestnut Hill or at the former Atrium location, even though that one wasn&amp;#39;t nearly as nice or spacious as here), I ALWAYS have a positive experience, which is telling. Out of four other locations I have been to, this is hands-down the best Cheesecake Factory around. Natick is subpar, Providence RI is horrible. I don&amp;#39;t even remember if I have been to any others in the past years. <br&gt;This location has a great setup with a perfect amount of booths and tables inside and outside. The atmosphere is SO much more relaxed and quiet than the Natick location. I went there within the past year and the food wasn&amp;#39;t great, the service was slow, and there were so many people there and so much noise. Here, not only is it easy to park, there is no wait, and the service was spectacular. Everything was efficient and accurate. <br&gt;The menu is super lengthy at The Cheesecake Factory so you are bound to find something that will peak your appetite. The meals are large and filling too. Almost no way to go wrong coming here. Again, simple parking too (not in Natick!). <br&gt;5 stars.", "rating": 5, "date": "6/1/2019"}, {"text": "Really good Chicken Enchiladas tonight from the skinny delicious menu. Ordered at the bar where I got very good friendly service.", "rating": 5, "date": "11/25/2019"}, {"text": "Ok, I give it 4 stars, mostly due to value for the money and professional service. <br&gt;<br&gt;They give you huge portions, and they are fast. It&amp;#39;s a clean place. The staff are professional quality. The price is very good for what you get. The food is good.  It&amp;#39;s all good!  Every restaurant should strive to be so good at the logistics and service. <br&gt;<br&gt;Note that I rarely eat desert, so the following only applies to their entrees: I don&amp;#39;t love their food, but everything else works like clockwork. So they deserve a solid four stars because I think they are excellent at accomplishing their goals. I just wish their food was a bit yummier.", "rating": 4, "date": "12/1/2019"}, {"text": "Very nice experience! Open hall therefore safer during these times. 4 stars because the steak was well done when I asked for medium.", "rating": 4, "date": "7/5/2020"}, {"text": "WOW What can I say we are in 2019 and a monster chain restaurant like the Cheesecake Factory is still cross contaminating food and Christopher Barsness THE MANAGER thinks that&amp;#39;s its totally normal and ok as long as he tells you that no matter what what order for fried food that it will be fried in the same oil as they fry fish, I asked if he would make an exception and change the oil or make my meal separate HE SAID NO. <br&gt;Needless to say I will never be back to the Cheesecake Factory thanks for your honesty Christopher.", "rating": 1, "date": "9/8/2019"}, {"text": "Hmmmm Strangely eerie feeling,waited for 45 minutes for a table had a reservation at another restaurant but my boyfriend really wanted to go here.  Our waiter was nice but a little awkward and overall the feeling was uncomfortable the food was good I ordered the beef skirt with mashed potatoes and my boyfriend had a specially made pizza with chicken and red peppers the food was delicious <br&gt;<br&gt;overall drinks were fine I had the red lha the Chardonnay<br&gt;<br&gt; a martini but you check it out look at the pictures and see what I mean it was just weird<br&gt;<br&gt; I would go to Braintree over newton nanytime no ghosts see what <br&gt;I have tried to edit this review to fix where I had the Chardonnay and he had the martini and I can&amp;#39;t even go back and fix it now you tell me somebody doesn&amp;#39;t want me to write this review . either way again the food was good the place was weird it&amp;#39;s an old place in Obviously has a lot of history and something doesn&amp;#39;t want to be told I don&amp;#39;t know ‍", "rating": 3, "date": "3/14/2017"}, {"text": "Pissed. I came here last night and spent a lot of money... had a lot of leftovers and a waiter gave me the wrong wrapped food. Very upsetting. It&amp;#39;s not that hard to tell someone whats in what box.", "rating": 1, "date": "9/6/2019"}, {"text": "My bourgey brothers tease me because of my love for the CF. I have always called it my favorite restaurant. But tonight I lay it to rest. We already had a terrible meal at the Burlington location so this Newton location was our new stop. But today was the worst. <br&gt;<br&gt;I thought being there at 3:30 on a Tuesday would mean quick service. The host was not warm, but the server came over immediately to take our order. The bread was served and I wondered if it had been sitting out since the lunch rush. It was not fresh. And then we waited...and waited...and waited.  No refills on the tea. <br&gt;<br&gt;Finally got my SkinnyTaste shrimp tacos--a dish I have enjoyed.  The tacos were inedible because the tortillas were crunchy meaning they were cooked incorrectly.  You know that texture if soft tacos are left out---rubbery.  The pickled veggies on the side were not pickled. It was so bad I waved the server down to send it back. <br&gt;<br&gt;My son had the burger and enjoyed it. But his fries never came out. He ate as much as he could of the burger and they were finally served to us in a small paper to go bag. WTH?  That bag subsequently opened in my car so then the fries were on the floor. <br&gt;<br&gt;Asked for the manager...and waited....and she agreed that we shouldn&amp;#39;t pay.  <br&gt;<br&gt;Went shopping and came back (this is how loyal I was) to get cake. There were 5 people in line with angry faces. They had been waiting and waiting without even having their orders taken. So my eight-year old was devastated, but we left empty-handed.  <br&gt;<br&gt;RIP Cheesecake Factory. I feel like this is our breakup. It is good sometimes to have closure.", "rating": 1, "date": "12/11/2018"}, {"text": "The ladies room was disgusting!<br&gt;My shoes were stuck to the floor, I sanitized them when I got  home<br&gt;How can the help use the same facility?", "rating": 1, "date": "10/10/2019"}, {"text": "Love love LOVE!!!  My bestie and i came here for an early dinner and i must say this location is where it&amp;#39;s at!!!!  From the greeters to our waitress, everything was superb.  Our waitress Rosemary was awesome!!!  From taking pics(she&amp;#39;s a pro y&amp;#39;all ) to suggesting the perfect meal to suit my mood (chicken Gumbo) My bestie ended up eating my dinner and packaged his to go. I&amp;#39;ll definitely come back to this location whenever I&amp;#39;m back here. S/O to Rosemary girrllll you did your thing", "rating": 5, "date": "3/14/2019"}, {"text": "We have been to many Cheesecake Factory but honestly we loved the service of this one. It was my friend&amp;#39;s birthday and they decorated cake so beautifully. Avocado toast were bliss and if you are vegetarian you must try lasagna!", "rating": 5, "date": "3/10/2019"}, {"text": "Whatever you do-DO NOT order delivery from this Cheesecake Factory. Tonight was the third order from them in the last six months that has arrived with either incorrect/missing items or with the complete wrong order. Door Dash is the most useless delivery app to begin with but Cheesecake Factory should take responsibility for ensuring that the correct and complete orders are given to the drivers.  Completely unacceptable. Do not waste your time.", "rating": 1, "date": "9/3/2019"}, {"text": "The Cheesecake Factory is always a favorite place of mine. After my dinner this past week, my mind has been changed. <br&gt;<br&gt;I went to dinner with my friend and her mother. We were seated at one of the tables near the bar. It was a Wednesday evening an luckily we had less than a 20 minute wait. We all share a salad and spinach dip to start. The others ordered a chicken dish and a pasta dish. Both these meals came out on time. I ordered the taquitos appetizer. They came out 10 minutes after the other dishes got delivered!!!!! They were burnt as well. The waiter didn&amp;#39;t seem to care to check in after we got our meal. Not pleased.", "rating": 3, "date": "10/27/2018"}, {"text": "This cheesecake factory had changed so much! First my water glass had green stuff on it. Looks like someone who ate salad just drink on it. Gladly Jess our server immediately changed it and apologize. <br&gt;We ordered Chicken with waffles and Calamari.<br&gt;When our food came in they were missing the syrup for our waffle and the hollandaise sauce was all dried up. The calamari is so rubbery and hard. I only ate half of it.  The breakfast potato taste gross as well. Overall the food is not pleasing at all. <br&gt;The server was busy from other table who&amp;#39;s been complaining about their food so we didn&amp;#39;t even bother to ask her and change it.<br&gt;Im only giving them 2 starts because the server was nice.  <br&gt;Lastly, im not coming back to this cheesecake anymore. Me and my husband shit ourselves right after we ate their food.", "rating": 2, "date": "9/16/2018"}, {"text": "Huge portions, great food. I was initially very suspicious of the Cheesecake Factory because I thought of it as a mediocre chain. However, I was proven wrong! The food is fantastic, with both the buffalo chicken pieces being very well made. The spaghetti and meatballs was hearty and nice too. Finally, the cheesecake itself is delicious! The portions are huge which is great value for money -- we had lunch for $30/pp and had enough for dinner too. I&amp;#39;d highly recommend checking it out.", "rating": 5, "date": "10/6/2018"}, {"text": "Great meat loaf dinners! Absolutely the best meat loaf that I have ever had. Spicy and very juicy, never dried out.", "rating": 4, "date": "2/6/2020"}, {"text": "I think ordinarily I would have rated this 4 stars, before last night.<br&gt;<br&gt;We have lived up here for 5.5 years. We have eaten at this Cheesecake Factory 24 times, spending a total of $2,019.26 -- an average of $84.14 a visit.<br&gt;<br&gt;Last night we went in about 9 p.m. The place was no more than half full. The &amp;#34;hostess&amp;#34; had her back turned to the door, and us, for a good minute before she turned around and noticed us. Asked how she could help. (Clue: We&amp;#39;re at a restaurant. We are here for food. Preferably at a table.)<br&gt;<br&gt;She informed us that it would take a moment and to wait. (In a restaurant with ample seating available. Curious.) After a wait of perhaps 3 or 4 minutes, we were deemed suitable to be seated.<br&gt;<br&gt;She took us to a dinky table. Worse: It was nasty. Filthy. When one of us pointed this out, what do you think the reply should have been?<br&gt;<br&gt;1) I&amp;#39;m so sorry, let me clean that.<br&gt;2) Would you like another table?<br&gt;3) It was just cleaned.<br&gt;<br&gt;Well ... it was not.<br&gt;<br&gt;However, the odds are good it will be remarkably free of $84.14 from us any time soon. Which is unfortunate, we like CF. And we&amp;#39;re good tippers too. I&amp;#39;m sorry &amp;#34;hostess&amp;#34; was maybe not having her best day, but ... we&amp;#39;re not spending money to sit at a disgusting table.<br&gt;<br&gt;Disappointed; we like the food generally. But not the way we were treated. We just decided to go somewhere else.", "rating": 2, "date": "7/16/2018"}, {"text": "i don&amp;#39;t usually write negative reviews, especially not for chains BUT I had a pretty negative experience at the Cheesecake Factory in Chestnut Hill today. <br&gt;i ordered a chinese chicken salad and asked for extra oranges. after I left the restaurant (take out order) I realized the slip said &amp;#34;no oranges&amp;#34; and i had not been given any. I turned around and headed back to  the restaurant for the oranges. I was not apologized to, but rather treated rudely by the employee at the take out counter who acted defensively, saying &amp;#34;I typed DOUBLe NOT NONe&amp;#34; after I rather politely  asked for the missing oranges (I waitressed for years and years, I aim to never be rude to restaurant staff). Then arriving home and finally opening the salad (which I order at least once a week) I saw to my dismay that I was given TURKeY instead of the chicken it is supposed to come with. I do not eat turkey due to family history of gout<br&gt;<br&gt;*Edit* I received a call from the cheesecake factory customer service. They apologized and offered me a gift card for the price of my salad. Would have preferred a refund BUT i appreciate the gesture*****<br&gt;<br&gt;Update: customer service for the cheesecake factory called and offered me a gift card for the amount of my salad, as a way to invite me back. So I did add a star as all restaurants mess up, customer service matters.:)", "rating": 2, "date": "2/25/2018"}, {"text": "I order the lunch pasta carbonara with chicken, only few pieces chicken charge for $4. extra.https://s3-media4.fl.yelpcdn.com/bphoto/ugs_F1t0-4-KdUorX2jzYA/168s.jpg", "rating": 2, "date": "10/1/2018"}, {"text": "I have been here so many times, but I always forget to take pictures or write a review. So here we go... this place is one of the best The Cheesecake factory because it is not so crowded as usual. Good service, short time on the waiting list and delicious food. I personally enjoy getting a table outside, away from de noisy family style restaurant.", "rating": 4, "date": "8/12/2018"}, {"text": "Foods are delicious  bread and butter coming before your order it&amp;#39;s so delicious you can try all the foods my favorite is chicken madeira. But Service is not perfect", "rating": 5, "date": "6/20/2019"}, {"text": "Took my Son &amp;amp; Wife here for my sons Birthday. Not very happy with this place. Thought the portion to price ratio was off. Our portions were just average. I expected more from a higher end restaurant like this. <br&gt;<br&gt;Our table wait wasn&amp;#39;t bad. But our wait person was awful. Our drink order taken the wait person came back &amp;amp; accidentally split a drink on my Wife. I know accidents happen but the drink spilt all over her new coat. Not Happy!<br&gt;<br&gt;We didn&amp;#39;t order any appetizers so we just ordered out meals. They came out in roughly 35 minutes. thought it was a bit long. <br&gt;<br&gt;Our food tasted Great, but like I said our portions weren&amp;#39;t that impressive. Could have gone to Panera Bread or the Olive Garden and could have had much larger portions for less money. But my son wanted to come here for his Birthday.<br&gt;<br&gt;Our wait staff person never came to check on us. When we were ready to leave we had to flag down a wait staff person to wrap up our left over food. The Person took our food. I ask for a slice of Cheesecake to go. The wait person said they would be right back. We waited roughly 20 more minutes. We flagged another person down they said I will be right back. The person came back only to tell us our Leftover food had been thrown away... Plus no Cheesecake either.. We paid in Disgust &amp;amp; Left $80 spent &amp;amp; it was a Bust. <br&gt;<br&gt;Also we realized that after we left we were never given our Dinner salads that was supposed to have come with our meals &amp;amp; no bread was brought to our table.<br&gt;<br&gt;Needless to say I won&amp;#39;t be going back to this place.", "rating": 1, "date": "12/4/2016"}, {"text": "Came here today for the very first time. The food was amazing. A little pricey, but otherwise delicious. Our waitress was Crystal and although she was attentive and  helpful, and not rude in any way. She could have been a little more friendly. She never smiled once, and didn&amp;#39;t seem happy with the 25% tip we gave her. <br&gt;But like I said she was good at her job and I wont complain about that. <br&gt;I would definitely go back", "rating": 4, "date": "10/4/2018"}, {"text": "This five star rating is for the newest addition to their cheesecake line up - the Lemon Meringue Cheesecake.<br&gt;<br&gt;For the longest time, to me, dessert at the Cheesecake Factory meant their luscious and light banana cream cheesecake.  But now, finally, there&amp;#39;s a serious contender for my precious tummy real estate and dessert calorie count - the smooth and sweet lemon meringue cheesecake... yum!<br&gt;<br&gt;There are worse things to be troubled with than which terrific slice of cheesecake to order!<br&gt;<br&gt;*** 10/2014 visit ***<br&gt;<br&gt;Come here for their terrific honey wheat bread, which is particularly good when served warm, and some delicious cheese cake.  If you need something else, consider the Hibachi Steak $19.95 ~ Certified Angus Hanger Steak with Shiitake Mushrooms, Onions, Bean Sprouts, Wasabi Mashed Potatoes and Tempura Asparagus.  Sure the meat portion was rather light on my plate, but what meat there was was cooked medium rare as requested, tender, and so tasty with the sweet marinade.<br&gt;<br&gt;The chicken was tender and tasty in the Chicken Madeira $17.95 ~ Our most popular chicken dish! Sautéed Chicken Breast Topped with Fresh Asparagus and Melted Mozzarella Cheese. Covered with Fresh Mushroom Madeira Sauce and Served with Mashed Potatoes.   Although it seemed the smallest plate at the table, which was also graced by the pretty layered Luau Salad ~ Grilled Chicken Breast Layered with Mixed Greens, Cucumbers, Green Onions, Red and Yellow Peppers, Green Beans, Carrots, Mango and Crisp Wontons with Macadamia Nuts and Sesame Seeds. Tossed in Our Vinaigrette. <br&gt;<br&gt;The Famous Factory Meatloaf, Served with Mashed Potatoes, Gravy, Grilled Onions and Corn Succotash was pretty good, though higher accolades went to the variation at Rox Cafe.<br&gt;<br&gt;Entrees rate a 4 here.<br&gt;<br&gt;Annoyingly, they don&amp;#39;t seat you till the whole party is there.<br&gt;<br&gt;*** 10/2015 ***<br&gt;<br&gt;The warm crab and artichoke dip app $11.95 was pretty good.  The eggplant parmesan rounds surprisingly arrived alternated with breaded and fried mushroom caps.  The Hibachi Steak $19.95 was still quite good and well worth ordering.<br&gt;<br&gt;For lunch a number of their menu items are available at a luncheon portion for a price that topped out at $14.50 for the salmon vs $18.95/$19.95 .  But consider your appetite.  The DC who ordered the dinner portion of the Luau Salad was the sole member of our party to finish their meal (not inclusive of the one who ordered the mac &amp;amp; cheese burger $13.50).<br&gt;<br&gt;For birthdays, if the birthday boy/girl selects a dessert, they&amp;#39;ll decorate the plate.  If no dessert is selected, they&amp;#39;ll bring out a scoop of ice cream with whipped cream and embarrass him/her with the staff singing a birthday song.<br&gt;<br&gt;*** 10/2016 ***<br&gt;<br&gt;HUGE Apple Crisp dessert!  Generous for 2.", "rating": 5, "date": "8/11/2014"}, {"text": "Got to try this Cheesecake Factory, which my wife likes. Our server Chrystal was terrific. Tried a turkey burger. This is the second best turkey burger that I&amp;#39;ve had. It was juicy. Most turkey burgers are dry. My wife had the miso salmon. I love miso since I&amp;#39;m Japanese and from Hawaii. Overall, it was a great experience dining there.", "rating": 4, "date": "4/15/2018"}, {"text": "The cleanliness....not the best. When the waitress, who was very nice the whole time, brought our drinks, the straws were sticky and could visually see dust on them. I drank my entire cup of water (via new straw) before I noticed I had lipstick marks on my cup. Waitress apologized. No explanation. Didn&amp;#39;t offer anything else. No manager came over to talk to my husband and I. Wasn&amp;#39;t very attentive nor empathetic in owning their errors. I won&amp;#39;t go into detail of the woman&amp;#39;s bathroom. We won&amp;#39;t be going back.", "rating": 2, "date": "1/28/2019"}, {"text": "I am a senior citizen who continues to work at Chestnut Hill Mall. I have worked at Bloomingdales and Brooks. I have been in every restaurant in Chestnut Hill and most of Newton. I have been insulted by the managers at Cheesecake at Chestnut Hill multiple times refusing to serve me a second glass of wine without any reason. This is done in front of my friends while I am eating meals. They are discriminatory towards seniors. I have lived in Newton for over 50 years. I have never been treated this way. I would never recommend this this restaurant for any", "rating": 1, "date": "1/14/2019"}, {"text": "I had a 5 star experience tonight. I ordered one of my new favorite dishes, the &amp;#34;Thai chicken with green curry&amp;#34; it has snow peas, shiitake mushrooms, cashews, toasted coconut, fresh mango, and onions with white rice (also available with brown rice). The service was attentive, the food was served at the perfect temperature, the presentation was appetizing and colorful! It simply could not have been more perfect. I love their sourdough Baguettes too!", "rating": 5, "date": "4/20/2018"}, {"text": "Here visiting the area, and sought out reliable TCF.<br&gt;<br&gt;Ordered a burger platter, Falafel Salad, and chicken tacos. All tasty.<br&gt;<br&gt;House gin martini was well-made.<br&gt;<br&gt;Attentive service too.<br&gt;<br&gt;Décor seemed unusually dark.<br&gt;<br&gt;One surprising no-no:  the bill had the usual three suggested tip amounts up to 20%...but the tip calculation was based on meal + taxes. Come on. Deliberate &amp;#34;mistake&amp;#34; or management is mathematically challenged?<br&gt;<br&gt;Either way, disappointed that The Cheesecake Factory management would allow this to happen.", "rating": 4, "date": "4/12/2016"}, {"text": "We had a great lunch! The superfood salad of almond crusted salmon on kale was fantastic!!!!! The toddler loved her pasta and hubs was very satisfied with the lettuce wraps and soup! Such a wonderful lunch for everyone and very great customer service!!!!! My favourite Cheesecake Factory around!", "rating": 5, "date": "11/19/2018"}, {"text": "It&amp;#39;s hard to complain when the ambience is nice the service is good the food is excellent and the prices are reasonable.<br&gt;<br&gt;Went for lunch, seems to be a bit less hectic then.<br&gt;<br&gt;I would love a few more healthy options, but it&amp;#39;s a cheesecake factory!<br&gt;<br&gt;I&amp;#39;m glad they are still in business, and I wish them well.", "rating": 4, "date": "1/28/2017"}, {"text": "Its the Cheesecake Factory.  Big menu. Big plates. Big drinks.  Big cheesecake.  Big everything.  Tons of food.  There&amp;#39;s quite literally something for everyone here.  Great for families.  Great for parties.  Awesome turkey club and mac&amp;amp;cheese balls are insane.", "rating": 4, "date": "10/14/2018"}, {"text": "Bf and I ate here last night... we started feeling nauseous in the middle of the night... Food Poisoning", "rating": 1, "date": "6/2/2019"}, {"text": "Sitting and eating as I write this. Waitress is not attentive. She did not even come once to check whether we wanted something. Food was OK but not as good as it usually is. The cheesecake was wonderful though! <br&gt;<br&gt;This used to be one of my favorite places to come to. Unfortunate. I will not return to this location. MaryAnni was our waitress i believe.", "rating": 2, "date": "3/13/2019"}, {"text": "Pretty good place and good is awesome. It&amp;#39;s inside the Chestnut Hill Mall next to Bloomingdales.", "rating": 4, "date": "12/9/2017"}, {"text": "Ordered take out twice. The first time they forgot our desserts. We placed a second order just to get the desserts (one cheesecake and one apple crisp with ice cream). What we got instead was a gross pile of soggy apples with no ice cream (see picture). When we called to complain, the manager told us it was the delivery drivers fault for not knowing that there were different pick up areas for different food items in the restaurant. Even if it was the delivery driver&amp;#39;s fault (which it wasn&amp;#39;t), I have seen dog vomit that is more appetizing than that apple crisp. 0/10 stars", "rating": 1, "date": "9/15/2018"}, {"text": "The food is phenomenal, and of course the red velvet cheesecake is out of this world. But John, our waiter, absolutely made our experience better. He was so friendly and nice and my friends and I loved him.", "rating": 5, "date": "8/26/2019"}, {"text": "We were hoping to celebrate an occasion, by having dinner for two families on a Saturday night. I called on Friday but was told they don&amp;#39;t take reservations for after 5pm. They said we can just walk in, and the wait time would be 15-20 minutes. So we made plans, everyone dressed up and I went there a little earlier to make sure we get a table. Much to my dismay, they said the wait time would be around 2 hours... <br&gt;<br&gt;We decided to move on to another place, which is not easy on a Saturday evening with no reservations. We ended up going all the way to Coolidge Corner. Hassle and disappointment, running around with hungry kids, because the CCF does not take evening reservations, and does not communicate accurately to set realistic expectations. <br&gt;<br&gt;What I did see in the minute we were there, is that it was crowded and loud, so I&amp;#39;m not sure we would have enjoyed it anyway. <br&gt;Given the high prices and our disappointing experience, I don&amp;#39;t think we&amp;#39;ll go there any time soon.", "rating": 2, "date": "1/20/2018"}, {"text": "I ordered take out today and got the orange chicken. Took the first bite and found a bone in the chicken. I called to let the manager know and she is refunding me for the orange chicken but nothing else that I purchased. I&amp;#39;m not really satisfied with this and feel like something else should be done since I found a bone in my food, so gross! Will not be coming back and would never recommend the Cheesecake Factory to anyone else.", "rating": 1, "date": "9/16/2018"}, {"text": "The service here is friendlier than any Cheesecake Factory location that I&amp;#39;ve ever been to. There was absolutely no wait to be seated unlike the Braintree location which is in a bigger and busier mall and there is usually at least a short wait there. I wasn&amp;#39;t in the mood for much so I ordered the nachos. They came out perfect and I really enjoyed them. My server brought out a bread basket for me to munch on while I waited for my food to come out and the bread was very delicious and freshly baked. I&amp;#39;ll definitely hit this place up again on my future trips to the shops at Chestnut Hill.", "rating": 5, "date": "3/27/2017"}, {"text": "Cheesecake Factory is always one of my favorite spots to go because their menu is endless and their food is pretty consistent, however my experience this time wasn&amp;#39;t as great. <br&gt;<br&gt;Came here on a Sunday night with a group of 7 people. The hostess said there will be a 45 minute wait, but we only waited for 15-20 minutes (so that was a plus)! We got seated in a booth, couldn&amp;#39;t fit 7 people so the hostess had to put an additional chair in the middle. <br&gt;<br&gt;The reason I gave three stars is because I felt really rushed. Once the food came, I think halfway, she already offered us boxes. I can&amp;#39;t even remember if she ever offered us to see the desert menu. I thought that was unprofessional and rude! I can&amp;#39;t even enjoy a night out without being rushed! Shame! <br&gt;<br&gt;The food here is good, like I said, pretty consistent. Some of my faves that I think are worth trying are: <br&gt;<br&gt;Shrimp scampi <br&gt;Louisiana chicken pasta <br&gt;Cobb salad <br&gt;Renee&amp;#39;s special <br&gt;Burger", "rating": 3, "date": "11/5/2015"}, {"text": "Disappointing experience to say the least. I love CF and have frequented this location many times, but this most recent experience on 8/22 was the worst. <br&gt;<br&gt;We arrived at 6pm to what seems like a bustling and crowded restaurant. This is to be expected as its in a mall and a favorite for everyone. The person at the front told us ten minutes max for a table for two. Thats totally reasonable! I get a buzzer and go sit down with my friend. 20 minutes later, nothing. Multiple families who came in after us are being sat before us with parties far greater than 2. Finally the buzzer lights up and we are sat. But to my confusion, I notice that the area in which we are sat, there are no joke 8-10 open tables. I understand you don&amp;#39;t seat a section all at once, but why were we waiting 20+ minutes when there are tons of tables open? Rude. <br&gt;<br&gt;After an additional 15 minutes of waiting for our waiter to show up. We finally are able to place a food order. We chose the nashville hot nuggets and two pasta dishes. Pretty simple, pretty quick right? My friend and I get to talking and enjoying the evening and finally realize, its almost 7:15 and we haven&amp;#39;t gotten food yet. Where are those damn nugs? Our waiter has also disappeared and appears to only be focusing on two other tables not near us. Coooool. Someone else finally brings our nuggets out and then of course our pasta comes immediately after. Whats the point of an appetizer if we get it when our food comes? Not great timing and no apology offered by the waiter. The nuggets were cold, so thats not so great, but tasted fine. The pasta was excellent per usual, but no Parmesan was ever offered as it usually is.  Wah. We finally get the bill and leave the place at almost 8:30. I love the Cheesecake Factory, but I never intend to spend 2+ hours in a place when our original wait time was suppose to only be 20 minutes. <br&gt;<br&gt;No bueno, next please.", "rating": 2, "date": "8/23/2018"}, {"text": "I wish I could give more stars but I can not and I&amp;#39;m sorry because Brianna was wonderful.  I was having a snack at the bar before a long drive home to NJ and a woman decides to sit next to me at the bar.  I notice she has a midsize dog with her.  I immediately got up and asked for my food to be wrapped.  The woman 2 seats away that I was chatting with motioned what&amp;#39;s wrong?  I said I can&amp;#39;t with the dog!  Well the women with the dog turns and said that she has rights, it&amp;#39;s a service dog.  I said I have rights too that&amp;#39;s why I&amp;#39;m leaving.  I spoke politely to the manager and he said there was nothing he could do.  Oh yes there is...ask the customer already seated if it&amp;#39;s ok to sit next to a pet.", "rating": 2, "date": "5/29/2019"}, {"text": "My Mom picked up a mango cheesecake for my niece&amp;#39;s birthday. It was the best cheesecake I&amp;#39;ve ever tried. Shout-out to the wizard who made it - Cheers !!!!", "rating": 4, "date": "1/14/2019"}, {"text": "The drinks were good! We had passion fruit mojito and lemon drop. They were both on a sweet side. Avocado eggroll was okay. Oh and we didn&amp;#39;t get bread so we were little disappointed. Entree were amazing though! We had Steak Diane and Chicken Madeira. Chicken was well prepared and for steak diane, some parts were over cooked but over all it was delicious. The server was attentive but I felt like he was rushing us to finish.", "rating": 4, "date": "3/25/2017"}, {"text": "Group of 6 and we couldn&amp;#39;t sit together in one table . big open area with plenty of tables open, but because we are not white. Since when does it matter you can sit at the table next to you that can accommodate all of us?  . So racist .... whatever ! We hungry and we just wanna eat and leave. P.S. there was 10-15 tables open but it wasn&amp;#39;t part of a section our server worked. Literally an invisible line to step across.", "rating": 1, "date": "4/1/2018"}, {"text": "I&amp;#39;ve been going here a lot, for years. It&amp;#39;s ok. The food is very heavy and at times hard to digest and tolerate. The portions are big and filling. Today we had guests over and decided to order in (take out). So we ordered a Cesar Salad to start and each person got their own dish. For the main courses we ordered; Quesadilla (with Guac, Salsa and Sour Cream), Americana Burger cooked well done without the potato crisps (with fries), Shepards pie, shrimp scampi and miso salmon. We went to pick up the food at the time that we were told it was going to be ready at the front (3:07PM). We arrived and it wasn&amp;#39;t ready yet, but it was expected because we it was Saturday afternoon and this place is always crazy packed on weekends. No worries. <br&gt;We got the food but it ended up being cold. The salad was ok, but something about it was a bit powdery and just a tad spicy, we reckon it was the dressing. The burger was ok, cooked well done as I asked but the sauce was overpowering and took away the flavor from anything else. The Shepard&amp;#39;s pie was decent, but was unexpected looking in terms of appearance. The shrimp scampi was good with jumbo shrimp and flavor. The quesadillas were delicious and cheesy. The fish wasn&amp;#39;t that appealing and had an interesting smell. It&amp;#39;s ok", "rating": 3, "date": "8/12/2018"}, {"text": "Had reservation. Arrived on time. Still took 20 minutes to be seated. Drink order taken promptly but took another 20 minutes to receive the beer and an ice tea. Kitchen unable to do any variation off menu (may I have a side of mixed veggies - nope). Food served lukewarm. Wasn&amp;#39;t a good experience.", "rating": 2, "date": "8/8/2018"}, {"text": "I just want to give a huge shout out to max for his amazing customer service. Max was extremely helpful and compassionate, when we called about a food allergy. He made sure that our food was labeled and delicious.THANK YOU SO MUCH MAX!", "rating": 5, "date": "5/27/2019"}, {"text": "Ok let me start off by saying, I am not the one who had the glass in the food it was my sister. I am writing this on her behalf because I&amp;#39;m appalled about the fact that they didn&amp;#39;t even offer to comp us for anything considering my sister had to spit glass out of her month thinking it was an onion in her salsa mix of her tex mex egg rolls. They were very nice about the whole situation but did nothing at all to help out the situation except apologize. Maybe just offer a new appetizer of the one we found the glass in.... thoughts???", "rating": 2, "date": "2/26/2018"}, {"text": "Every time I have visited this restaurant, summer and most recently February, there are fruit flies that land on the food. I have brought this to the attention of the wait staff and mangers but they the managers just disregard. Disgusting! The wait staff is good, the food mediocre. Don&amp;#39;t waste your money.", "rating": 1, "date": "2/7/2019"}, {"text": "Had dinner at the Cheesecake Factory with my family last night. I was really disappointed. I&amp;#39;ve eaten in other Cheesecake Factory restaurants many times before and not been disappointed like this.<br&gt;<br&gt;Service <br&gt;Service was slow and inattentive. Our food took a long time to come out and once it came out we did not see our server again till 25 minutes after we had finished eating. This was early Monday evening, the restaurant was not busy. No check on how things were going or if we needed anything. We skipped desert and bought Cheesecake at the counter to go because we got  tired of waiting. It took a long time for our meals to come out. I don&amp;#39;t mind long wait times, its good for conversations etc but this was too long and then the food came out only lukewarm. The server omitted 1 side dish.<br&gt;<br&gt;I ordered the pasta Jambalaya. The linguine was spongy and a mix of spinach linguine and regular which was not how it was described on the menu. The sauce was neither spicy nor cajun and the dish overall was cold. Perhaps a result of the long wait time described above.<br&gt;<br&gt;My wife&amp;#39;s Carne Asada was ok. You can&amp;#39;t mess up Meatball and pasta or Chicken strips and fries.<br&gt;<br&gt;Overall, a disappointing experience at the Cheesecake factory", "rating": 2, "date": "6/26/2018"}, {"text": "Sure, it&amp;#39;s a chain restaurant, but it&amp;#39;s still really good. They have a million things on their menu so it&amp;#39;s easy to accommodate everyone. Food is good and portions are huge. We got the spinach artichoke dip and it was incredible. Prices are really reasonable and the decor is nice. <br&gt;<br&gt;The only thing that was lacking was the service. Although our waiter was super nice, he seemed to skip all the details. He brought us our drinks without straws, and he forgot the cream and sugar for my coffee. He also took a very long time to come around to acknowledge us. I don&amp;#39;t mean to sound petty, but these are little things that we shouldn&amp;#39;t have to ask for.", "rating": 4, "date": "6/28/2014"}, {"text": "The food is great but this place is always packed with many people. The wait time to get a table on saturday dinners can be up to an hour. Since there are so many tables the waiters are not watchful and take a while to deliver your food. To get water or bread refilled you usually have to call them over. Other than the service Cheesecake Factory never disappoints. The bang bang chicken and shrimp is great and so are the pasta dishes. The lemon raspberry cheesecake is also one of my favorites.", "rating": 3, "date": "7/11/2018"}, {"text": "Out of the other locations in Mass. that I&amp;#39;ve been to, it is better service and semi-less wait time.  <br&gt;<br&gt;Unfortunately, they do not do reservations or call ahead seating.  So when you walk in there with a party of 6 or more, expect an eye roll and sass from the people at the host stand", "rating": 3, "date": "6/6/2016"}, {"text": "The food  is good and standard CF style but the service was terrible. It was my birthday  and although it was a busy night, Ive had better experiences in other CF. My carrot cake was dry and our server said she was too busy to take our photo she was running around like a mad person. She didn&amp;#39;t  have anyone try to help and follow  up with us...pathetic. I&amp;#39;m  a 25 to 30 percent  tipper for good service especially on my  birthday ...oh well.....", "rating": 2, "date": "3/23/2016"}, {"text": "Stopped by at this cheesecake on the spur kind of moment - plenty of parking outside the mall so always convenient. We didn&amp;#39;t have a wait and service was also pretty quick. We ordered 3 apps for two of us - spinach and cheese dip, chicken pot stickers and Tex Mex Egg rolls. As always HUGE portions so we couldn&amp;#39;t finish everyone. The chicken pot stickers were wonderful - nice tangy taste to them. The other two apps were ok - nothing to write home about - we were in and out within 30-45 minutes. Definitely one of my better cheese cake experiences!", "rating": 4, "date": "8/30/2016"}, {"text": "Oh. My. Gawd. Amazing place. The ambience is modern. Our server Gabe was outstanding... almost sweeter than the cheese cake lol. So many amazing modern twists so hard to choose. I&amp;#39;ll be back for lunch some time, their food looks like the best in town.", "rating": 5, "date": "3/14/2019"}, {"text": "The appetizers are the best of any chain restaurant. Perfect meals for the desserts that come after. I will order the chicken pot stickers or fried calamari 10 times. Don&amp;#39;t skip trying anything here because you think other restaurants serve the same. Every chicken dish egg rolls Mexican style dishes.<br&gt;If you want 5 star wait staff and bartenders you&amp;#39;ll get it here with great food<br&gt;Great locations are Chestnut Hill Back Bay Burlington Providence<br&gt;Awesome", "rating": 5, "date": "12/7/2015"}, {"text": "Out of all the Cheesecake Factory locations I&amp;#39;ve been to in Massachusetts and California, the best service came from Donna G at this location. Best dining experience! She was so attentive and nice. She even gave us strawberry lemonade refills to go, had no idea this was an option. <br&gt;<br&gt;The food was delicious as always. The California chicken club sandwich and Louisiana chicken pasta are always great options. Personally, I don&amp;#39;t like cheesecake so if you like cake, Linda&amp;#39;s Chocolate Fudge cake is a must, it&amp;#39;s perfectly  moist. <br&gt;<br&gt;If you ever come across Donna G as your waitress, you&amp;#39;re in good hands!", "rating": 5, "date": "6/2/2016"}, {"text": "I should have known something was wrong when the restaurant was nearly empty.  I have NEVER gone to a Cheesecake Factory and not had at least a 10 minute wait for dinner.  <br&gt;<br&gt;Our initial server was okay.....in the beginning. He did not write down any of our orders (there were 3), so he came back a minute later and confirmed everything.  He brought us our drinks, water, bread, and was never heard from again. Other waiters brought us more water, more bread, our food, and a manager after we requested to speak with one.  All these waiters would not have been a problem if we hadn&amp;#39;t had to ask for all these things.  Water is a basic.  And the restaurant was empty; he only had three tables. What gives? This is the first time I&amp;#39;ve had a negative service experience at a Cheesecake Factory.  That&amp;#39;s always been one of their things; great service to the point of being corny and annoying.  Our server was replaced with another one who was just as bad and acted like we were going to stone him.  <br&gt;<br&gt;The food was fine and came out as ordered and it was a ton as usual per Cheesecake standards.  One of my coworkers ordered the chocolate cake, which I LOVED, and I had a bite and it&amp;#39;s still delicious.  For this, CF gets two stars instead of one, but I wouldn&amp;#39;t visit this restaurant again.", "rating": 2, "date": "7/17/2013"}, {"text": "They let children sit at their bar.  Just FYI.  I don&amp;#39;t agree since children don&amp;#39;t order alcohol.", "rating": 4, "date": "10/6/2018"}, {"text": "Crazy yummy food for everyone. Personal favorites: avocado egg rolls for an appetizer and pasta carbonara.  *drool*", "rating": 5, "date": "2/3/2016"}, {"text": "I&amp;#39;m happy to report that the wait wasn&amp;#39;t long at all and the food and service were both as great as I&amp;#39;ve come to expect from the CCF. The waiter was cheerful and very accommodating and the layout was perfect to maximize table space but still let you have a private convo with your dinner guest. It was a little weird to be in the MALL during a dinner out, especially when Uniqlo&amp;#39;s giant display TVs are still showing wonkus visuals the whole time you&amp;#39;re eating. I suspect this is only an issue at certain tables. I have no idea why, but I&amp;#39;ve encountered some seriously disgusting stuff in CCF bathrooms. This place lost one star because when I reported the grossness in the bathroom to the hostess she said &amp;#34;oh, you mean that thing in the handicap bathroom? We&amp;#39;re working on it&amp;#34; and DUDE, you should&amp;#39;ve gotten that taken care of ASAP. Blech.", "rating": 4, "date": "9/9/2015"}, {"text": "Food was as expected. It tasted, you know, pretty good. Flavors were definitely there.<br&gt;Portion sizes were shockingly large. For example, my mother got a main dish that she shared with three other people at the table. We then brought it home and had a dinner for two the following night.<br&gt;<br&gt;That means two things. <br&gt;1) what quality meat are they using if the can afford to make close to 6 portions out of one $13 dish?<br&gt;2) cheesecake factory is unhealthy<br&gt;<br&gt;Cheesecake slices range from ~1000-1600 calories per slice. That is also unhealthy.<br&gt;<br&gt;Now, if you add an appetizer and a drink to your meal.. forget super size me.. you wouldn&amp;#39;t last a whole month.<br&gt;<br&gt;Cheesecake factory. Get your act together. Make your portions healthier (smaller). The skinny menu is a good start but your core menu has to be healthier.", "rating": 2, "date": "5/2/2017"}, {"text": "Great place to grab lunch or dinner after shopping. Many options, plenty if tables, rarely a long wait. Love the skinny menu options.  Plenty of options for kids. They also have outdoor sitting which is nice in warmer weather. The only complain about todays lunch - don&amp;#39;t bring kids meals while they are extremely hot. Its very difficult for a parent to try to make a small child wait while the plate is right in front of them.. its unpleasant experience for a child.. keep it on the kitchen for 5-10 min if kids plate is untouchable with bare hands.", "rating": 5, "date": "11/14/2017"}, {"text": "Nothing wrong with CCF if you go during the week or any other off-peak dining times.. Nothing worth waiting any real length of time for. Consistent, way too big portions.. but if you can sneak in before dinner time you can get a lunch sized portion of most of their more popular dishes. The spicy chicken chipotle pasta I had today at $12.95 is a good deal. I still had half of it to take home. At $17.95 for the dinner size it&amp;#39;s a rip off. You&amp;#39;ll get a pound of penne vs the 1/2 pound you get before 5PM. And it will need salt regardless of the time you have it.<br&gt;<br&gt;Service is always decent, moody hosts and servers here &amp;amp; there but that happens everywhere. The clientele in this particular location can be a bit ridiculous so I do consider that... <br&gt;<br&gt;Get your cheesecake to go or else you&amp;#39;ll end up in a food coma.", "rating": 4, "date": "3/31/2015"}, {"text": "As i have written before, i am not a chain person... and I am sick of concierge at various hotels recommending the damn cheesecake factory in places we travel to, but my mother in law loves it so it is always easy to take her here when we are at malls, etc.  <br&gt;<br&gt;This is a nice enough cheesecake factory, like all the rest, but i did love the outside (in the mall, not actually outside) seating area.  Also, we have a server named Donna who was literally the nicest person i have ever met and she was so pleasant and knowledgeable and attentive that it made our lunch very nice.<br&gt;<br&gt;We would go back if at this mall and needed a bite.  THe food is always the same, lots of choices, freshly made, and huge portions... not something i seek out, but a good choice, especially at this mall.", "rating": 3, "date": "1/2/2015"}, {"text": "Overpriced food of really bad quality. Dishes named &amp;#34;skinny luscious&amp;#34; are fried and served with mayo! Lol You have to wait to get a table and then wait for not very tasty food. Not worth it. I tried salmon spinach rolls - they were old and over cooked. Salmon tasted like canned. Bad experience.", "rating": 2, "date": "6/10/2017"}, {"text": "Disgusting ... We asked for the tables in the terrace , the one open in the mall courtyard and noticed immediately the floor under our table was very dirty , we changed table and the floor was dirty as well and there was a little mouse trap. Maybe if you clean the floor mice are less likely to come.", "rating": 1, "date": "8/30/2016"}, {"text": "A piece of glass find in my meatball pasta! How could a piece of glass mixed in pasta? Of Course  it cut my mouth a little. It&amp;#39;s my first bite and I didn&amp;#39;t pay that pasta but I still paid the rest of my bill. They gave me a piece of cheese cake as compensation. Actually, I didn&amp;#39;t want any compensation and a slice of cake worth nothing. I just very upset how could a piece of glass mixed in my food? What if I swallowed it. My throat? Stomach? Couldn&amp;#39;t imagine.", "rating": 1, "date": "5/13/2016"}, {"text": "I honestly don&amp;#39;t understand why so many people like this place.  This is my second time here, and it&amp;#39;s still the same.  The food is salty, looks old, and is usually overcooked (they keep the lights dim for a reason!). My &amp;#34;sauce&amp;#34; had a layer of film over it, so you know it&amp;#39;s been left out somewhere.  The only thing that made this experience half decent was my waiter.  I believe his name was Alex (?), but he was extremely caring and attentive, and seemed to actually be concerned about us getting decent food.  I&amp;#39;m not coming back here, ever, but at least my waiter was decent this time around.  First time it seemed like the girl could care less.", "rating": 2, "date": "8/15/2016"}, {"text": "My daughter and I love going to the Cheesecake Factory.  The service is typically great along with the food.  Unfortunately, my view changed slightly subsequent to my last visit.  My daughter had to go to the airport, therefore we asked for the food to go rather than eat at the restaurant.  When I returned home and warmed up the items, I noticed a rather long black piece of hair imbedded in my food.  That quickly put a damper on the meal and I threw it away.  An unfortunate experience.", "rating": 2, "date": "6/4/2018"}, {"text": "THIS IS JUST REALLY HARD FOR ME TO EVEN SOMETIMES PUT INTO WORDS HOW MUCH I LOVE THIS PLACE! The staff are extremely friendly and it&amp;#39;s definitely worth checking out sometime especially if you live within walking distance of this place in one of the Chestnut Hill Apartment Complexes! So I&amp;#39;m not a cheesecake person myself but the Linda&amp;#39;s Fudge Cake MY WORD IS SO DELICIOUS! You have to try this whether or not it&amp;#39;s the first time you&amp;#39;ve been to this place! Honestly at least the times that I&amp;#39;ve been here it&amp;#39;s never been too crowded!", "rating": 5, "date": "9/2/2017"}, {"text": "What a disappointment!  Seems like the service at this location is getting worse every month....   it was one of our favorite restaurants,  love the food, nice patio to enjoy the dinner.  Unfortunately, last Saturday was the worst dining experience. We came around 8pm, noticed that there were 3-4 tables available outside and asked to be seated on the patio. Had to wait 25 min, even though tables were available and later we were seated at one of those tables. The waitress came, took an order for drinks and an appetizer, told us she will bring water and bread in a minute. 10 min later, she brought bread, no water. 5 min later we got an appetizer, still, no drinks.  Finally, drinks arrived, the waitress took the rest of the order and it was the last time we&amp;#39;ve seen her.  We wanted to order the second round of drinks, dessert and coffee - there was no one to talk to..... she never came back!  We had to ask another waitress to either find our waitress or talk to a manager.  Well, neither Manager or our waitress  showed up.  The girl brought us the bill, apologized (even though it was not her table to take care of).   <br&gt;The last month dining experience was not that great either. The waiter looked like he does not want be there,  took an order, brought drinks and the next time we&amp;#39;ve seen him - when he brought the bill.  We had to tell him that it&amp;#39;s too early for the bill, we would like a dessert menu and coffee.  He looked surprised....<br&gt;We&amp;#39;ve been coming to Chestnut Hill location when it was still at the Atrium Mall   We love the food at the restaurant and I hope that there will be some  improvements in customer service", "rating": 2, "date": "7/19/2018"}, {"text": "Food ok, service lousy both recent trips first time server sneezed into her hand and kept working bothered time took too long to get service!", "rating": 1, "date": "7/17/2018"}, {"text": "What can I say. This is a chain people. It varies location by location. Since we are in this area a lot I can say with certainty that though this new place is better than that old place at the chestnut hill atrium mall, the SERVICE IS AMONG THE WORST, for the area. <br&gt;<br&gt;Consistently we go in here and we leave disappointed! Now with other options in the area we will reconsider this location.", "rating": 1, "date": "9/13/2014"}, {"text": "Ordered sliders...the buns were greasy and seems to have been microwaved!!!  Upset my stomach.  Spinach dip is good (even though microwaved too!) but the tortilla chips were kinda stale???  Not going back.", "rating": 1, "date": "5/25/2017"}, {"text": "Had the worst experience with a hosts ever. They were the most incompetent group. I have no idea what was going on but they kept telling us we were next to be seat and then proceed to seat 3 other group. They even to our pager, we had no idea where we were on the list. The female seemed  to have no idea what she was doing. She was completely useless...I can&amp;#39;t stress this enough! One of the so called hostess was so arrogant and rude. While giving my husband and snarky remark about our wait the female hostess chuckled. I would like to know who gave these people there job! Last time we go there.", "rating": 1, "date": "9/19/2015"}, {"text": "This was my first time here. Our company was treating us so my co-worker and I decided to splurge and get steaks. I had steak Diane and she had hibachi steak, $19.99 each, both came with mashed potatoes. For dessert we ordered cheesecake, I had the chocolate tuxedo cream cheese cake and she had the chocolate chip cookie dough cream cheese cake. Our waitress was friendly and gave us complimentary bread and butter to start with.", "rating": 3, "date": "1/3/2016"}, {"text": "Absolutely loved the food. Although the menu is so big and the restaurant really crowded, the food tasted fresh and was quickly served. We shared the avocado eggrolls, really good! Then I had the Chicken Madeira, which was also great. Think I order the same next time. My boyfriend enjoyed his turkey burger. As dessert we ofcourse ordered some cheesecake (cookie dough and 30th anniversary) and took it with us.<br&gt;Min: we had to wait for our turn and the waitress didn&amp;#39;t ask us if we wanted another drink or some water. I also like if  they clean the table after the main course when it&amp;#39;s dirty. I also don&amp;#39;t like the interior, it&amp;#39;s really dark in there and all the different elements make it messy", "rating": 4, "date": "7/22/2015"}, {"text": "Nothing is worse than sitting in a restaurant and seeing multiple mice racing across the floor. Actually, what might be worse is the restaurant manager we spoke to telling us she knows about the mouse problem and they &amp;#34;are working with the mall to find a solution to it.&amp;#34; Seriously? The manager, who was very apologetic and friendly, said that the mice were coming in through a mall door but assured us that the kitchen was mouse-free and and extremely clean. Even one of the waiters told us he wouldn&amp;#39;t eat in the area where we were sitting at because of the mouse problem. The restaurant should be closed down until you fix this problem. Disgusting.", "rating": 1, "date": "11/20/2015"}, {"text": "I&amp;#39;m usually here a couple times a month. The menu is endless and you can pretty much try something different each time you come - that goes for appetizers, entrees, and cheesecake. They have other desserts too, but I don&amp;#39;t see why you would come to the cheesecake factory for something other than cheesecake.<br&gt;<br&gt;The only major problem is their waiters need some extra training. They can be a little slower than expected sometimes, but I experienced one of the bigger mistakes last night - he forgot my onion rings that were part of my entree and when I asked about it, he didnt even apologize. That&amp;#39;s probably the only thing that me from all the times I&amp;#39;ve been. Otherwise, its a comfortable and delicious meal for the most part.", "rating": 3, "date": "9/29/2014"}, {"text": "Amazing restaurant, amazing menu, amazing food, amazing service!<br&gt;One of the best services I have ever experienced. Credit goes to Jordan, our server. He made the whole experience memorable. Will definitely be back.<br&gt;Long waiting time. But then it was a Friday evening, so expected.", "rating": 4, "date": "12/7/2013"}, {"text": "I usually go to the cheesecake location in Braintree but we came to the chestnut hill location tonight. I came here with my boyfriend on a Friday night. We only had a 15 minute wait for the 2 of us. We were seated promptly and brought drinks and bread. The food was amazing, we ordered the fettuccini alfredo with chicken and the mac n cheese burger. For dessert we ordered the chocolate chip cookie dough cheesecake which was fabulous. Our waiter, John was incredibly friendly and gave us great service. Excellent food, excellent services, and reasonable price. We will definitely be returning!!", "rating": 5, "date": "3/31/2017"}, {"text": "Had a wonderful meal.  Everything delicious.  Chicken Madeira is off the hook.  Chicken potstickers also very tasty, delicious sauce.  Friends Herb Crusted Salmon fillet aromatic and perfectly cooked.  Cosmos did the job nicely and everyone&amp;#39;s cheesecakes were delicious.  Service good, kitchen a little slow, but waiter warned us.", "rating": 4, "date": "3/3/2018"}, {"text": "Nothing spectacular. Reasonable prices (except beer) and large selection. Had fish and chips and it was good. Made out of cod. Don&amp;#39;t like chain restaurants as a rule but was outvoted by rest of my party.", "rating": 3, "date": "9/24/2016"}, {"text": "Overall the service was good but the food was mediocre at best.   The Spicy chicken cashew was overcooked, the coffee tasted like it was a week old and the whipped cream clearly had something in it to make it look better, but NOT taste better...", "rating": 2, "date": "12/1/2015"}, {"text": "Original cheese cake is unbelievable. Mac and Cheese balls are super good and filling:)", "rating": 5, "date": "3/16/2017"}, {"text": "I&amp;#39;ve never been a huge fan of the Cheesecake Factory, but I have to say for the amount of volume that they need to process during a busy weekend lunch hour they do an excellent job. I had the so-called Louisiana Chicken Pasta, which was moderately creamy, not swimming in butter, some breaded chicken (a bit too thin on the actual meat for my taste) and a bit of tomato, or pepper. Definitely a very large portion (we ordered dinner portions during lunch hour). A taste of buddy&amp;#39;s Jamaican chicken revealed it to be a bit too sweet, but otherwise a solid, fair, decent meal. Can skip dinner afterwards!", "rating": 4, "date": "2/15/2014"}, {"text": "Ordered a medium burger. Had to send it back twice for being over- and then under-cooked. CF is a great franchise for casual dining, but people at this restaurant need cooking classes.", "rating": 1, "date": "8/19/2017"}, {"text": "First time at the Chestnut Hill location. Haven&amp;#39;t been in years as the wait for a table is usually somewhere close to an hour at the Burlington location. <br&gt;The wait here was 10 minutes and service was excellent. No mix ups. And the food was great!<br&gt;The Hazelnut cheesecake was &amp;#34;to die for&amp;#34;!!<br&gt;Highly recommend this location!!", "rating": 4, "date": "12/18/2016"}, {"text": "Horrible service, manager Alex was even ruder than waiter. The waiter (old women ) spilled water on the child, and the manager Alex was very arrogant and rude even offered nothing", "rating": 1, "date": "7/22/2015"}, {"text": "Called not once, not twice but three times to place an order for pickup. I was supposedly transferred to the cashier each time but each time after waiting for 5 minutes there was no response. I don&amp;#39;t mind waiting and it wouldn&amp;#39;t have been a big deal if they&amp;#39;d at least acknowledged that I was waiting. Needless to say we ordered from another restaurant. Not sure if we will be ordering from here again.", "rating": 1, "date": "9/22/2017"}, {"text": "The wait was long but expected . The service was week at best Z she was over her head from the start . The real killer was my sons food came after everyone else was served and stated getting food . The manger came to the table and offer a free slice of cheesecake ? Will never return to this outlet .", "rating": 3, "date": "5/7/2016"}, {"text": "Went in here on a Sunday last weekend.  The restuarant was very busy.  There was a 15 minute way for two.  It was a very quick wait for a table.<br&gt;<br&gt;It&amp;#39;s amazing how fast this place is.  they DO NOT fool around.  We were seated in within 5 minutes had drinks!  <br&gt;<br&gt;We had mushroom and buffalo chicken eggroll appetizers that were piping hot and delicious.  I was pleasantly surprised.  Also, it literally came out in less than 10 minutes!  I have no idea who fast they can whip this out to the table!<br&gt;<br&gt;We ordered our entree&amp;#39;s and they, too, were at our table within 10 minutes!  I had Chicken littles and they were delicious.  I would have given this a definite 5 star rating but the chicken batter on my chicken littles really needed some spices it was very bland..but, still very delicious!  I just added some salt and pepper...and it did the trick.  <br&gt;<br&gt;I have to hand it to the Cheesecake Factory...they were amazing and handled the crowd unbelievable!  Our waitress was also quick, efficient and very sweet!  <br&gt;<br&gt;I also heard the manager in the kitchen yell: &amp;#34;Let&amp;#39;s move the pace!&amp;#34; to the cooks... HA HA!  So they are not fooling around here..", "rating": 4, "date": "1/26/2011"}, {"text": "We loved eating. The chicken dim sums were so awesome. Also loved the strawberry cheesecake", "rating": 5, "date": "2/13/2016"}, {"text": "This review is not about the quality of the food, but the service. This location is highly disorganized. When you order takeout, which I do frequently, they ALWAYS omit something from your order: napkins, silverware, bread, sauces that go with your order, tomatoes, the list is endless, It is so difficult to have to open and check EVERY order. My last visit there was vital missing food items in every order! Frustrating since we always tip on takeout. This happens at the bar as well.", "rating": 2, "date": "11/19/2015"}, {"text": "never been a hardcore cheesecake factory fan, not for dining in anyways. I usually opt for the cheesecake take-out. <br&gt;<br&gt;I&amp;#39;ve never had a problem with the food or the service, it&amp;#39;s just not my go to place. Salads are usually shared with someone and then we also split an entree. Portions are big, so save room for dessert. <br&gt;<br&gt;My latest venture here, left me unimpressed. Our waitress wasnt that great. She couldnt describe the soup of the day off the top of her head and had to go into the kitchen to take a look at it...not usually a good sign. <br&gt;<br&gt;I think this place is a love it or hate it kinda place. Also, this location, the whole mall is now vacant, leaving just Cheesecake factory...it&amp;#39;s so lonely inside this mall.", "rating": 2, "date": "3/18/2013"}, {"text": "So disappointed at the service at Cheesecake Factory. They gave away my dad&amp;#39;s meal and then offered more bread or salad while we had to wait another 10 minutes for his meal. All the mean while, our meals were sitting under the heat lamp. Even though it&amp;#39;s been sitting under the heat lamp, my meal had congealed over!! So pissed off with them right now!!!", "rating": 1, "date": "12/3/2016"}, {"text": "Okay, from the start I felt uncomfortable. I use a wheelchair now and then. And the host looked at me oddly. I thought maybe it was me so I let it go. Then the waiter came and asked if we wanted bread. We said yes, normally they bring the 3 peices of bread. Maybe this place was different then she brought 2 pieces of bread for 2 people so I was like oh I guess they give the amount of bread to match how many people. But then they sat a guy with kids on the opposite side and didn&amp;#39;t ask if they wanted bread just placed it and brought 3 peices of bread. I felt so uncomfortable. The only reason that I gave them 2 stars was because the feruchini Alfredo with chicken was good but wouldn&amp;#39;t come here again. Maybe they don&amp;#39;t see many Hispanic people. Not okay.", "rating": 2, "date": "7/11/2015"}, {"text": "When I&amp;#39;m not waiting 45 minutes to sit here, I&amp;#39;m waiting just as long to be served mediocre frozen food. I don&amp;#39;t know if it&amp;#39;s the over priced entrees, the terrible service or the snooty attitude of the managers but CCF just doesn&amp;#39;t do it for me. <br&gt;<br&gt;The last time I was there I ordered a scotch and I had to send it back three times because either the cup was dirty or there were flies in it. Flies, in my scotch. I don&amp;#39;t know, I can understand once but three? c&amp;#39;mon CCF<br&gt;<br&gt;I do like their Cheesecake so I suppose that&amp;#39;s a win on their part but other than that, nothing really redeems it. Sorry guys.", "rating": 2, "date": "2/5/2010"}, {"text": "Filthy table, indifferent service, and average food. Coupled with a pretty steep price tag, one can do better elsewhere.", "rating": 2, "date": "7/13/2017"}, {"text": "OK, so I&amp;#39;m in Boston with a group.  They start trying to decide on dinner, and various chains are being thrown about.  Finally, I step in.  &amp;#34;Guys&amp;#34;, I say, &amp;#34;shouldn&amp;#39;t we at least try to sample some local flavor?&amp;#34;  Go me, right!  All agree, and we start eyeballing the famous and ancient Union Oyster House on our smart phones.  Hooray.<br&gt;<br&gt;So what happened?  Well, we arrived at the hotel, and there&amp;#39;s a Cheesecake Factory right across the street.  Now my companions, being lower on the cultural food chain than esteemed yelpers such as ourselves, went gaga, and begged me to reconsider my chain complaint.  And, shamefacedly, I immediately did, when I realized my per diem for dinner would cover both the Jambalaya and a piece of cheesecake.  Don&amp;#39;t worry, I flogged myself later for giving in.<br&gt;<br&gt;So now you know that this place is one of my guilty pleasures.  I mean, you can&amp;#39;t offer me Dutch Apple Caramel Streusel cheesecake, or on this visit, Caramel Pecan Turtle cheesecake, and expect me to resist.  This was my first time with the Turtle, and whoa was it freaking delicious.  I am sure it&amp;#39;s one of the worst things for you to eat, but hey, without stuff like this what&amp;#39;s the point of living?<br&gt;<br&gt;This particular location was nice.  It&amp;#39;s on the lower level of the mall, and they were able to seat us immediately on a Wednesday night.  We had great service for our party of 8, and everyone was very happy with what they ordered.  Especially those of us who indulged in the cheesecake.  Down here in Georgia, these places are always madhouses, so it was nice to be able to walk into one and look at the cakes without being jostled by a bunch of people.  For the record, I may have just been insanely hungry, but the jambalaya pasta came out better here than I have ever had it before.  Simply wonderful!", "rating": 4, "date": "11/24/2012"}, {"text": "I usually love that place but last time i was there i ordered a coffee and when i took out a pack of sugar it was full of holes- as if a mouse had been around it.<br&gt;They claimed they had no mice and refused to open a new pack of sugar for me. Instead they simply didnt charge me for my coffee. I wanted to drink it but i wanted my sugar and they did not want to open a new sugar box so no coffee for me", "rating": 3, "date": "2/23/2016"}, {"text": "The server was hilarious! sarcastic, funny, chill, and gave us space. carbonara had an overly salty flavor that basically took over the entire dish. It was surprisingly bland other than this one note. The sliders were ok, but the meat was really just way too salty and fatty, and didnt seem high quality. <br&gt;<br&gt;MY ONE complaint, is that he manager was pushy, rude, and tried to take over the waitresses responsibilities and make her look like she wasn&amp;#39;t doing her job. It was so bad that i put in a complaint. I can&amp;#39;t handle men thinking they can be totally rude and domineering over female staff, or any staff for that matter! it ruined the entire night to have that cloud of superiority on the dinner table. <br&gt;<br&gt;SO, overall, eh, it is the CCF, but i like the one in Boston far more than i like this one.", "rating": 3, "date": "4/17/2015"}, {"text": "I called the Cheesecake Factory - Chestnut Hill asking for the wait on a table of 10. The host was really rude and he said that there was going to be a 2 hours wait. I said it was fine and told him we were about to walk in. He was even ruder and said &amp;#34;If you walk in now it will be a 3 hour wait&amp;#34;. 5 minutes after I spoke to him, someone from my party walked in. A hostess was really nice and told her the wait was 45 min. I asked for the host name and he said &amp;#34;Mario&amp;#34;, but It was the host working around 8pm on Wednesday 02/18/2015. He was very unprofessional and rude. We almost gave up on going because of him. We felt like he didn&amp;#39;t want us to come in. We did anyways because we were already in the area. I have been going this restaurant for years and never had this problem. I hope the manager addresses this issue. I will be writing another review for the waiter (TOD) because he was the best!", "rating": 1, "date": "2/20/2015"}, {"text": "Waited 40 min for table. Ordered Nachos off the menu and they were on the bland side. We were anxiously awaiting the artichoke dip but ended up with a burnt artichoke and dipping sauce. Waitress was great but definitely not worth the wait and outing.", "rating": 2, "date": "4/12/2015"}, {"text": "The night started off fine with a drink at the bar while waiting for an outside table. Also if our waitress  wasn&amp;#39;t such a delight this would be one star review. We ordered a salad , and two ribeye steaks , our food did take a little longer than usual to arrive but we were enjoying our conversation so we didn&amp;#39;t mind too much. A &amp;#34;manager&amp;#34; came over to apologize that they have run out of ribeye steak -seems odd to say that now it&amp;#39;s been 45 mins and the kitchen is just making our food now? Hard to believe. No worries my friend wasn&amp;#39;t upset she ordered the filet , rare. The manager or whoever she was comes back to tells us she wants to bring the other steak out and salad so food doesn&amp;#39;t overcook, okay fine. Our waitress comes by and sees we&amp;#39;re missing a ribeye and wasn&amp;#39;t told of the kitchen mistake. Very disappointing that the lines of communication at this place are in total disarray. The real reason no ribeye, it went to the wrong table. How frustrating. And what&amp;#39;s with the lie? Put on another ribeye. Maybe they did run out. Oh! During said chaos we gave our compliments to the male manager on duty about our waitress, she tells us he told her we said she was weird! Totally wasn&amp;#39;t what we said! I think there&amp;#39;s issues with staff and management at this place. Not sure we will be back.", "rating": 3, "date": "6/21/2017"}, {"text": "Well, I&amp;#39;d never been to Cheesecake Factory before, but my boyfriend thought this would be a great Valentine&amp;#39;s Day dinner location.<br&gt;<br&gt;Yeah, him and about half of outlying Boston, apparently.<br&gt;<br&gt;We got there around 730 and were told it would be roughly a half-hour wait to be seated. Taking the initiative, and because I was excessively thirsty, we made our way to the bar and self-seated immediately at a four-seater high-top with a view of the Minnesota/Wisconsin game. It took a while for a server to find us, but that&amp;#39;s more than excusable on a holiday.<br&gt;<br&gt;Our server, Rachel, was a gem. Funny, informative and very attentive, she was always in the periphery if we needed her. We started with a chocolate martini - not on the menu, but they&amp;#39;ll make it for you - and a Long Island iced tea, plus waters and the quintesential bread basket. <br&gt;<br&gt;Head&amp;#39;s up to the bread baker, and I know they have one because I saw a guy walking around with a giant platter of breads, but that is the hardest, least palatable Italian loaf I have tasted that wasn&amp;#39;t on the clearance rack at Stop and Shop. The multi-grain was fantastic, though, and we devoured it before our apps.<br&gt;<br&gt;Word to the wise, this is an amazing date location. We shared a Boston Cobb salad, which was well garnished and portioned appropriately to share. We then had the Hibachi steak, and OH GOD, can you say perfect medium rare? The best temperature for a skirt steak, which I know it was, but hey, cooked with that marinade the cut was great. The wasabi mash, tempura asparagus and roasted mushrooms were perfect. Delectable. Amazing and fantastic, and we have half of it in the fridge because there was just so much.<br&gt;<br&gt;We got two slices of cheesecake to go, thanks to Rachel&amp;#39;s suggestions. Coffee and the end of the basketball game were compliments of the manager, whose name I never got. A very pleasant, smiling lady, and I appreciated her attentiveness.<br&gt;<br&gt;This business is in the Atrium Mall, and while the rest of the structure is vacant, I hope they stick around. First visit but not the last! Only would have been better if my boyfriend proposed, but we&amp;#39;ll give these things time.", "rating": 4, "date": "2/15/2013"}, {"text": "Let&amp;#39;s see, we came here for Sunday brunch....my main complaint is that I was stupid enough to eat and drink here for 3 hours before ending up at Yard House at Legacy Place in dedham (a SUBSTANTIALLY superior dining/brunch experience).<br&gt;<br&gt;I ordered sliders for food, and was constantly pressured to order more food, even though their sliders are essentially 3 overcooked (despite asking for PINK center) mini burgers with no toppings and bun that came out of a plastic bag a few minutes ago. While I was waiting for Burger King delivery from their kitchen, I was treated to ambivalent service from our waitress who pressured us for more food, but kept forgetting our drinks.<br&gt;<br&gt;I also had 2 bloody mary&amp;#39;s which tasted &amp;#39;skunky&amp;#39; (not sure how you do that) but I suspect their tomato juice went bad and overall it was a terrible experience. The fact that it was sunny out and I was in good company saved the experience, but despite the fact that we were the only people there, Cheesecake Factory managed to screw up something so basic as Sunday Brunch in suburbia.<br&gt;<br&gt;The only redeeming quality about this place is that you can observe suburban russian jewish girls here, discussing #firstworldproblems and talking about their plans to marry a financial analyst that went to brandeis and their plans to go get drunk in Boston.", "rating": 1, "date": "7/31/2012"}, {"text": "The food, just like every Cheesecake Factory, is not bad. We had a collection of appetizers rather than main courses. Tuna avocado salad was tiny, but good and fresh. Salmon firecrackers were a little overcooked, but good. Mini carb cakes where very cheesy - yes cheesy - where is the crab meat? Calamari were okay, albeit unremarkable. Red velvet cheesecake was to die for. Their tab water is filtered and drinkable. <br&gt;<br&gt;Knock though - club soda was unbearably loaded with chlorine. I sent it back and got a new one. I told waiter David that it is not fit for human consumption and asked for more regular water instead. I still was charged $3 for the soda. Rather than arguing, I deducted $3 from the tip which made it uncharacteristically low. <br&gt;<br&gt;Don&amp;#39;t drink anything out of their soda fountain!!! Don&amp;#39;t give the sodas to your kids.", "rating": 2, "date": "3/22/2011"}, {"text": "Great food and drinks, if the waitress listens to what you order. <br&gt;It seems like victoria( the waitress) had her mind in something else the whole night. <br&gt;I ordered a Malibu and pineapple, and my friend asked for a chocolate martini. <br&gt;Victoria came back and asked me what I ordered. I said Malibu and pineapple. <br&gt;What we received was 2 martinis. <br&gt;The Malibu you could barely taste... For 10.00- I was ripped off!<br&gt;Victoria needs to cheer up! I gave the lowest tip ever.", "rating": 2, "date": "2/15/2013"}, {"text": "I flew up to Boston from California  to surprise my best friend for her 30th Birthday. I took her to the cheesecake factory to have dinner and dessert on August 5, 2018 and as we were sitting there I saw a mouse run by. I immediately got up and requested to speak to a manager. As I was waiting I asked one of the servers if he knew that they had mice and he said yes we do get them from time to time because of where their eatery is positioned (NO EXCUSE), so the manager comes and I ask her if she knows that they have mice and she immediately says no. When I repeat to her what one of her staffers said about having mice from time to time she immediately changed her story and confirmed his story and said yes we have mice from time to time. She said that she was going to contact the mall about it and offered to move our seats several times and I said what is moving our seats going to do? You all have mice. We had already ordered and she gave us the food for free but there wasn&amp;#39;t an apology and people should not have to come into a restaurant and experience that especially since we were there celebrating a 30th birthday.", "rating": 1, "date": "8/8/2018"}, {"text": "Worst experience last weekend. We went in Saturday for lunch and there was no wait. Some how all of the orders were messed up. The manager came over 30 mins later to apology but that was it. At any other restaurant you would get something free or something", "rating": 1, "date": "7/25/2014"}, {"text": "So, I&amp;#39;m confused by the reviews and ratings for this Cheesecake Factory. We live in the area and are there quite often! The servers and staff have always been wonderful to us! I am often there with 3 kids which if anything would merit rude behavior, but none has ever been expressed! The food is always good ( sometime son busy nights it takes a bit) but overall I have never had any issues with this location! We love it here and have many reasons to return!", "rating": 5, "date": "10/22/2015"}, {"text": "Five stars for the cheescake; one star for the pasta.<br&gt;<br&gt;The &amp;#34;Pasta with Meat Sauce&amp;#34;  entree was slightly large as a portion and miffled with too much oil. The sauce was lacking in meat and had a consistency that separated itself from the pasta (i.e. when the pasta was gone, the plate was filled with it.) Overall, the meal didn&amp;#39;t go down as well as I expected. I&amp;#39;ll try something else next time.<br&gt;<br&gt;Apart from that, the cheesecake was amazing! I had the Godiva Chocolate, which was a nicely garnished confection with a tangy crust. I relished every forkful!", "rating": 3, "date": "5/2/2010"}, {"text": "Typical cheesecake &amp;#34;factory&amp;#34; menu.  Ordered the usual items but was terribly disappointed by the portion.  Service was also very factory like, but nothing genuine.  We ordered appetizers but no inquiry as to if we wanted everything all at once or slowly.  My entire dinner service consisted of 1 entree per guest &amp;amp; 1 drink per guest.  I was so thirsty that I might have considered drinking the toilet water.  As we were leaving; I think I saw &amp;#34;please don&amp;#39;t come back&amp;#34; in my rear view mirror.", "rating": 1, "date": "5/21/2017"}, {"text": "I have to say that I do not see the fawning praise people give the food at The Cheesecake Factory.  My wife and I went here for brunch and found the food mediocre and the service below average.  Our orders were taken promptly and things went down hill rapidly from there. My eggs were moderately warm.  They probably would have been served hot if the server/bus person hadn&amp;#39;t walked around the restaurant for 3 to 5 minutes trying to find our table.  Someone couldn&amp;#39;t give them a table number???<br&gt;<br&gt;The next big issue was that I received my toast both dry as dirt and burnt as did my wife.  I had to ask twice for butter which resulted in us getting 3 slices of butter.  I did not realize The Cheesecake Factory was so hard up that they couldn&amp;#39;t butter toast and tried to prevent customers from doing so.  Our waitress reappeared at check time but was sorely missed when we needed her! <br&gt;<br&gt;Overall this is a way too pricy for such mediocre food and poor service.  You can do much better!", "rating": 2, "date": "8/25/2014"}, {"text": "Rock hard tomatos, terrible presentation, but expensive.  Weird decoration, poor lighting, and loud.  <br&gt;<br&gt;Our server was nice.", "rating": 2, "date": "11/14/2015"}, {"text": "As far as cheesecake factories go this place is run of the mill. Obviously they have good cheesecake and dinner is ok unless the place is slammed in which case there is a long wait and the place becomes a bit chaotic. Had the filet and although it doesn&amp;#39;t compare to a Boston steak house it wasn&amp;#39;t bad", "rating": 3, "date": "11/7/2015"}, {"text": "Chain restraunt but this location was on the better side of nice.  The food are what we expected, but the portions were way too big.  Next time we order for one and split the dish.  The bar was showing the Pats game and there was lots of good seats to watch the game and recover from christmas shopping madness.  The waitress was really good.", "rating": 3, "date": "1/1/2015"}, {"text": "If had the orange chicken with white rice . It is my favorite place .we go often to this place", "rating": 4, "date": "5/21/2017"}, {"text": "I have eaten many times at the Cheesecake Factory in different parts of the country. Today was my first time at this location. It did not disappoint.  Despite one party member arriving after the others who finished their food before the the other arrived, our friendly waitress Kaitlin told us to take our time even though the lunch crowd was large.  As always, the menu was extensive and all dishes contained fresh ingredients.  Quality, consistency and great service.", "rating": 5, "date": "5/12/2017"}, {"text": "Just a thought...<br&gt;<br&gt;If your customers must witness four separate performances of the waitstaff&amp;#39;s attempt at singing happy birthday hire a goddamn vocal coach to train the crew. Even the mutants from the Star Wars bar could do better!", "rating": 3, "date": "11/12/2012"}, {"text": "Not their best.<br&gt;<br&gt;We ordered two dishes here for lunch today:  The fish and chips and the California Cheesesteak.  The fish and chips were just ok.  You would get better version at a random pub.  As for the California Cheesesteak, that was pretty bad.  The bread was way over toasted.  The steak was cut too thick and cooked far beyond well-done.  It was unpleasant to eat.  <br&gt;<br&gt;I&amp;#39;ve been to other Cheesecake Factory locations and have never had a bad meal until now.  They need to work on their execution.", "rating": 2, "date": "7/5/2015"}, {"text": "The only reason this particular restaurant is getting 2 stars is for the food and the cheesecake. We arrived at 6:30 and were told that the wait time was 5-10 minutes...15-20 minutes later we check with the hostess and she had actually messed up, and didn&amp;#39;t take out name. I&amp;#39;m like ok, it happens. She says I will sit you right next, so we wait another 5 minutes and then she calls somebody else that &amp;#34;wanted to sit at the patio&amp;#34;. Needless to say we were really frustrated by now. So we get seated and the waiter is nowhere to be seen for another good 5 minutes. Well we thought its a busy night so be patient. He takes our order and it took them 20 minutes to see them again...Very dissapointed!", "rating": 2, "date": "10/19/2013"}, {"text": "Went here on a Tuesday night with my boyfriend and it was surprisingly crowded. Wait wasn&amp;#39;t longer than a minute though which was great. Waiter served us water and bread immediately, which was good because we were pretty hungry. Ordered a Caribbean cooler and it was a bit small for the price we paid but still delicious--just the right amount of alcohol. My boyfriend got the mac and cheese burger and loved it. Not too salty. I ordered the pulled pork sandwich. The coleslaw that came with it was delicious but the bbq sauce was a little too sweet. As usual, portion sizes are huge. You truly get what you pay for here. At the end, we finished off with a godiva chocolate cheesecake. It was perfect--chocolatey but not overpowering with sugar. I&amp;#39;d definitely come back here again.", "rating": 5, "date": "8/12/2014"}, {"text": "I only come to The Cheesecake Factory for a few things - their turkey club but with a cheeseburger instead of turkey, pumpkin cheesecake (when in season), and their red velvet cheesecake.<br&gt;<br&gt;The menu is enormous and the portions are comparable.  You can get many different types of cuisine and now they have a lighter menu with fewer calories, including drinks.  The mojito was delicious and not lacking flavour.<br&gt;<br&gt;While the menu is diverse, the food is not that great.  Also, I always feel like a pain the ass for modifying the turkey club to make a cheeseburger club instead.  One time the cheeseburger was cold, which was concerning.  Another time they didn&amp;#39;t melt the cheese and then charged me $5 extra.<br&gt;<br&gt;The service isn&amp;#39;t the best here and the servers don&amp;#39;t exactly love their job.  It is what it is and I will continue to come here when I am craving one of the above.", "rating": 3, "date": "11/19/2011"}, {"text": "Every dish I ordered there is like an episode of Man vs Food.  <br&gt;<br&gt;Has anyone had any room left to even try their cheesecake?  One time I came there just for desert and I wasn&amp;#39;t impressed ..   Same as all their other food, BIG portions, mediocre taste.  <br&gt;<br&gt;They need to stop trying to please everyone and concentrate on providing good quality food.   Their menu is huge and in addition they have advertisements in it.   When I&amp;#39;m hungry I&amp;#39;m not thinking of buying a diamond bracelet..   if they want to advertise in their menu they should advertise pepto bismol or tums at least that would be more appropriate.<br&gt;<br&gt;Order one of their salads, then enjoy eating it for the next 3 days.. <br&gt;<br&gt;The only reason I can think of going there is, if you&amp;#39;re coming with 10 people who can&amp;#39;t decide what type of food they want, either that or a group of competitor eaters.<br&gt;<br&gt;If you do go there, order something simple like a burger..  or chicken sandwich.  It will be average which is what this place is.", "rating": 2, "date": "8/7/2011"}, {"text": "You shouldn&amp;#39;t allow your employees to sit down when they should be taking orders. The person who took my order leaned over like a sloth over the POS system like she wasn&amp;#39;t getting paid enough to use her two legs God granted her. She was also incredibly rude and didn&amp;#39;t speak to me until I said something, do you teach greeting skills at all? She also only cared about the interaction when I was writing the tip which I only gave to help other people working at the desk in case you pooled tips. (I actually asked a worker if this was done for any future orders I do!) She didn&amp;#39;t thank me for the tip either she was too busy printing a receipt for it. Really a unpleasant interaction, I would expect better customer service if your employees are going to intimidate your patrons for a tip (that tip comes for free). I&amp;#39;ll eat elsewhere for now on in a pinch.", "rating": 1, "date": "1/15/2017"}, {"text": "Another great location is Boston! I love going to this location and the one in Burlington. My experience of going to the Cheesecake Factory has always amazed with the excellent customer service and undoubtedly the best---tasty food in town!!!", "rating": 5, "date": "1/5/2017"}, {"text": "Came here on a Saturday night, nice and early to beat the rush.  Arrived around 5:40 and the four of us were seated almost immediately.<br&gt;<br&gt;From start to finish, our meal was efficient.  The serving staff at this restaurant moves around very quickly yet we never felt rushed.<br&gt;<br&gt;The only issue is that it&amp;#39;s hard to get from one end of the restaurant to the other to use the restrooms because there are so many people waiting in the pathways in the lobby area.<br&gt;<br&gt;Go early so you don&amp;#39;t have to wait in line!", "rating": 5, "date": "2/19/2012"}, {"text": "I had the Skinnylicious Grilled Salmon. It tasted fine, but about an hour afterwards I experienced very bad diarrhea. It has been plaguing me all day. Not sure about their food safety standards because I feel terrible.", "rating": 2, "date": "7/19/2016"}, {"text": "I found a coupe of things on the menu to stick with because every time I try something new I tend to be disappointed here. <br&gt;<br&gt;APPETIZERS<br&gt;Buffalo Blasts - these are the bomb!!!! It&amp;#39;s like like a buffalo chicken rangoon! must try<br&gt;Spinach &amp;amp; Artichoke dip - your average dip but it&amp;#39;s still pretty delicious<br&gt;Samosas - not exactly authentic Indian but tasty. I like the thin crispy skin<br&gt;<br&gt;ENTREES<br&gt;Chicken Bellagio - two huge breaded chicken cutlets with linguine all over a creamy pesto sauce. Best thing ever added to the menu a couple years ago....it&amp;#39;s 2 meals for me but so good. Only $13<br&gt;Miso Salmon - glazed baked salmon over a bed of rice topped with sweet and creamy miso dressing. This is better than what I&amp;#39;ve had at Asian restaurants.<br&gt;<br&gt;CHEESECAKE<br&gt;Red Velvet Cheesecake - this is hands-down the best one ever!!!!!! It&amp;#39;s unique, it&amp;#39;s not too cheesy and not too heavy. <br&gt;<br&gt;The service is so so here nothing special and nothing to complain about. When they are busy they are less attentive which is expected but in general a typical Cheesecake chain. Parking is convenient and the outdoor seating is nice in the summer.", "rating": 3, "date": "2/4/2012"}, {"text": "I have love/hate feelings for the Factory. \r<br&gt;\r<br&gt;Yes, they have some reliably yummy dishes (Evelyn&amp;#39;s Favorite Pasta, burrito, cheese steak, etc.) and I could eat baskets upon baskets of their bread... especially when they bring it out of the kitchen freshly baked and still warm... so good.\r<br&gt;\r<br&gt;But there are just TOO many options in the novel-sized menu! I can&amp;#39;t handle it all in the five minutes that passes from the time they drop the menu to the time they ask if I&amp;#39;m ready to order -- only to come back two minutes later and ask again. \r<br&gt;\r<br&gt;If they actually left their patrons alone for the amount of time it would take even a Factory-skilled-menu reader to digest that ENTIRE selection, they would never be able to turn over tables! Then again, that may explain why they usually can&amp;#39;t.\r<br&gt;\r<br&gt;You need to go in with a battle plan: Do you want a sandwich? Pasta? Chicken? Mexican? Thai? Italian? Apps? Drinks? Dessert? If you don&amp;#39;t have it at least narrowed down to a fries-and-burgers night vs. a chicken-marsala night, you&amp;#39;ll be under the gun.\r<br&gt;\r<br&gt;Another plus: The Factory Peach Bellini... it&amp;#39;s not a strong drink, but tasty.\r<br&gt;\r<br&gt;Another negative: The fact that they require your entire party to be present to be seated. They&amp;#39;re just screwing themselves and everyone else waiting for tables by doing that.", "rating": 3, "date": "4/18/2006"}, {"text": "I love going to cheesecake. I think it&amp;#39;s a good price for such a large portion of food that they have. I usually go for a dinner at this place once in 3 month or so. I usually get steak and i have no complains.  But I was very disappointed the last time I went to. Fried calamari for appetizer were delicious. And I love garlic sauce they offer with it. As for my main course I  decided to order something else and went for Chicken Madeira and Steak Diane. I got way too much sauce on my plate, I couldn&amp;#39;t taste anything beside that sauce. If they would put a decent amount of sauce I would love that dish. But unfortunately that wasn&amp;#39;t the case.  As for my friend we went with Chicken Bellagio. Originally dish was served with pasta but he change it to rise. Chicken was great but  there was so sauce so they rise was dry. The good part I share my sauce as I had plenty. So we kind make our dishes taste a bit better. Overall I do like Cheesecake Factory food but they just need to pay attention how they serve it.", "rating": 3, "date": "2/23/2013"}, {"text": "I ordered Mashed Potatoes. Instead received uncooked chicken. The manager &amp;#34;Randy&amp;#34; offers the worst possible answer saying the restaurant cannot do anything and called me a liar. Never experienced such horrible customer service.", "rating": 1, "date": "10/1/2016"}, {"text": "This place should be called Cheeseball Factory.  The food isn&amp;#39;t spectacular but it&amp;#39;s edible.  You&amp;#39;d go here on a business meeting or you could get a couple of wacky cocktails.  Other than that though, I&amp;#39;d stick to the cheesecake which is pretty giant in proportion.<br&gt;<br&gt;I&amp;#39;m a total snob and a jerk so when I see people in here living their weird domestic lives and getting psyched on eating at a chain restaurant I feel sad inside and then make sarcastic remarks to try to hide how awkward it makes me feel.", "rating": 2, "date": "1/7/2009"}, {"text": "The experience we had was a mixed to negative one. The food was good, good for a chain restaurant that is. Our experience in the &amp;#34;good&amp;#34; department was short-lived because our waiter, a tender slim flamboyant white male didn&amp;#39;t have a clue as to what he was doing. Understanding that this &amp;#34;factory&amp;#34; was fairly busy, he did not once come over to ask how we were doing and if we needed anything, no exaggeration, NOT EVEN ONCE! He was inattentive and didn&amp;#39;t provide any of what we needed. We watched as all other tables around us got bread and butter as we watched in admiration what those carbs would have tasted like...devastating. After waiting about 20 extra minutes to even ask for the bill, we waited another 15 for it to actually arrive. He asked, &amp;#34;did we save room for the best part?&amp;#34; If he was referring to the best part being us walking out the front door as quickly as possible? Then yes, I had an empty stomach for that. Embarrassing as his name was also David...he gave love a bad name.", "rating": 2, "date": "2/9/2016"}, {"text": "So good. Too bad the mall it&amp;#39;s in kinda sucks (for guys at least). I&amp;#39;ve been  here twice now and been impressed both times. It is kinda pricey tho but it&amp;#39;s worth it I&amp;#39;d say. And the cheesecake... they have like 25 different kinds and they&amp;#39;re so good and filling. I want to try to find the one in Providence next time I&amp;#39;m down there. At least that mall has an Apple store I can kill time in. <br&gt;Cheesecake factory gets a 4.5 / 5.", "rating": 4, "date": "12/18/2006"}, {"text": "Ideally, I would give the Cheesecake Factory 2.5 stars.  I think it&amp;#39;s pretty overrated -- there&amp;#39;s rarely a time when you won&amp;#39;t have to wait an absurd amount of time for a table.  The menu is too extensive, the portions are too big, and the food is decent, but overpriced.  The good thing about the extensive menu is that it really does include something for everyone.  <br&gt;<br&gt;Positives: the servers are generally diligent and helpful, and the desserts are delicious.  The Cheesecake Factory is known for its vast variety of cheesecakes, but the other dessert options are just as good -- the fudge cake is my personal favorite.", "rating": 3, "date": "5/7/2006"}, {"text": "A really great place to dine if you into generous portions and consistent good quality.  This particular Cheesecake Factory lets you sit outside in the summer and you can shop in the Atrium Mall in case the wait is long and while you are waiting to get seated.<br&gt;<br&gt;Can&amp;#39;t go wrong with these items from the menu:<br&gt;<br&gt;Appetizers:<br&gt;THAI LETTUCE WRAPS<br&gt;AVOCADO EGGROLLS<br&gt;<br&gt;Salads:<br&gt;SANTA FE SALAD<br&gt;BARBEQUE RANCH CHICKEN SALAD <br&gt;<br&gt;Cheesecake:<br&gt;FRESH STRAWBERRY CHEESECAKE", "rating": 5, "date": "8/25/2008"}, {"text": "My boyfriend and I went here on Saturday night for dinner.<br&gt;<br&gt;The place seemed slow for a Saturday night and especially because I expected a lot of people to be out shopping for Christmas.  Anyway we got there and were seated within 5 mins at a table that was kind of close to another table.  It was quite uncomfortable so our hostess suggested a booth which was much better.<br&gt;Our waitress was nice except a little pushy....she would tell us to take our time but she was always coming to the table what seemed like all the time.<br&gt;Our food was okay I got pasta mariana was not what I expected and it was a little dry and my boyfriend got the Lousiana pasta which was excellent.<br&gt;For dessert we got a chocolate rasberry cheesecake and we got a red velvet cheesecake (my favorite and it was AMAZING...I think I might order that as my birthday cake next year)<br&gt;<br&gt;All and all it was a good experience!", "rating": 4, "date": "12/5/2011"}, {"text": "Waited for table over a hour and thought it&amp;#39;s busy and it&amp;#39;s must be good. Was very disappointed by the service and food was sent twice back since it was undercooked first time and second time my steak came out like rubber and cold! The only thing that cheered me up was the cake and that&amp;#39;s why I give them a 3star. If the cake didn&amp;#39;t play a role in my meal then THIS LOCATION would have gotten a 1 star from me!", "rating": 3, "date": "7/15/2014"}, {"text": "I really, really, reeeeealllly wanted to give this one four stars, but there&amp;#39;s just one problem that always gets to me every time I go: their menus are so...sticky.  For real, like, I found bits of macaroni around page 25 one time.  But the menu itself is pretty extensive, and I&amp;#39;ve never hated anything I&amp;#39;ve eaten there, and the wait staff is fine...hence the three.  <br&gt;<br&gt;Oh, not that this matters to everyone, but their bathrooms are pretty.  Though, I always feel a little weird that they have full doors, so I can&amp;#39;t look down and see anyone&amp;#39;s feet.  Nothing says getting to know someone but knocking on their bathroom stall.  Hey, there.<br&gt;<br&gt;If you go at an odd hour -- and this has been my own experience, say 4pm or 8pm -- you should have no problem being seated right away.  It does suck that they don&amp;#39;t take reservations, but they seem to do just fine with the clientele.  And there&amp;#39;s the double-edged sword effect: I suppose that, if they did take reservations, my lazy self wouldn&amp;#39;t get in at all during peak times.  <br&gt;<br&gt;Some appetizers that I really enjoy are the fried macaroni and cheese, taquitos and sweet corn tamale cakes.  The Big-Bang chicken &amp;amp; shrimp is a delicious dinner option with a spicy kick to it.  And of course, you can&amp;#39;t go wrong with any of the cheesecake options (key lime pie and the chocolate tuxedo creme varieties get my top votes).  <br&gt;<br&gt;Oh, and they&amp;#39;ve got a valet service if you care to use it.  I typically just make like I&amp;#39;m parking at the mall and enter the restaurant from the inside.", "rating": 3, "date": "5/20/2008"}, {"text": "I think the food here is great!  I got an artichoke appetizer  here the other day and it was like $9 for 3 whole artichokes!  (aren&amp;#39;t artichokes considered a delicacy or something?)<br&gt;<br&gt;Although my main dish wasn&amp;#39;t all that tasty (i ordered a veggie pasta that didn&amp;#39;t really have much sauce), I blame it partly on myself since Im absolutely terrible at ordering and never read the fine print (now that&amp;#39;s me just making excuses up for why I never read the dish&amp;#39;s descriptions close enough).  So yes, I ordered a pasta with no meat...and yes it could&amp;#39;ve been  better and i doubt any vegetarian would&amp;#39;ve enjoyed it more...BUT<br&gt;<br&gt;yes there is a but<br&gt;<br&gt;the cheesecake freakin ROCKS.  and by rocks i mean ROCKS.  it rocks so much I&amp;#39;m savoring every bite and have been picking away at it for 3 days nows.  Even though it&amp;#39;s probably rotting right now, it&amp;#39;s goodness just perfectly masks the mold...yyyummmm", "rating": 4, "date": "7/20/2008"}, {"text": "5 stars for the amazing customer service by Tanya!<br&gt;<br&gt;My friend and his brother arrived at 5 for an early dinner.  When we arrived we were quickly seated.  I started with a Mojito without the simple syrup.  It was actually quite good and muddled to perfection.  Yum!<br&gt;<br&gt;Next was my meal, I ordered the Chicken Piccata, i decided to go without the pasta and opted for a side of asparagus instead.  It was flavorful and a great size in the lunch portion, leaving room for a delicious Limoncello Cream Torte.<br&gt;<br&gt;This was recommended to me by Tanya and it was amazing.  It wasn&amp;#39;t to heavy or too sweet and the citrus flavor was perfect.<br&gt;<br&gt;What really made this experience stand out was Tanya she was very attentive and was very friendly.<br&gt;<br&gt;5 Stars.", "rating": 5, "date": "6/22/2012"}, {"text": "*sigh* Did I really come to Boston to eat at a chain restaurant?  Apparently so.  In my defense, I was eating with some locals who love the place, so that has to count for something, right?  That&amp;#39;s what I&amp;#39;ll tell myself anyway...<br&gt;<br&gt;This Cheesecake Factory is pretty standard in most aspects: there is usually a bit of a wait, you get decent service, fairly comfy booth seating, and a wide variety of dishes from which to choose.  We waited about 30 minutes for a table on a Saturday evening (around 6ish), so it could have been much worse.  Upon being seated, I noticed how large this restaurant is - definitely bigger than any other CF I&amp;#39;ve visited before.  Our waitress was sweet and helpful, though a little slow on the refills.  I&amp;#39;m sure she was swamped with many other tables, so it wasn&amp;#39;t a big deal.  <br&gt;<br&gt;For dinner, the people of my group ordered all kinds of meals, all of which were massive in size.  I tried out the Thai Lettuce Wraps, which always looked yummy, but I never had an occasion to order them.  I definitely was not going to starve with this plate - even the lettuce was oversized!  But it was oh so tasty.  The chicken was cooked nicely and had a good flavor to it, though a tiny bit tough.  I loved the variety of dipping sauces, especially the peanut sauce which I&amp;#39;m a sucker for usually.  I enjoyed the fresh veggies even if the bean sprouts did keep getting stuck in my teeth.  Attractive, I know ;)  <br&gt;<br&gt;After all of that, I was stuffed full, but who goes to CF without at least looking at the dessert menu?  Kudos to the waitress for pushing the menus on us... She clearly knows how to make a sale.  I decided to take home a slice of the Pineapple Upsidedown Cheesecake for a late dessert, which totally hit the spot.  It has to be one of my favorites that I&amp;#39;ve tried thusfar *nom*<br&gt;<br&gt;Overall, this CF wasn&amp;#39;t too shabby for a quick meal.  It was in a good (re: convenient) location &amp;amp; our time there went smoothly.  I certainly wouldn&amp;#39;t be opposed to visiting this location again sometime.", "rating": 3, "date": "12/30/2009"}, {"text": "It seems that all the complaints here tend to relate to the wait or their personal tastes. <br&gt;<br&gt;Yes, the wait is long, but what can you expect with high demand? It&amp;#39;s not like they drag their feet. At least they&amp;#39;re accurate. Thirty minutes means thirty minutes. And for personal tastes, well, they really don&amp;#39;t make a food bad. (For example, these are the same people who would rate a Blonde Hair Dye as terrible because it turned their black hair into an orange. Haha, I&amp;#39;ve been reviewing too much lately...)<br&gt;<br&gt;I&amp;#39;ve enjoyed many of their entrees. The meatloaf is a bit funky, but then again who makes better meatloaf than a mother? The cheesecake is great, and I am not the biggest fan of cheesecake. My personal favorite is the Pineapple Upside-Down cake, it tastes more like party cake than a cheesecake.<br&gt;<br&gt;The drinks are AMAZING, and damn fast. The bar is a fun area to be, and most of the bartenders are pretty cute. ;)<br&gt;<br&gt;I think the environment is great. Relaxing when you don&amp;#39;t want the chaos of a TGIF bar. The Egyptian decor is charming. Perhaps it&amp;#39;s a bit faux-high-class, but I think most people can figure it out.", "rating": 3, "date": "1/13/2008"}, {"text": ":( This used to be my favorite Cheesecake Factory, but it has slipped in the rankings to below *gasp!* the Cambridgeside location.<br&gt;<br&gt;I still love the location in the Atrium Mall, where you can window shop Anthropologie and Restoration Hardware with your buzzer thing. Buuuttt, the food has been less than consistent, so I must remain steadfast at 2 stars.<br&gt;<br&gt;I was served hard, crusty bread at a recent late-afternoon lunch, and my grilled shrimp and bacon club tasted like a three- day old leftover sandwich. <br&gt;<br&gt;I headed there for a dinner as well and the hostess was too busy talking to a waiter to greet us for a solid minute. Sigh. <br&gt;Cheesecake Chestnut Hill, why do you make it so hard for me to love you?", "rating": 2, "date": "7/13/2008"}, {"text": "For some odd reason, i end up eating here alot, maybe cause its one step up from your regular chain restaurants like crapplebees and chilis; i dont love the place but they have a large diverse menu and decent tasting food; plus its good for large groups, cause everyone is picky but can find what they want here; wait is usually long<br&gt;<br&gt;pretty much eaten a majority on the menu, my more popular choices are meatloaf sandwitch, apple porkchops, pizza&amp;#39;s arent bad, they have a good orange chicken ; asian dishes there are decent<br&gt;<br&gt;remarks from my more recent trip<br&gt;<br&gt;Not one of favorite restaurants but respectable and on the same level as a macroni grill or other chains...this experience was bad.... waited like 1.5 hrs to get a table and .5 to get the food...ridicoulous wait but for some reason we didnt feel like going anywhere else... ambiance was alright , bathroom get an alright rating...the water handles where small but urinals were clean and smelt nice<br&gt;<br&gt;bread was warm and we had 2 servings of it...i had a crabcake sandwitch with mashed potatoes...large portions but nothing great...average taste and mashed potatoes were not hot hot...waitress has a ghetto booty <br&gt;<br&gt;overall 5 out of 10", "rating": 2, "date": "10/27/2006"}, {"text": "This place is awesome.  Great Atmosphere, food and people.<br&gt;LOVE LOVE IT.  Had breakfast burrito this morning and it was delicious.", "rating": 5, "date": "10/9/2011"}, {"text": "Poor service.  Not a single word of apology after messing up our sitting. Waited for 25 minutes with their beeper. I check and they tell me my name is not on their list although I have the beeper they gave me.", "rating": 1, "date": "2/5/2016"}, {"text": "Ask for Shane!  We just finished a delightful early Wednesday night dinner at this mall location thanks to a terrific server named SHANE.", "rating": 5, "date": "5/4/2016"}, {"text": "Horrible. Decor and atmosphere was what you&amp;#39;d expect from the Cheesecake Factory but staff was subpar. Wouldn&amp;#39;t recommend or return.", "rating": 1, "date": "5/2/2016"}, {"text": "Ate here last night with my cousin. The food was good I guess (can&amp;#39;t smell or taste right now, so I can only assume), but the service was FANTASTIC. Our waitress (I&amp;#39;m sorry, but I forgot her name) was attentive, jovial, energetic, and keep bringing us that delicious bread (yeah, you know the one). We gave her a huge tip, because she deserved it. I would be back just to sit at her table again.", "rating": 5, "date": "5/1/2016"}, {"text": "Sometimes, when your cousins are doing the driving (and the paying), you let them do the choosing, too. CF was not my choice, but it was not the worst thing ever. Three apps were a light dinner for four of us, and the cousins and the grandmother were all pretty pleased.<br&gt;<br&gt;Their artichoke was the worst artichoke I&amp;#39;ve ever had, probably because they actually have to cook it from a fresh vegetable and not from a frozen bag. Also, there was an ant on our table. Poor ant, having to eat leftover crumbs of bad artichoke.<br&gt;<br&gt;But, props for being open late on a weeknight in the suburbs! Good for you, CF. Now get me a delicious artichoke and not one that sucks.", "rating": 2, "date": "4/30/2009"}, {"text": "I am usually not a fan of chain restaurants however the food, desserts, and drinks are just so tasty.  You could go there a hundred times and not try everything on the enormous menu that matches the enormous portions.  Avocado eggrolls are a must try along with of course the cakes.  <br&gt;<br&gt;Now the negatives:<br&gt;<br&gt;I haven&amp;#39;t figured out the secret as to why this place is ALWAYS crowded and you ALWAYS have to wait no matter what time/day you go in EVERY Cheesecake I&amp;#39;ve ever been to in several states now.  Wait for literally hours or take your chance hovering over people seated in the bar area, staring, willing them to finish up so you can pounce on their table before someone else.  <br&gt;<br&gt;The huge portions.  I did say that was good but when you reheat them the next day you see the pool of butter/oil leaching from the dish.  Better tasted and not seen - bad reminder of your indulgence.  This usually keeps me away just long enough for the craving to overpower the memory.<br&gt;<br&gt;Overall a good get together place - something for everyone.", "rating": 4, "date": "6/22/2007"}, {"text": "I think it&amp;#39;s cruel that the Cheesecake Factory serves so much cheesecake and yet requires their servers to wear white jeans.  Black is slimming, white jeans... not so much.<br&gt;<br&gt;Oh yeah and the food&amp;#39;s fine and all that.", "rating": 3, "date": "8/29/2007"}, {"text": "We&amp;#39;ve been here many times and had minimal problems with this place. But this time, when we came for Sunday brunch, we were completely taken aback by the rude and indecent service. The receptionist at the front (who we found out was named Emma) led us to a seat at the bar area, and not just the bar area. It was the darkest, most concealed part. Not to mention we had two kids and we found it very inappropriate that out of all the seats available at this time of day she led us to such an indecent seat. When we voiced our complaint to her and told her we wanted to sit at the terrace, she led us to, again, the very edge of the area and the darkest place possible. At that point we were fed up, and made a specific request to sit at a table at the center of the terrace, and the look she gave us was extremely rude. We asked to speak to a manager, and her explanation of what happened was completely ridiculous. She made an excuse of &amp;#34;Here in Massachusetts it&amp;#39;s alright for anyone to b seated at the bar.&amp;#34; We&amp;#39;ve been living here for over seven years and my father is an attorney and knew what&amp;#39;s he said was complete bs. Then she tried to explain why we were placed at the very edge of the terrace. &amp;#34;Every area is sectioned off to each server, so we wanted another server to be able to serve our costumers.&amp;#34; That one was also pretty ridiculous. Of all the times we&amp;#39;ve been here, nothing like this bad ever happened. We even considered leaving the restaurant altogether since we were so done with this place. But we decided to stay, and the plight continues. We asked for bread to start with, and it never came. Probably never coming back here.", "rating": 1, "date": "9/3/2017"}, {"text": "My family and I dined here on a Wednesday night for dinner. We were expecting a wait, but when we showed up around 5:45 there was no wait at all. We were promptly escorted to a table. The food was delicious. Out of the four of us, three had burgers. They stated that the burgers were delicious, the bacon bacon burger, macaroni and cheese burger and the Americano. I ordered the garlic noodles with chicken. It wasn&amp;#39;t what I was expecting but delicious none the less. Nice sauce, not too overpowering with garlic. It could of used more vegetables but no complaints. The chicken was so tender it fell off the bone. No complaints at all. As we were leaving at 7:30, it was starting to become busy.", "rating": 5, "date": "4/7/2016"}, {"text": "Yikes. Not sure what to say-- used to be great at the Atrium. The one at the Mall at Chestnut Hill is pretty poor. The service is surprisingly bad, ruining the meal. We don&amp;#39;t go here to eat anymore. When we crave cheesecake, we just order a slice and pick it up. But, we don&amp;#39;t even do that on the phone anymore, because even the phone service is lame. What has happened to our beloved Cheesecake Factory?!!!", "rating": 1, "date": "4/3/2016"}, {"text": "Stopped for dinner Tuesday early evening .  Greeted and seated right away .  Our waitress Danielle F was great.  Very attentive , took out orders right away , drinks came out fast with some freshly baked bread . I had the california cheesesteak. Excellent , had to take half home as portion was very generous . My wife had the Chicken and avacado club . She said it was delicious , only tough thing about it is that it was so big , she had to eat it with a knife and fork . We shared a piece of the blueberry truffle cheesecake , very good as was the coffee .<br&gt;We will be back !!!!", "rating": 5, "date": "1/31/2014"}, {"text": "We came here for dinner, and I would not visit this place again. We ordered tomato and basil pizza, chicken enchiladas, and a classic hamburger. The pizza and the enchilada were all too salty for us, and and the hamburger was just ok. Nothing special about the dishes, and we couldn&amp;#39;t finish them all, and we just left the leftovers.", "rating": 1, "date": "7/27/2014"}, {"text": "I&amp;#39;ve generally had decent experiences at this particular Cheesecake Factory. This past Sunday was a tad bit unpleasant. Our waiter seemed friendly enough to start with. After we got our drinks and bread, however, it took SO. FREAKING. LONG for him to come back and take our food orders. I would say it took him a good 10-15 minutes to come back. On top of that, it took maybe 20 minutes to bring my food out which consisted of two appetizers; one was edamame. I didn&amp;#39;t know that they planted the pods out back and waited for them to grow, because at the rate they were going, they might as well have.<br&gt;<br&gt;On the whole, I always enjoy going to Cheesecake Factory--their chicken caesar salad hits the spot every time. This time however, every time our waiter would leave, he would take years to come back, even to process our check which, in my opinion, is usually the fastest process since they&amp;#39;re ready and willing to take your money and have you out the door. <br&gt;<br&gt;I give them a 3 out of 5 stars since the service this time was pretty terrible but usually, I never have issues with the service or the food.", "rating": 3, "date": "4/19/2011"}, {"text": "Beautiful restaurant!<br&gt;Had their salmon it was delicious. <br&gt;Our server was great: attentive but did not hover. <br&gt;I like taking my time so I was happy with the service.<br&gt;Wished I had saved some space for their dulce de leche cheesecake!", "rating": 4, "date": "1/14/2014"}, {"text": "I am a big eater so I like the large portions, especially the comfort foods such as salisbury chopped steak, meat loaf, or shepards pie. I also like that the martini&amp;#39;s are large and come nice and cold.  And to top it off, cheesecake is my favorite dessert. Today I finally notice their small plate section and tried out the stuffed olives, garlic rolls, stuffed dates, and pizzette of wild mushrooms.  All of them were great!  We had plenty of leftovers for lunch tomorrow.", "rating": 4, "date": "10/28/2009"}, {"text": "Last minute get together with my brother and tonight I just did not feel the &amp;#34;welcome&amp;#34; from beginning to end. Got here at 9PM and the host gave us an option to sit where ever so we ended up sitting at a high top table and was served by Shane. He seemed pretty rushy and observing what tables he had I could understand he had a big party full of guys and a couple high tops (including us) and a few booth tables. He took our drink orders- I had the peach smoothie and my brother had the tropical smoothie. DELICIOUS! He brought out bread, but it was missing the sour dough white bread and I didnt really like the wheat brown ones and was pretty disappointed and noticed the next table that came in had both. Another server had brought our drinks over since it was sitting at the bar counter for about 5 minutes. Our server then ran over while our drinks were being placed down and the way he asked what we were going to order I felt rushed. He didn&amp;#39;t ask us if we had questions or needed a few more minutes, more like &amp;#34;What have you guys decided on for food?&amp;#34; Uhhh ok.  My brother already ate so he just ordered loaded potato tots and I ordered the chicken alfredo. When the food finally arrived, once again the same lady ran our food and I&amp;#39;m just confused as to why is she catering to us? Might as well have her serve us then? His big table was pretty much done and I see him attending to his other tables and to our right there&amp;#39;s some staff that is either on break or just ended their shifts and I see him chit chatting. Dont get me wrong, I understand y&amp;#39;all had a long days work and barely had a break, but work is work and its rude to &amp;#34;neglect&amp;#34; your guests. What I am the most upset about was when he came over to check up on us and I asked our server if he could pack the rest to go, his response was &amp;#34;Sure, but did you want me to bring a box for you to pack it yourself?&amp;#34; Wow. Speechless. As a server myself that IS horrible hospitality. First of all, what did you really do throughout our whole entire visit? 2 second table visits for the max 5-6 times, did not run any of our food/drink, busy attending &amp;#34;more important guests&amp;#34; (pretty much 3+ more guests because their table equals more tip?), and chit chatting. Just because its only 2 people with almost $40 worth of food, you don&amp;#39;t think we are worth your time? That&amp;#39;s how we felt the entire time here tonight. Tipped him 15%, but I felt he didn&amp;#39;t even deserve that percentage due to poor service and it annoys me how servers automatically assume whatever the check total will be they think they will get a minimum of 20% gratuity off it. Shane was nice, but his service needs some improvements and not just asking to take our orders and checking up here and there. I shouldn&amp;#39;t have to pack the rest of my food when I go out to enjoy my day off from doing that to my own guests! I don&amp;#39;t work there- you do.", "rating": 2, "date": "5/4/2014"}, {"text": "5 minute wait at 7:30pm-ish on a Friday night, yeaaa!<br&gt;Nom-goodies--warm wheat bread, mmmm<br&gt;Really nice red wines<br&gt;Good food and lots of leftovers<br&gt;...couldn&amp;#39;t be much better service at Cheesecake <br&gt;<br&gt;not so hot: spinach dip--waaay too salty, aaah!", "rating": 4, "date": "9/21/2008"}, {"text": "Holy goodness this place was great!! I even used it as an example for my fractions lesson to my second graders today. Can&amp;#39;t stop talking about it! So right, we took the shuttle bus on over from MIT.  Seemed like the nerdy-cool thing to do.  Scooted in and we were seated right away.  Place is huge! Caught a glimpse of all the cheese cakes on my way to our table.  So many choices! So many choices!<br&gt;<br&gt;Sat down, too Boston-food-overload to actually order a beverage other than water.  Our waitress was very nice and patient.  While stuyding the pages upon pages menu I happened to catch a glance of what appeared to be a soccer game on over at the bar (shiny-thing syndrome...easily distracted).  But, like the true soccer obsessed testosterone shooting through a girl&amp;#39;s veins person that I am, I quickly excused myself for a closer look.  Manchester United...ROMA! Holla! Mmm Cristiano Ronaldo.  Oh right, Cheesecake Factory...back to the table. <br&gt;<br&gt;So we ended up splitting everything.  The Cajun pasta dish which was IMMENSE!! SO LARGE! But quite delicious. As well as one of those tropical salads (also ridiculously large) which came with fried wonton like things on top...mango...was an art form like dish thing.  Wait wait waaaaaait. Wait a minute! Let me back up.  Um. Appetizers! We went with the avocado spring rolls and the fried macaroni and cheese.  W.O.W. I can&amp;#39;t...I can&amp;#39;t even begin to tell you.  THE best fried macaroni and cheese I&amp;#39;ve ever had (and I know mac n&amp;#39; cheese).  Oh my, oh my.  The avocado spring rolls were also a surprising delight.  Quite delicious.  <br&gt;<br&gt;Alrighty, so now the big finish.  Cheese cake.  Which. One. To. Choose?  I narrowed it down to the carrot cake cheesecake...the oreo...the regular....the kahlua...and I believe a few others.  But after the sensory overload of our meal...and the week, I went with &amp;#34;the regular.&amp;#34; Which was faaaar from ordinary.  Oh yes! It&amp;#39;s gooooood! Which reminds me....I still have a few bites left in my refrigerator.....hmmmm!", "rating": 4, "date": "4/18/2007"}, {"text": "I tried their curbside pickup service last night for the first time.  The food was ready within 25 minutes of ordering on the phone.  The guy who brought out the food, Brandon, was very friendly and helped us figure it out for the first time.  <br&gt;<br&gt;The only question I would pose is: How much, if any, do you tip them for coming out to give you your food?<br&gt;<br&gt;The food itself was great as usual.  Nothing too fancy, but good for the price.  The skirt steak arrived warm and tender, and the mashed potatoes were very flavorful.  <br&gt;<br&gt;Usually I worry that something like curbside take-out, especially for steak and the like, would end up tough and cold by the time it gets to the house, but that was not the case last night.  Everyone else in my dinner party had similar opinions.", "rating": 4, "date": "12/10/2007"}, {"text": "Just like any other, if you&amp;#39;ve been to any other cheesecake factory.<br&gt;<br&gt;I went at 930pm, so it wasn&amp;#39;t crowded or anything, but I&amp;#39;m sure there will be lines to get in line to get a table.<br&gt;<br&gt;The food is okay. It&amp;#39;s definitely one of those places where if you have a bunch of friends who are picky about what they eat, this place has something for everyone. <br&gt;<br&gt;But you know what they say about jack-of-all-trades not being an expert at anything...", "rating": 3, "date": "5/8/2008"}, {"text": "In the most simplistic terms. Cheesecake Factory&amp;#39;s food is bad. Bad for your health, bad for your wallet, and it doesn&amp;#39;t taste good. Cheesecake Factory&amp;#39;s food tastes like garbage, it sucks.", "rating": 1, "date": "1/27/2013"}, {"text": "Like any other Cheesecake Factory you&amp;#39;ll find. Long menu, lots of cheesecake. The layout is strange, it looks like the restaurant would be really small, but there are other booths around random corners, don&amp;#39;t get lost!<br&gt;<br&gt;Outdoor seating is available.", "rating": 3, "date": "7/11/2010"}, {"text": "Pros - huge menu, large portions, excellent service<br&gt;Cons - Typically long wait time<br&gt;<br&gt;I have been to The Factory both in the Burlington location and this location. I have to say I prefer this locations service and ambiance. I had the Carbonara pasta the lunch portion which was plenty and my friend had the mini pizza and the beet salad. Everything was delicious and filling. We had a slight mishap with a salt shaker that was not filled properly and the top came off spilling salt onto my friends pizza. This was quickly rectified by the wait staff by bringing her another pizza. Also I have to say that the Manager also came over to make sure everything was ok.<br&gt;<br&gt;All in all a great experience. If anything could be improved upon it is the way they do the seating. If you have a buzzer and it goes off this should automatically mean that you are going to be seated right away. This should NOT mean that you will be put in another line to wait to be seated. This has happened to me on numerous occasions at the Burlington Location.", "rating": 3, "date": "1/11/2011"}, {"text": "The take-out food is not the same size that you get if you eat in. Salads to go are horrible and the sandwiches are just slapped into the containers. The take out area staff take their time picking up the phone. Very very disappointed in this eatery .", "rating": 2, "date": "5/23/2015"}, {"text": "I went to this restaurant last night as part of a mystery shop, so my review in summary:<br&gt;<br&gt;The atmosphere is bustling, energetic, fun, as are all Cheesecake Factories.  They keep the place clean and well maintained, though one restroom stall didn&amp;#39;t work and there was a missing purse hook.<br&gt;<br&gt;We ordered the thai lettuce wraps and the goat cheese and veggie pizza.<br&gt;<br&gt;The lettuce wraps came with three dipping sauces, vermicelli, bean sprouts, shredded carrots, sliced cucumber and delicious grilled chicken.  This is a messy appetizer but a total home run in terms of flavor.<br&gt;<br&gt;The veggie pizza was missing its olives, and didn&amp;#39;t have enough goat cheese, but was delicious, despite this.  It was buttery and the veggies had great flavor.  I love the crust and it was cooked perfectly.  A nice dish.<br&gt;<br&gt;We sat at the bar and the service was solid, nothing spectacular, but we were taken care of, and enjoyed this visit.", "rating": 4, "date": "3/30/2008"}, {"text": "A lot of people hate on The Cheesecake Factory, but I love this place!<br&gt;<br&gt;The location at The Atrium Mall is usually busy, but I have never had to wait more than ten minutes to get seated.  Also, the free parking in the Atrium garage is great.<br&gt;<br&gt;I have never had a bad meal at Cheesecake, everything I have ever ordered there I have really enjoyed...the chicken piccata, thai lettuce wraps, buffalo wings, and spicy chicken chipolte pasta are my favorites.", "rating": 4, "date": "1/7/2009"}, {"text": "i used to think the CCF was a quality spot,   good service, great food ...... no more.  After the last three times, I will not be going back.  Each time, the servers are slow and seem completely overwhelmed, even though I go at slower times.  Once seated, the slowdown begins,   10 minutes or more to see a server.  then you order,   slow slow,slow  Last time, the food came out about 30 mins later, and some of the orders about 15 minutes after that, and some, were never even put in to the kitchen,   The food is ok, once it comes, nothing great. so the service really makes it not worth the visit.<br&gt;Oh well,   no more CCF", "rating": 1, "date": "11/26/2012"}, {"text": "We&amp;#39;ve eaten at many Cheesecake Factory Restaurants, and the food is always pretty good. Unfortunately this time, the food was good, but the service was horrible. Table of eight... server brought one bread basket... had to ask for another. Orders came out of the kitchen erratically... two, then three, then one, then two... over a period of several minutes. I had ordered a salad instead of the fries with my burger (nothing special, it&amp;#39;s offered that way on the menu). I was half done with the burger, when the salad arrived. Also had to request and wait for condiments for the burger. Mustard and ketchup should automatically be brought with a hamburger. There were mistakes with one or two of the other orders, as well. I think I&amp;#39;ll pass on this C. F. outlet in the future.", "rating": 2, "date": "10/19/2015"}, {"text": "Plan to celebrate my kid&amp;#39;s birthday and know that it is Father&amp;#39;s Day, so I call ahead to reserve a table. I was told no, they don&amp;#39;t do reservation. I asked if no reservation because of Father&amp;#39;s Day. They said no, they don&amp;#39;t do it. What kind of business or service is it! So only ONE star to the service. No knowledge about food.", "rating": 1, "date": "6/11/2014"}, {"text": "The food was good which is why is refused to give one star. The service was non-existent. This is the second, and last, time I will come to this location. The server, Sarah, was either high or had failed to get any sleep for the past few days. We sat for the majority of the meal with empty water glasses waiting for ordered drinks that never came. She was hanging out at the bar for at least 10 minutes. It&amp;#39;s beyond me how such a dramatic shift in quality could occur when the location moved to the other side of the street but it really is beyond appalling. What a shame.", "rating": 2, "date": "4/20/2015"}, {"text": "Food was fine. I got a chicken quesadilla.  Great. I ate two of four pieces and left a bunch of salsa, sourcream and more than half my guacamole on the plate. I then made what turned out to be a big mistake by letting waiter box the meal. I figured it was pretty obvious that when I get something boxed to go, I&amp;#39;d like everything I paid for in that box.  If its on the plate, it goes in the box. Low and behold I get home and I have two triangles of quesadilla, yet nothing to dress it with. I don&amp;#39;t keep guac in my fridge sorry. Nor do I have fresh pico de gallo laying around. Usually have sour cream, but naturally, I don&amp;#39;t now. When somebody asks you to box their meal, put everything in that freakin box. That seems obvious to me but maybe my expectations are out of whack, I don&amp;#39;t know. I do know that I&amp;#39;m home and hungry and disappointed at how miserably plain my quesadilla is about to taste. Rant over.", "rating": 2, "date": "4/26/2014"}, {"text": "Great restaurant. Portions are huge, so while it may be a little pricey, you definitely can take your food to go and eat it the next day. They don&amp;#39;t take reservations, so you may need to wait a while on weekend nights. appetizers are great too, and the bread they bring it is phenomenal. I&amp;#39;ve ordered drinks from their bar too which were made very well (strong). Service is usually pretty fast and always very professional.", "rating": 4, "date": "7/12/2014"}, {"text": "I happen to be a big fan of the cheesecake factory.  I love the food, the menu, the ambiance.  I decided since it was a holiday week to take my kids out with my friends at 8 PM....Well, it took them an hour to seat us...Just as they did, our waitstaff switched....The food was just ok...I ordered the avocado  rolls..I love them!  However, my friend ordered the salmon with asparagus, which was very thick....not very appealing.", "rating": 3, "date": "5/25/2014"}, {"text": "Best chicken picatta EVER. Nice, clean, relaxing atmosphere... Server was super nice. Will be going back ASAP!", "rating": 5, "date": "7/18/2014"}, {"text": "Love the Cheesecake Factory - huge portions, reliably good food and it has sentimental value for me &amp;amp; the bf.  That said, the waiters at this one are a little weird sometimes.   One time we had a waitress who literally yelled at my boyfriend for taking a (really important) phone call in the middle of the meal and told him to stop being rude and pay attention to me.   Nice sentiment, but sometimes it is necessary to take a call and your girlfriend understands....  After the phone call was finished, she asked him what it was about.   Um....what?  Who does that?  What if someone had died?   We just laughed it off obviously, but how awkward would that have been if we had been on a first date or meeting for business?<br&gt;Another time I had put my coat on the bench beside me, because they don&amp;#39;t have coat racks, and the hostess (kinda rudely) asked me to move it and then looked at me like I was absolutely PSYCHO when I asked her if they had a coat rack I could put it on.    (Answer: they don&amp;#39;t, which is sort of weird in and of itself).<br&gt;Also one time a crazy French lady kept trying to come into my stall in the bathroom even though I was telling her over and over again that someone was in there, and then when I came out she said she was sorry and that she doesn&amp;#39;t speak very good English.   But presumably she could still hear the VOICE shouting from within the STALL, no??   Do people share bathroom stalls in France?  Anyway that&amp;#39;s not the restaurants fault, but it seems I keep having weird experiences at this CF location.  <br&gt;So yeah....good food, good atmosphere, free, convenient parking at the Atrium, but some of the staff and customers are a little weird.", "rating": 3, "date": "12/20/2009"}, {"text": "I dunno what it is with me, maybe I&amp;#39;m as big of an asshole as I claim to be, I hope not.  However, when I order orange chicken I don&amp;#39;t expect to bite into a piece of metal.  I don&amp;#39;t know what it was exactly other then a piece of metal maybe a rivet?  When I told the manager he said he could comp my dish and give me a new one.  I was like are you kidding me man I don&amp;#39;t think I&amp;#39;m going to risk it.  In the end we had to pay for our entire meal which is complete BS.  I should have sued!!!!!<br&gt;Another place I give -1000000 Stars.<br&gt;<br&gt;This place is so mediocre metal aside why do people go here, wake up!", "rating": 1, "date": "8/27/2008"}, {"text": "Good food. I cant believe I didnt even try the cheesecake!  Its OK though, the icing goes right to my thighs anyways.", "rating": 4, "date": "11/14/2006"}, {"text": "We had the worst restaurant experience last night. I am still mad after &amp;#34;sleeping-on-it&amp;#34;.  We took my daughters and a friend to dinner last night.  We got to the restaurant at 6:30, sat at our table at 7:30.  We ordered two burgers, a pasta, a salad, and a steak dish.  While we were waiting for our food, the waiter dropped off 5 pairs of chopsticks for us, which got us all confused since we don&amp;#39;t see any of our food will require chopsticks.  That to us, was racism (as we are an Asian American family) disguised as service. I am really mad that my kids had to encounter this. After complaining to the manager, he immediately took the blame and offered us a small gift card to apologize.  He said some other table in our area asked for chopsticks, but we can&amp;#39;t find anyone around us who would have used chopsticks for their meals. When the waiter came back, he took the chopsticks away without saying anything. We got our food at 8:30 and my medium steak was so burnt and dry that I can&amp;#39;t help but think it was revenge. When the waiter came back and asked how everything is, before I could get a word out, he said &amp;#39;That&amp;#39;s great&amp;#34; and left.  So, should I go back to this restaurant again?  If I don&amp;#39;t, the waiter probably had gotten his wish and he doesn&amp;#39;t have to serve &amp;#39;us&amp;#39; again.", "rating": 1, "date": "10/12/2014"}, {"text": "i love this place, really fresh drinks there, food was excellent as well, but service sometimes was really slow , that&amp;#39;s why only 4 stars, anyway, I&amp;#39;ll be back for sure!&amp;#34;", "rating": 4, "date": "6/9/2016"}, {"text": "blah.<br&gt;too crowed, too disney, too much mediocre food.<br&gt;although the bartending at a couple of these things is pretty good.", "rating": 2, "date": "6/22/2007"}, {"text": "Overall I had a HORRIBLE experience at this particular Cheesecake Factory from beginning to end. I will never return. When we arrived we were told that there was going to be a 15-20 minute wait, and we ended up waiting for 40 minutes. When we were finally seated it then took about 10 minutes for our waitress to even come and take our drink order. When she took our drink order it took about another 15 minutes for her to then bring them to us. By the time she returned we were ready to order both our appetizers and entrées. Our food took about 30 minutes to come out, and when it did it was lukewarm, and very dry. Our waitress barely came over to our table to check in with us, and when she did she would forget things that we had asked her for. After the horrible meal we ordered dessert, since that&amp;#39;s what The Cheesecake Factory is mostly known for. After ordering it then took another 20 minutes to receive our already made desserts. This may have been some of the worst service and food I have had at any Cheesecake Factory. We walked in at 2:10 and didn&amp;#39;t finish eating until 4:45 due to the horrible service. I wish I had decided to go to Besito next door. I had a wonderful experience there the last time I went, and the food was amazing. AVOID THIS LOCATION OF THE CHEESECAKE FACTORY!", "rating": 1, "date": "2/28/2016"}, {"text": "Eating a slice of tiramisu cheesecake from The Cheesecake Factory is one of the most paradisial experiences one can have here on Earth.  It&amp;#39;s right up with reaching out to touch Noam Chomsky&amp;#39;s elbow in Hutchins Hall at the University of Michigan.  Yeah, that good. +5 stars for the tiramisu alone.<br&gt;<br&gt;They didn&amp;#39;t stop with a good thing though, they had to drag it out.  <br&gt;<br&gt;Although you can always expect to get some, well get a lot, at the Factory.  It&amp;#39;s almost guaranteed that the gettin&amp;#39; is not any good.  So you are left with the decision:  get a lot  you don&amp;#39;t really enjoy at the Factory or get a little you really enjoy elsewhere, for the same money.   I am down with the school of Romantics, I want it  (my food) good and intense, and the duration is of no importance.   <br&gt;<br&gt;- 2 stars for wasting resources in abundance by making such crappy food.", "rating": 3, "date": "8/18/2008"}, {"text": "I only chose 1 star because they wouldn&amp;#39;t let me do 0 stars... I am completely disgusted with this place. The last few times I have ordered takeout they have messed up. I WILL NOT be returning. Tonight&amp;#39;s escapade: I place an order for 3 entrees and a child&amp;#39;s mac n cheese, I get home and the 3 entrees are there but no mac n cheese. I call to let them know and the manager named Alex agrees with me that the service is terrible and says he will make a new order...fine I go and get it because my daughter needs dinner. When I arrive to pick it up he is waiting with my $7 and change for the missed mac n cheese and barely and apology. He then says if the last few times have been so bad, &amp;#34;why do I bother coming back&amp;#34; his words exactly. At this point I no longer will be. Cheesecake Factory get your shit together and train your staff on how to be inn a customer service industry. FYI: if they screwed up for me the last 4 times, how many times have they screwed in between for other people???", "rating": 1, "date": "1/5/2016"}, {"text": "Always a long wait to get in but I love the Chicken Farfalle. Its so good!!", "rating": 4, "date": "1/8/2007"}, {"text": "My wife and her sister have gone to this place a few times and of course, I ended up going at one point. The always raged at how big the salads and portions are but frankly bad food doesn&amp;#39;t taste any better just because there&amp;#39;s a lot of it. The only food item I&amp;#39;ve eaten there that was any good was a salad (I forget the name of it) that had roasted beets, walnuts and goat cheese in it. I should have stopped at that but it was the last item I&amp;#39;ve had there that was even semi impressive.<br&gt;And, once again the high corporate think tanks seem to feel that cramming folks into tables for two, side by side is efficient. Well, that might be the case but I really don&amp;#39;t want to hear conversations with strangers that are sitting 2 feet from me. Side by side tables are a joke. There is nothing &amp;#34;French&amp;#34; or cute about it. If you are into chain restaurants (You should ask yourself WHY? if you are) than this might be up your alley, though a cramped alley it may be.", "rating": 2, "date": "6/14/2009"}, {"text": "Chicken and biscuits to the FACE. This places chicken and biscuits are Grrrrrrrrrrreat. If you&amp;#39;ve never had them then swing by and get them here. I mean pretty much anything you get at a cheese cake factory is going to be awesome but thats just a dinner you cant get at to many places and they are doing it right. I almost always leave with leftovers too because the portions are for a small army. Besides the food the wait staff is great too always had a friendly knowledgeable person willing to throw in some insight and make the meal better. The desserts.... obviously amazing. There is a chocolate cake there that a slice of it is about the size of a small child, chocolate overload. It also doesn&amp;#39;t hurt that because of its location within the mall there is always a great array of hotties in or around the restaurant and the waitress staff isn&amp;#39;t to shabby either. Go find out for yourself.", "rating": 4, "date": "6/20/2009"}, {"text": "The Cheesecake Factory has just started having Happy Hour from 4-7. The menu items range from $4 - $6 and include some great choices. I go for the avacado spring rolls and the chopped salad. With prices like this, you end up making up for it in drinks -- these places know what they&amp;#39;re doing. ;^)", "rating": 4, "date": "3/11/2008"}, {"text": "This cheesecake factory was just okay! I think the food is not as good as other locations!", "rating": 3, "date": "8/24/2010"}, {"text": "love the Cheesecake factory.  The one in Natick is probably my favorite due to the size (very spacious).   The Ahi tempura rolls are top notch.  As are the Avocado egg rolls.  Their cobb salad is one of the best out there and the lunch portion is large enough to feed two.  Their portions are just enormous.  Wasnt so crazy about their chicken club, the chicken was too thick but everything else I  have had here is great.  The decor is realy pretty I think, very Californian, I disagree with one of the previous people saying it was cheesy, its not very New England but not cheesy. It is a breath of fresh air compared to all the family style dining around MA. They have great drinks and of course desserts.  The tiramisu is great.", "rating": 4, "date": "12/14/2008"}, {"text": "food is always great at any location but service can be hit or miss... this place is a hit", "rating": 5, "date": "6/9/2015"}, {"text": "The food at all the Cheesecake factories taste the same, so I will not rate the food.<br&gt;<br&gt;What I am rating here is the terrible and horrible service. From start to finish everything is slow. My sister called in to make reservations for 13, Saturday night at 7:00PM. The manager there Stacy, made an exception for us so we had &amp;#34;reservations&amp;#34;. I checked in at the front desk and told them i had reservations....for 7:00PM. I was told it&amp;#39;ll be a 30-45 minute wait. But wait...don&amp;#39;t we have reservations why would we have to wait? Apparently no one at the front desk knew Stacy had made this exception. And finally when Stacy did realize we were there and checked in....we&amp;#39;ve been waiting for a good 20 minutes already. 7:20...7:30...7:45..8:00....we did not get seated until an hour after our FAKE RESERVATIONS! This is unacceptable. A table of about our size gets there at 7:45 and they get seated before we do. Terrible! Either take reservations or don&amp;#39;t! Because my family would&amp;#39;ve happily went elsewhere and made REAL RESERVATIONS so we didn&amp;#39;t have to wait an hour to eat.<br&gt;<br&gt;I&amp;#39;ve had bad experiences at this specific location before and normally they offer complimentary slices of cheesecake to make up for it, but we didn&amp;#39;t get didly. It was my grandmother&amp;#39;s birthday atleast send out a special slice for her! nope nada.<br&gt;<br&gt;Don&amp;#39;t come here unless you have time to chill at the cheesecake factory. Plan to spend an hour waiting to sit to down and then another 30 minutes for your food, and then another 30 minutes just trying to flag your waitress down for the bill.", "rating": 1, "date": "5/23/2012"}, {"text": "It&amp;#39;s not easy to give such a low rating to a seemingly fancy restaurant like Cheesecake Factory - but I am telling you that this particular one I went to is not quite the great place to eat as people may have imagined. I went there with a group of friends, and their food is ... &amp;#34;okay-ish&amp;#34;, definitely disproportionate with its price level and sophistication of its decorations. Maybe they have great cheesecake, but other food items are not to be praised", "rating": 1, "date": "9/3/2010"}, {"text": "Came here this past Sunday for Brunch this past Sunday (09-02-12). I have to say, service was pretty bad. We were seated promptly and things just went down hill from there. We placed our orders for drinks and food. Our food didn&amp;#39;t come out in time, which we didn&amp;#39;t mind at first, until we realized that the party that came 15 minutes after got served their drinks, bread, and food before us. Our server seemed careless, forgetful, or she just didn&amp;#39;t care much. We politely reminded her about the bread on 4 separate occasions, but it didn&amp;#39;t come out until after our entrees were served. Meal was okay, not great or memorable, I&amp;#39;ve had better at different locations. I wasn&amp;#39;t irritated until I politely made a suggestion to the manager that his servers need to memorize things a little better. His reply was a simple &amp;#34;okay&amp;#34; and just walked away. No wonder why the rest of his staff seemed careless, because the manager didn&amp;#39;t care. Perhaps the reason is because they know the location is closing down, but it doesn&amp;#39;t excuse the service we received, I expected better service from an established restaurant such as this. Disappointed and won&amp;#39;t be returning.", "rating": 1, "date": "9/3/2012"}, {"text": "Well what can I say, this place is to die for..<br&gt;The &amp;#34;Happy Hour&amp;#34; menu of $4-$6 is a great gimmick, the drinks push the bill to a higher $$ but hey the food makes up for that, and of course<br&gt;<br&gt;THE CHEESECAKE IS WHATS ITS ALL ABOUT....<br&gt;Definitely recommend everyone to go and get a slice of heaven,<br&gt;Cheesecake heaven that is...<br&gt;Place was packed and was told the wait was about 30 mins, well I and 3 friends were seated in 20 and the waiter was quick, friendly and on his game.<br&gt;He worked hard and earned a very good tip for the great service.", "rating": 4, "date": "12/9/2009"}, {"text": "We are regulars at the bar. I really like the salads here. Nice and easy atmosphere. The Bartenders are so Awesome here.", "rating": 5, "date": "1/8/2013"}, {"text": "can&amp;#39;t go wrong with going to this place<br&gt;people are friend<br&gt;service is pretty good<br&gt;love their crab cakes and their shrimp pasta<br&gt;favorite cheese cake is the brownie sundae cheesecake", "rating": 3, "date": "3/5/2012"}, {"text": "if you are gluten free, or suffer from celiac, stay away from cheescake factory.  had fries last week and pasta this week with terrible results.  either they got the order wrong (they claim this is not the case) or there is contamination in the kitchen. either way, if you want to have digestive issues go here, if you want to enjoy your dinner go to one of the other places nearby.", "rating": 1, "date": "7/9/2014"}, {"text": "The food is great - lots of flavor, huge portions.  Prices are moderate, but well worth it for the quality of food you get.  Dishes are creative, a good variety of cuisines.  Decor is lovely.  Great places to get together with friends.  One down side at just about any location I&amp;#39;ve been to - long waits (30-45 minutes).  Get used to the buzzer, it is your friend when you go to this chain.   Btw, even though it&amp;#39;s a chain, I would consider it to be on a step above the regular chain restaurant (I tend not to like those too much, although I will still eat there).  We are usually too full for the actual cheesecake, and I would say I&amp;#39;m not even a cheesecake fan.  It is good though, tons of varieties of course, and very sweet and filling.  Lots of people take half a slice to eat, and the other half to go, because it is so large.", "rating": 5, "date": "2/8/2008"}, {"text": "I haven&amp;#39;t gotten take out from Cheesecake in while--tonight I remembered why.  I got the Baha Chicken Tacos.  They&amp;#39;ve obviously changed the recipe--the chicken pieces were rubbery and now covered in some kind of bitter brown sauce.  Instead of fresh salsa, sour cream and guacamole I got---absolutely nothing.  Even the tacos were thinner and fell apart easily in the oily sauce.  The tacos were accompanied by the saltiest beans and rice I&amp;#39;ve ever tasted.  Really--it tasted like someone upended a salt shaker into my side dish!  For the price, it&amp;#39;s just not worth it!", "rating": 2, "date": "11/27/2011"}, {"text": "Tried a new desert called Factory mud pie -- fantastic chocolate cake, scoops of vanilla and coffee ice cream, whipped cream (theirs is the best - but I asked for just a little), a cherry, and a side serving of incredible chocolate sauce. Ridiculously delicious. I&amp;#39;m going back for it as my valentine&amp;#39;s chocolate treat. I enjoy this location best of the many locations I&amp;#39;ve tried. Just fun and almost always a great experience.  Feels like a party.", "rating": 5, "date": "1/8/2008"}, {"text": "Tried brunch at Cheesecake Factory. Very disappointed. Waitress messed up the order. The restaurant was a mess. The brunch menu seemed like a real afterthought.", "rating": 2, "date": "12/16/2007"}, {"text": "So we went to the Cheesecake Factory again for a friend&amp;#39;s birthday.There were 19 of us so we decided to split the check. The food was good but our waiter didn&amp;#39;t know how to split up the check and we waited 45 minutes while he tried to do it, over and over again. Finally we settled up and our party was short $5. I told them that after waiting almost an hour to be rung up we were wondering if we could just call it even, and they FOUGHT us on it .  I HOPE I NEVER HAVE TO GO THERE AGAIN AS LONG AS I LIVE!", "rating": 1, "date": "5/1/2011"}, {"text": "We went last night for dinner. The place was empty, and we were seated immediately. And we sat for a good 20 minutes before anyone acknowledged us. A waiter asked if we&amp;#39;d been helped, and when we said no, he said someone would be right with us. About 10 minutes later, we got a waitress. She kept talking to us like we were little kids (my mom&amp;#39;s in her late 40&amp;#39;s, and I&amp;#39;m 27-not exactly kids). We ordered, sipped on our drinks (mint green iced tea-yum!), and they were empty in no time. And they stayed empty. The waitress never came back to check on us. When they brought our food, she finally asked if we wanted more drinks. The 2nd was really watered down. The food was good, but not real flavorful. My chicken romano was huge (I had enough left over for lunch today), but my mom&amp;#39;s shrimp scampi was smaller, and more expensive. We didnt order cheesecake (we really didnt want to raise the bill before calculating her tip), but we looked at the case on the way out. The waitress kept glaring at us. The cheesecake server was making coffee or something and kept ignoring us. We&amp;#39;d decided to get a piece to split later, but she never came over to help us. We left without cheesecake. It was sad.", "rating": 2, "date": "4/28/2009"}, {"text": "While the food at cheesecake factory is always delightful, this particular cheescake factory had something else....BAD SERVICE. If this is the one I think it is (in the prudential center) they have the worst hostesses (sp?) out of any place I&amp;#39;ve seen!  First of all, there&amp;#39;s probably about 10  of them and none of them can do their job right apparently.  When they call out names of parties, they call them once and sometimes too low to hear! Such was the case when my family went, I thought I heard our name being called. I went up to ask if it was our name...they couldn&amp;#39;t look to see what the last name was called, they just said we had to wait a few more minutes.  It literally took almost an hour wait when they told us 20 minutes.  This happened a few more times and even one of the many hostesses said we were the next up.  We weren&amp;#39;t.  So we were about to march out of there when we were FINALLY called.  Service was better after that but WOW, those hostesses need to learn how to do their job.", "rating": 2, "date": "9/20/2010"}, {"text": "the good thing about cheesecake factory is their huuge menu, large portions and excellent service<br&gt;<br&gt;i think the only downside was a typically long wait because the restaurant is so busy! everytime i go there is a long wait for a table. I have been to the cheesecake factory in the cambridge galleria, natick collection , atrium mall and prudential mall. all locations lived up to the restaurants great reviews", "rating": 3, "date": "7/5/2011"}, {"text": "My friend and I were super excited to go to Cheesecake for dinner, since we have had great experiences at the one by the Prudential in Boston. When we got there, we waited for 5 minutes at the host stand, before being given the &amp;#34;1 minute&amp;#34; finger.<br&gt;The restaurant was empty..but we were seated at an awkward 4 person table in the middle of the room. When my friend asked to switch to a booth, she was told everything was &amp;#34;reserved&amp;#34;. Sidenote: All the booths were empty for the duration of our meal.<br&gt;Our waiter took 5 minutes to come over to us. And another 10 to take our order. Salads reeked of fish and were DROWNING in dressing. We ordered Sweet Potato Fries- Mcd&amp;#39;s style with too much salt. Also, the &amp;#34;fried mac and cheese appetizer&amp;#34;... I thought I was at Cheesecake Factory, not Sonic.<br&gt;We were thinking about dessert, since we were just SO disappointed with our meal and didn&amp;#39;t want to leave on a bad note. But after waiting for him to bring the dessert menus for another 20 minutes, we decided we needed to get out of there.<br&gt;We got a cheesecake at the bakery counter- Chocolate Chip Cookie Dough. Oh, and no mention of the fact it was full of pecans.<br&gt;The music was WAY too loud, the crying baby ruined the appetizer, and our waiter was just creepy with a retainer. <br&gt;Almost makes the 12 dollar parking at the Prudential location worth it.", "rating": 1, "date": "3/1/2011"}, {"text": "How can you not like a restaurant that serves cheesecake?  The portions are huge and the service great!  Again, how can you not love cheesecake at the end of a meal?", "rating": 4, "date": "7/4/2010"}, {"text": "I grew up in Chestnut Hill and have been to this Cheesecake Factory a few times. Overall it&amp;#39;s been ok from what I remember ten years ago. The last time I went there was a couple of years ago with my sis and it was quite a baffling experience. We were seated quickly and given menus. However, although we saw a waiter attend to all the customers immediately around us, he never once came to my table. My sis and I waited 45 minutes for service, watched the people around us being attended to, while we were blatantly ignored. I don&amp;#39;t want to jump to conclusions, but I will say that the only difference between us and all the patrons around us were that we were the only visible minorities. Anyway, I spoke briefly with the manager about what the rules of his establishment were in terms of who could be served and who could not be. He gave some insincere apology about what happened to us and offered to send gift certificates for us to return. It was pretty clear that he couldn&amp;#39;t care less about our experience and in fact we never saw those gift certificates. My advice: If you&amp;#39;re black, Latino, Indian, Asian, or any other minority, don&amp;#39;t bother with this place. You&amp;#39;ll get much better treatment just about anywhere else.", "rating": 1, "date": "7/31/2012"}, {"text": "huge menu, great selections of foods and portions. no matter what you&amp;#39;re craving they have it.  good for all meals and the prices are very reasonable.  i love the bread they serve with the meals and haven&amp;#39;t ordered anything that i havent liked. it&amp;#39;s a regular place for us and we always leave full with doggie bags.  the wait can be tough so be sure to get there when your a little hungry but not starving. you might pass out from the wait but if you plan correctly it&amp;#39;s totally worth it.  get some cheesecake to go! it&amp;#39;s amazing.", "rating": 3, "date": "1/18/2009"}]}