{"address": ["5065 Main St", "Space 314", "Trumbull, CT 06611"], "monthly_reviews": {"2019": [[0, 4.0], [1, 3.5], [2, 3.0], [3, 2.5], [4, 3.0], [5, 3.0], [6, 2.5], [7, 2.0], [8, 2.5], [9, 2.5], [10, 2.5], [11, 3.0]], "2017": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 2.5], [4, 2.5], [5, 3.0], [6, 2.5], [7, 2.5], [8, 2.5], [9, 2.5], [10, 2.5], [11, 2.5]], "2020": [[0, 3.5], [1, 3.5], [2, 4.0], [3, 4.0], [4, 4.0], [5, 4.0], [6, 3.5], [7, 3.0], [8, 3.5], [9, 3.0], [10, 3.0], [11, 3.0]], "2018": [[0, 2.5], [1, 2.0], [2, 2.0], [3, 3.0], [4, 2.5], [5, 2.5], [6, 3.0], [7, 2.5], [8, 2.0], [9, 2.5], [10, 2.5], [11, 3.0]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "I took my little cousins out for a pre-Christmas dinner after a long afternoon of shopping. As we were getting seated, we were offered the seating area which individual chairs which obviously was not a good seating selection for little kids. I asked for a booth &amp;amp; the hostess sort of shrugged and begrudgingly gave us a booth. She was acting like it was a full house &amp;amp; my seat selection would be deducted from her check, sigh. Anyways, I ordered the Jamaican shrimp, rice &amp;amp; plantain, while the kids got pizza. My meal was very delicious which shocked me because it was a Jamaican dish being prepared at a chain restaurant. I will definitely good back again &amp;amp; order the same meal.", "rating": 3, "date": "1/2/2019"}, {"text": "Sorry to say I see what the negative reviews are about.  The quality of the food is completely awful.  Both our orange chicken dishes and miso salmon.  I won&amp;#39;t detail but for once am actually going to contact the Manager about the food quality we were served.   Ten years ago Cheesecake Factory had great quality entrees, along with huge portions and good, fresh bread.  Even the bread tasted stale.  They also shrunk the portions big time, not that it mattered because the food wasn&amp;#39;t really edible.<br&gt;The pumpkin cheesecake and ice cream sundae still tasted very good.  Go for dessert!", "rating": 1, "date": "9/10/2018"}, {"text": "The cheesecake factory never ceases to impress. What about lunch, dinner, or a Sunday brunch I am usually very please with the food and the service. Today was no different. After a little while in the mall for holiday shopping, we went here for a quick lunch. I started off with a chicken tortilla soup which had a great taste and a slight kick. My wife had her favorite lettuce wraps, and I had southern grilled chicken sandwich. Everything was tasty, and our service was great. I expect nothing less", "rating": 5, "date": "12/6/2018"}, {"text": "The buffalo blasts and egg rolls are our favorite appetizers. The fried mac &amp;amp; cheese balls are very good as well. Plenty of dishes to choose from. Staff was very friendly.", "rating": 5, "date": "9/12/2020"}, {"text": "Usually a hit or miss. Last night was a total miss. We were given a waitress who was on break (says staff) and covered by another. Food was good, I got one of the breaded chicken dishes with asparagus and mashed potatoes and my bf got the pasta neopolatano which he really liked (sauce on the side because he doesn&amp;#39;t like mushrooms). He liked the mix of meats in it. We also had a small app of Nashville chicken nuggets that were spicy and had pickles with them. So good. Reason why 2 stars is because with the waitress swapping, my bf got his dinner and nearly finished it (he cant wait and he didn&amp;#39;t want it to get cold) and I didn&amp;#39;t get my dish til a good 15 mins later. Kind of sucky just to be sitting there waiting for food while our partner is delivered his much sooner. Not cool. And why would we get a waitress who was on break?", "rating": 2, "date": "1/6/2019"}, {"text": "No complaints about the food, everything was delicious. We timed it right with no wait, even on a Saturday night. The service was pretty quick up until after our food came, but the manager did not hesitate to step up. He wrapped our leftovers and reassured us our dessert would be out shortly. If it wasn&amp;#39;t for him, our experience could have quickly turned poor.", "rating": 4, "date": "6/10/2019"}, {"text": "The meal itself, was fulfilling! 5 star if you&amp;#39;re a fried Mac n cheese kind of person this burger is for you as the cheese melted down  with just one bite. And it&amp;#39;s huge even to close. Now the avocado by itself I would give a 2 star maybe even less, it wasn&amp;#39;t fresh, had no flavor besides the avocado being weirdly hot, the inside was soggy and the outside was cold and hard a lot of weird texture combinations and hurt my stomach afterwards. :( so it was half good half bad depending what you get", "rating": 3, "date": "2/2/2020"}, {"text": "CF is a chain Restaraunt with the largest menu I have ever seen .  <br&gt;The good : Been here multiple times with family, we have never had a bad meal. My favorite is the grilled fish tacos but my family orders lots of other things and they&amp;#39;re always pleased with the food. The desserts are wonderful and their carrot cake is my favorite. <br&gt;the bad : the noise level is deafening, I actually have to use earplugs or I won&amp;#39;t go   Cocktails are expensive and often just awful. I no longer order a mixed drink here. <br&gt;The ugly: it&amp;#39;s too hard to stay on diet", "rating": 4, "date": "5/23/2019"}, {"text": "The service is great, the waiters are very kind and fast. The food is absolutely terrible. I&amp;#39;ve been eating here for a number of years and have not ever had just disgusting food, ESPECIALLY NOT FROM CHEESECAKE FACTORY. My pasta was inedible but my girlfriends was dry and bland. This will be my last time eating here.", "rating": 2, "date": "8/12/2020"}, {"text": "I love everything about the Cheese cake factory except their huge lines (I wish they took reservations). Trumbull is quite far for me plus the calorie listing against all my favorite dishes gives me chills, so I am not a regular. But whenever I am so happy and want to eat something I really like, this is my go to place. I love their margaritas, corn cakes, avocado egg rolls, veggie burger, Mexican dishes and above all cheese cakes. My husband who is a meat/seafood lover likes those too.", "rating": 4, "date": "9/5/2018"}, {"text": "Too many choices on the menu - turned off by the pic with the maggots in the food. They did add the peas to the Mac and cheese when I asked which was nice and the avocado toast had a great taste.", "rating": 1, "date": "4/7/2019"}, {"text": "Ive been to other locations numerous times. We stopped in early evening. It wasnt crowded so tgeir was no wait (Tuesday). Our waitress was great, she told us the specials and then went to get us bread. We had the spinach artichoke for an app...no flavor what so ever. I ordered a hamburger with fries medium well. Since I&amp;#39;ve never had a burger here before I said why not. The burger was cooked perfectly the fries were great. I had to wait a while for more ketchup because it wasnt enough. My sister had the blazin shrimp (I think thats what it was called). There was nothing fancy or spicy about it. In fact the fried shrimp was soggy. No crunch. My sister ate 1 but felt bad about sending it back so she ate my fries instead..smh <br&gt;The place started to fill up a bit and we just couldnt get a hold of our waitress. We wanted dessert and the bill. About 10 mins later we took our dessert to go and paid our bill<br&gt;For dessert I had the red velvet cheesecake and my sis had the lemon raspberry cheesecake. Both were great....2 stars for the shrimp, spinach artichoke dip and the wait for ordering dessert and getting the bill.", "rating": 2, "date": "1/25/2018"}, {"text": "This place is usually great. Most of things on the menu are good.<br&gt;<br&gt;I kept looking at the shepherds pie on the menu. Decided to order it last night. After all, its a simple<br&gt;dish......what could go wrong?<br&gt;<br&gt;The meat was dumped into a fancy plate and covered over with mashed potatos. Again....what would be expected as its generally homestyle anyway.<br&gt;<br&gt;The disturbing part is that the meat was very oily and just not good. Meat literally sitting in a pool of oil. I had a few bites and I felt sick. Just a gelotonous mess. Felt sick all through the night. <br&gt;<br&gt;Note to self: Stick with the things they advertise as being their &amp;#34;specialties&amp;#34;.......don&amp;#39;t venture off to other things no matter how simple you think the dish sounds.", "rating": 3, "date": "11/30/2019"}, {"text": "This is just a regular old Cheesecake Factory. The dim lighting is kind of annoying but other than that it&amp;#39;s fine. The staff is friendly and attentive and the menu is extensive.", "rating": 3, "date": "4/26/2019"}, {"text": "Not worth a 45 minute wait to get called, then 15 minutes waiting for someone to show us to a table then almost 20 minutes to get someone to take our order. Spent $100 for 3 people and personally, my food wasn&amp;#39;t that good. My cheesecake was not good at all and that  was a surprise because I&amp;#39;ve had their cheesecake before and it was good. Maybe it&amp;#39;s time to take The Cheesecake Factory off my menu.", "rating": 2, "date": "9/14/2019"}, {"text": "I&amp;#39;m a little shocked by all the low star reviews of this place! It&amp;#39;s a Cheesecake Factory! They have a certain standard of food and quality and this place certainly meets it! Arriving on a Saturday afternoon at about 1PM, I didn&amp;#39;t have to wait for a table and was seated right away. Our waitress was awesome! She came by right away to take drink orders and kept my water glass filled throughout lunch without me having to ask. She stopped by several times to make sure everything was okay and I never felt like I had to hunt her down. I had the salmon kale salad and my husband had the poke. I especially enjoyed the tart salad dressing and garlic almond cream topping on the salmon. My husband thought the poke was ok. It had a slight gingery taste which he did not enjoy. I also had the passion mint fizz (no alcohol) which had passion fruit, mint and soda water but I personally prefer the flavored lemonades more.", "rating": 5, "date": "9/29/2019"}, {"text": "My family and I came to The Cheesecake Factory for lunch on a Sunday. We were seated quickly at a large booth and were greeted by our waitress soon after.<br&gt;<br&gt;My dad and I both ordered the California omelet, my mom and Aunt both had lunch-sized salads (one Santa Fe and one Sheila), and my grandmother had the brioche French toast. Everything came out as ordered and everything tasted great. My 86 y.o. grandmother even told our waitress that it was the best French toast she&amp;#39;s ever had... it was pretty cute.<br&gt;<br&gt;The Cheesecake Factory is not my favorite restaurant and it certainly isn&amp;#39;t the best food in the world- but as far as chain restaurants in the suburbs go, our experience was pleasant, we had no issues with our service, and we all enjoyed our food.", "rating": 5, "date": "7/31/2016"}, {"text": "Friendly atmosphere. Great for diverse groups with picky eaters!  Something for everyone on the menu.", "rating": 5, "date": "1/30/2020"}, {"text": "Love it my favorite place the staff is amazing and the food is delicious and all prepared  in house.", "rating": 5, "date": "1/30/2020"}, {"text": "Fine restaurant and great looking on the inside. Service was also very good in my opinion. Food came out quickly, even though the place was very busy on a Saturday night. The food was fine, fresh ingredients as far as I could tell. Certainly on the pricey side and the food was not seasoned. I got the shrimp dish in a tomato sauce and my date got the fettuccine Alfredo (which unfortunately does not come with any meat, though it should). The bread was good, but not warm.", "rating": 3, "date": "3/12/2019"}, {"text": "FINALLY LOOKED DOWN AFTER THE 7th WING (after indulging in half cooked buffalo blasts,&amp;amp; wet pizza)! I think I&amp;#39;m going to DIE!!!! I waited 40mins for my food- isn&amp;#39;t that enough time to at least cook it?! What is happening to the CF we all know and love?!", "rating": 1, "date": "10/9/2019"}, {"text": "Sooo! I went back here after a 4 year hiatus, choosing the  Westchester location as my main go to spot. Can&amp;#39;t say I wasn&amp;#39;t disappointed again. I ordered a to go of (not to mention I waited 23 min on hold) of Thai lettuce wraps with charcoaled, sorry burnt chicken, with a juicy uncooked pink in the middle. The cheeseburger egg rolls were pretty good though. I also ordered something else I can&amp;#39;t remember that was good as well. Overall, be careful with the chicken, I re-cooked it at home. The sad part was they didn&amp;#39;t even offer a we&amp;#39;re sorry for putting you on hold so we&amp;#39;ll take 10% off. Nada.", "rating": 2, "date": "8/21/2019"}, {"text": "This is not the first time we have eaten at the Cheesecake Factory in Trumbull. <br&gt;<br&gt;The atmosphere is nice, friendly staff - all our needs were met, prices are within reason if you stay within the menu and do not order any extras, <br&gt;<br&gt;They also, offer a wide variety of food selections everything you can imagine (can get a little confusing); if you order the regular size meals they are quite big and well worth the price.<br&gt;<br&gt;We went on Tuesday afternoon for lunch and we were seated right away.<br&gt;<br&gt;This visit we ordered the Old Fashioned Burger and the Chicken, Mango, and Avocado salad which were both delicious. <br&gt;<br&gt;Other menu items I can recommend they are very good are: <br&gt;<br&gt;Thai Lettuce Wraps<br&gt;Fried Macaroni and Cheese<br&gt;Pork Belly Sliders<br&gt;Fried Calamari<br&gt;Avocado Eggrolls<br&gt;Chicken Pot Stickers<br&gt;Factory Burrito Grande<br&gt;Shrimp and Chicken Gumbo<br&gt;Fried Shrimp Platter<br&gt;Fish and Chip Platter<br&gt;Santa Fe Salad<br&gt;<br&gt;Needless to say, we have never tried their cheesecakes. They are a little pricy.", "rating": 4, "date": "4/3/2019"}, {"text": "I have been numerous times and I think the fact of the matter is: when there are so many options it&amp;#39;s hard to have specialties. Everything is just &amp;#34;alright.&amp;#34; I have tried many things and nothing blows me away. Interestingly enough the two menu items I did enjoy (Eggplant Parmesan and Falafel Salad) have been removed from the menu. I do enjoy the cheesecakes, however (Oreo and Hazelnut Crunch are faves). I should note: the service at this location is always very good!", "rating": 2, "date": "8/6/2019"}, {"text": "The farfalle was good but not worth $18.00!!! The place was empty on a Saturday night and now I know why, $9.00 for a piece of cheesecake, this isn&amp;#39;t New York", "rating": 1, "date": "6/24/2019"}, {"text": "The only thing good is the cheesecakes and the Mac and cheese balls , food is over cooked and greasy especially if it has to be fired  you will not any lotion  on you hands that day if you decide a fried item at this location , pass on it will be burnt . Very disappointing . I wanted to cancel the wings but I just sent the cheese burger egg rolls which came out greasy and burnt , my fingers was trying to drain the grease. Didn&amp;#39;t work", "rating": 1, "date": "3/12/2019"}, {"text": "Terrible!! I will never, ever return!! I DO NOT recommend!! Don&amp;#39;t wait your time or money. Cause it ain&amp;#39;t cheap either!", "rating": 1, "date": "5/27/2019"}, {"text": "Was a little Leary going in. I walked in to use the restroom while I waited and saw a lot of tables with barely touched food. Or burgers with one bite, but the table was empty. Usually these are not good signs. When we checked the reviews, we were even more skeptical that we would have a decent experience.  However since we were on a long road trip and I was absolutely starving I figure I would give it a shot, Cheesecake Factory never really gave me a problem in the past.<br&gt;<br&gt;All in all the food was okay, although a few misses occurred. The drinks took a while to come to the table. They ran out of bread, so we had to wait for that to be ready, and by the time it came out the main course was already put on the table. The second cocktail had some debris inside of the drink. In the fashion of &amp;#34;alcohol disinfects all&amp;#34; I just fished it out with a spoon and kept on trucking.<br&gt;<br&gt;Our waitress Emily was friendly and pleasant to work with during our visit. Her bright demeanor and happy and bright energy made the stay enjoyable.", "rating": 3, "date": "8/25/2018"}, {"text": "Cheesecake factory is usually hit or miss. This one is not for me for a couple of reasons. One is that it is quite noisy. Second is the atmosphere is to bland, meaning there is not much atmosphere, it&amp;#39;s just all noise and being in the mall doesn&amp;#39;t help since I am not a fan of this mall. Also I have a few friends who had a few bad experiences here, one with under cooking and over cooking of food. That was awhile ago but still. I have found that the quality of Cheesecake factories does vary from one to another even though it is a chain. I would not go back here.", "rating": 2, "date": "10/8/2018"}, {"text": "I eat here all the time and the food is superb.  I recommend the grilled salmon, steak Diane, or the chicken and waffles!!", "rating": 5, "date": "1/30/2020"}, {"text": "Words can&amp;#39;t describe the enjoyable atmosphere here, everyone has bright smiles and a good attitude. The spinach artichoke dip what outstanding it was a must try! I had the Louisiana chicken pasta (pictured with review) had a incredible bend of taste and spices. Furthermore our server Jennifer was out of this world I would recommend her when you visit, she was always checking in and making sure we had everything we needed.", "rating": 5, "date": "10/20/2018"}, {"text": "We came here on a Saturday night and there wasn&amp;#39;t much of a wait. I went with my favorite dish, the shrimp scampi. The noodles were a little clumpy, but it still tasted good. Our server Tatiana was very attentive. I took away a star because it irks me when restaurants calculate the suggested tip on the post tax amount. It belittles my gratuities and seems disingenuous to others who don&amp;#39;t know better.", "rating": 4, "date": "7/10/2018"}, {"text": "Cheesecake was great, but we got Filet Mignon and it was so salty we sent it back so my birthday dinner was ruined so we went to McDonald&amp;#39;s instead", "rating": 2, "date": "1/18/2020"}, {"text": "This review is from last Monday.<br&gt;<br&gt;Let me start by saying I&amp;#39;m not a fan of the Cheesecake Factory, only thought it to be over-rated, too hyped and expensive.  My wife, Mother-in-law and I were in the mall and decided to get a bite to eat. This place was close by, so we chose to eat here (even-though it isn&amp;#39;t not my favorite restaurant I went with the flow). Wasn&amp;#39;t busy so we were seated quickly, the restaurant was nicely decorated to create a relaxed atmosphere (not sure if all locations are the same within the CF chain).  Overall our experience was pleasant, we had no issues with our service, and we all enjoyed our food. Friendly staff, quick service, waitress was excellent.  I ordered the avocado egg-rolls and they were delicious!  <br&gt;<br&gt;I may give the CF another try in the future, before I become a fan though.", "rating": 4, "date": "4/15/2017"}, {"text": "One of our favorite restaurants!  Prompt service, great food, good drinks, not to mention the amazing desserts!  We got an appetizer and 3 entrees which was enough for the 4 of us to share and still have leftovers. Then (of course) 2 cheesecakes. Can&amp;#39;t resist!  We&amp;#39;ll be back!", "rating": 5, "date": "1/31/2020"}, {"text": "Our waitress totally exceeded expectations. It is rare now a days to get a server who really &amp;#34;gets it&amp;#34;. FINALLY. Thank you CRYSTAL for creating a very pleasant dining experience. She routinely checked up on us, answered any questions patiently and sincerely. There was no issues once-so-ever. Other than our A++ server, the food was great. Got the honey bourbon martini and was PERFECT.<br&gt;Lovely experience thanks to crystal and the very good menus.", "rating": 4, "date": "10/18/2018"}, {"text": "Came here for a nice dinner, and was seated in a bother behind three unruly teenage girl celebrating a birthday. The whole time we were eating the would bang on the window and show random passerby&amp;#39;s something on their phones. While we ate several young and older males came into the restaurant to talk to them. I went to complain and no one ever came and said anything to them and they continued to make noise and be disruptive. Finally our server came to the table and my husband said something to her. She told the manager but the paid their bill and left before anyone came and said anything to them. It&amp;#39;s not the first time I&amp;#39;ve been here but it most definitely will be my last as they staff and management don&amp;#39;t care about other customers comfort while dinning at their restaurant.", "rating": 2, "date": "12/26/2019"}, {"text": "This Cheesecake Factory is amazing! we came for my father&amp;#39;s birthday tonight and everything was fabulous. We started with an Asian pear martini for mom, spinach artichoke dip as an appetizer followed by crispy battered fish and chips for Dad, Madeira chicken pasta, and a garlic chicken pasta for mom. The service was prompt the food came out fast and was hot fresh andand delicious!", "rating": 5, "date": "4/4/2018"}, {"text": "Ordered through Door Dash.  Chicken Taquitos were delivered as Beef Taquitos, and the BBQ Ranch chicken salad came without BBQ Ranch dressing.  Called CF who put me on hold saying I had to talk to Bakery Manager.  After 5 minutes on hold was told I had to take it up with Door Dash.  This is not the first time they&amp;#39;ve messed up orders to go and it is very obvious that they couldn&amp;#39;t care less as they had no interest in trying to make it right or even hint at an apology of any sort.", "rating": 1, "date": "3/1/2019"}, {"text": "Came on Valentines Day , the wait was an hour . Not bad for V day. Very nice friendly waitress. Food  was delicious , my fav appetizers are the Mac and cheese balls and avocado rolls. To die forrrr! The bestttt. I Was disappointed with my entree, verryyyy small portion. I got the truffle honey chicken with mashed potatoes and asparagus.", "rating": 3, "date": "2/15/2018"}, {"text": "Good food.  Good service.  It&amp;#39;s not cheap but it&amp;#39;s not expensive.  <br&gt;<br&gt;You know what you get with Cheesecake Factory.  Their food is ****. One of the better restuarant around here.  Service was a bit shake at first but they seem to have it together now.  Juniors cheesecake is better but this will do since it is close. <br&gt;<br&gt;Surprisingly their brunch is very good.  Their Lemon Ricotta Pancakes are VERY Good!", "rating": 4, "date": "9/25/2016"}, {"text": "Don&amp;#39;t understand on why there&amp;#39;s so many people giving bad reviews. Literally went there for lunch and was in and out. Was seated quickly and the waitress came right over to take our drink order. As she brought out the drinks she also brought out bread and was on the ball the whole time. Food was really good especially the orange chicken along with the avocado toast.", "rating": 5, "date": "1/16/2019"}, {"text": "Let&amp;#39;s start with the noise. It was so loud that you couldn&amp;#39;t hear the hostess call your name. It was so loud you couldn&amp;#39;t hear the waitress when she spoke. Now let&amp;#39;s go onto what they ran out of: silverware and napkins, brown bread, tuna for the tuna salad. And last but not least is the food. Their salads were always the draw for us. They don&amp;#39;t have tuna (and the waitress even questioned why it is on the menu). The chicken in our salads was almost inedible. It was dry and hard. And there wasn&amp;#39;t very much of it. There were ingredients in the salad that were not listed. The portions are large, but if they are not good, no reason to go.", "rating": 2, "date": "3/4/2018"}, {"text": "Me and my family go too the Cheesecake Factory a few times every month, we love it! The staff is always so accommodating at the Trumbull location and fast service at the bar stool tables! We usually like too see Stephanie in the bar area and she always gets everything perfect and is super friendly. <br&gt;<br&gt;There&amp;#39;s Enough choices so everyone is happy and full at the end. I get the guacamole and chips and it is such a large portion I take half of it home and made two amazing meals from it! My family&amp;#39;s also enjoys the Caesar salad, four cheese pasta, the meatloaf, buffalo blast, and even the Mac and cheese burger! 100% would recommend!", "rating": 5, "date": "4/22/2019"}, {"text": "I&amp;#39;m here so much it&amp;#39;s ridiculous! Friendliest and knowledgable staff and the food is always 100% Ive never walked out unhappy with anything. They make all their sauces in house, along with many other things that are made to order. They are the place I go when I need consistency and great food. <br&gt;I work at the mall for a side job, and my coworkers and I are in there Atleast 2-3 times a month! <br&gt;We love Cheesecake Factory! Overall 10/10", "rating": 5, "date": "7/11/2018"}, {"text": "Great food. Excellent Cheesecake. If it were less expensive I would come here more often. Great special occasion dinner place though.", "rating": 4, "date": "12/31/2017"}, {"text": "We waited long to sit but being a Saturday night( hour &amp;amp; 15 mins ) I guess was to be expected. <br&gt;Douglas our server was great. He was friendly and served us well. <br&gt;<br&gt;I had the beet salad so goood , we had the fish and chips just ok - and the New Orleans pasta dish with chicken. Was spicy but just ok. <br&gt;We got our. Cheesecakes to go. Delish. The pumpkin one was so creamy and the carrot cake cheesecake was sweet and nutty. Yum. <br&gt;I think I&amp;#39;d come any other day but sat <br&gt;And also the food is Just ok <br&gt;And may I add in Pricey.", "rating": 3, "date": "10/16/2017"}, {"text": "I love the Cheesecake Factory! Whenever I have to go to the Trumbull Mall, I make sure to grab some food here. Their Factory Nachos are off the hook! They&amp;#39;re so delicious and not terribly spicy either! I usually get the five cheese pasta for my entree. If you&amp;#39;re worried about it being overly cheesy, don&amp;#39;t. It&amp;#39;s not too cheesy that it overpowers everything else. There&amp;#39;s a perfect balance of cheese, pasta, and sauce. My favorite cheesecake on the menu is definitely the celebration one! I was never a cheesecake fan until they debuted this puppy! Now I can&amp;#39;t go there and not get it. I just have to! It&amp;#39;s so tasty! It&amp;#39;s almost more like a cake rather than a cheesecake. Which is perfect for me. And the strawberry mousse! Oh my god! Just... *Homer drool*<br&gt;<br&gt;I went out of my comfort zone not too long ago and ordered the Da Vinci Pasta. I don&amp;#39;t think I&amp;#39;d get it again. It was too earthy and had too strong of a mushroom taste for me. Then again I&amp;#39;m not exactly crazy about mushrooms. If you like mushrooms, you&amp;#39;ll probably enjoy it.", "rating": 4, "date": "6/13/2018"}, {"text": "Went for a late dinner on 10/5 sat in the high top bar area and had such a great experience. My family went, 2 adults and 2 young kids. We had tonni as a waitress and it was only her second night and she was awesome. There were also 2 other staff in there named Brett and Andre and they were awesome helping out also. Our orders were taken promptly and our food came out in a good time frame. The manager was also extremely friendly too. We will definitely go back and ask for Tonni as a waitress again! Such a pleasant experience!!", "rating": 5, "date": "10/5/2019"}, {"text": "Menu is a little too extensive for me to think they every single dish is going to be made amazing but I have never had any negative complaints when I have gone there. Order from the healthy menu for smaller and healthier portions!", "rating": 4, "date": "4/28/2019"}, {"text": "LO,FL over my photo.  Restaurant has only been open 2.5 weeks and silverware is bent.  Yes, there are totally kinks as other people have mentioned, but this is the Cheesecake Factory people.  What do you expect?  Consistent food, consistent service and a consistent atmosphere.  I know I&amp;#39;ll get the same yummy dishes here as I will in Cali or in Florida.  Thank god they opened in Trumbull, CT, thank God!<br&gt;<br&gt;And, for the first time ever I tried their gluten free options.  Very, very pleasing.", "rating": 3, "date": "8/21/2014"}, {"text": "As with most franchise restaurants, you never know what kind of service you&amp;#39;re gonna get when you go. I&amp;#39;ve been to this particular Cheesecake Factory dozens of times since its grand opening. I&amp;#39;ve had really good waiters and some horrible ones. There are times when the chicken tenders have been fresh, hot and crispy and other times when they tasted like they&amp;#39;d just been popped in a microwave. It really depends on when you go. I find Monday - Thursday after 7 to be the best times to go. Want consistency? The mac n cheese balls are always perfection. You can never go wrong with my favorite cheesecakes: Reese&amp;#39;s, Oreo and the classic cherry. The bread is always good too: sourdough and honey wheat. The raspberry lemonade is good but super sweet... I always water mine down a bit. Bottom line is, the dessert is very good and I always leave feeling full.", "rating": 3, "date": "6/28/2016"}, {"text": "Had a hair in my Cuban sandwich recently. Good otherwise is fine. Staff is more friendly than would be expected for a chain", "rating": 3, "date": "3/19/2019"}, {"text": "Service and food quality way off.  Starting with service....of our 4 orders, 1 came out first, then 2 more came out about 10 minutes later and the last order, a bacon cheeseburger, was completely missed (served to another guest) and they only realized the mistake after an additional 10 minutes.  For one of the orders they missed adding mustard (both on initial request and then as an after-the-fact side request.  For the MIA burger, they offered a &amp;#34;soup&amp;#34; as an apology (nice gesture, I guess) which took about 10 minutes to come out and then, finally, the BC burger came after another 15 minutes (so basically over 40 minutes after the first person was served).<br&gt;<br&gt;So far, we were relatively relaxed about the whole deal...but then the very late burger arrived, it was a nasty, greasy mess served with luke warm fries.  On top of the burger was a thick slab of dripping fat.  Completely unappetizing and we gave up and cut our losses.", "rating": 1, "date": "4/2/2016"}, {"text": "Sometimes people really can find anything to complain about. Give it a try for yourself before feeding into a negative review. My husband and I went today for the first time to celebrate our 12th anniversary. It is also the first time we&amp;#39;ve been able to go out together without our children in years. I&amp;#39;m so glad we choose to go to the Cheesecake Factory. Our food was delicious and the service was even better. Our portions were very large and even my husband who can eat a lot left with leftovers for later tonight. I was honestly full after sharing the appetizer with my husband but when my main course came out it looked so good I had to continue eating and I&amp;#39;m glad I did. I honestly can&amp;#39;t wait for something else to celebrate because The Cheesecake Factory will be the spot we choose to go. It is our new favorite and I can&amp;#39;t wait to go back and let my children try it out as well! It&amp;#39;s nice to visit with your significant other, a friend, or even with your children being that I found the atmosphere to intimate, yet also very family friendly. If you&amp;#39;re reading this review and thinking of going I would say go for it! The environment was nice, the staff were friendly and we really enjoyed it. I attached a picture of our appetizer which was their fried Mac and cheese. Can&amp;#39;t go wrong with this, it was great!! Next time I will snap a picture of everything we order. Hope this review helps make your choice to visit, and I hope you enjoy it as much as my husband and I did!", "rating": 5, "date": "1/5/2019"}, {"text": "It was our first time here and also it was a very special day so I had a great time had time to go into the mall did a little bit of shopping and then went to eat since they opened later than the mall. I will definitely recommend this location very friendly very nice people the food was very good and the Cucumber lemonade to-die-for delicious you got to try that one. I definitely will go back and visit and of course I have to have the desert of the cheesecake and that too was very rich and tasty", "rating": 5, "date": "9/8/2017"}, {"text": "Danbury location usually better than this one. The wait times for meals are long and food never tastes as good as most CF locations. Cheesecake always good though.", "rating": 2, "date": "9/20/2017"}, {"text": "Cheesecake Factory seems to be fairly consistent across the board at all locations. Always great service, nice ambiance and reliably good food. Always a good choice for large groups as they have SO MANY options!!<br&gt;<br&gt;My go to is the BBQ Ranch Salad (mostly just so I can eat the fried onion rings on top, of course). I&amp;#39;ve never had a bad dessert here either - the white chocolate macadamia cheesecake is heaven!! <br&gt;<br&gt;This location was right up to par with the rest - I sat in the bar and my bartender was just lovely. Only issue is the mall parking that you have to contend with. Prepare yourself to walk off all of the food that you just ate while trying to find your car afterwards.", "rating": 4, "date": "10/29/2015"}, {"text": "Just Horrible! Wish I can rate -1 Stars. Took my wife and kids tonight for my wife&amp;#39;s Birthday. My wife let the waiter know that she had a severe gluten allergy and ordered a GF shrimp and pasta dish. After 45 minutes waiting for the food, her food came with breaded Shrimp. We sent it back and the waiter apologized and said the pasta and sauce was GF but the chef made a mistake and dipped the shrimp in breadcrumbs. He took it back and showed up 10 minutes later with a new dish and said this is totally GF. Well, 5 minutes later the Manager comes over with the real GF dish and apologizes as the dish she was eating was NOT GF free. She got really sick from this meal. Unbelievable! Never going back.", "rating": 1, "date": "6/10/2018"}, {"text": "This place is horrible I honestly don&amp;#39;t understand why people come and eat here, if you look through the glass mirror you can honestly see the managers and servers eating and touching your food with their bare hands and then letting it be served to you after they had their little bite of it. Disgusting don&amp;#39;t even bother to waste your time here.", "rating": 1, "date": "8/22/2018"}, {"text": "Awesome !!!!!!!salted caramel cheesecake is the bomb yaaaaaaaaaaaaaaaasssssssssssss I love it hereeeeee. I will go back foreverrrrrr. Yasssssss", "rating": 5, "date": "2/15/2019"}, {"text": "I contacted Cheesecake Factory about my review 21 days ago and still haven&amp;#39;t received a call back... very disappointing and another reason why I won&amp;#39;t return. Following up with customers is key especially when working in the customer service industry.", "rating": 1, "date": "7/19/2019"}, {"text": "We like the place but the hidden charges are really petty <br&gt;Ordered a burger kids meal and salmon with a slice of cheese cake spent over $50 for lunch <br&gt;The kids meal comes with a drink he opted for cranberry juice but was charged $4 for it when asked for the drink that. Are with the kids meal was told we could not get that since the bill was closed out", "rating": 3, "date": "2/1/2019"}, {"text": "Good food with a very good ambient. They have vegetarian options that can make you think twice before ask for a meat meal in your next visit to the place (is really good!) Also, deserts in this place could be an amazing dream, really. The cheesecake it&amp;#39;s really good with the right amount of sweetens and can always make you wish for another one.", "rating": 4, "date": "1/29/2019"}, {"text": "The service here tonight was awful. We requested a booth, waited 40 minutes to be shown to a table, and then told that we would have to wait all over again for a booth. <br&gt;<br&gt;Next we asked for bread, it didn&amp;#39;t come. The waitress told us that she was waiting for it to come out of the oven even though I saw at least 4 other servers taking bread to tables.<br&gt;<br&gt;My food came out wrong twice.  I asked for a menu to order cheesecake and she ignored me only bringing a menu for my dining companion. <br&gt;<br&gt;Usually the service is good here. The manager seems to be overwhelmed on a busy might", "rating": 1, "date": "12/29/2017"}, {"text": "My mom enjoyed a delicious lunch here yesterday while passing through the area! The service and food were both very good.<br&gt;<br&gt;My mom ordered the Tuscan chicken; the vegetables were very fresh and the dish was seasoned delicately but well. I got Evelyn&amp;#39;s favorite pasta (gluten free) and it was also very nice. It could have had slightly bolder flavors, but was fresh and good. I&amp;#39;ve had salads at Cheesecake Factory before and they are good, too. <br&gt;<br&gt;The service was great and the waiters were very accommodating of food allergies. The decor was a bit over-the-top fancy for me, but chairs were comfortable and the rooms looked good in its style.<br&gt;<br&gt;If we&amp;#39;re in Trumbull again, we will go back!", "rating": 4, "date": "3/26/2016"}, {"text": "Splain me this Lucy..... how does one have happy hour but doesn&amp;#39;t have drink specials even though they are advertised on your website?? There is no happy in happy hour without discounted libations. Shame on you Cheesecake Factory for false advertising and blaming inability to discount your drinks on the mall. Your saving grace and extra star is because of your food and ONLY the brown bread. Looks like we will be frequenting west Hartford for any future excursions.", "rating": 2, "date": "3/31/2017"}, {"text": "Just like every other Cheesecake Factory. Nothing special but still a decent place. The servings are huge which at least makes up for the prices. The restaurant is always very busy (long wait times) and very loud.  It&amp;#39;s attached to the mall and the back wall of the restaurant looks out into the mall. Not a fan of this since it&amp;#39;s usually the area that people wait and I feel pressured to eat faster. <br&gt;<br&gt;The seating also kind of sucks. They did everything they could to get every possible space occupied which means your sitting right next to strangers. <br&gt;<br&gt;Overall food is ok but I really hate how cramped it is.", "rating": 3, "date": "6/4/2017"}, {"text": "I have been to The Cheesecake Factory of Trumbull many times, and each time is always a great experience. Generally, the service is good. The food portions are generous. The lunch specials are good price and you still get a generous amount of food! Every time I go for lunch I get fettuccini and my friend gets the four cheese pasta, which are both very tasty and filling! They start you with two types of bread, and since me and my friend love the brown bread we always ask for more and they have no problem getting you more. I recommend the Godiva Cheesecake, although they all look good. My friend always get the Reese&amp;#39;s or red velvet, which are also both good.", "rating": 5, "date": "6/26/2017"}, {"text": "This place has something for everybody and it is a great place for a multi generational party, as in a graduation. I like the salads, the boys do the burgers, and my mother in-law gets the seared Ahi tuna. The place gets busy so the service is hit or miss and they don&amp;#39;t take reservations. But I have found that the food is reliably good. And  the deserts! Mon dieu! The major problem is picking one. We had a graduation party of right and we each got a different cheesecake, then shared. My favorite was the Dulche de leche caramel cheesecake. Worth the poundage.", "rating": 4, "date": "5/9/2017"}, {"text": "Seemingly in an effort to maximize square footage and maximize every last cent of revenue, this Cheesecake Factory location installed an &amp;#34;outdoor&amp;#34; patio, complete with wicker dining furniture, umbrellas, and faux plant life. The catch? It&amp;#39;s not outside. It&amp;#39;s in the mall causeway. <br&gt;<br&gt;Nothing like the smells and sounds of bustling suburban retail along with the bright antiseptic glow of fluorescent lighting to accompany a fine meal. <br&gt;<br&gt;They&amp;#39;ve really redefined &amp;#34;al fresco&amp;#34;. How progressive.<br&gt;<br&gt;We came to Cheesecake Factory to spend a gift card. My memories of Cheesecake Factory were mostly on the positive side. A large, mostly competent menu of items at a slightly higher quality level than Applebee&amp;#39;s or Chili&amp;#39;s, in a space slightly more adorned with high ceilings and a templatized attempted at ornate. <br&gt;<br&gt;But that&amp;#39;s just it. This is faux fine dining, just as the patio was faux outdoor dining. It&amp;#39;s all a ruse until you eat the food. And I guess the average mall goer that stumbles in here leaves impressed, at least judging by the long waits. But maybe it&amp;#39;s just the effect of marketing, decor, the illusion of &amp;#34;fancy&amp;#34;.<br&gt;<br&gt;The sad thing is, for the prices you pay here you can eat at a much more competent, honest, locally owned restaurant. The food and service will likely be better, and you&amp;#39;ll be supporting a local business. But while much better local restaurants struggle on a Sunday night, this place was booming. <br&gt;<br&gt;When we asked to be moved from the stale air of the then-closed mall corridor, the staff seemed annoyed. But here&amp;#39;s the thing: it&amp;#39;s customary to ask if you have a preference between outdoor and indoor before being seated, even if the outdoor space is fake.<br&gt;<br&gt;Service was satisfactory, but did not match the formal attire that servers don. <br&gt;<br&gt;The food was very disappointing all around. The allegedly spicy Louisiana Chicken Pasta was bland, with dry breaded chicken. The Chicken Enchiladas tasted nothing like Mexican food, almost as if they were topped with canned tomato sauce with a sickly sweet taste we couldn&amp;#39;t place. Everything tasted clearly reheated, further proven by the too-hot-to-touch plate of the enchiladas. These taste like frozen microwave entrees, in huge portions, carefully plated. The menu tries to be everything for everyone with hundreds of items, serving the &amp;#34;Factory&amp;#34; moniker well, but one must wonder how much of it is successful. <br&gt;<br&gt;The cheesecake with strawberries was the one positive, but our enthusiasm waned when we realized the center was frozen.<br&gt;<br&gt;And that dinner perfectly sums up the proposition of Cheesecake Factory. It&amp;#39;s all presentation, and from a financial standpoint, it works. <br&gt;<br&gt;You just have to wonder from the fake patio and frozen cheesecake whether they care that we can now see the strings.", "rating": 1, "date": "1/12/2015"}, {"text": "This is my third time in a Cheesecake Factory, and my first time at this location. I have to say that I don&amp;#39;t really care for it. We waited about an hour to get a table on a Friday night. The food was okay. I tried to order somewhat healthy and got the skinnylicious chicken tacos. They were just okay. The cheesecake is pretty good, but to me it&amp;#39;s not at all worth the hype and long wait.", "rating": 2, "date": "2/21/2015"}, {"text": "went there last night.  If you like eating in a noisy place with slow service then this is the place for you.  After waiting about 45 minutes for our meals the manager comes over to explain that our food went to another table and he would make it right.  Not really.  Did nothing.<br&gt;The wait staff conveniently forgot to stop by regularly except to tell us once that our food was being plated.  food didn&amp;#39;t show, then the manager did. .<br&gt;Dish was OK but it was supposed to have a cream sauce but seemed to have a butter sauce.  dripping in it.  I guess in their effort to get food to us eventually the chef forgot about the sauce.  We had a gift card that we needed to use, otherwise would have walked out.", "rating": 2, "date": "6/24/2018"}, {"text": "It was really good, but the chicken Madeira had no sauce on it. It had cheese, asparagus and potatoes which were very good, yummy and lots of them. And the chicken was good but there was no Marsala wine sauce! My daughter got the New York cheesecake with strawberries on top and I got the Hershey&amp;#39;s Chocolate Bar cheesecake. And my daughter got the shrimp scampi and salmon combo meal. It was still delicious.", "rating": 4, "date": "5/28/2019"}, {"text": "Long waiting-line to get a table. Their entrees were average, but &amp;#34;OMG&amp;#34;, their cheesecakes were DELICIOUS, especially the key lime cheesecake.<br&gt;<br&gt;Just order your cheesecakes to go, it is the best solution.", "rating": 4, "date": "3/25/2016"}, {"text": "Went here on a Friday night for a birthday dinner. This Friday was typically slower then any other Friday because it was Halloween. I was expecting a long wait as in my prior visits however we were seated as soon as we entered. <br&gt;<br&gt;The waitress took a while before coming over to the table to greet us and when she came over she seemed as though she was annoyed and did not want to be here. On the bright side the inside of the restaurant is very nice. <br&gt;<br&gt;The bread here is amazing and always fresh. We ordered the crispy calamari as an appetizer which was excellent and as a main dish I had the Orange Chicken which came with white rice which wasn&amp;#39;t bad. Had a different taste then the normal orange chicken I&amp;#39;m accustomed to from local Chinese restaurants. I usually order The crispy chicken costoletta which is always THE BEST. Also have had the Oreo cheesecake and the cookie dough cheesecake both of which are mouth watering!! <br&gt;<br&gt;Huge portions so come here on an empty stomach. You&amp;#39;ll still end up taking some home whether it&amp;#39;s the desert or part of your meal.  <br&gt;<br&gt;Overall service sucked but food &amp;amp; desert is amazing!", "rating": 3, "date": "10/31/2014"}, {"text": "Service to say the least is horrible<br&gt;<br&gt;Waited almost 20 minutes for our buffalo blast which were cooked way to long.....<br&gt;<br&gt;Ask for water 10 minutes ago, still waiting.<br&gt;<br&gt;The floors are beyond slippery they must mop with old grease. <br&gt;<br&gt;Are waiter was friendly(just super slow)<br&gt;<br&gt;I&amp;#39;ve been to this chain from whiteplains new York to Miami Florida and never had an issue, try it once 5 minutes away from home and it horrible.<br&gt;<br&gt;This review will be sent to there Corporate office asap, with more extensive details.<br&gt;<br&gt;I would NOT recommend this place to anyone.<br&gt;<br&gt;Ruby Tuesday next door has much better service.<br&gt;<br&gt;Bad bad bad choice", "rating": 1, "date": "10/13/2014"}, {"text": "I wish I have better things to say about this location. I came here around 530 to pick up 2 slices of cake to go. You&amp;#39;d think that&amp;#39;s simple enough for me to get. It&amp;#39;s now 6:00 and I&amp;#39;m still waiting on two simple slices of cheesecake. <br&gt;<br&gt;I know this review doesn&amp;#39;t speak for the quality of food here. But this inefficiency needs to be worked on. All the employees don&amp;#39;t have the support and training they need and look more flustered than actually getting the work done properly. <br&gt;<br&gt;I hate leaving bad reviews especially since my moms been wanting to come here for some time now, and yet this will be the first and most long lasting memory she has of this store.", "rating": 2, "date": "10/30/2016"}, {"text": "Horrible!! we order the fried fish dinner, all the fish but one was empty batter, and that one, my boyfriend got sick on it.<br&gt;<br&gt;The customer service??...horrible, when we told her about the no fish, just batter, Emilee just smiled and said, sorry!! <br&gt;<br&gt;too bad there was a no star rating.", "rating": 1, "date": "8/27/2018"}, {"text": "Cheesecake Factory in general serves great amazing food.   White planes and this one in Trumbull mall are great.   I wouldn&amp;#39;t recommend the Stamford one.     But as for this Trumbull mall branch. I&amp;#39;ve been here twice so far and I highly recommend.   Great service both times. And excellent food as well.   I will definitely go back", "rating": 5, "date": "1/19/2017"}, {"text": "I always have the absolute worst service whenever I go to the Cheesecake Factory in Trumbull. Food is so good, but the service sucks! Most of the servers are very rude. Last night, my server came to my table maybe twice the entire night. We also waited over 45 minutes when the hostess told us we&amp;#39;d be waiting for 15-20. I keep trying this place again but can&amp;#39;t seem to catch a break. Very unfortunate.", "rating": 1, "date": "4/29/2019"}, {"text": "My friend and I came here and ordered the filet mignon with mash potatoes and esparagus and it was amazing!!! The service the young lady provided us was amazing too and everything was just on point.", "rating": 5, "date": "4/9/2018"}, {"text": "I&amp;#39;ve been to this CheeseCake Factory location before and usually its fine. I went in for dinner last night with 2 other people and was so unimpressed. First of all, the hostess working was rude and lazy. When 3 people walk into a restaurant at 8pm on a Wednesday, there shouldn&amp;#39;t be a wait. But there was. Not sure why since MORE THAN HALF of the tables were empty! We waited about 5 minutes for a table, not sure why. Then finally when the hostess of the year decided to seat us outside, she suggested we sat at a table right next to the door, which we didn&amp;#39;t want, so I asked her if we could sit at one of the cushioned booths instead, and she said yes but it would take 5 minutes to bus the table. I thought she was kidding! Lets be serious, the restaurant was essentially half empty, you&amp;#39;re telling me that no one can clean the table? Why couldn&amp;#39;t the hostess do it? I understand that they tip out a busboy to do such things but in a restaurant, the entire FOH staff should come together and bus the dirty tables especially when they restaurant is dead! I&amp;#39;ve worked in restaurants in the past as a hostess, server, and bartender, and NEVER in my life would I tell a customer that they had to wait 5 minutes after already waiting, for a table that can be cleaned in about 30 seconds. But whatever, who cares about hospitality anyway!<br&gt;<br&gt;Our server was nice and helpful, although we felt rushed at the end of our meal. <br&gt;<br&gt;The food was BLAH.<br&gt;I had the Shrimp and Sausage pasta, and the taste was good. However there was only 3 pieces of shrimp and about 20 pieces of sausage. Literally, I counted. My mother had some chicken teriyaki dish which she absolutely hated.<br&gt;<br&gt;The cheesecake was the best part of the evening. 5 stars for dessert. 1 star for the lazy hostess. 3 stars for the server.", "rating": 3, "date": "9/22/2016"}, {"text": "So This was an OK experience for my first time at the cheese cake factory. The service was outstanding but it was kinda overrated", "rating": 2, "date": "1/14/2018"}, {"text": "I ordered the chicken pot pie from here via grubhub, when it got here it was already cold but i can always heat it up so that wasn&amp;#39;t the issue. I open the container and there are three TINY bite size pieces of chicken- not chicken breast mind you but nugget sized pieces. 3 in a chicken pot pie, surely there must be a mistake.<br&gt;<br&gt;Grubhub calls them and they say nope we aren&amp;#39;t refunding it, not our fault. This is beyond disappointing to me, if i order a meal i expect to have it properly made and to treat your customers with dignity and to apologize for the mishap. Whoever was the manager that day seriously needs to learn better customer service and to look over their kitchen manager/staff better to ensure the meals going out are actually up to par and filled correctly.", "rating": 2, "date": "1/8/2018"}, {"text": "The Cheesecake Factory is always a place for good food and dessert. Never a let down. Just by myself for one glass of wine and a chicken and mash potato dinner, the cost was 28 dollars and change. Was it worth the price to come back often? No, the prices are about 3-4 dollars extra for entrees and 2 dollars extra on glasses of wine. Otherwise I would be a regular here at the Cheesecake Factory. I have them 4 out of 5 stars because their food is great, but just a bit pricey for middle class standards.", "rating": 4, "date": "1/14/2016"}, {"text": "This was our 2nd time at the Trumbull location. Very short wait to get a table, our waiter was fantastic! We had Thai lettuce wraps that were very good but for a $13 appetizer they were cheap on the chicken and sauces.Bang Bang chicken and shrimp was very good. Chicken picotta was very good. We complained to the waiter on the large amount of ice in our marguerita&amp;#39;s and the small little glass , we each drank 4  because they were so small. Godiva cheesecake was oh so good! Sorry Cheesecake Factory you only get 3 stars for being cheap with the chicken and excessive ice in your drinks.", "rating": 3, "date": "1/23/2016"}, {"text": "The food was good.<br&gt;The employees are fantastic.<br&gt;The wait was long but it&amp;#39;s in a mall and it was a weekend so you kinda get whatever you get.", "rating": 4, "date": "3/18/2018"}, {"text": "I would like to start of with saying that their food is always amazing! It&amp;#39;s always what you expect and if not, better. With that being said, the service is HORRIBLE! Idk if it&amp;#39;s just the service on the patio or what. I always sit on the patio. We had appetizers, which were amazing. While we were eating our appetizers, our entrees came out. They should&amp;#39;ve timed it better. My veggie burger was supposed to come with a salad. You would think that my salad would come out first or at least at the same time as my burger. It came out about 5 minutes after my burger came out. It was irritating. And the waitress&amp;#39;s phone kept ringing and she didn&amp;#39;t even notice. And we had to keep asking for refills on our water. This might just be a patio thing, but I&amp;#39;m not sure. I love their food and vegan options, but get so irritated with the service. This happens every time.", "rating": 2, "date": "6/27/2016"}, {"text": "If you want to be treated poorly for overpriced food, this is the place for you. The one star is for the hope that their customer service gets better. I went in with a party of 4 (there were only two other groups there and they weren&amp;#39;t groups of 4). The manager said 15-20 minutes so we kindly waited with the buzzer by the inner door. We proceeded to wait and when my buzzer went off 25 minutes later I went up and the hostess said we were buzzed 20 minutes ago (which I had in my hand the entire time and didn&amp;#39;t go off). Even if it did my name was never said out loud like the other parties present. The hostess then informed us that we would be the next 4 seated. We also overheard the manager say to the hostess to not seat us. We waited for another 5 minutes and another 4 person group was called before us that just got there. At that point we decided that no matter how much people like cheesecake there is no excuse for poor customer service and we left. There&amp;#39;s a Panera Bread down the hall that we went to instead, much nicer people and better food.", "rating": 1, "date": "6/20/2019"}, {"text": "Often enjoy going here for lunch and sitting at the bar. Always have amazing service and an experience here. The food is great and portioned just enough to have a significant meal. While it can be a bit pricey, it is still great food and drinks. My only concern would be there is no wifi and apple pay. Interesting that there can be such a great place that is behind with technology.", "rating": 4, "date": "10/9/2017"}, {"text": "Too large of a restaurant for Trumbull <br&gt;Empty tables everywhere but still 30 minutes to sit", "rating": 3, "date": "3/31/2018"}, {"text": "Long lines. I went there and enjoyed the beet and goat cheese salad which was pretty good. The cheese cake was good. Nothing great. <br&gt;<br&gt;Second and third time I&amp;#39;ve gone, I got food poisoning. <br&gt;I refuse to get anything other than drinks or cheesecake there now. <br&gt;<br&gt;Nothing I had there was worth the price and the menu is the size of a novel. Nothing is fresh. <br&gt;Not a fan.", "rating": 2, "date": "9/20/2015"}, {"text": "TCF is always good, albeit expensive.  Consistent with something for everyone as well as the cheesecakes and dessert.  This is a new, small location opened 8/5 and it&amp;#39;s clear they are being careful with service (buddy training) and food taking longer than usual but service is attentive as you would and should expect at this price point.<br&gt;<br&gt;Oh and like most CAKE&amp;#39;s I have been too long lines are guaranteed unless you go before 4:30 for dinner.<br&gt;<br&gt;I look forward to a more quieter Sunday brunch starting at 10am...<br&gt;<br&gt;A solid 3.5; if service faster 4....", "rating": 3, "date": "8/8/2014"}, {"text": "I genuinely felt like I was never ripped off more than on my first and last visit to this place.  Service was mediocre at best and food was about the same as a fast food place.", "rating": 1, "date": "9/6/2017"}, {"text": "The least busy day of the week on a Monday, you&amp;#39;ll find yourself waiting over one hour and counting for the meal to come. I&amp;#39;m disgusted by how all the employees take their job slowly as if its okay for customers to wait 30 minutes for water or over a hour for food to be served on the table.", "rating": 1, "date": "3/12/2018"}, {"text": "First let me say that I do love Cheesecake Factory but NOT this one!! Trumbull Mall has the worst one I ever been to. The Service was terrible but lets get to the food situation. I ordered the Shrimp scampi which was bland with barely any taste. My wife order the Jamaican black pepper shrimp which they forgot the plantains!! Then the waiter said sorry and went to put the order in, they NEVER came out, he came back to us 3 times asking if they came and each time was NO they didn&amp;#39;t. Her dish was also bland and shrimp overcooked. Please avoid this particular Cheesecake Factory unless you want bland food and ok service!!", "rating": 2, "date": "9/14/2015"}, {"text": "Worse experience everrr!! To begin with I told the server this was our first time coming to the cheesecake factory. The wait was not long but everything else was! We waited so so long for our drink , butter, and the longest for our food which came out over cooked and cold as a brick. I asked for new fries and they brought me out more cold fries!!! I asked for warm potatoes which were suppised to be mashed and the manager brought me them with chunks of potatoes in them. The manager didn&amp;#39;t even introduce him self! Waited another 20 minutes for them to remake my meal by then everyone was done with their food! Would never go here again or reccomend it to anyone! Only gave one star because I couldn&amp;#39;t do no star!", "rating": 1, "date": "3/3/2018"}, {"text": "This chain restaurant is located in a busy mall. There is very ample and very comfortable seating inside as well as a small outdoor patio dining area which is nice. The décor and the overall ambiance gives this place an upscale feel and the entire staff is friendly and attentive. But while the place has an upscale look and vibe, it is really just your average chain restaurant with good PR. However, that good PR makes their prices a bit steeper than places like an Applebee&amp;#39;s or Ruby Tuesday&amp;#39;s. The appetizers here average around $10.50 and the main dishes around $19.00. For two people each ordering an appetizer, main dish, beverage and one dessert to split, you can easily drop $60-$75 per person before the tip. If you order alcohol, jack that price up much higher.<br&gt;<br&gt;As for the food itself. Let&amp;#39;s start with the menu. It is 20 pages long! You have so much to choose from the decision is staggering. I have been there half a dozen times and tried something different each time. At that rate it may well take a few hundred visits to put even a dent in the menu. Whatever you&amp;#39;re in the mood for, you can find something here.<br&gt;<br&gt;The quality of the food is good to very good. The preparation and presentation are excellent. The portions are a bit on the smallish side compared to other chains, especially when you consider the price, but they are still enough to enjoy adequately, though you will have room for dessert (that may be the point).<br&gt;<br&gt;Some negatives, if you go at peak days/times, you might have quite a wait, it could be an hour. I have only had a wait on one trip, it was 25 minutes. Another inconsistency is the prep time to get your meal. I have had a meal arrive anywhere from 15 minutes to over 35 minutes from the time of ordering, and it did not seem to matter if the place was busy or not with the longer waits.<br&gt;<br&gt;Now let&amp;#39;s get to the part where this place simply shines; the desserts! As their name implies, this place has the most amazing and decadent selection of cheesecakes you can possibly imagine, and then some. A full three pages of the menu is dedicated to their cheesecakes, specialty desserts, specialty coffees, iced and frozen drinks ice cream creations and shakes. If you have a sweet tooth, you will think you have died and gone to sugar heaven! And the prices are very reasonable, much more so than their regular menu items, averaging $7.50 per item. You can also buy whole cheesecakes from their display cases.<br&gt;<br&gt;The dessert portions are generous too. One piece of cheesecake is more than enough for one person, and can be split between two and still give each of you enough to enjoy. I love cheesecake in general and this place makes them an art. I have had theirs on three of my trips, though I am not normally one for dessert.<br&gt;<br&gt;Bottom line is the food is on average, very good, the portions a bit smallish, but if you include dessert, you will not leave hungry. The service from the staff is excellent and the desserts exceptional. They are quite pricey on the food and beverages for a chain retaurant, but great on the desserts. The wait times to be seated or served are hit and miss. If it were up to me alone, I would only go here for the desserts and have my meal at another, less costly chain, but my girlfriend loves the place and she&amp;#39;s worth the extra cost.", "rating": 3, "date": "9/27/2016"}, {"text": "45 minutes for 2 half-loaves of cold, hard bread!! Let&amp;#39;s just start there.<br&gt;<br&gt;Now that I got that out, I have to say that I really tried my hardest to give our waiter all of the patience I could muster up while serving us, but he just couldn&amp;#39;t cut it. Beside the bread (did I mention that it took 45 minutes!?), the COMPLETELY uncooked rice (rolling around on the plate), and complete disregard for my extravagant request to help me celebrate my sister&amp;#39;s birthday (while exactly 9 other poorly executed &amp;#34;happy birthday&amp;#34; numbers rang out), I graciously allotted two stars to this place because they managed to get my Chicken Costoletta right.....for the most part.", "rating": 2, "date": "10/18/2015"}, {"text": "The service is ALWAYS SLOW! Even on an empty day when there are a ton of employees wandering about, maybe a kitchen issue?! Never going back, just a waste of time.", "rating": 1, "date": "7/28/2018"}, {"text": "I went into the restaurant with my colleague and I was not greeted by anyone I had to search and find a hostess. Once I found her she then told me I needed to wait for a runner to then come and seat me. She had a horrible attitude she asked me what was my name I asked her if they were on a wait she stated no it&amp;#39;s just for the runner to call us. The runner then appeared and I saw the hostess tell her not to come over to us to let us come to have us come over to her. I then walked over and asked where was the manager. The woman who I had approach had a very bad demeanor. As I&amp;#39;m speaking to her she&amp;#39;s waving her hands in my face telling me that nothing wrong happened and she was standing right there which was not true. I then stated to her I wasn&amp;#39;t complaining in regards to the hostess I&amp;#39;m complaining in regard to the way that we were treated when it was time to be seated. She then calls my friend and I a nigger  and said why are you people always upset. And from her prior comment about us being niggers I&amp;#39;m assuming you people is in reference to us being black. This woman was very rude to be a manger.She also allowed other restaurant employees to be involved in the conversation and they were laughing and egging it on.A guy walked by who identified himself as a manager he was speaking a bunch of slang and I asked him not to address us in that manner. He then got an attitude and said he was calling security because I asked him for the number to corporate. This place is horrible and everyone needs to be replaced at this point.", "rating": 1, "date": "12/20/2018"}, {"text": "The food was subpar although my major complaint is that my food came out late in comparison to the other diners at my table due to waiting error. The way the manager compensated with the 20 minute error was by giving me a free piece of cheesecake. Management conducted the incident quite well, although the waitress was not the best. If you are thinking of coming here I suggest having an enormous amount of patience.", "rating": 2, "date": "7/2/2017"}, {"text": "Ordered takeout on their website. Arrived at curbside pick up and called multiple times, no one picked up. Went into bakery to pick up order and gentleman could not have cared less. He was very unfriendly. Also, they did not provide silverware or napkins in the take out bag. The third star is for the food, which was quite good but would&amp;#39;ve been easier to eat with utensils.", "rating": 3, "date": "9/26/2018"}, {"text": "The desserts stand out more than their menu items. I usually order the red velvet cheesecake which is always perfect- slices of moist red velvet cake wedged between smooth cheesecake. <br&gt;<br&gt;The last time I ordered a burger, the meat was dry and the Mac and cheese that comes with it was crumbly and mushed together. The vegetable tempura &amp;#34;fries&amp;#34; was delicious though. If anything stick to their pasta.<br&gt;<br&gt;The service at this location is just like any other Cheesecake Factory- long wait time and even longer service time.", "rating": 3, "date": "3/1/2016"}, {"text": "Always a fan of this place. It&amp;#39;s smaller than other CCF&amp;#39;s I have been to but none the less its the real deal. Staff is super nice, and its better than going to weschester to get some amazing cheese cake. <br&gt;<br&gt;Fav Dish: Bang Bang Chicken and Shrimp<br&gt;Fav Cheese Cake: Bananna.", "rating": 5, "date": "2/2/2016"}, {"text": "Near disaster coming in the door. However the professionalism shown by the manager Jonathan and great service by our server Tara saved the evening. As always food outstanding. Will continue to be a happy and repeat customer!", "rating": 5, "date": "2/6/2016"}, {"text": "Horrible service. We actually had to walk out of the restaurant. I usually love the Cheesecake Factory but never go to this location again.", "rating": 1, "date": "9/2/2018"}, {"text": "The food was great and plentiful. Service was friendly, but sooooooo incredibly slow. 25 minutes after ordering before the first kid&amp;#39;s drink arrive. 10 more minutes before the next 2 were delivered. (If you&amp;#39;re a mom, you know this is not Ok...)<br&gt;<br&gt;We preordered the birthday cheesecake earlier in the day so it would be ready after dinner. We finished dinner, requested our cakes, and it took an additional 40 minutes before they brought the cakes out for us to sing happy birthday. It was unsliced, so they brought it back to the kitchen and 10 minutes later we were final having dessert. <br&gt;<br&gt;This was on a Monday night. I can&amp;#39;t fathom how bad it is on the weekend.<br&gt;<br&gt;I know lots of people enjoy The Cheescake Factory, but it&amp;#39;s just not for me. Give yourself at least 2.5-3 hours if you plan to eat here.", "rating": 2, "date": "12/1/2014"}, {"text": "They mess up my order every single time, it is literally never correct. I do not know why because I order the same thing every time and it is one of their &amp;#34;specialties&amp;#34;. Worst Cheesecake Factory location in all CT. UPDATE: ordered out again today this time getting sliders. Asked for plain no ketchup no onion, what do I get? Both on it and don&amp;#39;t realize until I get home. Buns soggy and Also the fries tasted like they were made at lunch time. So disgusting. Don&amp;#39;t know how this location is still open.", "rating": 1, "date": "5/25/2018"}, {"text": "The service can&amp;#39;t be worse. Yesterday I went to this Cheesecake Factory, I didn&amp;#39;t need to wait for seating but the service is too bad and slow. It took like one hour to wait. We even didn&amp;#39;t have knives and forks when the servicer giving the food. Also, the food wasn&amp;#39;t fresh at all. I have to ask the manager to change. It was a really bad birthday experience. Won&amp;#39;t be here again.", "rating": 1, "date": "5/8/2017"}, {"text": "Terrible service. Slow night and very slow service. Drinks and food took forever. Food came out at different times and it was obvious that some meals were under a heat lamp drying out the pasta.", "rating": 1, "date": "5/16/2017"}, {"text": "Very good bartenders there. I work in the mall so i go there weekends it so much fun to have ur nachos and best drinks. Love it", "rating": 5, "date": "4/24/2017"}, {"text": "Where do I begin . The hostess from last night was extremely rude . She told us 15 minutes and when I went to ask her how much longer she snapped back with &amp;#34; I told you it would be a half hour &amp;#34; she definitely didn&amp;#39;t and was so rude about it  . Service is extremely sssssslllllloooowwww . Took forever to get our drinks and food . Only thing that came quickly was the check .  Also , I went to use the restroom and the floor from my table to the bathroom was so extremely greasy feeling I had to pay attention to walking so I didn&amp;#39;t slip . The bathroom looked like a bomb exploded in it . TP all over the bathroom stall and pee on the seat :( so Nasty . Food was good but poor customer service and poor sanitation will keep us away .", "rating": 1, "date": "1/3/2017"}, {"text": "My boyfriend and I went for dinner tonight to celebrate our one year anniversary. Everything was going well until I took a bite of cheesecake and pulled a long white hair from my mouth because it was in the cheesecake!!!! It was brought to the waiters attention without asking us he brought a piece of the same cheesecake eww!!! My boyfriend told him we didn&amp;#39;t want it anymore and they brought us the check. It was over $70! We asked if something could be done since I almost ate the hair and it went into my mouth! All they did was take off our drinks which were both Cokes so they only took off about $4... really? I almost ate a piece of a strangers hair that was in their product and that&amp;#39;s all they do? We will not be returning. I hope this review helps", "rating": 1, "date": "2/3/2018"}, {"text": "Ok tonight I was very dissapointed in the Ccf my fries was cold as well as my sliders luke warm I sent the fries back delt with the chicken. My dinner mate came out with no sause on her pasta then after she ate what she could and opt to take her food home the waiter throw it away. They comp the cheese cake but it wasn&amp;#39;t the cheese cake that got thrown away <br&gt;Very dissapointed tonight", "rating": 1, "date": "9/3/2014"}, {"text": "I&amp;#39;ve been to the cheesecake factory many times in different states.  I enjoy the food and desserts.  However for such a busy and well established company you would think this establishment would have the option to make reservations for large parties.  I came with a large party (13 plus)  after 6pm and had to wait 30 minutes to get seated.  This could have been avoided had the option to make reservations been available.  This is totally unacceptable and unprofessional, how can such a big chain no accept reservation at mall location where it&amp;#39;s extremely business.", "rating": 1, "date": "12/9/2014"}, {"text": "Delusions fast clean friendly staff how ever s little crowded due to it being in the mall.", "rating": 4, "date": "4/29/2016"}, {"text": "The server asked how we liked our meal. My response was &amp;#34;not worth a two hour wait.&amp;#34;<br&gt;<br&gt;We were a party of six who ate there early on the Saturday evening before Thanksgiving, in order, we hoped, to beat the dinner rush. Surprise - we had a long hour&amp;#39;s wait to get a table, then what seemed like an intolerably long time from when when we ordered until our food was presented.<br&gt;<br&gt;When one of the others at the table echoed my comment to the manager, who had come over with our server, she told us when we checked in, when we were seated... <br&gt;<br&gt;All our friend wanted was an acknowledgement that we had had a long wait, and a small symbol of that acknowledgement - something like coffee for the table.<br&gt;<br&gt;But as every practiced politician knows, and as everyone whose job is customer service should know, when you&amp;#39;re arguing process you&amp;#39;re losing.<br&gt;<br&gt;My wife and I both had salads. Our food was good enough that we would return. But only if the wait is short - 15 minutes or less - or of we planned to shop during our wait (would that there were a Barnes &amp;amp; Noble, the best place to kill time in any mall). The keeper of the list takes cell phone numbers, so why hang around in the cow pen inside the door?<br&gt;<br&gt;Good food and one star may seem an oxymoron. The issue is that those who run this 300 seat restaurant would do themselves a favor to find a a way to make frustrated guests happy, at least as long as it remains a novelty.", "rating": 1, "date": "11/23/2014"}, {"text": "This is the Cheesecake Factory, and they ran out of the Reese&amp;#39;s Peanut Butter Chocolate Cake Cheesecake...<br&gt;<br&gt;Also, my friend&amp;#39;s plate was hotter than the food. Not impressed. Over priced food for a mass amount of mediocre food. This restaurant is located in a mall, stop trying to be more than that.", "rating": 1, "date": "11/17/2014"}, {"text": "The food is horrible, ordered well done hamburger with  mushrooms and it was raw.  Mushrooms were horrible  too.", "rating": 1, "date": "4/7/2016"}, {"text": "Came in on my lunch break because I&amp;#39;m working a double shift. I was by myself and was really looking forward to their bacon cheeseburger. They sat me down and not one employee came to even give me bread or water. I waited 10 mins and still nothing. Ended up leaving and getting my lunch elsewhere. Not very good service.", "rating": 1, "date": "4/15/2017"}, {"text": "The Cheesecake Factory was a beautiful experience. It was my first time at the one here in Trumbull. Service was courteous and timely .", "rating": 4, "date": "11/13/2015"}, {"text": "Wow. Where do I Start... I really enjoy my visits to The Cheesecake Factory but this one takes the cake (no pun intended). We haven&amp;#39;t even left the restaurant yet and I felt compelled to leave this review. <br&gt;<br&gt;We were a party of 8 and I get that we would have to wait for a bit. It turned out to be almost an hour and a half wait to get seated. It was my room mates niece&amp;#39;s birthday. It all went downhill from there. First off they did not have the appetizers that we ordered. Second, besides the 1 1/2 we waited to get seated we had to wait almost another 45 minutes before the main course came out. We went in for lunch around 1 and did not start to eat till after 3pm. At this point we were starving. Here is the kicker. Despite our best efforts to tell the wait staff that we had a birthday person at the table, of everyone&amp;#39;s main course, they bought her&amp;#39;s out cold!! Needless to say we were not a happy bunch. The waitress did her best to apologize and the manager comp&amp;#39;d her meal but that was not the point. They ruined what was supposed to be a memorable occasion. Her 21st birthday. <br&gt;<br&gt;Some of us lost our appetite because everyone mood changed. For the worse. Good thing I don&amp;#39;t ever have to come back here...", "rating": 1, "date": "8/28/2014"}, {"text": "The waitress said they didn&amp;#39;t have the ingredients to make 2 different things I ordered. Are you kidding me?So I ordered something I didn&amp;#39;t really want. The food was terrible. Rice wasn&amp;#39;t cooked all the way. The staff are either to young or inexperienced to provide the quality of service I&amp;#39;ve had at other The Cheesecake Factory locations. The restroom toilet was broken with parts of it in the toilet bowl.  This is the ghettoest cheesecake factory I&amp;#39;ve ever been too. The waitress was nice. She tried so I left her a big tip but I&amp;#39;ll never be back.", "rating": 1, "date": "10/24/2016"}, {"text": "I worked at the Lake Grove location for four years and realized the most important part of the job was to never let a guest see what mess goes on behind closed doors. This location has only been open for about a month so there are a bunch of kinks to work out, but I definitely could see the issues all around me. Empty drinks, m is - running of food, servers not visiting their tables enough to check in....Obviously I&amp;#39;ve worked at this restaurant before and put my service above everyone&amp;#39;s....well it is. I&amp;#39;m too bias so I should probably stop reviewing.", "rating": 3, "date": "8/27/2014"}, {"text": "Very disappointed in my visit at The Cheesecake Factory tonight. Ordered coke with no ice, waitress brings out coke with ice. Make a remark, she doesn&amp;#39;t volunteer to fix it. When I finish it, she asks if I want a refill and I say, with NO ice this time please. Brings another one with ice. When our steaks came out, ordered medium well, they are rare. It takes an additional 20 minutes for them to pop them in the microwave. During this time frame, flies were continuously flying around our table. The restaurant was probably 1/5 filled, I have no idea why it took over an hour and a half for us to be served and why our waitress could not understand basic orders.", "rating": 2, "date": "8/9/2017"}, {"text": "Love the cheesecakes but the menu is also great.  The cobb salad was amazing.  Very busy on the weekends but one of the few places worth waiting for a table.  Service was friendly and efficient.", "rating": 5, "date": "1/26/2017"}, {"text": "A couple of months ago, my husband and I were in the Trumbull Mall and decided to try the Cheesecake Factory for lunch.  We liked it so much that we&amp;#39;ve been back twice.  I&amp;#39;ve never been a fan of chain restaurants, but we found the food to be well made, delicious, and the staff helpful and friendly. The place is absolutely spotless and inviting. I&amp;#39;ve had a couple of different salads, and enjoyed them all.  My husband had the salmon today (I don&amp;#39;t recall what he&amp;#39;s had in the past) and found it delicious -- even better than a $32 salmon he had the other evening in a fancy restaurant in Westport.  We had &amp;#34;lunch-sized&amp;#34; portions, but they were big enough for dinner.  My only complaint is that the gorgeous cakes they have on display have about 1200 calories per slice -- much too much for this diet-conscious person.  They were tempting, but I had to resist.  Next time I&amp;#39;m there, I won&amp;#39;t torture myself by looking at them.", "rating": 4, "date": "7/11/2018"}, {"text": "This place is brand new for our area, so we tried it. The decor and sound level reminded me of a Las Vegas casino! We were glad outdoor seating was available, where it was a little quieter, even if we were basically sitting in the mall parking lot. (Also, tubs of aromatic garbage rolled past every half hour or so, being taken from kitchen outlet to refuse receptacle.) <br&gt;The staff is trained but very young and inexperienced and seemed overwhelmed -- the menu is vast and communication among bar, kitchen, servers, and all are still chaotic. Our waiter was very sweet and the slowness was clearly not his fault. Food was well prepared and tasty. We were too full to eat cheesecake but brought some home with us. <br&gt;By 6pm there was a line out the door, so most people must know and appreciate the chain. It was too crazy for us old folks (51, 53, 56, and 61), and I doubt we will return even when they&amp;#39;re running smoothly.", "rating": 3, "date": "8/15/2014"}, {"text": "Wow it was busy sunday afternoon 3:00 but we were only two so got a table fairly quick. Workers were hustling and bustling! Our server was running around here and there but brought our water and bread quickly. We ordered edimame for app and two salads and literally all came same time. My salad was a special shrimp salad and lettuce was pretty but didnt look washed. It was dark and I was hungry so ate most of it anyway. Server never came to check if all was ok-just kept rushing around. Understandable but dont expect a quiet relaxing meal with attention on the weekend. Idk if its like that during the week. The menu was extensive. There is something for everyone. I probably wont be back any time soon.", "rating": 3, "date": "3/21/2017"}, {"text": "The food is inexpensive in my opinion for the portion size which you are getting. The best thing about the Cheesecake Factory at this location is the convenience. If there is a long wait (which there usually never is) you can browse the mall and wait for a text. <br&gt;<br&gt;Service is pretty fast and accommodating. Only one time did I experience a long wait time and the manager offered an appetizer on the house for my guests and I. Totally worth it. I also love the brunch menu, great bang for not so much bucks.", "rating": 4, "date": "7/1/2017"}, {"text": "The cheese cakes are the best. Their food is just okay. Pasta is too greasy. We ordered two dishes for two of us but could not finish at all. The setting is quite new and modern but it smells a little.", "rating": 3, "date": "7/21/2015"}, {"text": "As usual,  food was good.  The fried calamari was VERY salty.  Our server was Mylene (spelling),  she was great!  She was Friendly,  polite,  and very competent.  Enjoyed my lunch and service.", "rating": 4, "date": "10/28/2016"}, {"text": "So far I enjoy eating here. Very large menu to choose ftom. Here again with jack", "rating": 3, "date": "2/7/2015"}, {"text": "Great location, great staff, amazing food. Beautiful decor. Can eat here on a date, with the family, or just for fun! The food is delicious and the cheesecake is to die for. Gets very busy but that&amp;#39;s a good thing.", "rating": 5, "date": "2/4/2017"}, {"text": "No wait for two people which was great. Our waiter was friendly, though there was a language barrier. We ordered the artichoke and crab dip that was so salty we couldn&amp;#39;t finish it--way to much old bay; the beet and goat cheese salad was tasty but literally had a single piece of beet on it; and the sweet corn tamale cakes were actually pretty good. We decided not to stay for an entree, left a nice tip and went home. We will not be going back.", "rating": 3, "date": "5/30/2016"}, {"text": "The food and service was good. The place looks nice and smells good. The food was a little pricy tho.", "rating": 4, "date": "5/10/2017"}, {"text": "Is what it is...nothing too special here. Chain food, slow service and probably seated in the worst booth on the planet. Probably won&amp;#39;t be back, 60$ lunch could have been at a 10x better place.", "rating": 2, "date": "8/16/2016"}, {"text": "Let&amp;#39;s just start by saying the sun came out faster than our food. We waited over 45 minutes for three steak sandwiches and a salad. My mother ordered a tea and was still waiting for it while the rest of our party had received their drinks. When the tea finally came, she had to wait longer while we tried to get the waitresses attention who failed to bring a cup or spoon. Although the food was good the service was absolutely horrible. It&amp;#39;s a shame because with good service this chain would rock. Please properly train your staff. Poor<br&gt; service is the demise of a chain.", "rating": 1, "date": "11/1/2015"}, {"text": "The service here sucks, haven&amp;#39;t seen our server in 15 mins. And only received 2 of the 3 meals and no silverware yet!!", "rating": 1, "date": "2/24/2018"}, {"text": "This will my last time at this location the ladies at the register always have a attitude, one time they forgot to put my order thru and I was on lunch break I had to wait for them to put it through again. I went there again today it took them 45 mins to make pancakes smh never again.", "rating": 2, "date": "2/19/2017"}, {"text": "I think they have way too much stuff going on w the menu- The food I ordered seemed like it was something frozen they threw in the microwave and then buried it in too much butter. It&amp;#39;s overpriced in every way . Mixed drinks are weak and watered down for $12.00 each! Won&amp;#39;t go back.", "rating": 2, "date": "12/29/2015"}, {"text": "Came here on a busy Saturday afternoon so I expected a bit of a wait however after receiving our drinks and an appetizer along with some really hard bread and almost frozen butter we waited an additional 30 minutes at which point our waitress came over and asked if she could wrap up the remainder of our appetizer to go. Ummm no thanks we haven&amp;#39;t had our entree yet. She looked confused and walked off. Hoping she went to get our entrees, we waited an additional 15 minutes. Finally I spotted her and asked that she cancel our entrees and give us the bill for the appetizer. Again the confusion and she just walked away. 5 more minutes and the Manager came over and asked if we were sure we didn&amp;#39;t want our entrees that it would just be a few more minutes. I explained we had been waiting for 45 minutes and really just needed to leave and go get something to eat at that point. You&amp;#39;d think he would have offered a discount on the entrees, or give us the 7.00 appetizer on the house. Nope. Not sure what the issue was as there were several tables around us that arrived at the same time or minutes after us and had been served within 20 minutes. There were only 2 of us. Anyway there you have it. Hope y&amp;#39;all get better service.", "rating": 1, "date": "8/25/2018"}, {"text": "Similar to Noel P, I just waited on hold to place takeout order for 5 minutes, hung up, called back saying that I was on hold for 5, without apology was told they&amp;#39;d get someone, before holding another 5 minutes and hanging up again.  The same thing happened a few months ago before getting lucky on the 3rd try.  Taking phone orders isn&amp;#39;t that hard... this place desperately needs new management.", "rating": 1, "date": "6/21/2016"}, {"text": "Went there with my wife Feb 13, thought we would skip the Valentines day crowd. 117 minutes later we get a text. (Yeah 117 minutes after being told a 90 minute wait time) What a disappointment service was slow, food was subpar at best not to mention overpriced. Steak was ordered medium. We got the charred version. We just wanted to get out. My advice... Go somewhere else, avoid the headache.", "rating": 1, "date": "2/20/2016"}, {"text": "Not bad ever, love cheese cake factory as it really lovely restaurant. Don not miss teriyaki chicken and cashew chicken.", "rating": 5, "date": "1/28/2015"}, {"text": "First visit of the new Trumbull location. Kids are excited as we visit re factory when we visit Florida every year. Place was mobbed but they still brought out our good timely and everything was great especially the pear arugula and blue cheese flatbread yum!!!Only complaint was the roast chicken was overlooked and dry. It is a packed Friday night. They they brought the whole table desserts and sincerely apologized. That&amp;#39;s great service and we will be back here many times in the near future.  Laura our server was really great. Very attentive, very nice and well informed. Hope we get her again!!", "rating": 4, "date": "9/5/2014"}, {"text": "The Cheesecake Factory is always a good option especially when you are craving sweets. Their food is very good, although sometimes a little pricey, but I always get their famous cheesecake which is worth every penny. Most of the times I have visited here I have just gone with friends and order cheesecake and drinks. I have never had a long wait either (but have only gone during non-busy times) and the staff is always friendly.", "rating": 5, "date": "1/31/2016"}, {"text": "Overall unpleasant experience. From the INSANE wait time to the complete lack of attention and bad food. I&amp;#39;m sorry but this is just not a good choice. Please consider that you would be waiting an awful amount of time for a bad experience.", "rating": 1, "date": "3/11/2018"}, {"text": "Honestly, I&amp;#39;ve had mixed feelings about this restaurant for a while. Today I came in and the wait staff completely ignored me and party. When I complained about my pasta they made me wait almost an hour and they didn&amp;#39;t fix it. WORST DINING EXPERIENCE EVER!!. I will never eat here again, I personally wouldn&amp;#39;t recommend it.", "rating": 1, "date": "3/3/2018"}, {"text": "yo this place was super scary it&amp;#39;s like pitch black u need a flashlight to eat. a very freaky place there&amp;#39;s like serpents all around the lamps and evryones watching you", "rating": 5, "date": "3/2/2018"}, {"text": "I&amp;#39;d heard this place was coming &amp;amp; I counted down the days until opening day! As the date drew closer, my friends &amp;amp; I decided we should get a group together to support this great business, that&amp;#39;s new to our locale! So we gathered &amp;amp; headed over to enjoy the famous cheesecakes! <br&gt;OK I know, I know it&amp;#39;s a chain restaurant &amp;amp; they usually have long wait times... &amp;amp; this location is no different in those things, but they also have some good food, servers who want to do their job, &amp;amp; oh FANTASTIC CHEESECAKE!!!! We got here w/our grp,  &amp;amp; we waited a while, but  I spoke w/Mike, &amp;amp; he tried to help us get our large grp in &amp;amp; so while he worked on that, we amused ourselves &amp;amp; other guests while we waited. <br&gt;We had all phenomenally AWESOME GREAT time w/good friends &amp;amp; supreme cheesecake!!!! We didn&amp;#39;t try any of their regular foods,  just deserts. ..all was very good, including service!! We look forward to our next visits individually &amp;amp; together. <br&gt;<br&gt;Side Note to Corporation:<br&gt;ONE suggestion to The Cheesecake Factory Corp, while I know they don&amp;#39;t currently take ANY reservations, at ANY OF THEIR LOCATIONS, they SHOULD REALLY CONSIDER accepting reservations for larger groups, at ALL locations. (Or at the very least do a &amp;#34;trial period&amp;#34; of this concept at select spots and see what sort of response they get from both customers, employees,  &amp;amp; sales). They could call, email, and/or text also, to confirm the details, so as to avoid no shows etc. I think this would encourage more business for them &amp;amp; happy customers overall. I had no issues for this visit, but just think that for the business, the community, &amp;amp; all in general, it&amp;#39;d be something they would be wise to consider. Just a thought!  :)", "rating": 5, "date": "8/8/2014"}, {"text": "Pretty interesting first time experience at the Cheesecake Factory.  I felt like I was in Las Vegas at a buffet with the design of the resturant and the huge diversity of culture. The place was absolutely packed yet service was still very good, even from the trainee Leon, who may have been better than our actual waitress. But now writing this review, when it comes down to it, it was still just mass produced chain restaurant food. Huge menu, great service, just didn&amp;#39;t have that homemade feel.", "rating": 4, "date": "12/27/2015"}, {"text": "This poor rating is reflective of the drink prices not being posted in the menu. Wow, what a shock when the bill came. Really disappointed that the restaurant would intentionally mislead it&amp;#39;s customers just to make an extra buck. Too bad because the food and service was ok. They lost a customer today....", "rating": 2, "date": "2/20/2017"}, {"text": "Seated and waited on promptly. The waitress was nice. We ordered 2 orders of the filet mignon both were supposed to be cooked med but we&amp;#39;re well done with the burnt taste ruining them both but mashed potatoes were good. Also ordered the Chicken Madeira with Steak Diane combo. The steak was good and cooked correct but the chicken was disgusting, it tasted exactly like a burnt omelette. The mashed potatoes were good. I would not return.", "rating": 2, "date": "4/22/2016"}, {"text": "Wouldn&amp;#39;t take Samsung pay (credit card via phone) or wouldnt take my credit card numbers, had to be a physical card. Just lost a customer.", "rating": 1, "date": "9/5/2016"}, {"text": "Ugh where do I begin!? THE WORST SERVICE EVER!!!!Stopped by for a &amp;#34;supposed to be quick lunch&amp;#34; while me and my friend were shopping at the mall. Ended up being almost 2 HOURS from start to finish. Once inside we did notice they were a little busy, but decided to sit down anyways. Went over to the hostess stand and was seated immediately. Afterwards, no one acknowledged us for almost 15 minutes since we sat down. <br&gt;<br&gt;While we were waiting for the waiter to come I was already getting frustrated with the fact that there were so many servers passing by and not 1 could say &amp;#34;someone will be right with you&amp;#34;. We should have left right then and there. Anyways, once our server did come, which I don&amp;#39;t even know his name because he never introduced himself, he asked what we wanted to drink. We placed our drink orders and an appetizer, since we were still deciding on the main course. <br&gt;<br&gt;Long story short, we waited almost 15 minutes to get our drinks alone, and I had to ask for some bread for the table since we were starving. Once our server left the table he literally stood around and chatted with co workers instead of getting our drinks. <br&gt;<br&gt;Then the appetizer arrived which was delivered by another server, and I had to ask that guy for my glass of water which OUR SERVER forgot. About 15 minutes later our  server came by to check on us and I told him we were ready to order our main course, but he took FOREVER to put the order in the computer. We saw him stand around and talk with co workers AGAIN instead of putting our food order in. SERIOUSLY!?  We literally waited another 20 minutes for our main dishes. <br&gt;<br&gt;Once we were done eating, we wanted to bring a piece of cheesecake home and get the bill. Again the waiter was ignoring us or just simply forgot to check on us, and kept walking by. Once he did come back to our table we waited another 30 MINUTES to get the check and piece of cheesecake to go! That&amp;#39;s ridiculous!!! I wanted to just get up and leave already but we were waiting for the change. <br&gt;<br&gt;I understand it was busy but 2 other tables sat around us and they were helped immediately and received their drinks and checks before us! What kind of s*** is that!? I was getting really ticked off, to the point where I just wanted to get up and leave. <br&gt;<br&gt;As far as the food, it was okay.. Nothing special. Definitely won&amp;#39;t be returning unless they fix their service and staff. Hostess was rude and asked me with an attitude to move my dirty dishes from the table next to us so she can seat a party. UM HELLO LADY WE PUT OUR PLATES THERE BECAUSE NO ONE CAME AND REMOVED THEM FROM THE TABLE SO WE HAD NO ROOM TO EAT! <br&gt;<br&gt;That was my experience at the Cheesecake Factory in the Trumbull Mall. Unless you have a couple of hours to waste on sitting down and eating here, I would suggest you skip it and go somewhere else!", "rating": 1, "date": "8/16/2015"}, {"text": "Service was terrible. There were dozens of empty tables but there was a line to sit, so we grabbed an empty booth in the bar. They took our order and disappeared...for over 45 minutes. Didn&amp;#39;t bring out the salad even before the meal. Finally they brought our meal minus the sides which didn&amp;#39;t arrive until we were done eating. The food was ok, it was just like pulling teeth to get it. They just could not possibly have cared less. Never going back!", "rating": 1, "date": "7/12/2015"}, {"text": "After the 30 min wait for our table, we were finally seated. Unfortunately, we didn&amp;#39;t have a waiter even stop by to give water or utensils for at least 20 mins after we sat down. I was with a party of 5 so the time passed as we looked over the menu. I finally got so agitated that I pulled a waiter over to explain that we were waiting for 20 mins without any service. She immediately helped and was very professional and sweet. However, our drinks were lack luster and food could use some more flavor. Waitress was the best part of our dinning experience.", "rating": 2, "date": "9/26/2015"}, {"text": "The relatively new outside seating arrangement in front of uniqlo is very nice.  Comfortable chairs.  The Jamaican black pepper shrimp on the menu is a perennial favorite. One bad change to that menu item is the replacement of the mango salsa with pineapple. That&amp;#39;s a big noticeable change for the worse. Being the mango salsa back please", "rating": 4, "date": "1/1/2017"}, {"text": "I had an awful experience here and haven&amp;#39;t been back since. The food was not appetizing at all and I had to wait half an hour just to return my dish because the waitress seemed to just disappear. What I can say is that the manager at the time was very helpful and apologized for our experience.", "rating": 2, "date": "12/20/2016"}, {"text": "I have eaten there three times now.  My first mistake was going the day after their grand opening.  From the time we were seated thru the time we left...2-1/2 hours had passed and I was more than upset.  Nothing fancy was ordered either plus NO desert.  Food was great but I wouldn&amp;#39;t wait that long gain.<br&gt;<br&gt;We waited about 6 weeks to try it again.  I actually ordered the same food.  I was surprised that the food was overly salted which took away from my eating experience. This time we were there just under 2 hours.<br&gt;<br&gt;Our third time there was disastrous l, I ordered a special, 1/2 sandwich with cup of soup.  The sandwich couldn&amp;#39;t be held...it just fell apart...<br&gt;<br&gt;Our wait person was also servicing a table to our left.  Our tables were too close together...not for our waitress though!  She squeezed herself right in there but her butt was in my face and so was that napkin she had in her back pocket.  That thing moved items on our table plus kept hitting me every time she stood between the tables. <br&gt;<br&gt;I was disappointed with every aspect of my meal....I couldn&amp;#39;t wait to get out of this overly noisy environment where the music was was set too high to have any kind of conversation.<br&gt;<br&gt;I follow the 3-strike rule....I&amp;#39;m out of there now and for good.  The wait staff have learned bad habits from the get go and now have perfected them to a fault.  Too expensive for a mediocre experience.", "rating": 2, "date": "12/16/2014"}, {"text": "I ordered take out here one night while I was in the area. It was by far the worst. Opened up my containers only to have reheated microwaved food. The burger bread was soggy, my rolls were not even crispy and burnt chicken. I immediately called the restaurant to express my dissatisfaction. I love eating from the Cheesecake Factory but that one occasion was a complete turnoff.", "rating": 1, "date": "7/4/2015"}, {"text": "The bartenders think that the bar is a dividing wall that customers cannot hear beyond. One asked me if I was waiting for takeout and then turned away (service bartender). Customers don&amp;#39;t wish to be party to their banter while trying to enjoy my dinner and get some work done. The soup was over-seasoned and I sent it back. No apologies from the bartender Phylicia. Thumbs down.", "rating": 2, "date": "3/30/2016"}, {"text": "Cheesecake Factory as usual has giant portions of yummy food. The wait is always insane so go before you get hungry. The wait will help you power through your meal and have leftovers for later.", "rating": 4, "date": "3/6/2016"}, {"text": "I always have an unpleasant time at this particular Cheesecake Factory. There seem to be many servers, adorned in white and bustling about, but for some reason the service is EXTREMELY slow. My glass of water doesn&amp;#39;t seem get refilled until my waiter is around my table for me to flag him/her down. <br&gt;<br&gt;As for the food, it always looks appealing on the menu and even on the warm plate itself... however, the taste is either completely bland or ordinary. For a place that charges the prices that they do for their dishes, I expect more flavor -- or at least something to write home about. But sadly, this is never the case. <br&gt;<br&gt;Save your money and spend it elsewhere. You will be much happier if you take my word.", "rating": 1, "date": "2/8/2015"}, {"text": "Ordered a meal to go . Said it would be 20 mins. I get there and apparently they gave our food to someone else. Offered free cheesecake which is cute and all ..but doesn&amp;#39;t take away from the fact that I had to wait for another order.  The service at this location is not good. Would rather drive to Danbury than eat here.", "rating": 2, "date": "10/29/2017"}, {"text": "Went to The Cheesecake Factory weeks ago with my daughter and her mother on a busy Weekend night. Had a fun experience and our waitress Georgia was very nice and attentive. Great service overall and made us feel very welcome. The food was flavorful as always and the drinks were well made. I&amp;#39;m sure we&amp;#39;ll be visiting again soon.", "rating": 5, "date": "3/26/2016"}, {"text": "Last night our family decided to eat at the Cheesecake Factory in Trumbull.  This experience was very disappointing.  We did not mind the 50 minute wait to be seated.  Our server Erma was very attentive and polite.  What was disappointing was the long wait from the time we were seated to the time we received our food.  The quality of the food was horrible.  I ordered the Cajun Jambalaya and had to send it back because the pasta was under cook.  The waitress stated that the manager will come over and speak to us but she never came over.  My niece ordered the chicken Alfredo and was not happy with her choice.  We ordered desert and that was an additional 25 minute wait.  When we received our check, Erma stated that my meal and beverage was comp by the manager.  In actuality, we were charged for a extra Cajun Jambalaya.  We had to wait for the extra meal to be taken off our bill.  Best part of meal was the iced green tea.", "rating": 1, "date": "6/28/2017"}, {"text": "First time I was ever disappointed at Cheesecake Factory. Ordered salmon salad off the regular salad menu, not the appetizer salads. Salmon was served cold, salad was nothing notable. Ordered a glass of Pinot noir and it was gross, not good wine at all. Def a disappointing visit. Could just be the items I picked.", "rating": 2, "date": "12/5/2014"}, {"text": "My mom and I had lunch at Cheesecake Factory yesterday ( Monday ) afternoon. The place was packed but we were seating quickly and met our waiter shortly after seating. We ordered the lunch fish and chips and the lunch margarita pizza with Caesar salad. Food came out quickly but you could tell the fish was frozen and the pizza seemed like the lean cuisine ones you throw in the oven! Our waiter was M.I.A. for the most part of our luncheon, it took about 20 minutes just for us to get the bill. I will say the tiramisu cheesecake was perfect. Overall, I would not come back here.", "rating": 2, "date": "12/30/2014"}, {"text": "I usually love the Cheesecake Factory. This experience was not up to par mostly due to service. It was busy but not overly crowded.<br&gt;The waiter did not know what light dressings were available so brought regular instead. The food was brought out sporadically. There were three of us and we each got our food at different times delivered by different people. When I finally did get the light dressing it was horrible. It was the light mustard but had no taste. The rest of the food was delicious but the crab bites were expensive for the price. The Asian chicken tacos were great. I don&amp;#39;t usually write reviews but I really like that Cheesecake Factory has a light menu that tastes good. I hope the one here gets its act together.", "rating": 3, "date": "2/28/2016"}, {"text": "Everytime I go the food is great. Sometimes there are long lines but for the most part not much waiting. The molasses bread is my favorite. I love that there are so many choices on their menu so that whatever type I&amp;#39;m in the mood for they have", "rating": 5, "date": "12/20/2015"}, {"text": "I&amp;#39;m a big fan of The Cheesecake Factory. I think I went too early, it was just open a few weeks, but there were some kinks. Overall, we ate (my wife, my 2 little girls and myself) and we agreed that we would go back and give it another shot. I love the ambiance and locality of it, right in the mall! Plus, where else can you get &amp;#34;cheese cake this good?&amp;#34;, no where!", "rating": 3, "date": "2/16/2016"}, {"text": "I was at the mall today and in need of some lunch so I called to place an order for take-out! The girl on the phone seemed sweet, but a little confused when I asked to place an order for the Baja Chicken Tacos! She took my name, number and order and then told me they would be ready in about 20-25 minutes (which seemed a little long but I figured it was busy due to today being a holiday). I arrived about 22 minutes later and proceeded to the counter to get my order! Again the girl was very sweet, but a little unsure of herself! In fact she almost let me walk out without completely paying for my meal (I had a gift card that didn&amp;#39;t cover it). However, the main reason for the two stars is I paid $15 (9 from the gift card and 6 out of pocket) for four tacos. No sides whatsoever were packed in my bag (it comes with rice and beans). I usually wouldn&amp;#39;t say anything, but this isn&amp;#39;t the first time this has happened to me (whether I was eating in or taking out). $15 for four tacos is simply unacceptable!", "rating": 2, "date": "10/8/2018"}, {"text": "Standard Cheesecake Factory location. I thought it was common knowledge that they&amp;#39;re known for their long menus and long waits, are people really complaining about this? CF is packed regardless of where it&amp;#39;s located, so I would expect to wait an hour or so for a table, longer if you&amp;#39;re going during peak times. Why not peruse through their 18 page long menu while you&amp;#39;re waiting an hour for a table? Kill two birds with one stone. <br&gt;<br&gt;This location gets an extra half star for having a text messaging system to notify you when your table is ready, and another half star for being attached to the mall. This means I can shop while I wait, therefore it doesn&amp;#39;t feel like a wait. If I don&amp;#39;t want/need to shop, I just go to Target (also in the mall) because c&amp;#39;mon, you always need to grab something from Target. Again, use your noggin&amp;#39; here, y&amp;#39;all. <br&gt;<br&gt;Food is well above average for a chain restaurant, service is always friendly (and the one time our food was taking a while to come out, we were proactively offered comped dessert due to the wait), and I&amp;#39;ve never been unhappy with a meal here. My personal favorite is their ahi carpaccio, which I&amp;#39;m guilty of ordering as my meal every time we go here. Give me all of the ahi tuna!", "rating": 4, "date": "9/15/2014"}, {"text": "Love the Cheesecake Factory. Almost always impressed with what I order. Fried macaroni and cheese is a favorite. My friend likes the appetizer that&amp;#39;s fried zucchini and mushrooms. The chicken Madeira and other pasta dishes that I&amp;#39;ve tried are delicious. I&amp;#39;ve also had great steak off a friends plate from here. Oh and the bread that they bring out to the tables is great.", "rating": 5, "date": "8/13/2015"}, {"text": "I&amp;#39;ve given this place plenty of tries and each experience is worst than the last. Wait staff, amazing at their  job. But they are always out of stuff. My most recent trip was last night. I wore a scarf and left it there by accident. Called this morning to make sure it was still there and it wasn&amp;#39;t. But the fact that I had to sit on hold for 25 minutes to be told no, then click hung up on. Absolutely rude! I want my f**king scarf back.", "rating": 1, "date": "10/31/2014"}, {"text": "Go at an off hour to get seats right away. Love the four cheese pasta and strawberry shortcake.", "rating": 4, "date": "11/11/2015"}, {"text": "Decided to try this new restaurant for the first time. Settled on brunch. As we&amp;#39;re walking in the front door we noticed a a really bad smell. Turns out the restaurant loads it garbage into the garbage truck next to the front door. There was spilled garbage and fluids across the parking lot where one would enter the restaurant. Food was ok service was. But couldn&amp;#39;t seem to get that smell out of our heads. I did try to make contact with rest no response.", "rating": 1, "date": "9/30/2014"}, {"text": "The worst cheese cake factory I&amp;#39;ve ever been to. We were seated quickly, saw our waitress once to take our order, appetizers were luke warm. After the appetizers we didn&amp;#39;t see our waitress for the next 45 minutes or so.  My plate was served by a different person and that too was luke warm. We asked for a manager since we couldn&amp;#39;t even get a refill in our drinks and he did nothing, he himself actually took too long to get us the check. Worst part of all is I got food poisoning once I got home a few hours later. Never coming here again.", "rating": 1, "date": "9/11/2014"}, {"text": "the place really bad the truth expected otherwise the meal was unpleasantly unpleasant we went to celebrate the birthday of a friend as a family and we really expected another quality of service and even attention food my mother spends all night after going out to eat from here and the truth we had another idea of ​​what could become Cheesecake Factory A Horrible Experience if you can avoid it do not go or come here.", "rating": 1, "date": "10/30/2017"}, {"text": "Meatloaf was good. Garlick noodles were terrible. Pasta was not done correctly. Returned the dish. Very very noisy. Not a good environment. It will be a very long time before I return here.", "rating": 1, "date": "9/27/2014"}, {"text": "Service is terrible- I&amp;#39;ve been there twice dinning in and once for take out- they messed up my take out order which was annoying, and dinning in- we waited forever for our food to arrive and the second time- they were &amp;#34;out of stock&amp;#34; for what I wanted to order- which was frustrating. But I still love their cheesecake...", "rating": 2, "date": "10/23/2014"}, {"text": "Food was okay and I got served cold pasta dish and the manager came and apologized with half his eyes closed and brought me another in a few mins - probably just took the old dish and microwaved it and the manager told me it was made all fresh", "rating": 2, "date": "6/27/2015"}, {"text": "The food dishes come out pretty big for the price you pay. Extremely long lines, also we had a waiter that was supposed to come refill my drink and returned 10 times to our table with no drink. I ate my entire meal waiting for our drinks and he didn&amp;#39;t even offer us a different drink. For paying 300$ I think they would have some better waiters.", "rating": 3, "date": "11/28/2015"}, {"text": "I hate waiting 20-30 minutes for these chains and then the food is subpar.  Ordered the Americana Burger and it came 15 minutes after everyone else in my party and was burnt. Might as well go to McDonald&amp;#39;s", "rating": 2, "date": "11/15/2014"}, {"text": "When they first opened the food was very good but it has since gone die hill. Service is slow and food subpar. I went to the one at the Trumbull mall and I would have had a better meal at the food court.", "rating": 2, "date": "12/4/2016"}, {"text": "Went for dinner on a slow Monday night with family (7 total) and got horrible service!  Even after asking, two of us didn&amp;#39;t get appetizer plates and we had to ask for silverware.  No drink refills, and a very rude waitress treated us like an inconvenience.  They didn&amp;#39;t clear the appetizer plates or serving dishes off the table.  The worst part of all is that they made an error with one of entrees and did not bring it out till everyone else was done eating.  The waitress downplayed the error, didn&amp;#39;t acknowledge or apologize or offer any reconciliation.  Even when slow and fully staffed we were surprised to see such slow and bad service.  After asking the waitress if we were charged for the entree that didn&amp;#39;t arrive until the end, the waitress said the manager is working on comping that plate, but upon receiving the check, it was still charged.  Will not be returning and do not recommend to others.", "rating": 1, "date": "11/28/2016"}, {"text": "This place is my choice when heading home up the Merritt Parkway from New York City.  Once you get onto Route 15 you enter wilderness with no good restaurants until this one, in the big mall at Trumbull CT.  It&amp;#39;s like most other Cheesecake Factories, solid, reliable, decent food.  Noisy but they all are", "rating": 4, "date": "11/11/2015"}, {"text": "Since attending the opening last year, I have stopped in about a half dozen times. There&amp;#39;s typically a long wait, which is pretty common for any Cheesecake Factory. The food here is good and consistent with other locations. So why the three stars? The food is a little bit pricey and I just feel like you could get homemade food at a small and charming restaurant one town over in Fairfield.", "rating": 3, "date": "7/3/2015"}, {"text": "We had a very poor experience the last day of no tax Saturday. As you may imagine it was very crowded. We were told the wait would be 15 minutes and was actually 40 minutes. It took another 30 to 35 minutes to get our food. Altogether we were there for 2 hours. When the food came two of the three meals came together while the third took another 10 minutes. . Mediocre at best. The highlight of the meal was the fries which were very good. The Kobe burger was nothing special. Soup was too rich. Even the cheesecake was to dense and too sweet. They certainly could not handle a large crowd.", "rating": 1, "date": "8/24/2014"}, {"text": "We are all about the Cheescake! We love the variety and they are so many to choose from! Definitely for the cheesecake fan! :)", "rating": 5, "date": "2/9/2016"}, {"text": "The worst service and slowest kitchen imaginable. Walked out after waiting interminably long to receive the meal and was glad I did so. Spoke to others who had the exact same experience.", "rating": 1, "date": "11/24/2014"}, {"text": "Absolutely terrible!!!! I waited an hour to be seated in a crowded almost cafeteria style like seating area. Then they took our order (for two people) and we waited another hour and no food or updates. The people who got there after us got their food before us. I dont know how they expect to have a menu thats 15 pages long (thats an exaggeration but still) and stay in business. Also there were flies everywhere flying around!", "rating": 1, "date": "11/6/2014"}, {"text": "Never disappointed! Great menu! great drinks! And kid friendly. Awesome staff haven&amp;#39;t had a bad experience yet!", "rating": 5, "date": "5/26/2015"}, {"text": "Only reason 3 stars is there staff makes you wait so long for your cheesecake  and the entire menu is just too large.   Overall everything is good though", "rating": 3, "date": "6/21/2015"}, {"text": "Save your time and money.  Very disorganized at the hostess station, waiter was attentive and tried best to do a good job.  Food is mediocre at best.  2 people in our party immediately had to use the bathroom after eating.   For the price paid go to a nice non corporate restaurant", "rating": 2, "date": "9/4/2016"}, {"text": "Overpriced and not that good. LOVE the cuban rolls thats it !!When it first opened it was slightly better but why i  give it two stars is because of the nasty nasty staff in place right now!!    When they first opened i had never had a bad experience until recent months. Hostesses and whoever answers phones for take outs should be fired! Wish i knew who spoke to me the way they did one time while i was placing a take out order... they left me on hold for over 10 minutes then I called back and when she asked me to hold again I told her I was waiting while and I needed to place my order.  she was extremely rude to me and  reprimanded me that she had other customers and placed me on hold again!!! I drove all the way to the mall and still on hold walked into the Cheesecake Factory with my phone on hold and they were all standing around talking doing nothing no other customers in sight !!! The worst part was there phone line was ringing and they were all ignoring it.", "rating": 2, "date": "5/13/2016"}, {"text": "Food was good, prices were fair, seated us fast and drinks were good ... So was the cheesecake as expected", "rating": 4, "date": "3/3/2015"}, {"text": "Horribly unhealthy, crazy portioned food. This is a classic example of typical  &amp;#34;American&amp;#34; cuisine. Huge portions. A mountain of sodium and sugar per serving. The plus side is: convenience. It&amp;#39;s a chain so certain standards such as decor and music are standardized by corporate. I am not a fan of chain restaurants and this is why: you cannot maintain the same quality of food when you have hundreds of locations. Quality is reduced to increase revenue. Cheesecake Factory is no exception. Contributing to the obesity epidemic with monstrous portions and lack of fresh ingredients is not a restaurant I want to support. If your with a big group of people who want to eat and want to eat big, this is the place to do it. Happy Hour is also pretty decent with half priced appetizers and discounted drinks. Although the drinks are watered down. Come here for CONVENIENCE. Nothing more. If this is your favorite place and you can&amp;#39;t live without it, venture out more.", "rating": 2, "date": "6/12/2016"}, {"text": "What can I say. We have been waiting forever for this place to open locally and it is finally here! And it delivers. Great food, good service and friendly waitstaff. Oh and the deserts were amazing.", "rating": 5, "date": "6/29/2015"}, {"text": "If you read this, CF, know I will not return and it&amp;#39;s mainly because of the exorbitant price of your coffee!! Really, 3.25 for a small cup??? Did Juan deliver the beans?? And, while I&amp;#39;m at it, a glass of soda for the same price? I could buy a 6-pack!  Cheesecake slice, 7.95.  Nope, will not return.  There are many other choices out there.", "rating": 2, "date": "6/8/2017"}, {"text": "loved the food drinks and service. Firecracker salmon is my fav.... in middletown, NY I&amp;#39;ve tried others.... no match", "rating": 5, "date": "10/14/2015"}, {"text": "Food is great. Servers are still pretty new. But not bad. I recommend that you order right away the kitchen it&amp;#39;s still pretty slow. So if you are not in a hurry for good food this is definitely the place to go.", "rating": 4, "date": "1/21/2015"}, {"text": "I have had hit and miss experiences at Cheesecake Factory. I went in to meet a friend for lunch and got sat right away, which was nice. There was four of us in total. Our waiter constantly checked in to see if we were ready to order which was a little annoying. It felt a little like we were being rushed. We put our orders in the food literally came out one by one. Everyone ordered something that needed to be cooked, I ordered a salad and mine came out last and like ten minutes after everyone else&amp;#39;s food came out. Thankfully everything tasted really good! I&amp;#39;d go back again but would really hope for some better service.", "rating": 3, "date": "11/13/2015"}, {"text": "Keeping in mind that this location is brand new and just opened up for less than a month, they&amp;#39;re still working out some kinks.  I&amp;#39;ve always been a big Cheesecake Factory fan, which is why I wasn&amp;#39;t surprised that this place was completely packed Sunday night.  If you are going in with a party of 2 it shouldn&amp;#39;t be too bad, my wife and I waited for about 30 minutes but I like the fact that they have text message system rather than the little vibrating sensors that let you know your table&amp;#39;s ready.  It allows you to go further away from the restaurant and shop the mall while you wait and not miss the alert.  Bigger parties, you&amp;#39;ll probably be waiting an hour or more depending on what time you go.  <br&gt;<br&gt;After reading the few reviews posted so far I was trying to keep my expectations in check and not being over hyped.  We had 2 waitresses attending our table which was great, probably 1 in training.  Joclyn was very professional and attentive.  We got our drinks and bread quickly and the bread was very fresh and still warm.<br&gt;<br&gt;We ordered the Fire Cracker Salmon Rolls for appetizer which came out at a reasonable pace.  For entrees we had 2 different pastas, both arrived at the same time and still very hot and fresh.  I was also surprised that they were seasoned very well and portion size was excellent as usual with Cheesecake Factory.  <br&gt;<br&gt;I couldn&amp;#39;t say the same for the table next to us, they had some issues with their order (too much cheese on their pizza... wth?) <br&gt;<br&gt;Anyway, we also got the banana cream cheese cake which was very smooth and delish. <br&gt;<br&gt;Overall, we had an excellent experience this time and I hope it&amp;#39;ll continue the next time we return.  I was happy with the service we received from Joclyn and no complaints about the food despite the other reviews and our neighboring table.  <br&gt;<br&gt;There can be room for improvement at the entrance as it gets pretty crazy crowded during times and confusion occurs as some people picking up take out or just buying cheese cake get all mingled with the other restaurant guests waiting for tables. The front end people seemed kind of stressed as they don&amp;#39;t really smile or act alert when guests try to get their attention, but I assume their just really trying to focus on seating everyone.", "rating": 4, "date": "8/20/2014"}, {"text": "Vast menu keeps it interesting to try new things.  Glad they opened in our town.  Very enjoyable to lunch there after shopping.", "rating": 4, "date": "7/29/2015"}, {"text": "The  so called &amp;#34;skinnylicious&amp;#34; menu is still very fattening and bad for you. There are no healthy choices here. The cheese cake slices are standard. The best would have to be the classic cheesecake with strawberries on top. Overall a average place. There&amp;#39;s also always a really long line to get in and it&amp;#39;s really crowded and noisy. The bread they give you tastes good though, better than most entrees dishes they have here", "rating": 2, "date": "2/27/2017"}, {"text": "Got take out from here. Standard meals. Messed that up. Cheese cakes were ok. Food was wrong. Had to drive back to change. Original food was let out for 20 min, not  recooked like manager said. Very disappointing. Cold food was mediocre at best. Terrible experience.", "rating": 1, "date": "10/17/2015"}, {"text": "Huge disappointment.  Waited two hours after being told no more than 80 minutes.  Food was just okay. Did not compare to my experience at the west Hartford location which was exceptional.  Pasta and shrimp was bland and overcooked. no better than average diner food.", "rating": 1, "date": "1/17/2015"}, {"text": "MIXED FOOD EXPERIENCE.  We went here on a Tuesday and were very surprised how busy this restaurant was.  The inside is very warm and inviting.  If it weren&amp;#39;t for the windows leading to the inside of the Trumbull Mall, you&amp;#39;d never know you were there.  We came to celebrate a birthday and were not disappointed in how the entire staff took the time to wish us a Happy Birthday.  <br&gt;<br&gt;The mixed experience had to do with overall taste.  It clearly has to do with the overwhelming menu choices.  I&amp;#39;ll list what we had and rate them individually due to the flavor inconsistencies.<br&gt;<br&gt;1.  Avocado Rolls, 3 stars.  Chewy<br&gt;2.  Chicken and Mushroom lettuce wrap, 4 stars.  I would have given it 5 stars but I got one piece of lettuce that was just the right size and the rest were too small for the filling.  Great flavor<br&gt;3.  Cuban Sandwich 1 star.  It tasted nothing like a Cuban and had a sauce that was similar to tarter sauce, which made each bite unpleasant.<br&gt;4.  Spicy Chicken Chipolte Pasta ,1 star and it was sent back due to unsavory flavor and it came with just a few chunks of chicken.<br&gt;5.  Stuffed Chicken Tortillas, 2 stars.  Lacked flavor, was forgettable.<br&gt;6.  Chicken Madeira, 5 stars.  Chicken was soft and flavorful.  It has plate licking qualities.<br&gt;7.  Chicken Madeira and Steak Diane, 5 stars.  I already described the mouth watering chicken.  The steak was cooked to perfection and was satisfying to the palate.  <br&gt;8.  Reese&amp;#39;s Peanut Butter Chocolate Cake Cheesecake, 5 stars.  Big enough for two to share.<br&gt;9.  Godiva Chocolate Cheesecake, 3 stars.  Big enough for two but too rich for my taste buds.<br&gt;<br&gt;I was a little surprised that, for the prices they charge, a soup or salad was not included with our main course meals, 2 stars.  If you are going to charge these prices, you should be providing more.  A basic bottle of The Cheesecake Beringer wine was $32.<br&gt;<br&gt;No one was overwhelmingly impressed with this dining experience.  I&amp;#39;m glad we tried it, but probably will not return.  Too many unsatisfied taste buds to justify a return visit.", "rating": 3, "date": "9/24/2014"}, {"text": "The organization of the restaurant has been spotty.  We have been ignored with the place half empty and not been assigned a waiter after sitting down.  We have sat in the bar and had 5 staff talking with no service because &amp;#34; no one was assigned the table. &amp;#34;. The food is good in terms of quality but management seems to be poor.", "rating": 3, "date": "1/5/2017"}, {"text": "There are better options. Mediocre, overpriced food from a diner-sized menu. Their cheesecakes are good (if a bit decadent), but I wouldn&amp;#39;t recommended going for a full meal.", "rating": 2, "date": "7/26/2016"}, {"text": "The Food at The cheesecakefactory is sooo delicious. WE like it so much. And The staff is also very friendly. WE just moved Here from Germany and The Next Time WE will go there for Dinner very often :)))", "rating": 4, "date": "1/26/2017"}, {"text": "Party of six. We left our name/number while we shopped as they don&amp;#39;t take reservations. We shopped and 30 minutes later, our table was available. I received a text. Sooner than expected. The place was incredibly crowded! With more people pouring in.<br&gt;<br&gt;The hostess was visibly frazzled. Folks in this position should be unflappable, gregarious &amp;amp; all smiles!<br&gt;<br&gt;Mel B. Was our server. Very warm + friendly. She started off VERY strong but finished VERY weakly. Nice but forgot about us mid meal. <br&gt;<br&gt;My dish, orange chicken, which I always get at TCF was tasty, the plate was HOT, my food was lukewarm. How does that happen? I&amp;#39;m not one to send food back. <br&gt;<br&gt;Friend #1 ordered chicken wings off the app list. They were very salty. She has never been impressed with TCF &amp;amp; her mind was not changed by her meal last night. Oh yeah, she ordered a salad with her wings...it arrived well after her wings were consumed. Even though she reminded our server about it as she ate her 3rd wing.<br&gt;<br&gt;Friend #2 had skinnylicious enchilada. She thought they were fantastic. I took a forkful...I was not impressed @ all. Mushy and bland.<br&gt;<br&gt;Friend #3 had a side salad and Philly steak + cheese. She loved it. <br&gt;<br&gt;Friend #4 had the chicken chopped salad. According to the menu, it was supposed to be romaine, guess what? It was iceberg! It was on the soggy side. The chicken was barely there. She didn&amp;#39;t send it back...we all know why!<br&gt;<br&gt;Friend #6, a child, ordered the chicken sliders, with fruit salad. They were OK....she never received her cutlery, napkin. So we had to share with her. She went without a napkin, though we asked....SEVERAL TIMES!! <br&gt;<br&gt;My takeaway? The menu is MASSIVE/ HUGE!!!!!! Jack of all trades, master of none comes to mind...except the orange chicken. Lol its never, ever bad. I&amp;#39;ve had it at 3 different TCFs throughout New England. Always the same. Tough to get refills on water. Another server was kind enough to fill in while Mel B. was MIA. She brought over water &amp;amp; salad dressing for friend #6s lettuce/tomato.<br&gt;<br&gt;The cheesecakes...pineapple upside down, key lime, banana, dulce de leche, strawberry all good. They could do a nicer job of presenting them. I&amp;#39;ve been to TCFs where the presentation was beautiful. <br&gt;<br&gt;Will we return? YES! Will they always be busy? YES! This place will bring folks in who are not mall shoppers. We shopped after our meal and left after the mall closed. Folks were still lined up to get in!! The parking lot was jam packed.", "rating": 3, "date": "12/29/2014"}, {"text": "Pleasantly surprised. The food was very good for a chain. Only down side was they were out of a few items and it took a while to get our drinks and silverware. Very busy that night... But the waitress was very nice.", "rating": 4, "date": "6/4/2016"}, {"text": "We had a Great Family Dinner last night. The meal was fantastic and our waitress was Amazing. Her name is Carressa and I would recommend you ask for her when you arrive. She is friendly, kind and caring. We usually do not order dessert, but how can you pass up the Cheesecake. All 3 choices were Perfect!!", "rating": 5, "date": "12/2/2016"}, {"text": "I have tried this location three times now and each it has declined!  Wrong items, cold food, burned food, and the list goes on so have not been back!  Against my own judgement my family is having a reunion and asked to dine there - I called and was told no reservations for a party of 25+.  Asked to speak to a manager and was put on hold for 20 minutes by Kayla and left only to be disconnected!  Called again and was put on hold again and after 10 more minutes yet again to be disconnected.  Considering my past experiences and the challenge to speak to someone above the age of 16 who is not rude, crude and socially unacceptable, I have moved on and will dine elsewhere!  I have never nor will I ever bend over backwards to give my money to a location that feels above the rest!  Over time, this restaurant will fail as the reviews below only enforce each of MY experiences!", "rating": 1, "date": "5/17/2016"}, {"text": "Ok, let&amp;#39;s start here: the smell is disgusting. So gross. Over the summer, after a long day of shopping at the mall, me, my mom, my sister, my grandmother, my aunt and cousin decided to have dinner at the Cheesecake Factory. We walk in and it&amp;#39;s PACKED. We say how many people we are and ask about the wait. They said about 45 mins to an hour. Ok. We have nothing else better to do anyway.  We wait and wait and wait. Then, I went with my sister into the bathroom, and lo and behold, there was VOMIT everywhere. Chunky vomit. And no one was cleaning it up. We high tail it outta there and wait some more. We finally get a table and order. I got enchiladas from the &amp;#34;healthy&amp;#34; menu. They tasted like armpits. Then it was time for the cheesecake, probably the best part of this whole dinner. Me and my sister got the peanut butter cheesecake and it was So. Good. That was the only thing saving that experience tbh. Not the best.", "rating": 2, "date": "10/30/2016"}, {"text": "We finally decided to use gift certificates that we were given for Christmas several years ago. I wasn&amp;#39;t expecting anything exciting, just basic.The place was very busy to begin with. We had to wait for 30 minutes so we walked around the mall. When I opened the menu I was overwhelmed by the extensive list of choices. I kept saying to myself with all of these choices how can the food be any good. It was a long time before we finally got glasses of water and then awhile more before our wine arrived. We wanted to start with the ricotta and meatballs appetizer but after placing the order Lauren came back and said they were out so we decided on the roasted pear and blue cheese flat bread. It arrived and the pears did not look roasted and were cut in large chunks(should have been much much smaller or thinly sliced) but overall it had good flavor. Bread never came to the table and we didn&amp;#39;t think to ask until we were half way done with the meals. Oh and another thing it took forever to get utensils and napkins. We had to use the cocktail napkin with the appetizer. I ordered the Shepard&amp;#39;s pie with apprehension but have not had it in ages and was curious. It was actually really good, I was very surprised for a chain restaurant to make it very tasty. My other half had the chicken marsala and he said it had good flavor but needed more sauce and wished the pasta had been cooked a bit more. I was hoping the lemon cake was on the dessert menu because I had it several years ago at the Fort Lauderdale location and thought it was good. They changed it a bit but it was still quite good. My other half had the dulce de leche cheesecake and enjoyed it very much. Overall not a bad experience but service was lacking and needs to be fixed. We were supposed to get refills on the water and that never happened. Someone is not doing their job.", "rating": 4, "date": "5/22/2016"}, {"text": "Very good restaurant. I will start with the bad first. The two-party seating is very close together and the restaurant gets very busy.  There are no reservations and the wait time can be 2 to 2 1/2 hours on a busy weekend. The restaurant does however have a text message notification system that will alert you when your table is ready via text message; so you can walk around the mall while you&amp;#39;re waiting.  I have never had to wait longer than an hour.<br&gt;<br&gt;I have been to Danbury, Palisades Mall and West Hartford.  This restaurant definitely puts out some of the better food.  The portions are plenty, the presentation is neat and the quality is there.<br&gt;<br&gt;The front of house staff is usually very good; personable and well-trained.  I have been there five times and only once had a waiter that was average, the rest were great.<br&gt;<br&gt;Best time to go is off hours on a weekday.", "rating": 4, "date": "2/22/2015"}, {"text": "My husband and I went to the Cheesecake Factory today.  Service was very good .  Our waiter very nice and quick.  Food was excellent.", "rating": 5, "date": "8/30/2016"}, {"text": "The portions are big yet the food is so-so at best.   My husband had a Mexican dish that he barely touched (he never leaves food on his plate), my son who eats us out of house and home left his eggplant parm on his plate, my gumbo was definitely not the kind you would find in any New Orleans restaurant, and the deep-fried macaroni and cheese landed in the stomach like a lead balloon.  The cheesecake doesn&amp;#39;t make the rest of the meal any more worth eating.  No, this is no longer on our list of places to eat out.", "rating": 1, "date": "5/22/2015"}, {"text": "Always had good food and good service at this one. Until tonight when the food gave me food poisoning. It&amp;#39;s really disappointing too because I did actually like this place and I probably won&amp;#39;t go back for a really long because of this.", "rating": 3, "date": "10/6/2014"}, {"text": "I have been to a number of different Cheesecake Factory throughout the years. But my latest experience at Trumble was the worst one. The service was bad (waited for at least 15 minutes to get greeted by our waitress), dirty utensils, broken glass ( at the rim!!). Worst of all, unavailable dishes 15 minutes after we ordered!", "rating": 1, "date": "5/15/2016"}, {"text": "Wish i can leave 0 stars. My girlfriend and I are currently at cheesecake factory in the mall. Service is absolutely terrible!!! Walked in asked for a table for 2 the host told us 15 minutes (no problem) 20 minutes goes by nothing.... 25 minutes later I have to go up and ask where our table is. The host brought us around the entire restaurant to find us the table and nothing. We ended up going back up to where the host office was waited for another 10 minutes before I had to grab the manager. The manager apologized and looked for a table for us finally after another 5 minutes we sat down. We ordered our drinks and food since we knew what we wanted already and asked for them to bring out the bread. We received our drinks then 12 minutes later our dinner but still no bread. Asked for the bread again didn&amp;#39;t come for another 15 minutes by that time we were done with our meal. Didn&amp;#39;t even bother ordering desert wanted to get out as soon as I can!!", "rating": 1, "date": "8/28/2016"}, {"text": "I was SOOOOO excited for this chain to come near me so I could go, it had been almost 25 years since my friend married in California.<br&gt;<br&gt;I was WAY early as it was tax free week in Trumbull, CT and prime lunch time. They sat me 10 minutes after I got there even though my other two members weren&amp;#39;t there yet. (MUCH appreciated) and I nursed an Iced Tea for 20 minutes.Two servers watched me the whole time and then again once they arrived and again, until we were ready.  (MUCH appreciated). A welcome gift, SOURDOUGH bread, and WARM!<br&gt;<br&gt;The menu is like a book, you really need 20 minutes to even look through the food, if you want a drink, there&amp;#39;s another 10.<br&gt;<br&gt;They have something to please every craving, Chinese, Mexican, American, like HUNDREDS of options including diet/&amp;#34;Skinny&amp;#34;.<br&gt;<br&gt;We started with Fried Zucchini and Fire Cracker Shrimp.  Both were good. 4/5.<br&gt;<br&gt;Entrees were Skinny Shrimp Tacos, BBQ Ranch Chix Salad and 1/2 portion of Shrimp Scampi w/ tomato.<br&gt;<br&gt;We ended with the Coconut Choc Chip Cheesecake. <br&gt;<br&gt;We were stuffed, but it was pricey, thus the non 5 star rating. The staff was very nice and well trained. I am sorry for those that went at the first opening and got bad service. <br&gt;<br&gt; I will give this place a 5 star when I go and I don&amp;#39;t spend $100 for 3 people for lunch. Even though this place isn&amp;#39;t really overpriced that much.", "rating": 4, "date": "8/22/2014"}, {"text": "I&amp;#39;m well-versed in &amp;#34;The Cheesecake Factory Experience,&amp;#34; being that I went to college in Washington DC and frequented many a Cheesecake Factory in my undergraduate heyday.  I&amp;#39;m aware of the long waits for a table, ridiculously huge menu, and obscene portion sizes.  So now, 11 years after finishing college and living back in CT, I was both surprised and curious when a Cheesecake Factory opened in the good ol&amp;#39; Trumbull Mall.<br&gt;<br&gt;The long and short of it is:  My sister and I are both mothers of babies.  She has TWIN newborn sons who sleep all day and I have a 9 month old who - for right now, anyway - is pretty good at restaurants.  We met at the mall (with our mom in tow) to get out of our houses for the afternoon and grab a bite to eat.  I was expecting to do a harried lunch down at the food court but in a moment of somewhat blind ambition, we decided to inquire about a table at the Cheesecake Factory.  My sister prefaced her request to the hostess with a &amp;#34;you&amp;#39;re gonna LOVE us...&amp;#34; and explained that we needed a table for 3 adults, 1 highchair, with room for a double stroller, and - oh yeah -  space to park another stroller.  The very friendly host said it wasn&amp;#39;t a problem and there was barely any wait (it was exactly 12 noon on a Thursday).  Score!<br&gt;<br&gt;After a few moments during which they seated a few other patrons, we were ushered into a large booth where lo and behold, all 3 of us ladies could sprawl out, the boys could nap alongside the table and my daughter could hang out in a highchair, which was brought over immediately.  And we could leave her stroller alongside the barrier/wall between the bar and the restaurant.  2 for 2, Cheesecake.<br&gt;<br&gt;Our incredibly sweet waitress came over immediately to take drink orders, sensitive to the fact that there were 3 babies with us and we would need to a.) probably eat quickly and b.) may need to make a quick getaway in case one of them had a meltdown.  She didn&amp;#39;t rush us at all, but we ordered everything ASAP, and it was all brought out within a reasonable time frame.  Every server who stopped by to deliver a drink/snack/meal was very helpful and friendly, even stopping to pick up one of my daughter&amp;#39;s socks that she had inevitably dropped on the floor.  No one cared when she ate the finger foods I had brought from home (in addition to the meatballs I ordered for her).<br&gt;<br&gt;The food was tasty and the service was great.  The restaurant, being brand-spankin&amp;#39; new, is really open/airy, clean, and has good music playing.  And all three tiny humans were well-behaved and in good spirits.  I realize had we come at a different time of day (dinner vs. lunch, weekend vs. weekday), the wait would have been crazy and the babies would have definitely lost it.  But that&amp;#39;s why I don&amp;#39;t bring my kid out during the &amp;#34;witching hour&amp;#34;.  :)<br&gt;<br&gt;All in all, I appreciate any public place that opens its doors to families of all sizes and doesn&amp;#39;t bat an eyelash when asked to accommodate parents of newborns.  It was my sister&amp;#39;s first time bringing the boys out to eat and we are very glad that the Cheesecake Factory is now in her &amp;#34;restaurant repertoire&amp;#34; - we will be back for lunch again!  Thanks Cheesecake!", "rating": 5, "date": "11/14/2014"}, {"text": "Although I have never ate in I love the take out. The Oreo cheesecake is to die for! Vanilla bean with glazed strawberries is another fave. And the chocolate chip cookie dough. I love ordering their entire cheesecakes. I only wish they were pre-sliced. The menu is also pretty good they have orange chicken, pizza, all types of good eats.", "rating": 5, "date": "1/31/2016"}, {"text": "I&amp;#39;ve been to this Cheesecake Factory several times, the service is good, the quality of the food has always been good and I really can&amp;#39;t complain. It&amp;#39;s a chain, so I don&amp;#39;t expect to be served a gourmet meal.", "rating": 4, "date": "9/8/2015"}, {"text": "Doesnt even deserve a star. Long wait. They said it would be 40 minutes and it was over 2 hours. Very disappointing", "rating": 1, "date": "10/25/2014"}, {"text": "Not impressed at all. The long wait for Cheesecake Factory to arrive and after one visit, im dont. Food was average at best, service was poor. Over priced for a below average experience and average food.", "rating": 1, "date": "9/29/2014"}, {"text": "Excellent food and even better customer service! I&amp;#39;ve been here on multiple occasions and have never been disappointed!! I&amp;#39;ve had the same waitress Azzalee twice and I&amp;#39;m still impressed with the phenomenal customer service I receive! I will return soon!!!!", "rating": 5, "date": "12/10/2015"}, {"text": "We have enjoyed the Cheesecake Factory in other locations, but were disappointed with our family&amp;#39;s first visit to the new Trumbull site.  There was a minimal wait that evening to be seated, which was a pleasant departure from typical one hour waits at the company&amp;#39;s restaurants.  Unfortunately, we were repeatedly reminded by our servers just how busy they were and left waiting for long periods to order our food and be served.  When a dinner arrived with the wrong side vegetable, the server dismissively insisted it was correct (it was not) and added that the desired vegetable would require an additional charge.  Another server arrived a moment later with our remaining order and immediately agreed it was the wrong side vegetable and promptly replaced it.  We subsequently ordered 3 deserts to go and after an interminable wait of more than twenty minutes opted to cancel that order rather than to continue to wait.  A manager came over to apologize and explain how incredibly busy the bakery was from many walk-in orders.  She described a perplexing process where despite our being a customer at the restaurant for the past hour, upon ordering our desert we were now at the mercy of a ticketing queue in the bakery.  She suggested there was nothing she could do about the wait and offered absolutely nothing else (e.g. free desert; some discount upon a return visit; etc.) for our inconvenience. This is unacceptable and much better service and response is expected given that dining for a family of four at the restaurant is not inexpensive.", "rating": 2, "date": "8/28/2014"}, {"text": "Went here for my birthday, not too super! We got a table right away even though it was busy. Our server took a long time to get us our appetizers and he kept ignoring us. I think he had too many tables. We also told him that we wanted a cheesecake to go and bring home to sing happy birthday to our kids and he said no problem. Had fish and chips which was ok but the fries were cooked to death. After waiting another long wait to get our bill we left and went to get our cheesecake only to find out that the cakes are frozen and it would be 2 hours till the cake was defrosted. The server never mentioned this to us and it was disappointing because we wanted to take a cake home to sing happy birthday with our kids. We talked to the manager and she made excuses and didnt offer us anything even an apology. Wife called the next day to complain and another manager took our info and sent us a giftcard in the mail. Glad they followed up and hope the place is better when we go there again.", "rating": 2, "date": "10/1/2014"}, {"text": "I would have given 0 stars. My food was not cooked- raw hamburger.   Other food was cold.  Service was very very slow. So disappointing!", "rating": 1, "date": "8/14/2014"}, {"text": "this is place is usually good but our last visit last weekend was by far the worst, we were seated  after a 15-20 min wait, we sat down and after 20 mins we noticed we weren&amp;#39;t the only people not being served, there was a total of 5 other tables with no waiter or waitress, finally we and other people got up to say something and it took forever for them to get us some service still how horrible. finally some other waiters were told to help our section and they took our orders for drinks and appetizers and the waitress let us know that they were short staffed because some waiters, waitresses were cut off early....... finally we got our drinks after a 20-30 minute wait, our appetizer came out right after, than we sat for an hour for our food to come out. I ordered a pasta and when it finally came out it tasted like it was seafood cross contaminated. A small Manager Lady came over and apologized for the service , she said oh I&amp;#39;m guessing your not a seafood fan, the point is I didn&amp;#39;t order a seafood pasta. instead I ordered a factory burrito , after we were all finished up our bill came out and it wasn&amp;#39;t even right she never removed the pasta, had to literally do there job for them, we left almost 2 hours later. the manager is id say a Rookie and should find another job", "rating": 2, "date": "3/3/2016"}, {"text": "Terrible experience here. We went out expecting to enjoy a good meal and left with a very sour taste in our mouths (literally). My girlfriend and I each ordered two different meals containing chicken in it. They put the food down and immediately we both smelled something funny but kind of just kept to ourselves, maybe it could&amp;#39;ve been all the spices etc. (I got the baja chicken tacos and she got the chicken picatta for the record). After our first bites we knew something was off, it tasted very strong and one quick smell of it and you could tell clear as day that it was spoiled. We notified our waitress and she was great about it, however the manager came over and also asked what was wrong. She proceeded to say she smelled it and she could not smell anything and was very rude about the entire thing. She took absolutely no blame for the matter implying it couldn&amp;#39;t possibly be the restaurants fault as they &amp;#34;pound fresh chicken everyday&amp;#34;. Anyone with a working nose or sense of taste would have noticed this, trust me. She then saw us walking out and didn&amp;#39;t even say sorry. Awful management!", "rating": 1, "date": "8/16/2017"}, {"text": "Had my first and last visit to this place this past weekend. After a 50 minute wait to be seated, our drink orders were taken promptly but about ten minutes before we saw them, or the waiter again. I had ordered a glass of wine. When reaching for the glass when it finally arrived, it was sticky on the outside of the glass- so sticky that when I picked it up, the napkin which it sat upon was lifted too.  I told the waiter, he took it back, another ten minutes before I saw him again telling me that all the wine glasses were in the dishwasher. Finally got the wine, second glass not in much better shape. The food was ok- nothing to brag about but not bad either. Then dessert time. My husband ordered hazelnut crusted cheesecake. After again an unusually lengthy wait, we were told that the cheesecake he ordered was frozen- we could have it to go only. Also, a very noisy place. Overall fair food, service which could have been a lot better, questionable clean glasses, the noise.....will not go back.", "rating": 1, "date": "11/14/2016"}, {"text": "Most people who go into a Cheesecake Factory know what to expect. It&amp;#39;s not fine dining, just reliable, occasionally excellent food. The cheesecakes are of course the main event, but if you stick to their signature dishes like the Chicken Madeira or the Asian Chicken Salad, you&amp;#39;ll come away satisfied. My wife once ordered filet mignon...I was like, why would you order a $30 steak at a Cheesecake Factory? But you know what? It was absolutely delicious, as good as Capital Grille. This outlet is always crazy busy so get there early and be prepared to wait 45 min to an hour for a table.", "rating": 4, "date": "8/14/2015"}, {"text": "Not sure what to say about this place except for incredibly inconsistent. When it&amp;#39;s a good night there, it&amp;#39;s great! When it&amp;#39;s not a good night, it&amp;#39;s really bad. I&amp;#39;ve been here probably about 10 times and sometimes servers are great and other times they&amp;#39;re terrible. Some of the food is really great! Other dishes are not. Bread is great when it comes out warm, but can be terrible when it comes out cold. I sometimes ask for special requests because of dietary restrictions or preferences and some times it&amp;#39;s perfect, other times I have sent the meal BACK TWICE. I really want to love this place but unfortunately it&amp;#39;s a bit difficult sometimes. I will say, however, that their apple crisp, Godiva cheesecake, and cookie dough cheesecake are great and have always enjoyed those!", "rating": 3, "date": "2/3/2016"}, {"text": "My husband and I came here after the lunch rush today and have never had a worse experience at a Cheesecake Factory location. After being seated, drinks took between 8-10 minutes. Then we were told they didn&amp;#39;t have the appetizer we originally wanted so we chose another. The spinach dip was bland and the chips were greasy. My husband ordered the farfalle without peas and I had the pit beef dip sandwich. The food took way too long to arrive (about 25 minutes). When we did get the food, the sandwich was bland, tough, and dried out like it had been sitting under the salamander for too long. My husband&amp;#39;s pasta had peas in it. Since our waitress never came by to check on us, we had to flag down someone else to get a new pasta. Our waitress let us know the manager was on top of it making it himself in the kitchen and it came out fairly quickly and tasted fine. At no point did our waitress ever check on us, or apologize for the duration of our visit. When the bill arrived, they charged us twice for the re-made pasta. We didn&amp;#39;t even want to stay for dessert since what was supposed to be a quick lunch was an hour and 15 minutes of disappointment. Never again, Trumbull.", "rating": 1, "date": "10/29/2016"}, {"text": "Awful. I was very excited for a Cheesecake factory to open near me and it was extremely disappointing and frustrating. Food took over 1hr and 15min to get to us after ordering, and we were there for 30 min prior to ordering.", "rating": 1, "date": "8/23/2014"}, {"text": "I visited this location on February 23rd. When we arrived it took 10 minutes to seat us which was no big deal. Once we sat we ordered drinks and food quickly. Drinks took a little while but again no big deal. Dinner on the other hand took an hour. Not only that but the waitress came to check on us only once during that hour and never came to say they are running behind or anything like that. Once we got our food next time we saw the waitress we ordered our desserts 2 red velvet cheesecake slices, 1 smores cheesecake slice, a rocky road ice cream, and an Oreo milkshake. The milkshake came out after fifteen minutes. Cheesecakes came out fifteen minutes after that and the rocky road took fifteen minutes longer than that. How does an ice cream take 45 minutes? At first I sent this review on the 25th to just them on there website but they did not even reply in over a week. Would not recommend unless you want to waste 2 hours of your life waiting for ok food and being ignored by the waiters.", "rating": 1, "date": "3/5/2017"}, {"text": "Christmas Eve, large original cheesecake....disappointed.  Four hours after pickup, frozen in middle, then got all melty.  $50.00 mess!", "rating": 1, "date": "12/26/2015"}, {"text": "After being told 75 minutes it took 128 minutes to be seated. We were served our meal fast but the eggplant was undercooked.  The hamburger was just fair. It took way too long for desert and we finally asked for it to go. My first and last time going to a Cheesecake Factory. Very disappointed.", "rating": 1, "date": "2/15/2015"}, {"text": "The bistro shrimp pasta dish was delicious, but the shrimp were overdone. This dish would&amp;#39;ve been even better if the shrimp were sautéed instead of deep fried in batter.", "rating": 4, "date": "7/15/2015"}, {"text": "I have been here 3 or 4 times, alm have been pleasant. One time there was a child next to me that broke a dish and was being disruptive, the waiter did wverything he could to make our experience as nice as possible. Every person we have had there is friendly and eager to please, the food is always tastey.", "rating": 4, "date": "11/7/2015"}, {"text": "A small group of us went to grab a quick bite later in the evening. The wait for the dining area was 15-20, but a bar high top table was available so we took that. Quick service, decent food and drinks and an overall solid place to stop for something to eat later in the evening. Our waitress Mellisa was pleasant and worked quickly to get us what we needed.", "rating": 4, "date": "11/5/2015"}, {"text": "My favorite place to eat when I&amp;#39;m in the mall. Louisiana chicken pasta &amp;amp; chicken di pans are the best. The food is a little pricey but I get what I pay for &amp;amp; more. The staff is very nice, always gets a warm hello from the hostesses &amp;amp; my servers so far have been great! I recommend asking for Lori, Stacy or Azzalee! We had an issue with our check but one of the managers came over &amp;amp; took care of everything. The only bad thing is that the floors can get quite dirty but I usually notice that when ok weekend nights only when it&amp;#39;s crazy busy. &amp;amp; I don&amp;#39;t recommend going there weekend nights with a big group, you&amp;#39;ll be looking at a long wait. I&amp;#39;ve witnessed a lot of people get crazy because they&amp;#39;re are 5 mins over there wait. It&amp;#39;s not that serious lol that&amp;#39;s why they say ABOUT xx mins.", "rating": 5, "date": "4/23/2015"}, {"text": "I&amp;#39;ve been to the Trumbull location twice, the first time was in 2014 and the second time was this past Saturday. When my friend and I went to the Cheesecake Factory last year it was a very scary first experience. My friend was eating the portabella mushroom, avocado and zucchini fries when she realized that there were pieces of metal wire in her food. We complained to a manager about the issue. The manager explained to us that the wire baskets used to cook the fried food must have frayed and that explains why the wire was in the food. They said they would fix the problem and that they would change to newer baskets. They ended up refunding our money for the appetizer but that was all that was offered to us. Thankfully my friend did not choke or swallow the medal wire. It could have been very dangerous. After that my friend and I lost our appetite. We paid for our bill and left without finishing our food. <br&gt;<br&gt;A year later I received a gift card to the Cheesecake Factory and decided to give it a second chance. My friend and I decided to go there for lunch on Saturday. It was very crowded. When we walked up to the hostess counter she barely greeted us or looked us and instructed the other hostess to seat us at table number 70. She never asked if we wanted a booth or a table. The table was very small and very close to the people next to us. Before we could complain or ask to be moved, the hostess walked away from us without asking us if we liked the table. It was very uncomfortable to be sitting that close to the other table. Since the hostess was no where in sight, my friend and I decided to take matters into our own hands and we moved ourselves to one of the empty private booths. After a couple of minutes, the hostess noticed we moved to another table. She came over to us, took our menus away from us and told us that there is a waiting list for a booth. After getting treated poorly and feeling like the hostess embarrassed us, we left the restaurant and decided to cool off for a bit. I didn&amp;#39;t want the gift card to go to waste so I went back inside and put my name on the waiting list for a booth. After 20 minutes I got a text message and retuned back into the restaurant to be seated. It took another 10 minutes to be seated. It also took a while for the waitress to come to our table to take our drink and food order. We had ceasar salads, which weren&amp;#39;t bad but the salad dressing was a little on the strong side. Since the place is called the Cheesecake Factory we decided to give the cheesecakes a try. We ordered the original cheesecake and the dulce de leche caramel cheesecake. Neither of us finished our cheesecakes. They tasted very sour. It was the worst cheesecake I&amp;#39;ve ever had. <br&gt;<br&gt;I don&amp;#39;t know if its just the Trumbull location but I feel like the Cheesecake Factory is very overhyped and overpriced. After two stressful and disappointing experiences I have decided that I will not be giving the Cheesecake Factory another chance in the future. I will not be going back.", "rating": 1, "date": "3/16/2015"}, {"text": "So, brought my son there for his 20th bday.   We ordered srinks and our seerver came back after ten mins thats its another 10 mins then when we got out drinks mine was soo strong and my friends was all juice and let. Me add, we ordered the same drink.  Then the food.  OMG really.  Chicken marsala. NOT. Had it taken off my bl. The food in 1 word SUCKED....  Never willi I ever eat at the Cheesecake Factory again.. it sucked from beginning to end.  Oh, let me say, been in this business over 30  yrs. Yuck gross food. And they wont take reservations, we waited over an hour for crap food. Our server was ok though. Tell them to introduce them selves..... night.", "rating": 1, "date": "2/3/2015"}, {"text": "The wait was long and we did not enjoy the food. we never ate there before so when we ordered a large cheese the waitress should have said sorry theres only a small but she didnt and it was horrible I have no idea where they got their recipe from but definitely stay away. We couldnt bite the chicken off the wings we had to gnaw at it. The only thing tasty was the cheesecake maybe they should stick to just that oh yea the fries were average nothing special but at least they were ok. Theres more just dont want to write a book and mind you we wrote to the cheesecake factory online and of course we got no reply. Definitely too pricey for their horrible food.", "rating": 2, "date": "1/10/2015"}, {"text": "This is probably the worst Cheesecake Factory I&amp;#39;ve ever been to and I&amp;#39;ve been to several. I ordered the antioxidant salad and was super excited to try this healthy salad for the first time. The salad came and the lettuce and kale were both soggy and unappetizing. The manager, very friendly, came over and apologized and offered to make a fresh one. After some time she came back and guaranteed that she had checked the salad herself and the lettuce was indeed fresh. It was not, the same texture and sogginess existed. I was the offered to replace my dish for he third time and  decided to go for something that I know I like. After 25 minutes, my dish finally came and the luau salad was the worst one I have ever had. Soaked in dressing AND the lettuce yet again, Was not fresh. I&amp;#39;m usually not one to complain and this is the first time I&amp;#39;ve felt the need to leave a review. I am always satisfied with my order when I come to cheesecake, but this time was just something else. Needless to say I will not be going back to this cheesecake location again.", "rating": 1, "date": "3/4/2016"}]}