{"address": ["1200 Morris Turnpike", "Ste D-103", "Short Hills, NJ 07078"], "monthly_reviews": {"2019": [[0, 2.5], [1, 3.0], [2, 3.0], [3, 3.0], [4, 2.5], [5, 3.0], [6, 3.5], [7, 2.0], [8, 1.5], [9, 2.0], [10, 2.0], [11, 2.0]], "2017": [[0, 2.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.5], [5, 3.5], [6, 2.5], [7, 2.0], [8, 2.0], [9, 2.5], [10, 2.5], [11, 2.5]], "2020": [[0, 2.0], [1, 2.0], [2, 2.0], [3, 2.5], [4, 2.5], [5, 2.5], [6, 2.0], [7, 2.0], [8, 2.0], [9, 2.0], [10, 2.0], [11, 1.5]], "2018": [[0, 2.0], [1, 2.0], [2, 2.5], [3, 2.5], [4, 2.0], [5, 2.5], [6, 2.0], [7, 2.0], [8, 2.5], [9, 2.5], [10, 2.5], [11, 2.0]], "2021": [[0, 1.5], [1, 1.5]]}, "reviews": [{"text": "After a uneventful experience at another CCF, I will give this location / experience a better review.  The crab cake bites and tacquitos were good.  One child was happy with her Mac and cheese and my other child was pleased with her flatbread pizza despite that her first order was burnt but they were smart and considerate enough to not bring it out, rectify the situation, made her a new one, brought us some complementary small Caesar salad and comped the pizza off the bill.  Bravo to the manager on duty this past Saturday.  That is how you handle a snafu! We ordered cheesecakes to go and thoroughly enjoyed those!", "rating": 4, "date": "5/21/2019"}, {"text": "Came here for lunch.  It was pretty busy.  The service is beyond horrible.  Waited about 45 minutes or more for our food.  Our server looked miserable and did not want to be there.  <br&gt;Food is decent but definitely not worth the wait.<br&gt;I would stay far far away unless they can improve the service.", "rating": 1, "date": "2/17/2020"}, {"text": "Always a fam fav! Quick pit stop to get the desserts. Our all time fav is tiramisu cAke. Conveniently open late on the weekend. Complimentary bread served warm is to die for. Love to celebrate bdays.", "rating": 5, "date": "1/12/2020"}, {"text": "I was expecting more!!<br&gt;I&amp;#39;ve heard that the Cheesecake Factory is very good, so a decided to try, <br&gt;First of all, our server took 30 minutes to introduce himself to the table and I think he didn&amp;#39;t even know what he was doing, he took 20 minutes to bring our drinks and the Ultimate Margarita was awful, I ordered a Fried Calamari which only had 3 calamari ring and a couple of tentacles, but it was full of breading, stuffed mushroom was okay, that only good thing was the bread he brought when we sat, even the Coke wasn&amp;#39;t that good ( and that&amp;#39;s almost impossible ), menu was very poor, no coming back!!", "rating": 1, "date": "7/3/2019"}, {"text": "Been to many CFs all over the country. Usually a decent experience. Even during prime times, 15 minutes tops for cake takeout. This one is the slowest ever. 50 minutes to takeout 2 slices of cheesecake. How is that ever acceptable? <br&gt;<br&gt;If delays are that long, they should let customers know before they place your order as some people may not want to lose an hour of their life waiting for two slices of cake that, at 1000 calories a slice, they then have to put two hours in the gym later on to burn off.", "rating": 1, "date": "4/1/2019"}, {"text": "One of my better Cheesecake Factory experiences in NJ. I would definitely come to this one again. <br&gt;<br&gt;I went on a Thursday night and they were pretty busy, so I could understand a 15 min wait for just myself. <br&gt;<br&gt;I was seated in one of the tables at the bar, I&amp;#39;ve always been a little skeptical about service in bar areas bc I assume the bartenders would be too busy making drinks. But luckily they had a few more servers up there. <br&gt;<br&gt;I was also brought out bread which is nice. The last time I went to cheesecake I was by myself so I guess the server assumed I wasn&amp;#39;t going to eat the bread by myself? . I had to ask last time- diff location. <br&gt;<br&gt;I ordered my usual Renee&amp;#39;s special. It was pretty good. The soup came out hot. Usually it&amp;#39;ll come out luke-warm at other locations. Also a lot of other places will forget the soup spoon. <br&gt;<br&gt;My salad and turkey sandwich came out perfect too. I think this one was a Caesar, usually it&amp;#39;s a spring mix, but that&amp;#39;s okay, tasted pretty good:-) <br&gt;<br&gt;The only thing I could see improvement on is timing. I feel if there was a wait, then service should be on point once seated. - the wait is usually to give servers time to catch up if the restaurant isn&amp;#39;t at full capacity. - and my server cane to check up on me after I finished eating.", "rating": 4, "date": "3/30/2018"}, {"text": "I placed an order at 3:30 today, slotting it for pickup at 7pm. When i reach the restaurant at 7:15, i was told that i have to receive a text message that the order is ready for pickup and then only can i receive it. <br&gt;No where in the confirmation mail or at the website (while booking, after booking) was it mentioned about receiving a text message for pickup. I have travelled 10 miles in the worst rain of the season to pickup the order - just to know about a system which was mentioned no where and apparently its &amp;#34;understood&amp;#34; ( as quoted by the store manager)<br&gt;<br&gt;When i called the store, i was told that there is a long list of order and my order has just been put in And its going to take time. How in the normal sense am I supposed to digest the fact that an order which was placed at 3:30 for pickup at 7- has not been pushed for preparation till 7:35??? This is heights of being taken for granted and unprofessional behavior.", "rating": 1, "date": "7/10/2020"}, {"text": "Not sure this location has it figured out. They made us wait for 45 min after the given pickup time for an online order only to get it wrong.", "rating": 1, "date": "9/28/2020"}, {"text": "I haven&amp;#39;t been to this Cheesecake in years and I was truly shocked by how wayyyyyy downhill this place has gone!<br&gt;<br&gt;*Extremely slow service. It literally took over 25 minutes to just get water....<br&gt;*Super small portions! I know Cheesecake is known for its giant meals but these weren&amp;#39;t even regular-sized. The food looked sloppy and as if whoever prepared it could not care less about the job....<br&gt;*Most of the employees looked legitimately annoyed and angry to be there, or that they were simply there to hang out.<br&gt;<br&gt;I will not be returning to that location....", "rating": 1, "date": "8/28/2019"}, {"text": "Cheesecake delivers reasonably priced food with huge portions. In short, diner food with upgraded ambiance with emphasis on desserts. Their menu is huge. It has everything. They now have skinny menus that compile items that have comparatively less calories for people who are health conscious. <br&gt;<br&gt;Their drinks are awesome too. Apple martini, sangria are 2 cocktails I get the most. Also, mango smoothie type of drink is fantastic. For appetizers, eggrolls, nachos and spinach dip are excellent to share. Their salads are pretty fresh too with a lot of ingredients and pasta is what I usually get the most. Louisiana pasta used to be better with more sauce but the portion seems to be even larger than before.<br&gt;<br&gt;Desserts! Can&amp;#39;t really go wrong with any cheesecake here. Tiramisu, chocolate mousse and of course the strawberry cheesecakes are among the most popular ones. There&amp;#39;s always room for desserts!", "rating": 5, "date": "2/12/2019"}, {"text": "My girlfriend and I came here on Thursday, November 1, 2018 for a last minute date night. We arrived to Cheesecake Factory around 7:30PM and were immediately seated upon arrival. We weren&amp;#39;t that hungry so we only ordered an appetizer and two desserts. <br&gt;<br&gt;As per usual, we ordered the Spinach and Artichoke Dip as an appetizer. And again, we devoured it in a few short minutes. Cheesecake Factory&amp;#39;s Spinach and Artichoke Dip is one of our favorites. The chips are never stale and the dip is always flavorful and seems fresh also! <br&gt;<br&gt;For Dessert we ordered the Dulce de Leche Caramel Cheesecake and the Strawberry Shortcake. This was our first time ever ordering this Cheesecake and we don&amp;#39;t regret it! The Dulce de Leche flavor was perfect and the Caramel flavor was just right also! The combination of the two flattered each other and made the entire Cheesecake just amazing! The Strawberry Shortcake, as always, was my girlfriends favorite. And I too, have nothing to complain about. Nor do I have any suggestions to change this dessert... other than: MAKE IT BIGGER! We absolutely love the Strawberry Shortcake so much that we tend to eat it so quickly and before we know it, it&amp;#39;s all gone. <br&gt;<br&gt;Not only was the food amazing, but the staff were also friendly. Our waiter, who I regret to have forgotten his name, was awesome. He continuously checked on our table to make sure we were okay. I definitely recommend coming to Cheesecake Factory during the week night because the service was a lot better than when we come on a weekend night. I rated this 4 out of 5 stars because it&amp;#39;s not always that the service was as good as this days. And again, I think it&amp;#39;s because this was a week day night.", "rating": 4, "date": "11/6/2018"}, {"text": "I will NEVER set foot in this location again. I came here twice in one day never got the opportunity to eat. Came when they first opened with a child so l was pressed for time. My Cajun jambalaya comes out with over cooked noodles. No time to reorder so we left. <br&gt;<br&gt;Second time at 5:00 greeted and sat by a Manager with the same child. This time we weren&amp;#39;t in such a hurry however l sat there for 19 Minutes!!!! Not one person came to the table. I got up and told the manager as l left about the lousy experience and left. Won&amp;#39;t waste my time again", "rating": 1, "date": "1/7/2019"}, {"text": "Was here today for dinner around 8:30 PM - ordered the chicken and shrimp gumbo.  The order took so long that we had 3 servings of bread. When my order came, i could already tell that the rice was extremely raw. Had a bite and it was so raw it was crunchy. Told the server, no apology, no comment just took the plate back. She came back maybe 5-10 minutes later, still didn&amp;#39;t say a word just handed me the gumbo. I could tell they either popped into the microwave or some heating thing or scooped out the rice from the same plate and just dumped another serving. Crunchy lumps of rice were still in the gumbo itself and the &amp;#34;new&amp;#34; rice was still undercooked. Server came back 10-15 mins later to finally ask how it is and i said the rice was still raw but i was so hungry i had no choice.  Smiled and left.  So disappointed in the service and the food.", "rating": 1, "date": "2/29/2020"}, {"text": "Their takeout service is ATROCIOUS! Tonight was the final straw. This was their idea of chicken nachos. NO CHEESE. NO CHICKEN. NO CHILI SAUCE. Just a side a sour cream and a side of pico. NO GUAC. These are literally dry tortilla chips to dip into the sour cream and pico. I ordered through Door Dash and they&amp;#39;re just as guilty for not checking the order before walking away, despite my having warned them as such (see my order below). I&amp;#39;d say every other order from Cheesecake Factory in Short Hills through Door Dash is wrong. One time, I ordered taquitos and got cheeseburger egg rolls. They almost always get the nachos wrong. I blame both of them. No more ordering from this Cheesecake Factory and I&amp;#39;m DONE with Door Dash. I&amp;#39;m sticking with Uber Eats who has YET to get my order wrong<br&gt;<br&gt;Update: so I am back here again but this time I didn&amp;#39;t use delivery service. This time, I ordered the food on the site and am here to pick it up. They are making me wait on the line of 15 people who have yet to order their food even though my food is already paid for and sitting on the counter getting cold. The person at the front desk who takes the names for seating refused to help me. This place sucks.", "rating": 2, "date": "9/14/2019"}, {"text": "My family and I came for dinner (instead of cooking at home). Usually, the service is solid. However, it took over 45 min for our entrees to arrive. We were so disappointed. <br&gt;<br&gt;The manager stopped by our table and offered free cheesecake. That didn&amp;#39;t leave us with a good feeling. Oh well.", "rating": 2, "date": "8/25/2019"}, {"text": "This must be an anomaly in the chain.  The service is terrible and the manager is severely challenged.  For a place with $14 cocktails and big checks the service should be better.  Food comes out in stages, salad then 13 minutes later the dressing.  Salmon comes out and then a 15 minute wait for potatoes.  Are you kidding.  I&amp;#39;ve been eating in Cheesecake Factory restaurants for over 25 years in at least 10 different locations and this one stands out for being poorly run and barely managed.  I am officially down with the short hills location.  <br&gt;<br&gt;Too expensive for such crappy service.", "rating": 1, "date": "8/7/2019"}, {"text": "appareling, the location has a totally different pickup instruction from the website, and of course they don&amp;#39;t tell you. waited and waited and waited and wondered where was my pickup. called them and they told you you needed to do this instead of what the website and the email told you. Great. Thx.", "rating": 1, "date": "7/16/2020"}, {"text": "The first Cheesecake Factory I was ever at was in Coconut Grove, Florida twenty years ago and they set the bar pretty damn high. (This mall is not what it used to be. Lots of high quality restaurants like Joes American Bar and Grill and Papa Razzi are no more.) The menu at this place is extraordinary. I also appreciate that they list calories next to every item on the menu. The price is average and portions are large. Every time I have had the cheesecake it has been amazing. Now for the bad news: yesterday, I came with my mom for lunch and the wait was insane. After a half hour wait, we waited another twenty minutes for our server to arrive and take our order and get us water. We knew to order everything then or we would never get our food. We shared the hamburger sliders for an appetizer and then, I had the most bland and tasteless fish tacos ever. They should have had some guacamole because I couldn&amp;#39;t even get half way through the meal. The rice was also underseasoned. I will come back for dessert only and certainly not at this location.", "rating": 2, "date": "5/12/2019"}, {"text": "When you come to any cheesecake factory there are some things you just have to expect:<br&gt;1) wait time more than one hour after 5pm.<br&gt;2) good cheesecake<br&gt;3) huge variety of foods<br&gt;<br&gt;Came here after walking around the mall.  Burgers on kids menu were good for my son.  He liked them.  I got burrito which was 90% rice; very disappointing.  I remember when these things used to be larger and filled with meat.  I guess they are training their chefs to save money and fillers to the menu items.  My wife had the enchiladas off the healthy menu and she said it was good but the side salad was not edible.  <br&gt;<br&gt;Unfortunately i will likely be back cause there are few eating options at this mall.", "rating": 3, "date": "12/9/2018"}, {"text": "Standard cheesecake factory, however the service on multiple occasions has really been sub par. I don&amp;#39;t particularly frequent anymore because of this", "rating": 3, "date": "11/1/2018"}, {"text": "Come here a few times a month. Never had a problem with the service or the food. It can get very packed on weeknight nights, so don&amp;#39;t expect a short wait if you come with a large party.", "rating": 4, "date": "3/11/2020"}, {"text": "Ordered the &amp;#39;Fresh Vegetable Salad&amp;#39; <br&gt;featuring roasted beets, asparagus, green beans.<br&gt;If there was more than one small beet, one green bean, and one slender spear of asparagus I will eat my hat. The pomegranate vinaigrette had a strong soy flavor. <br&gt;Being seated just outside the kitchen bussing station moved this dining experience to the top of our &amp;#39;Never to be Repeated&amp;#39; list.", "rating": 1, "date": "9/4/2018"}, {"text": "I want to share my experience with this particular The Cheesecake Factory restaurant at Short Hills. I don&amp;#39;t recommend this restaurant to anyone because of their Unethical and disrespectful staff. I rate them zero stars due to following experiences. On 2/1, I placed a take out order online at 6 pm and arrived on time for pickup at 6:20 pm. I was in line for 45 mins just for pickup and never received my spot as people were jumping line; the problem was there was no line at all. After waiting for 50 mins I politely ask for my turn and received yelling response for cashier that I jump the line and he will not serve. I was pretty shocked and upset because after politely waiting and even though people jumping line I received this response. I requested for Manager his name is Ralph, I was disappointed as he completely didn&amp;#39;t help and even try to solve this issue and not in condition to hear the concern. When Manager ask the cashier who is next in line the answer was &amp;#34;I don&amp;#39;t know&amp;#34; this fact means that person Over the counter didn&amp;#39;t had any idea who is next then that staff doesn&amp;#39;t have a right to abuse saying you jump the line and will not serve you. I take this incident very seriously and going to escalate this to corporate office to this disrespectful act.<br&gt;<br&gt;2. I also had worst dining experience in December, as usual after waiting for an hour we were given a table that was not even clean and after request to change the staff was rude as usual. The fork was not at all wash, please see the attached picture. It took 10 mins to explain what is wrong to that fork and need a wash one. We decided not to visit but gave a second chance and they fail again in Feb.<br&gt;<br&gt;I see a major issues with management and don&amp;#39;t have any hopes that this will ever resolve.<br&gt;<br&gt;I had been to many Cheese cake factory this restaurant is the worst and they failed both time.<br&gt;<br&gt;I highly recommend not to visit this restaurant till the time they fix these issues.<br&gt;<br&gt;You lost a customer for a life. If this continues you will lose more customers.", "rating": 1, "date": "2/1/2020"}, {"text": "Ok I&amp;#39;m surprised that this place has such a low star rating..... I&amp;#39;m staying down the street here for work, and I have now eaten here 3 times this week. <br&gt;<br&gt;Why? <br&gt;<br&gt;Because it&amp;#39;s Cheesecake Factory, they are all over the country and they are ALWAYS CONSISTENT. <br&gt;<br&gt;All 3 times I ate here this week I had something different, had a different server and yet had basically the same experience as I have anywhere in the country at a Cheesecake Factory.... food was great, as expected, it&amp;#39;s always consistent, drinks were great, they taste the same at all locations. The servers are nice, attentive, but if you go during busy dinner time expect the services to be busier than normal too!<br&gt;<br&gt;If you read the low 1 star reviews people left... also do yourself a favor and go to &amp;#34;their&amp;#34; profile to see that they most likely have only reviewed 3 businesses and also gave a 1 star. Because those type of people like to complain over anything, especially waiting a few minutes for service. <br&gt;<br&gt;Great menu items:<br&gt;* Mac &amp;amp; Cheese Balls<br&gt;* Brussels Sprouts<br&gt;* Nachos<br&gt;* Alfredo Pasta<br&gt;* Impossible Burger<br&gt;And obviously the free bread!<br&gt;<br&gt;They also have a great happy hour although I didn&amp;#39;t get there in time for that but check the menu for items and prices.", "rating": 5, "date": "7/17/2019"}, {"text": "This is a factory plain and simple.<br&gt;<br&gt;The food is ok.  Though I can&amp;#39;t say that you should order any item on the menu.  The food is not spectacular but have always been fresh and cooked right.<br&gt;<br&gt;I&amp;#39;ve always had decent service even at peak times but I usually use this place as a last option for some reason I am not particularly fond of the large format restaurants especially those with capacity of 300 or more.  But this one haven&amp;#39;t yet disappointed me so I will probably visit again.", "rating": 4, "date": "6/8/2019"}, {"text": "So I decided to come back to cheesecake again hoping the food is better. I ordered my usual it was ok but not nice and hot.  The hostess in the front a Spanish girl with glasses with the Dora explorer hair cut was rude as hell. Not sure what the problem is. Told me a 20 minute wait plus it was not busy lunch time on a Monday. Empty seats all over the place but telling me a 20 minute wait . Than I watch her seat ppl that came in after me. Not right or good. Need to be sent back to training.   Ugh.  Ugh", "rating": 3, "date": "12/23/2019"}, {"text": "Went for Dinner<br&gt;<br&gt;Food - 5/5. The bread selection they offer is lovely and the pumpernickel has good taste. Steak Diane had great crust with a warm pink center, just like how I asked for. Good seasoning on both the steak and mashed potatoes, with the mashed potato having nice chunks between the creaminess. The sauce was the main attraction of the whole dish as it added a nice savory and tart flavor to the entire plate.<br&gt;<br&gt;Service - 4/5. We had a big party of people that was to arrive but many were late and about a quarter of them canceled last minute. The staff were still very accommodating and professional about the whole ordeal.<br&gt;<br&gt;Value - 4/5. The pricing is pretty average as this is a chain restaurant. The food is good and for $20 you get a steak entree. Not bad at all!<br&gt;<br&gt;Parking - Mall Lot/Garage (Free)", "rating": 5, "date": "6/26/2017"}, {"text": "Got there at 11am and was not really crowded.  Ordered appetizers and drinks which came quick. Ordered entrees.  Took over half an hour before food came.  By that time we were no longer hungry. Server was apologetic and we know it was not her fault as the kitchen screwed up. Manager came and apologize but did not do anything. We took the food to go.  Manager and kitchen staff needs to get their act together. Would have given 1 star if not for server.", "rating": 2, "date": "3/7/2020"}, {"text": "This Cheesecake Factory is huge, well decorated, and sexy! It&amp;#39;s what I like to call the signature franchise look. HOWEVER let&amp;#39;s talk about the food and service. We were meeting up with a friend who was already seated. We weren&amp;#39;t greeted by a hostess nor were we walked to our table. Our server took forever to attend to us! From greeting us, to taking orders, and delivering the bill. I was looking forward to the mac &amp;amp; cheese &amp;#34;balls&amp;#34; burger.  I&amp;#39;ve had this burger in the past and love it!  When the food came out, it was a mac and cheese patty on a close to well done burger( I ordered it medium). The server was skimpy with the ketchup as well. We had to request more condiments. Let&amp;#39;s  just say, I would not be back.", "rating": 3, "date": "4/7/2018"}, {"text": "I just had a quick lunch at the Cheese Cake Factory Bar in the Short Hills Mall. <br&gt;I&amp;#39;ve been in the business so I know how difficult as well as how hard it can be behind the scenes. Kevin was such an amazing bartender! With a busy Sunday brunch/Dinner going on he made sure to keep asking me if I needed anything or he could be of any help with the extensive menu they offer.<br&gt;I loved everything he recommended. I don&amp;#39;t really ever leave reviews but I thought the food and the service deserved one!", "rating": 5, "date": "7/28/2019"}, {"text": "I find this location super busy at the short hills mall. Lately it&amp;#39;s been hit or miss. Service is good/ok but everyone looks rushed.  I notice small things like having a fork but no knife. Bread without butter served .Things that happen when staff is stressed/rushed and don&amp;#39;t pay attention to detail. <br&gt;<br&gt;Food has been mediocre at Cheesecake lately . Not awful but not like how I used to feel/be excited. Plus the calories are ridiculous with most meals. <br&gt;<br&gt;Bang bang chicken and shrimp is one of my faves . I like the seared tuna salad, miso salmon. Lemon chicken. <br&gt;<br&gt;Apps- I like the fire cracker salmon, avocado egg rolls, crab wontons", "rating": 3, "date": "2/24/2017"}, {"text": "The Cheesecake Factory a national chain with restaurants in higher end malls or locations. Let me state that I have never been to a Cheesecake Factory restaurant ever. Two weeks ago, I was just blown away on my first visit. It was a WOW visit.<br&gt;<br&gt;From the moment I walked in, I was just impressed with ambiance, service and food. What more can I say. It was just awesome.<br&gt;<br&gt;I was at the Short Hills Mall waiting for the wife who works just across the street. I happen to enter another restaurant a few hundred feet away and just had a horrible experience. Everything that drives me crazy about service in a restaurant; they did.<br&gt;<br&gt;Moving forward, as I walked in at the CF music was at right level. Perfect lighting. Everyone just busy doing their jobs, without looking like they where running around &amp;#34;like a chicken without their head&amp;#34;. Everything seem perfect and working right.<br&gt;<br&gt;Found a seat at the bar and let me say it was busy. Bar area was packed with Happy Hour customers. Ordered a Mojito; delicious. Good. Damn good. It was as perfect a mojito as I ever had. That mixture of tartness and sweetness with the aromatic mint, made for a wonderful delight. Best part $5.95 for this delicious drink. Remember HH pricing.<br&gt;<br&gt;Now I am a burger guy and when I see sliders I just order. It is the perfect food when enjoying adult beverages. The order consisted of 4 sliders that were moist and tasty. It was a real deal at $5.95 Happy Hour Special.<br&gt;<br&gt;Service was just outstanding. Period. The young lady was personable, friendly and made a mean drink. Life is good. At 6:08 or so I asked if I can order apps. The Bartender said, let me check if they changed over from HH menu to regular menu and made it happen. No hassle. No drama. She just offer me the HH menu for food with no worries.<br&gt;<br&gt;Overall, The Cheesecake Factory will be my Happy Hour place when in the area. With outstanding service, food and cocktails this customer is a very happy camper.", "rating": 5, "date": "2/13/2017"}, {"text": "My family and I love the food at this place , however you would think a place named the Cheesecake Factory would operate a little faster since it is a factory , but they don&amp;#39;t , they need to speed it up", "rating": 4, "date": "10/12/2019"}, {"text": "Two stars just for the sake of our server, who provided us with excellent customer service. Other than that this is below average establishment with rude hostess and mediocre food.", "rating": 2, "date": "3/21/2019"}, {"text": "I have never had a bad meal at Any Cheesecake<br&gt;Factory the one in Short Hills included. Drinks are always on point and so is the food. There is always a wait at this location unless you get here when it opens. I usually go during peak days and hours. I have come on a Tuesday before and it was still crowded. So, if you don&amp;#39;t mind a wait this location is just as good as any.", "rating": 4, "date": "2/19/2018"}, {"text": "Really wished I checked the reviews before coming because this was as bad of an experience as the reviews say. What makes it worse was it was my birthday. <br&gt;<br&gt;After ten minutes of being ignored, we finally had to flag someone down to ask who our waitress was.<br&gt;<br&gt;Took 45 minutes for our food to come:<br&gt;<br&gt;My chicken and biscuits had burnt biscuits and no mashed potatoes. I was told it would be 30 minutes to make more biscuits. My replacement order was wrong and tasted nasty. I sent it back and ended up not even eating dinner.<br&gt;<br&gt;They didn&amp;#39;t tell my aunt that there were out of soup until they delivered her food.<br&gt;<br&gt;My other aunt&amp;#39;s food was not warm. So was the replacement. She ended up not eating.<br&gt;<br&gt;The waitress would never come over or refill our drinks.<br&gt;<br&gt;My mom ordered food to go. They bring it up on a regular plate then later accuse us of not saying anything when they came over. At that point we all start laughing because it&amp;#39;s been such a horrible experience.<br&gt;<br&gt;I am still here so stay tuned. We still don&amp;#39;t have our dessert order and they will probably screw that up too.", "rating": 1, "date": "10/20/2019"}, {"text": "Typical Cheesecake Factory franchise. However they could use a better cleaning crew. The bathrooms were horrendous and it was only 7:30 at night. I feel for whoever had to use them later in the evening!<br&gt;Our waiter was very attentive and friendly, making sure we were well taken care of. The service was quick and the food came out quickly. <br&gt;The menu is a little over whelming as they have so many items to choose from but this could also be a bonus as it has something for the whole family. <br&gt;Food was good as always and was prepared as expected, also another plus to franchises. You receive a large portion of food so there is always left overs! <br&gt;Have to say all in all it was a decent experience but I have definitely been to cleaner cheesecake factories before. Need to up their game on cleanliness.", "rating": 3, "date": "3/14/2018"}, {"text": "This place is a good right at the mall in summit shore hills.<br&gt;<br&gt;Food is decent, and service is good.<br&gt;<br&gt;This place is a go!", "rating": 4, "date": "5/24/2019"}, {"text": "I regrettably was not able to eat at The Cheesecake Factory today but we did swing by to redeem two free slices of cheesecake. This review pertains only to the cheesecake we got to-go and literally nothing else (e.g., service, pricing, flavor), so I strongly believe that the five stars is wholly deserved. If you&amp;#39;ve never tried one from the restaurant because of its exorbitant prices, TRY ONE! Yes, they&amp;#39;re generally very expensive (and normally out of my budget), but they&amp;#39;re sooo creamy. I don&amp;#39;t even want to think about how many sticks of butter had to be sacrificed, but I am pleased. I got the fresh strawberry cheesecake (it&amp;#39;s just regular cheesecake with strawberries) and it was AMAZING! If you like good things, you&amp;#39;ll like this.<br&gt;<br&gt;If you don&amp;#39;t like cheesecake, then shame on you.", "rating": 5, "date": "1/1/2018"}, {"text": "I love the Cheesecake Factory. I honestly do. I just wish the service was better. We waited 15 minutes for our server just for drinks.  Then we felt rushed as she immediately asked us over and over again for our entree order. We didn&amp;#39;t even get our drinks yet. Just water. The chicken  madera looked so good on the yelp pictures, but came out dry and cool instead of hot.  This won&amp;#39;t stop me from ever going back to another Cheesecake Factory. But i won&amp;#39;t be nearly as excited as i used to be.", "rating": 2, "date": "1/2/2019"}, {"text": "The food is great as usual. My first time having fried Mac and cheese and it was so good. They give 4 huge Mac and cheese balls that will have you stuffed before your meal even comes out. They also give bread and butter as you wait for your meal. Now I&amp;#39;m not a big fan of bread but I truly enjoyed it. It was fresh, warm and absolutely delicious. It was so good I asked for more (which is unlike me). Our waiter was nice and super fast. Everything we asked for was given to us in the blink of an eye. I&amp;#39;m really impressed by the service. I have one negative comment about the whole experience. I ordered grilled shrimp with my salad and the shrimp was cold. Maybe it&amp;#39;s just me but I was expecting warm shrimp with my salad. Overall, the experience was great.", "rating": 4, "date": "6/9/2019"}, {"text": "I absolutely adore the Cheesecake Factory.  When I come to my hometown for the holidays, we always Isis this particular location because of its&amp;#39; convenient residence inside the mall. This location left us extremely disappointed though. Here&amp;#39;s why...<br&gt;1. First, there was a 40-minute wait. Ok, no biggie. It&amp;#39;s the holidays. It&amp;#39;s 8:00pm and the mall is closing in an hour. <br&gt;2. As our buzzer went off and we get up to be seated at our table, in walks a man with a little chihuahua on a leash. All of our mouths dropped. One lady with a family of 5 asked the hostess if dogs were allowed in the restaurant. The server said, only service dogs. The lady exclaimed, &amp;#34;that was not a service dog &amp;amp; he was not blind&amp;#34;. The hostess just shrugged her shoulders. The lady and her whole family canceled their reservation &amp;amp; walked out exclaiming how unsanitary it was. I totally agreed. And had we not been starving and waited over 40 minutes, we would have left, too. Luckily, they sat us on the other side of the restaurant. <br&gt;3. The service was horrible. Our table didn&amp;#39;t have enough silverware, it took forever to get our bread and some of us got drinks while others didn&amp;#39;t. I was with a party of four. When we requested more silverware, one of the other servers (not our waitress who couldn&amp;#39;t be found) got it and apologized, stating it had been a crazy day. Again, cool. It&amp;#39;s the holidays. We get it. <br&gt;4. But, this last thing took the cake... we all began devouring our food, only to get halfway through &amp;amp; my mom finds a long, curly black hair at the bottom of her plate. We were disgusted and informed the waitress. She took the plate, came back &amp;amp; stayed she took it off the bill, but the manager argued with her that the hair didn&amp;#39;t belong to any of the cooks because they were all men. Manager never came to our table to address the issue or apologize. <br&gt;<br&gt;After the hair situation and lack of professionalism by the manager, we decided to skip dessert, pay our bill &amp;amp; just leave. This has left a pretty bad taste in my mouth... literally. We will not return to this location EVER!", "rating": 2, "date": "12/28/2017"}, {"text": "My husband, baby girl and I came for brunch before taking pictures with Santa at Short Hills mall. I&amp;#39;ve actually never had brunch here before so didn&amp;#39;t know what to expect but it wasn&amp;#39;t bad.  We made it before the rush of folks. When we entered there were only 2 strollers at the door.  By the time we left, the stroller area was 4 strollers deep.  <br&gt;<br&gt;Food: Their food menu has a good mix of healthy options and a number of breakfast tex-mex items.  My husband did their Eggs Benedict which was not as good as you would get at a jersey diner.  I had the breakfast tacos and those were actually pretty good.  Their coffee is a darker roast. <br&gt;<br&gt;Decor: You&amp;#39;ve been to one you have been to them all.  It&amp;#39;s the same layout.  Lots of seats, the booths have plenty of privacy. <br&gt;<br&gt;Price: Standard for nicer casual chain restaurants.  About $35 for two meals with coffee.<br&gt;<br&gt;Service: Despite the size, service was very quick and friendly.  They seem to have efficiency down pretty well.<br&gt;<br&gt;Parent Notes: The handicap stall of both bathrooms have a nice changing table at a decent height.  The booths BARELY fit an infant car seat so ask for a table seating instead if you need to keep your little one with you in a car seat and they can&amp;#39;t sit in a high chair yet.<br&gt;<br&gt;Notable Extras: Always consistent.", "rating": 3, "date": "12/10/2018"}, {"text": "There always pretty good to me here. I normally come after work or sometimes during the day after shopping . The staff is pretty cool...the food is always good here. Definitely cant complain. <br&gt;<br&gt;Ps-it&amp;#39;s normally more crowded during the day so if you come at night it&amp;#39;s a little more laid back.", "rating": 5, "date": "2/17/2017"}, {"text": "2.5 stars and that&amp;#39;s IT! We waited less than 5 minutes for our table which was great. But when we sat down, we noticed that the table was dirty and there was food all over the floor. A lady came over to clean it and insisted that it wasn&amp;#39;t dirty! Um, we&amp;#39;re not blind. Our waiter blamed it on a kid that was there before us which was no excuse. After we placed our order, it took 42 minutes for our food to come out &amp;amp;  it came our barely warm. I hate to send food back but my broccoli was ice cold! The brunch combo was extremely boring- dry pancakes, overcooked bacon and my over easy eggs were over hard!! The chicken fingers were pretty good- too bad it was paired with old celery. Our waiter was clearly over his job and it showed. So, believe the reviews that you read on here! This is a beautiful restaurant with ugly service and hit or miss food!", "rating": 2, "date": "10/30/2017"}, {"text": "Always a solid happy hour with great bartenders but the food just isn&amp;#39;t that good. It&amp;#39;s often poorly made (has to send my quesadillas back for not being hot or melted plus there wasn&amp;#39;t much chicken) and the bathrooms are always disgusting and not kept clean. I overheard a bartender saying they hoped corporate would come soon to make some changes and I hope the same for their sake.", "rating": 2, "date": "8/26/2019"}, {"text": "One of the worst dining experiences. Service was ridiculously slow and waitress was extremely inattentive. Waited 20 minutes before waitress acknowledged us and then about 15 minutes to receive water. Appetizers and entrees took about an hour to arrive. Proceeded to take out counter after we finished to order some desserts to go and 4 employees literally standing around doing nothing while not acknowledging any of us customers waiting to order. Obviously the management here doesn&amp;#39;t care enough since most reviews say similar things yet nothing changes. Definitely won&amp;#39;t be returning", "rating": 1, "date": "9/15/2019"}, {"text": "If I could give this place 0 stars I would. Walked in with a party of 4. We waited 25 minutes after sitting down to receive a drink order... not drinks... drink order. We asked for a basket of only wheat/brown bread and placed our appetizer and dinner orders. Our waitress then comes back 10 min later to tell us that they are out of the wheat/brown bread after we had saw her walking with an entire basket of brown bread to a table? Hmmm not sure if that&amp;#39;s correct. She said she would go double check and then sent a manager to our table. Who did not acknowledge the issue of our waitress carrying out a basket full of only wheat bread and then telling us there was none left. The manager then comes to tell us that they have been out of brown bread for the past hour, which then further confused and complicated things. <br&gt;Our appetizers came out before our drinks as well. And we were never offered a refill in the 55 minutes it took for our food to come out. We contacted another waiter about this who was nearby and he thankfully brought our drinks out to us. Following this, our food came out and someone at our tables food was cold. He had ordered the chicken Parm &amp;#34;Pizza Style&amp;#34; and the chicken came out soggy and cold and the pasta was dry. <br&gt;Overall, probably one of the worst dining experiences as our waitress came to our table twice in an hour + time period, the managers failed to acknowledge the main issues going on (horrible service and lack of clarity), and cold food.<br&gt;<br&gt;Fast forward 1 month later, my boyfriend got a gift card to the Cheesecake Factory from a friend so we decided to go by ourselves and give it another try. I do not live in this area, let alone this state, and both times the wheat/brown bread was either gone or not ready. Service was better this time and other than the bread things had been going pretty well. I ordered the Parmesan crusted chicken with broccoli and my boyfriend ordered pasta carbonara. Our food came out in a timely fashion... but my mashed potatoes were lukewarm and crusted on the top while my broccoli was cold. I sent it back to be warmed up and by the time it came back my boyfriend had already finished his dish. Overall I&amp;#39;ve been to this place twice in a 1 month period and have been disappointed both times with either the service or food.<br&gt;<br&gt;Needless to say, I haven&amp;#39;t had this problem with any other Cheesecake Factory restaurants I&amp;#39;ve been too, and I believe this one has some work to do.", "rating": 1, "date": "1/1/2020"}, {"text": "Good food, ok service.  Always a wait.  The server wasn&amp;#39;t terribly good this time, refusing to accommodate our request to leave the Mayo off the sandwich.  He said it&amp;#39;s a new menu item and they can&amp;#39;t leave the Mayo off.  On what planet, does this make sense. <br&gt;<br&gt;You know, as I type this review, I get even more annoyed, so I&amp;#39;m taking another star off.", "rating": 2, "date": "2/25/2019"}, {"text": "I should have read the reviews first. I was not happy with my food. I had the fish and chips. The fish taste like it was cooked earlier and microwaved to order. Some parts were soft and some were hard. My tarter sauce tasted like blue cheese dressing. I gave it two stars because of the Cheesecake.  That was good.", "rating": 2, "date": "4/1/2020"}, {"text": "Thinking of ordering take out? Think again. This cheesecake factory location has made me wait on the phone EVERY TIME (exactly 3) I&amp;#39;ve called to order for at least 45 mins.<br&gt;<br&gt;I get the restaurant is busy, and the server is seating incoming customers and managing the take out phone simultaneously, but 45 minutes is just not right. 30 minutes into listening to reception music from the underside of 2006, I call to politely remind the front desk that I am waiting to order. I am always rudely transferred to back to hold, without comment or apology. Then I wait out of principle. I&amp;#39;ve started to think this location likes to punish people who try to order take out. Operant conditioning to deter take out orders. <br&gt;<br&gt;I&amp;#39;ve eaten at this location and the food is as good as at any other location. Regardless, treating all patrons with respect and efficiency is entirely lacking. If I can&amp;#39;t order food after 45 minutes, it&amp;#39;s not a restaurant, its a bad waiting room radio station.<br&gt;<br&gt;Cheese, yah gotta do better", "rating": 1, "date": "1/5/2018"}, {"text": "It&amp;#39;s always a pleasure to come here! I love the atmosphere and how amazing the food is ! Starting from the bread to dessert, everything was deliciousssss and filling. Especially the oreo cheesecake...omgoodness, I can still taste it! I definitely recommend people to come here for a nice, yummy meal if they&amp;#39;re in the mall! <br&gt;<br&gt;The only thing is, because they are so good, they are usually busy so they did not come around to refill our waters which was annoying because I was parched.", "rating": 4, "date": "7/27/2016"}, {"text": "The food was good, the server was nice but always check your utensils. We found some dirt on this spoon and fork.", "rating": 3, "date": "3/4/2019"}, {"text": "Solid SkinnyLicious meal once again.  I always order off the Skinny menu and always enjoy the portion and taste of the food.  The service is usually pretty good.", "rating": 4, "date": "6/30/2019"}, {"text": "The restaurant was not packed at all and still took over an hour for the food to come out. Saw other tables who ordered after us get there food before. Our order was extremely basic. Soda came out flat, fries were cold and burnt. Finally part of the food came out but took another 15 minutes for the rest. we told the manager who did nothing about it. Extremely disappointing as we eat here a lot but now rethinking it.", "rating": 1, "date": "9/29/2019"}, {"text": "Very unhappy with my visit today! Brought two guests out of the country on vacation to have dinner. We were in four, first came one order the other 3 others 20min later. Hardly the server came to check on the table. Everything we order after took some time to come, more than usual. The ribeye steak needs a thinker cut and better size.  Unfortunately this visit today wasn&amp;#39;t very nice. And at this time 9:30pm the restaurant was pretty empty. Needs improvement. Makes me consider bringing new guests here and/or coming to this location again.", "rating": 2, "date": "7/29/2019"}, {"text": "So the Cheesecake Factory at Short Hills always seems to disappoint me BUT I continue to visit because the food is not what I complain about....IT&amp;#39;S THE SERVICE!!!! <br&gt;<br&gt;Place is clean, the people are nice, but OMG it was slow.  <br&gt;<br&gt;Met with my girls and you need to be on top of your server.  We ordered soup and 15-20min went by and we realized we didn&amp;#39;t even order our entrees.  The waiter explained 7 tables just got pushed on him but it&amp;#39;s not an excuse......it&amp;#39;s a Monday night!<br&gt;<br&gt;So ended up having corn chowder which was delicious then the following:<br&gt;<br&gt;Luau Salad - The dressing was yummy and the crunchiness was perfectly blended with the rest of the ingredients.  We shared this amongst 4 gals and it was more than enough.<br&gt;<br&gt;Louisiana Chicken Pasta - don&amp;#39;t like spicy...don&amp;#39;t order this....it has a nice kick to it and I love bowtie pasta.  Chicken is pan fried....really yummy.<br&gt;<br&gt;Wish we had time for dessert....but like I said service was slow.<br&gt;<br&gt;Yah I would come back....just so convenient after shopping.  Hope the service is better the next time around AGAIN.", "rating": 2, "date": "12/1/2015"}, {"text": "The waiter service was horrible! It was so bad that we had to ask other waiters for service.<br&gt;Our waiter was more attentive to other patrons...<br&gt;<br&gt;We were seated very quickly, which is the only good thing about this experience.", "rating": 2, "date": "7/31/2018"}, {"text": "One time I came here and they brought out everyone&amp;#39;s food almost 20 minutes apart. So we told them to wrap it up and we left. Kinda irritating when you plan on sitting down to enjoy your food. Really good food though so that is cool.", "rating": 2, "date": "3/30/2020"}, {"text": "I haven&amp;#39;t been here since I was 14 and it was cool to come for a birthday dinner...and judging by my most recent experience, that&amp;#39;s probably a good thing. I knew it had been a long time when I discovered that they had a cocktail menu. Last time I came here, I didn&amp;#39;t even know what a cocktail was.<br&gt;<br&gt;I game in for lunch with some of my girlfriends after an exhausting day of bridesmaid dress shopping. I had a bunch of mixed emotions during our lunch, and because of that I&amp;#39;ll settle on an even 3. Here&amp;#39;s why: <br&gt;<br&gt;5 Stars- The menu selection. If you&amp;#39;ve ever been to a cheesecake factory before, you&amp;#39;ll know that their menu is a small novel. There is a ton to choose from, and plenty of decadent sounding lunch specials. Oh also, their hot sourdough bread and butter is the stuff that dreams are made of. <br&gt;<br&gt;4 Stars- The Mojito. It had fresh muddled mint and blueberry. It was divine. <br&gt;<br&gt;3 Stars- The overall dining experience. Read on and you&amp;#39;ll see why...<br&gt;<br&gt;2 Stars- The service was waaaack. No one asked how we were doing and it took like 30 minutes to bring us our check...after we asked 10 times. <br&gt;<br&gt;1 Star- The food. I should have stuck to what I knew, but I honestly didn&amp;#39;t think that fried chicken sliders could be messed up. Instead of 2 or 3 neatly presented sliders, it was a platter of haphazardly assembled greasy chicken patties and mushy buns with a mess of lettuce and tomato on the side. I felt like I was ten and eating a meal at summer camp. Super nasty. <br&gt;<br&gt;It&amp;#39;s not the worst mall chain restaurant to snag a quick meal at...next time I&amp;#39;ll just need to stick to what I know.", "rating": 3, "date": "8/24/2015"}, {"text": "The service is very slow. Our server said that the kitchen messed up cooking the orange chicken so they had to re-cook we waited for my daughter&amp;#39;s meal for a looooooong time. Mind you I don&amp;#39;t know why the chef would mess up cooking their well known specialty dish.  The manager was great though in addressing the complaint 1star for that but they need to train their staff better.", "rating": 1, "date": "8/29/2019"}, {"text": "I&amp;#39;ve eaten there in the past but this time I felt the need to voice my disgust at my experience. I went to dinner with my daughter last Friday. I ordered the shrimp linguine and my daughter ordered a burger. The waiter asked how we wanted the burger cooked and my 11-year old daughter was uncertain so I spoke up for her and told them the meat should be well done. Well we were eating and chatting when my daughter points to her burger- turns out she was halfway done eating it when she noticed it had quite a bit of blood on the inside. At this point I had already paid but was completely disgusted. I asked to speak to a manager to voice my concerns. The manager simply made excuse after excuse after excuse. I can&amp;#39;t even remember if there was an apology in the midst of his excuses. I doubt it. <br&gt;Anyway I&amp;#39;m disgusted not only about the undercooked Food my child was eating but also about the way the manager handled the situation. He was rude and unprofessional. For that reason in itself I won&amp;#39;t be back.", "rating": 2, "date": "7/10/2018"}, {"text": "We were looking forward to going to the restaurant tonight and the experience was really bad. Over an hour wait until we got a seat for our family of 5. The place was crowded and very noisy the whole evening. We waited for the menus, waited to get our order in, waited about an hour to get the food (which came at different times), then waited for someone to clean our dishes, waited for someone to clean the table, waited for the dessert menu and again waited to pay. The entire experience was painful and very frustrating. All together it took over three hours. The last time we came wasn&amp;#39;t nice, so we have it another chance. We won&amp;#39;t be coming there anymore.", "rating": 1, "date": "1/4/2020"}, {"text": "Forgot to check in, but had to come back to post about it.  I had Chicken Bellagio: Breaded chicken ( scallopini style ), prosciutto, arugula, basil pasta over cream sauce. It was heavenly! I totally food-gasmed!", "rating": 5, "date": "5/8/2018"}, {"text": "My worst experience here. I&amp;#39;ve been coming here for years.. maybe management has changed but the service and food was not good. I&amp;#39;m not so picky that I need everything perfect but the difference in service was so obvious from previous experiences.<br&gt;It will be a long while before I return to this location.", "rating": 2, "date": "7/5/2018"}, {"text": "I went for a Sunday brunch and arrived around 12:30- no wait time! The brunch options are pretty good1 I ordered the fried chicken and waffles Benedict. The breakfast potatoes had virtually no flavor and tasted like they were drenched in oil. The chicken was nice and crispy, but the waffle was soggy. I would&amp;#39;ve preferred they pour the hollandaise sauce directly on the poached eggs and not on the side. However, good portion! Overall OK meal- nothing to brag about but there are plenty of other options here for a brunch.", "rating": 3, "date": "3/26/2019"}, {"text": "We went for happy hour. The waitress we had never was around and never offered us a refill on our drinks so we skipped desert service was bad. Our waitress disappeared for 20 minutes.  I was already ready to leave. I asked for the check and to go bag that took her 10 minutes. Walked away not feeling happy about this place. Carry your patience with you.", "rating": 1, "date": "6/6/2019"}, {"text": "I&amp;#39;m giving the Cheesecake Factory in Short Hills, NJ 3 stars only because I love their food. As far as calling in an order for pickup, that&amp;#39;s another story. I was put on hold 4 times for an average of 10 minutes each time. So I called the Cheesecake Factory in Wayne, NJ.... Same thing. Completely unacceptable. Why aren&amp;#39;t the phone operators being monitored???", "rating": 3, "date": "2/1/2020"}, {"text": "Never going back. Dirty forks and knives. Fruit flies all around us. Smaller portions than any other Cheesecake Factory I have been in. Smaller cocktails. The one in Menlo Park is so much better.", "rating": 1, "date": "8/1/2019"}, {"text": "Ordered Doordash for 2 people tonight, over $80 total for the convenience factor of a lazy Sunday.  Cheesecake Factory didn&amp;#39;t even include bread in the order and the food arrived barely warm.  Won&amp;#39;t ever order to go or delivery again from them based on principle alone that you shouldn&amp;#39;t be treated any differently if you get it to go.", "rating": 1, "date": "11/17/2019"}, {"text": "Mom got a chicken dish and we all shared it as she said it tasted funny. We were out to prove her wrong.  We all spent our night hugging the toilet. Food poisoning big time. So be careful eating here.", "rating": 1, "date": "5/27/2019"}, {"text": "My weekly brunch date at Cheesecake Factory never fails me. I decided this week to have the Chicken and Waffles Benedict. It was a bit more busy than most weekends but waiting for my food was SO WORTH THE WAIT! It was so good! I can tell that their was love put into that dish!!! Also, my bartender, I know he wears glasses and he has been working there for years, (I worked at the mall for so many years) went to see were my dish was and I wasn&amp;#39;t even in a hurry and he had a full bar. I love the fact that especially behind the bar there are still the same familiar faces that I have known for years and they always have a smile or they remember what you are going to have. I love the consistency with the staff. It really goes a long way with the customer service experience and they should be recognized for it. Thank you as always guys!", "rating": 5, "date": "11/18/2018"}, {"text": "Came here for dessert and coffee after dinner. Our server was Anthony, he was really nice but not attentive at all. For me when I go out to eat, I don&amp;#39;t necessarily need for you to get things individually one by one. Everything didn&amp;#39;t come out exactly at the same time. My party ordered three cheesecakes, two coffees, and a latte. Everything came back one after another. Same thing when it came to the check. Dropping off the check, waited ten minutes, picked up the check, we told him we wanted to get containers to go, dropped off the check to the table, waited longer to get the containers. I&amp;#39;ve never had a problem with the actual food at any Cheesecake Factory but it is inevitable that every night you are going to be busy and packed. We went on a Wednesday night and for just dessert turned into almost over an hour just waiting for service alone. I hate to take down about service if only I was aware if not the server but the management not having enough people working.", "rating": 3, "date": "7/3/2018"}, {"text": "The service is fast and precise. I had a four cheese pasta with chicken. Which exceeded my expectations. My friend had salmon with mashed potatoes and broccoli. Which was also pretty good. Overall the food was great, service up to par. Easy access for a car, parking lot right outside. On the negative side the floor was VERY slippery for some reason. I had to grab on to whatever i could while walking to and from my table", "rating": 4, "date": "1/27/2019"}, {"text": "The Cheesecake Factory? More like The Snoozecake Factory. Simply AWFUL. 15 minutes for menus. 25 minutes for drinks 55 minutes for entrees that come BEFORE the appetizers. This place is not an example of mismanagement, but LACK OF TOTAL MANAGEMENT. The wait was the good part though. The appetizers came out AFTER the entrees all wrong, but in an odd chain of occurrences, the entrees were wrong too, and also needed to be sent back, talk about FOOD WASTE. Basicly every single item we ordered besides white wine was incorrect or improperly made. Restaurant ran out of 4 menu items (extremely odd for a chain restaurant). Failed to make the famous Evelyn pasta THREE TIMES (literally made it 3 times over and NOT ONE VERSION was the &amp;#34;Evelyn&amp;#34; pasta we eat at 6 other cheesecake locations across the country). Every version came out of the kitchen with the chef&amp;#39;s very own twist (also VERY ODD for a FRANCHISE) rather than the menu description and with a heavy, heavy hand of salt and oregano (EWw). Chicken Madeira tasted like it was doused with kerosene and also needed to be remade. The famous make your own Thai chicken lettuce wraps came already made for us as tacos rolled in hot, soft, wilted lettuce (this is not the way Cheesecake factory serves this dish and also a HEALTH HAZARD). After complaining to the waiter several times and talking to the manager several times, the waiter continues to come over and ask us time after time and says, &amp;#34;So..UM...what&amp;#39;s wrong?&amp;#34; and &amp;#34;So...what&amp;#39;s going on guys?&amp;#34; IT WAS LIKE THE TWILIGHT ZONE. When we discussed all these issues with the manager never once an apology, he just says to us: &amp;#34;Ohhhhhhh.............thank you.&amp;#34; - and walks away - WHAT?!?! crazy!!!!! So, can we give this place zero stars? Finally the manager&amp;#39;s manager who seemed *slightly* more aware of the issues came over to say hello, although she was very sweet, needs a VERY big lesson on customer service and hospitality, I mean, she acted like what she did by removing 1 appetizer from our bill, maybe a damn slice of cheesecake after all of these issues would have been nice????? The cherry on top of our imaginary cheesecake was when we asked one of your employees to kindly watch us (2 females) walk out to the car as it was very late at night and dark out, he comes outside with us, waves, enthusiastically, &amp;#34;Good night ladies!!!!!&amp;#34; and goes RIGHT BACK INSIDE !!! After we explained to please watch us get into our car safely !!!!! I guess you guys forgot the murder that occurred in Short Hills parking lot in broad daylight just a few holiday seasons ago. HOW  <br&gt;MORONIC????? If you want to take a trip to Psycholand , this is it ! AWFUL AWFUL EXPERIENCE AND VERY DISAPPOINTED IN THE CHEESECAKE FACTORY AS A FRANCHISE TO ALLOW THIS LOCATION TO EXIST. ZERO COMMON SENSE. ZEOR HOSPITALITY.", "rating": 1, "date": "12/12/2019"}, {"text": "The bartenders here are the absolute best and provide top notch service no matter how busy they are!  Seriously, the reason I keep coming back. The food is good, avocado egg rolls, chicken taquitos, Greek salad, and the spinach dip are some favorites. And the cheesecake, obvi.", "rating": 5, "date": "6/12/2019"}, {"text": "After such an incredible meal at Cheesecake Factory yesterday, I knew first thing I wanted to do Monday morning was leave them a five star review. I am so surprised to see so many negative and one star reviews for this location. Especially so many within the last month! <br&gt;<br&gt;My fiancé and I were shopping at Short Hills Mall when we decided to stop in for a late lunch/early dinner. As with every other Cheesecake Factory, this place was packed. The hostess told us it would be about a half hour wait. We put our names down, grabbed a buzzer, and plopped down in the waiting area. 15 minutes later, I felt a buzz, buzz, buzz in my back pocket, we weaved our way through the herd of people waiting for a table and were ushered right to a nice intimate table for two.<br&gt; <br&gt;Both feeling healthy we decided to order off the SkinnyLicious menu and boy was it delicious. I got the Lunch Miso Salmon substituting the white rice for spinach. My fiancé got the grilled steak medallions. Both entrees were outstanding. My salmon was packed with so much flavor. It tasted just as good as if I got it from Nobu. We also decided to split the Korean Fried Cauliflower (which was probably one of the best appetizers I had a very long time) and the Edemame.<br&gt;<br&gt;We were so full and satisfied that we couldn&amp;#39;t even order a cheesecake. You can always count on a great meal from this place. Even our waitress was really great. She checked on us often enough, and always made sure our waters were full. We don&amp;#39;t eat at Cheesecake factory often, but when we do come back I already know what I want to order.", "rating": 5, "date": "1/8/2018"}, {"text": "Follow up to my initial review of the cheesecake factory visit.  I respond to the request of the representative who wrote on my page to basically be told that they could not find a record of my visit.  <br&gt;<br&gt;If the company honeslty looked into the complaint there is no way they would not be able to find a record of me being at this resturant on September 20th. When you arrive they always ask for your name so that they can put your name down in the computer or on the paper so that you could be seated in the order that you arrived and availability. Secondly, I&amp;#39;m sure an establishment as large as there&amp;#39;s has cameras, third but not the least my party paid with several credit cards that night so I am site that the company would have records of that. <br&gt;<br&gt;If The Cheesecake factory  didn&amp;#39;t want to take this issues seriously they should not have responded to review of one of their establishment.", "rating": 1, "date": "11/2/2016"}, {"text": "Disgusting tables, silverware, and glasses.  They should be ashamed of themselves and the leadership should be fired. See my photos as you will notice how dirty this place is.  Health inspectors should and will be notified.", "rating": 1, "date": "2/6/2018"}, {"text": "The service is terrible. We waited for 30min for the bread and water. And the food is terrible too!!  So different from other Cheesecake Factory locations. Don&amp;#39;t come here", "rating": 1, "date": "2/11/2018"}, {"text": "This Cheesecake Factory was pretty packed on a Saturday night. Got here around 7:00 and had to wait an HOUR for a table. I guess it&amp;#39;s expected but still. <br&gt;<br&gt;Just your typical Cheesecake Factory. We love the Chicken Bellagio ~ I think it&amp;#39;s the best thing on the menu. Had the chicken Picatta this weekend, nothing too special. <br&gt;<br&gt;Cheesecake it good though. Loved the Godiva Cheesecake. The hazelnut Cheesecake had a little too much cake base it in but was pretty tasty", "rating": 4, "date": "2/20/2017"}, {"text": "This will be my last time going to this Cheesecake Factory. Every visit, the service has deteriorated. The server passed our table numerous times, and didn&amp;#39;t offer assistance. To make matters worse, a handicapped patron in a wheelchair was directed to a table and the chair was not removed for them. I offered to move it for the gentleman. <br&gt;Our orders were wrong and no one seemed apologetic, except for the manager.<br&gt;I can find somewhere else to get my cheesecake.", "rating": 1, "date": "1/17/2018"}, {"text": "One of my favorite restaurant, I like the free bread very much, Cobb salad is fresh and big plate", "rating": 4, "date": "4/21/2019"}, {"text": "From the moment I walked in I knew I should had left. First they said there was no wait for 3. 15 minutes later they call us and as we are walking to the table they realized that the table was dirty. Another 15 minutes later we were sat. Under the table it was still dirty and no one seemed to care. For starters we order fried calamaries and sweet tamales. The calamaries were fill with French fries and super wet and gummy like they were not cooked through.  The sauce seemed to have been sitting out and started turning color. My son who loves calamaries and at 6 can eat the whole order said they were disgusting. The tameles which are the reason I went there were ok, a little too soft compare to other tamales I had at other locations. Then for the entree we had the kid cheese pizza, shrimp scampi and bbq chicken salad. The salad was ok nothing really had flavor, then the shrimp scampi presentation was awesome and made you feel it was going to be delicious but the pasta was over cooked and tasteless. The shrimp were also gummy and flavorless. The cheese pizza was better than my entree . For desert we had the lemonchello which was amazing. Wished I just picked up the cheese cake and saved my 100 dollars. Will not visit this location again. Its sad when the free bread was better than anything you ordered.", "rating": 1, "date": "3/11/2018"}, {"text": "I&amp;#39;m from California and this store would never cut it there. <br&gt;Service: meh. 3 times I&amp;#39;ve come here in as many days (bus. trip) bad service. At 4:10 pm with about 10 tables occupied it 5 mins to get my Sprite. It&amp;#39;s :15 now and still no bread. <br&gt;Cleanliness: Dirty/grimy ... Everywhere. Bathroom filthy. <br&gt;No one really makes eye contact unless absolutely necessary. <br&gt;Hold on, I have to ASK for my bread....server disappeared 5 mins ago. <br&gt;The only redeeming value is their good cheesecake. <br&gt;Music: VERY ethnic. Not dining music.<br&gt;I may start avoiding CF&amp;#39;s all together with them trending this way.<br&gt;Posted 12/17. <br&gt;Last visit: 6/17<br&gt;Delay in review due to technical glitch on Yelp.", "rating": 2, "date": "12/26/2017"}, {"text": "Aside of the chaos in the ever-busy Short Hills Mall location, we enjoy coming to cheesecake with the family. I really don&amp;#39;t understand the need to have so much on the menu and find it quite overwhelming as well. I also don&amp;#39;t understand why it took me so long to see that I was ordering way too many appetizers that my entree always ended up getting packed up lol<br&gt;<br&gt;While you&amp;#39;re not going to find culinary genius here, it is pretty much a safe bet to get some decent food. The quality of some dishes are hit or miss, and sometimes depend on the day I guess since we can order the same dish and quality varies. Also, when you stretch the ability to control the food across so many menu items that is the result. For the kids, the Mac and cheese is a solid hit and the fries are great. Avocado rolls are delicious (subject to variation in taste) and wings are solid. We went for the crab and artichoke dip which was not edible and had no flavor. Chicken sliders were good on prior visits but this time the chicken was cut too small and was drowned by the bun.<br&gt;<br&gt;Moral here is that options are not always great when they can cause your to shut down and default to what you know. Takes away from being able to explore other dishes since you don&amp;#39;t want to risk it.", "rating": 3, "date": "3/9/2018"}, {"text": "Hate to dis this place but the manager here does not know what he is doing. Does not belong in the hospitality business. I&amp;#39;m sure that the staffs inability to get their shit together has everything to do with his lack of leadership skills.<br&gt;My daughter suggested I clarify what manager I am referring to the big guy with the red shirt. Any decent manager would have introduced himself to me and made sure my experience was on a par  after my first complaint.", "rating": 1, "date": "1/7/2018"}, {"text": "The food is always excellent. The problem lies in the service. On a weekday its usually okay, but on a weekend its usually quite poor. Expect to wait at least 45 minutes and have people at other  tables an inch apart from you. Worst of all is the noise. This place is the loudest restaurant I&amp;#39;ve ever been in.", "rating": 3, "date": "4/7/2019"}, {"text": "We&amp;#39;ve been to this place many times. I enjoy TCF and its many menu options. Our family of four went there on a Saturday night. It was the standard 30-min wait but we didn&amp;#39;t mind. We went strolling through the mall during the wait. So this is the sequence of events tonight:<br&gt;<br&gt;7:15 - we are seated and our waiter immediately takes our drink order<br&gt;7:30 - our drinks arrive in staggered fashion with the beer arriving last; we place our food order<br&gt;8:00 - couple in table next to us leave<br&gt;8:05 - new couple arrives at the empty table<br&gt;8:20 - our waiter apologizes for our long wait and says he&amp;#39;ll find out what&amp;#39;s happening in the kitchen <br&gt;8:25 - our neighboring couple&amp;#39;s food arrives; I go ask the front desk (since our waiter is MIA) why we&amp;#39;ve been waiting so long for our food; manager says he&amp;#39;ll find out<br&gt;8:30 - our food arrives but we&amp;#39;re fuming mainly because someone f&amp;#39;ed up and everyone was pointing fingers (manager said kitchen messed up; waiter said he had no idea; food servers said they&amp;#39;re just doing as told).<br&gt;<br&gt;So we waited a full hour for our food (nothing complicated - Caesar salad, two steaks, and one chicken) and we told them to take it back. I said I would pay for drinks, but the manager was nice in saying that our drinks are covered. But, if anything could have salvaged the evening, it would have been a word from the manager or waiter saying that he screwed up (instead of blaming it on the kitchen) and asking us to enjoy our food with drinks on us (or some other discount for the long wait). <br&gt;<br&gt;In any case, bring food to customers in the order they arrived and everyone should be happy. This place is a madhouse on Friday and Saturday evenings. That is just my one bad experience. I&amp;#39;m fairly sure by their popularity that others have good experiences. So take this for what it&amp;#39;s worth - just one review among many.", "rating": 1, "date": "10/28/2017"}, {"text": "I love the Cheesecake Factory but the service here sucks. This location is close to my house but it&amp;#39;s definitively worth it to travel the extra mile to Paramus. I gave this location too many chances but today&amp;#39;s definitely my last. Our food took over an hour to come out and we had a child with us. We arrived at 7 and didn&amp;#39;t leave until 8:40. We got our food at 8:30 and left at 8:40. No apologies just a ton of excuses. No visit from a manager not even a single update on where our food was in the process. The service here is horrible. Farewell Shorthills Cheesecake Factory.", "rating": 1, "date": "12/21/2018"}, {"text": "The Menlo Park mall location is much better.  This one always low balls the wait time by at least 50 %. <br&gt;Just waited 45 mins after being told 20.  When we finally get seated guess what..I see at least half a dozen empty tables.  Wtf <br&gt;This is the only CF that I have been to that doesn&amp;#39;t seem to run like clockwork.<br&gt;On a positive note they make up for a service slip up. Someone in our party was missing part of their order and it didn&amp;#39;t come out until the meal was almost done. Without us even asking the mgr came out and apologized and offered us a comp desert. Much appreciated.", "rating": 4, "date": "4/28/2019"}, {"text": "Service is sometimes slow but the food is fabulous! Friendly staff. Great place for going out to dinner both with families and alone on a romantic date night. My personal favorite is the dumplings! Great atmosphere and a chill place to hang.", "rating": 4, "date": "3/23/2019"}, {"text": "The service is hit or miss. I ordered takeout and the syrup was not syrup...it wasn&amp;#39;t even sticky. It looked like the poured oil into the container mixed with something else.", "rating": 2, "date": "3/23/2019"}, {"text": "The portions are so big here I am always full by the appetizer. Love their vegetarian lettuce wraps. My fav thing on the menu is the avocado egg rolls with cashew cilantro dipping sauce. The falafel salad was good just needed more seasoning or a lemon dressing.  The cobb salad looked great and had a chipotle dressing that was very creamy. This is the place to indulge portions are humungous!", "rating": 4, "date": "3/31/2016"}, {"text": "The pasta, Evenly&amp;#39;s favorite, is delicious. However, it took the kitchen too long to prepare the burger. According to what they told us, someone dropped the burger to the floor so they had to make another one. We would like the burger to be medium and come with sweet potato fries. What we got after 40+ minutes were a well-done patty with potato fries. Moreover, the waitress forgot to serve us the bread the entire time. We prefer only buying cakes from this place in future, which might be the only safe choice that won&amp;#39;t disappoint us.", "rating": 2, "date": "8/29/2019"}, {"text": "This is a staple for all NJ eaters. If you want to get great value and also have one of the biggest menus to choose from, Cheesecake Factory is for you! Although the name can throw you off, their food is more than just dessert. Pasta and salad dishes are quite good as well as some asian fusion dishes. They really can do it all. It&amp;#39;s not the most sophisticated food in the world but the flavor and portions are on point!<br&gt;<br&gt;We always order the spicy ahi tuna tempura app and are never disappointed. Kobe beef sliders were good as well. My father in law always gets the Chicken Fettucini, quite tasty. The ladies love the Cobb salad, tons of bacon and chicken! Come here to gorge but if it&amp;#39;s busy be prepared to wait....", "rating": 4, "date": "6/20/2014"}, {"text": "After the NY Winter Wine Festival at the Hilton we went across the road to the cheesecake factory for some much needed chow. I normally go to the Bridgewater or Menlo Park locations. Thinking that all Cheesecake factories are created equal I ordered my usual. My sister and I shared a Ceasar Salad( that was good) and the Dynamite Shrimp (overcooked and greasy). <br&gt;<br&gt;For entrees I had my usual shrimp and salmon combo with mash potatoes and asparagus and my sister had a burger and fries. My Combo came out and the shrimp were so brown I didn&amp;#39;t recognize the dish. The salmon was not very warm but I ate it while I asked for new shrimp .<br&gt; I was a little surprised when the manager came over he didn&amp;#39;t offer to take the entire plate and fix order instead he just got me new shrimp . I actually enjoy the combo when I eat a little shrimp and salmon in same bite so this killed it for me . <br&gt;My sisters burger came out with no fries because they were making them still. FRIES really they are the shortest thing to cook.???<br&gt;<br&gt; Anyway I did get an replacement shrimp it was less dark in appearance but a little gummy . I told the manager when leaving it still WASN&amp;#39;T RIGHT,  He told me he watched them while making it and they did it right. So I guess I was wrong lol. <br&gt;<br&gt;The Bartenders really saved the experience as they made us amazing Stoli O cosmos and were very pleasant.  I would NOT order my favorite dish from this location EVER ! At best I would probably  have drinks at happy hour price.", "rating": 3, "date": "2/28/2016"}, {"text": "My first time at any Cheesecake Factory location and overall, a bit of a discordant experience. The food options and quality were a shade above your normal full-service chains, the prices right in line with other competitive offerings, and the decor/lighting very relaxed and inviting. My complaint however, resides solely in the customer service experience, which judging from previous reviews, is an all too common occurrence. After we were seated, our party was forced to wait an obscenely long time to place our orders and the service after our food arrived was similarly lackadaisical. <br&gt;<br&gt;I understand that we dined during peak hours, and while not blaming the waitress who served our table, the blame must be accepted by the managers on location. The experience has not put me off entirely, but changes should be made to necessitate future visits.", "rating": 3, "date": "3/1/2016"}, {"text": "I went to this location the Saturday after valentine&amp;#39;s and it was horrific to say the least. I won&amp;#39;t be back. After being seated it took out server who I believe was named shameka ten or so minutes to ever show up to our table. Then I actually had to go ask the staff if we had a waiter. When we sat down the table wasn&amp;#39;t cleaned off and the previous couples check and money was still on the table. The server was rude and neglent and didn&amp;#39;t listen to the order carefully. Her attitude was off and very phony. She wanted to serve the ppl around us but not ya for some reason. I wish I had asked to change the server now I think of it and did report it to the management via a phone call because I was so bothered. What a waste of money and a valentine&amp;#39;s dinner. I have never felt so bad eating at a restaurant and I will never go na", "rating": 3, "date": "3/21/2019"}, {"text": "So let me preface this by saying don&amp;#39;t go to a Cheesecake Restaurant and try to order steak. I made the mistake so you don&amp;#39;t have to. Now if you read this and decide to order a steak after I told you not to, that&amp;#39;s on you. <br&gt;<br&gt;My girlfriends and I arrived on Friday, a little after 6:00 and were told there was a 10-15 minute wait. We didn&amp;#39;t have any issue with that because we hadn&amp;#39;t seen each other for a bit and we 3 are gifted with the gift of gab! We didn&amp;#39;t wait 10 minutes which was great. <br&gt;<br&gt;On to my dinner, which left me underwhelmed. So I ordered the Hibachi Steak because I let my anemia choose the entreé. It was supposed to come with Wasabi Potatoes and Tempura Asparagus, but I substituted Tempura Asparagua for regular asparagus.<br&gt;<br&gt;Our waiter, Joey was very patient with us, as we had one wholly indecisive member in our party. He had to visit 3 times before the entire table was ready, but I ordered an Herbal tea to pass the time. <br&gt;<br&gt;So I was really excited to try Wasabi Potatoes but unfortunately I was served a GIANT pile of regular unsalted red-skinned potatoes. There wasn&amp;#39;t a whiff of Wasabi in the mashed potatoes (which is pretty hard to miss), nor did I see wasabi on the side, so that left me disappointed. Also, I don&amp;#39;t know about anyone else but when I order steak (and pay damn near $22 for it) potatoes should be a side! I go to a restaurant for food I can&amp;#39;t make myself, and I certainly don&amp;#39;t get steak and potatoes to eat the potatoes! <br&gt;<br&gt;The meal was mostly blah potatoes, about 2 pieces of cut up asparagus, and maybe 6 or 7 slivers of damn near done steak (which I requested cooked medium) Also, I&amp;#39;m an adult, and I want to cut up my own damn piece of meat. Just saying.<br&gt;<br&gt;Anyhow I ate half of my giant plate of potatoes and saved space for the Chocolate Tuxedo Cheesecake which was plated so nicely, that I almost forgot my underwhelming steak dinner. <br&gt;<br&gt;Our waiter was busy and so I didn&amp;#39;t bother to address the steak situation but there seemed to be individuals going around watching people eat but they didn&amp;#39;t ask us how our dinner was going, so I left well enough alone. <br&gt;<br&gt;Next time I&amp;#39;ll just skip dinner and go straight to the cheesecake. They&amp;#39;ve got those down, dinner service not so much.", "rating": 3, "date": "5/6/2017"}, {"text": "After an hour wait (Saturday night at 7:45 so I get it) we sit down at a table that still has food residue from the previous patrons.  Every single utensil was dirty and crusted with food despite the table having the appearance of it being just set.  I looked for a server but no one would pay attention to us so I decided to gather up the silver and dirty folded napkins and remove them from the table myself while I cleaned the table using my sons baby wipes.  I was finally approached by a waitress who was pleasant.  I showed her the dirty silver and she removed it immediately.  We ordered food and it arrived in a fairly timely manner.  But it is a bit difficult to eat without any silverware.  Yes, she had forgotten to replace our cutlery.  A few moments later she returned in a very casual manner and said &amp;#34;here you go&amp;#34;.  Food wasn&amp;#39;t bad...  nothing to write home about but it was what we expected.  Half of our plates were cleared and we asked to see a dessert menu.  10 minutes went by and no menus.  We start to look for the waitress and see her talking with her coworkers.  She notices us looking at her and finally graces is with some menus.  She takes our order and the wait begins.  5 minutes...  10 minutes...  15 minutes go by and still no food.  We look but can&amp;#39;t seem to find our server anywhere.  She finally arrives to tell us that there is a delay with the cakes and it&amp;#39;s going to be a few more minutes. My wife gets up and notices an entire counter by the cakes overflowing with plated food and the cooks standing there talking.  I assume the waitress forgot to order our food.  We ask for it to go as it&amp;#39;s now late but also ask for the check while we are waiting so we can hurry things along.  Again, a very &amp;#34;oh well&amp;#34; attitude and demeanor from our waitress.  8 minutes later (yes I timed it) she finally brings out to go desserts with the check.  Horrible service...  very slow and very dirty.  Won&amp;#39;t be back...  unless I have 3 hours to kill and want to eat off of a dirty table.", "rating": 1, "date": "11/23/2019"}, {"text": "I come here often and I like it everytime.<br&gt;<br&gt;FOOD &amp;amp; DRINKS<br&gt;<br&gt;I love their bread first and foremost. Its pumpernickel and delicious. I can get full just off of the bread but my favorite dish is the four cheese pasta I get this every time and never get tired of it. Every dish is pretty good from here so you cannot really go wrong and they guaranteed have something you&amp;#39;re in the mood for because their menu is very long. <br&gt;<br&gt;My favorite drinks are the strawberry-banana daiquiri and the georgia peach. They are so good! The georgia peach is my go to because it is s hard to find from other places. <br&gt;<br&gt;SERVICE<br&gt;<br&gt;It varies on the waiter, but service is relatively good here. They can get pretty crowded so sometimes the wait is long as hell and there are too many tables to pay attention to- they&amp;#39;re pretty good though. <br&gt;<br&gt;I like to come here, definitely worth it! They aren&amp;#39;t too expensive either and that is always a plus.", "rating": 4, "date": "1/3/2016"}, {"text": "Just came here for Happy Hour.. Ordered Tex Mex Eggrolls, Factory Nachos &amp;amp; Long Island Iced Teas ALL $5.95... I forgot to take pics but food was delicious..", "rating": 4, "date": "12/7/2017"}, {"text": "I wasn&amp;#39;t particularly blown away.   Sat at the bar, had the calamari and the sweet fries.  It was good and I would come back but my socks weren&amp;#39;t blown off as I  had expected.  Service at bar was ok could have been more attentive.... Asked for water... I never got my water,  etc.<br&gt;The pizza margharita was good.  The carrot cake was HUGE!!  (&amp;#34;That&amp;#39;s what she said.&amp;#34;)<br&gt;<br&gt;I&amp;#39;ll go back and try to add a star to this review....<br&gt;<br&gt;Overall it was just ok", "rating": 3, "date": "5/2/2016"}, {"text": "I&amp;#39;m not sure what the deal with this place is but it&amp;#39;s totally normal to wait on hold for 10 minutes to place an order, then wait at the restaurant 10-15 minutes LONGER than the amount of time they tell you your order will take. Doesn&amp;#39;t seem like they&amp;#39;re lacking any staff because there is usually a half dozen people standing around chatting and doing nothing while 3 or 4 people look like they&amp;#39;re running around like crazy trying to get everything together. I&amp;#39;m writing this review while I&amp;#39;m on hold, it&amp;#39;s been 7 minutes and it&amp;#39;s the second time I&amp;#39;m calling trying to order, c&amp;#39;mon guys! Food is great but the wait is insane **UPDATE** Keisha just answered and instead of just transferring me she took my order and was really nice and helpful, thanks girl!!", "rating": 2, "date": "11/6/2018"}, {"text": "Understaffed. Waited forever to get our drinks and then meals.  We are here at an off hour too!  Between lunch and dinner!   Won&amp;#39;t do this again!", "rating": 1, "date": "1/5/2019"}, {"text": "Love the food and cheesecake selections. Yes, the menu is a book thick.<br&gt;<br&gt;::Ambiance::<br&gt;A normal Cheesecake Factory setup and there was no wait at all.<br&gt;<br&gt;::Food::<br&gt;Surprisingly they have pretty good fish and chips, minus the fries. Fish was very crispy. I just love the Fresh Strawberry cheesecake.<br&gt;<br&gt;::Service::<br&gt;The staff can put on a bit more of smile on their faces. Bases our waitress forgot to bring the beer, everything else was pretty good.<br&gt;<br&gt;::Fun Fact::<br&gt;They have a fire place in the back, which is very hard to find.<br&gt;<br&gt;Would have the cheesecake again. I really want to try all of their cheesecakes one day.", "rating": 4, "date": "11/10/2013"}, {"text": "If I could rate no star, I would. Last night was HORRIBLE. We called my pick up order in around 7:45pm and were still waiting well after 8:15pm for my food. Not only did the guy at the front counter try flirting with me, he basically called me FAT! Saying he &amp;#34;loves a full-figured woman!&amp;#34; <br&gt;To think that was it, doesn&amp;#39;t explain the half. I drove all the way back to central jersey to enjoy my chicken parm sandwich, to find an object in it! Photos attached. My friend called last night to complain to the manager, and was placed on hold TWICE, then when he finally spoke to someone, he was brushed off. Like what kind of service is this, and who is running this establishment?! Cheesecake Factory used to be good, and the service was great a few years ago, but overtime, it&amp;#39;s become a huge disappointment. I wasn&amp;#39;t pleased with the service nor my food, obviously. I don&amp;#39;t think they&amp;#39;ll EVER get any business from me, again.", "rating": 1, "date": "5/8/2018"}, {"text": "I love the food and cheesecakes but was upset because we had a 2 1/2 hour wait this pass friday. It was a birthday group of 15 : we called the day before to find out If we need to make reservations or maybe come in early because the group size and they stated no it should be fine to seat us all. Of course we waited because had everyone there but they should allow reservations for large groups.", "rating": 3, "date": "11/12/2017"}, {"text": "Over the past week I&amp;#39;ve ordered a few times over the phone for pick up and the staff make it impossible to place an order. As soon as you call they put you on hold indefinitely! It take 3-4 calls to get someone to take your order and you have to  request a manager before your taken care of...the frustrating part is they are not busy! It&amp;#39;s a Monday night and the mall is slow but cheese cake factory obviously doesn&amp;#39;t care about their customer. I shouldn&amp;#39;t have to ask for a manager every time I want to place a pick up! <br&gt;<br&gt;Negatives stars if I could rate it", "rating": 1, "date": "11/2/2015"}, {"text": "Let me start with the positive points. When we arrived, there was only a 5 mins wait. For me, it was the fastest seating I have experienced at any Cheesecake Factory location. The food was decent, as usual the menu has lots of options for everyone. However, the service was awful. I ordered a kids pasta &amp;amp; meatball dish, and when the runner brought it out I asked her if she can please bring an extra plate. She rolled her eyes with a major attitude and said &amp;#39;ok&amp;#39;. If I should have asked my waiter instead, she could have communicated that to me. However, the plate I asked for NEVER arrived! I will not return to this location!", "rating": 1, "date": "7/14/2018"}, {"text": "This was a frustrating experience.  The food was pretty good- but the service was terrible.  We waited a long time for everything- &amp;amp; they didn&amp;#39;t even seem to be very busy when we got there.  Our server didn&amp;#39;t bring the things we requested (2nd round of drinks &amp;amp; ketchup for a burger) &amp;amp; after waiting 15 minutes I had to go to the kitchen to get the ketchup myself.  The 2nd round took 20 minutes, &amp;amp; everyone was done with their food by then.  Then, she took the leftover pizza to box it- &amp;amp; we waited so long for it to come back that I had to go find that too.  I think we&amp;#39;ll go to the Summit Diner next time.", "rating": 2, "date": "7/7/2018"}, {"text": "Terrible experience at this Cheesecake Factory in Short Hills , NJ . Went on a slow Sunday afternoon ,  saw many empty tables. Still had to wait a half hour to be seated.  We knew what we wanted when we sat down so ordered right way.   Other diners near us were heard to comment that they were still waiting for their drinks while their meals were served.  Finally fifty minutes later our food arrived ... in horrendous shape. My turkey burger was falling apart and minuscule and my partners alfredo dish was literally a plate of glued  together cold  pasta.  My beet salad looked like what was left AFTER you finished your meal.  Got up and went to the front, said to the person in charge we couldn&amp;#39;t eat this and was met with the response &amp;#39;ok&amp;#39;. So after wasting a good 2 hours I decided to email the company and got a phone response which was very nice offering to get back to me about the problem.  So after no response after that I called again and it seemed as if the whole thing was forgotten! Again I was promised a response.  What I got was a ridiculous gift certificate that was totally inadequate.  Makes me conclude this restaurant doesn&amp;#39;t understand customer service AT ALL. The waste of my time was not appreciated by them at all.<br&gt;<br&gt;And they clearly DO NOT understand our frustration because if they did they would make an honest effort to repair the damage. Cannot believe how tone deaf they are!!", "rating": 1, "date": "5/4/2018"}, {"text": "It&amp;#39;s dark, it&amp;#39;s noisy, the tables are relatively close together, the servers are tough to flag down, but... if you are a vegetarian and you&amp;#39;re looking for the best Impossible Burger, this is where to find it. I have eaten them at Bare Burger in NYC, Houlihan&amp;#39;s in Parsippany (second best), White Castle in East Brunswick and at The Office in Morristown. The Impossible Burger here is larger, juicier, and dressed perfectly. The fries aren&amp;#39;t so bad either.", "rating": 3, "date": "1/23/2019"}, {"text": "Everyone knows about the Cheesecake Factory.<br&gt;<br&gt;I&amp;#39;ve always stopped by and gotten the cheesecake there, but never had the pleasure of dining in until this summer.<br&gt;<br&gt;Complimentary bread basket: Warm and crusty. You&amp;#39;ll need it for the wait. 4/5<br&gt; <br&gt;Shepherd&amp;#39;s Pie: This dish could feed an entire family of 4 in the old days. There&amp;#39;s ground meat, potatoes, and sauce everywhere. Rich and filling. 5/5<br&gt;<br&gt;Steak Diane: The steak was on the tougher side of tender. The mushroom wine sauce could be heartier. 4/5<br&gt;<br&gt;Lasagna Verde: Flavorful and chewy, with an artful presentation. 5/5<br&gt;<br&gt;Salted caramel cheesecake: Smooth and creamy. You could really taste the salt crystals. 4/5 <br&gt;<br&gt;Since it&amp;#39;s THE mall location, it gets super crowded and noisy on the weekends. Expect a 45-min wait to be seated, followed by a 30-min wait for the food. Come hungry and you will walk out well-fed.", "rating": 5, "date": "9/22/2018"}, {"text": "Food was OK. Service was OK.  However, on the bill they give you the &amp;#39;suggested gratuity&amp;#39; and the math is done on total of the check with tax.  If the restaurant is going to help me with the math for a gratuity it should be on the sub-total NOT including the tax.  Calculating a gratuity should not be done on the taxed amount.", "rating": 3, "date": "1/22/2019"}, {"text": "ordered on door dash and didn&amp;#39;t get what i ordered.  took way longer than anticipated.  don&amp;#39;t order cheesecake factory on doordash - the short hills cheesecake factory doesn&amp;#39;t seem to be able to handle the incremental volume.", "rating": 1, "date": "1/26/2020"}, {"text": "I liked their omlette and also the cheese pizza. The guacamole salad was delicious. The ambience is really nice.", "rating": 5, "date": "1/3/2019"}, {"text": "The worst service. Waited 10 minutes to take our order. Waited 10 minutes for my salad dressing which I had to get up and ask for for a second time. Drink refills after we we&amp;#39;re done with our meals. I won&amp;#39;t be returning.", "rating": 2, "date": "6/20/2019"}, {"text": "My husband called to order me a bday cake night of 12/14/17 bc i told him i wanted an oreo cheesecake, he called and asked for a small oreo cheesecake, the lady said that, that isn&amp;#39;t an option and they only have a big one (which is a lie, bc i got my husband a small one for his bday) so my husband said okay to the big one bc my bday is the next day. And today we finally opened the box so i could blow my candle, but this is what we see in the box a cheesecake surrounded with paper, and does not even look like a bday cake. It looks like we are going to sell cheesecake. What a disappointment on my bday. We called trying to ask maybe they could give us the one that doesn&amp;#39;t have all this paper but they said no. And they even said that the one we got was a corporate cake. Why did we end up with a corporate cake. LMAO. Too funny. <br&gt;The lady lastnight was definitely a liar and lazy. Smh.<br&gt;Also the manager was no help. He didn&amp;#39;t want to help my husband with his concern. definitely not going to buy cakes for next special occasion in this location, we might get a corporate one again  <br&gt;the one in menlo park mall is better.", "rating": 1, "date": "12/15/2017"}, {"text": "Yummm had the turkey burger and a side salad, it was gluten free and so flavorful.  My dish along with my friend&amp;#39;s enormous mexi-salad was only $34.00.  Lots of food for a reasonable price.  Cheesecake Factory is always consistent &amp;amp; I love their huge selection on the menus.", "rating": 4, "date": "7/27/2018"}, {"text": "what an experience! August 8th we decided to have dinner here....<br&gt;I have been going to cheesecake factory for years (coconut grove fla. up to Niagara falls locations) and this has to be one of the worst experiences I have had.  The service was horrible! <br&gt;we ordered appetizers (Thais lettuce wraps) and they never came.  the server never took any accountability and instead blamed the cook...so much for team work....he was barely apologetic and breezed off aloof somewhere else.  Usually cheesecake factory is excellent with service recovery....not this day....never saw a manager....<br&gt;we were so turned off that we decided to leave without dessert.  we asked for the bill and it was lobbed on the table without a folder.  the waiter took forever to return so we decided to get up and try to pay at the cheesecake counter.  unfortunately the fellow there said he couldn&amp;#39;t accept it....this is when we saw the waiter looking for us and handed him the payment. just a horrible experience period...", "rating": 1, "date": "8/10/2018"}, {"text": "Take out service has diminished terribly since my last visit to this location. <br&gt;The staff totally ignores you until it is time to take your payment. <br&gt;Everyone seems to busy with their own life to acknowledge a takeout customer.", "rating": 1, "date": "5/5/2015"}, {"text": "I love going to the Cheesecake Factory after work for a drink or for lunch. They have a huge menu with options for everyone. I really like their skinnylicious menu because it&amp;#39;s healthier and has smaller portions. My all time favorite bartender is Christine, she is the best! They don&amp;#39;t take reservations so, that can be annoying with a large group. It gets very crowded during dinner time especially Thursday- Sunday. Their portions from the regular menu are huge so, you can definitely share. Same with their Cheesecake slices. There&amp;#39;s parking right outside Cheesecake and in other parts of the mall.", "rating": 4, "date": "7/11/2017"}, {"text": "mehhhh.....<br&gt;1. Wait waaaa-a-aaaay too long. [can&amp;#39;t possibly see why anyone would ever come back here]<br&gt;2. Appetizers seemed to be of the store-bought frozen variety type.<br&gt;3. Asked for crispy fries, they came out limp, desperately requiring a dose of Sildenafil Citrate and more heat.<br&gt;4. Brown Rice EXTREMELY undercooked<br&gt;Our waiter was attentive and sincerely apologetic - - I blame 100% of the negativity of this review on the Kitchen Staff, Cooks &amp;amp; Head Chef. I don&amp;#39;t expect them to EVER change ANYTHING about this place as long as they&amp;#39;re extended 50+ minute lines waiting to get inside of what used to be a good establishment. I don&amp;#39;t get it!", "rating": 2, "date": "3/17/2018"}, {"text": "I used to enjoy going to the Cheesecake Factory and would often wait the ridiculously long times to get a table after shopping.  However, the food and service quality levels have plummeted over recent years.  It&amp;#39;s like the staff knows that there are limited restaurant choices and they just don&amp;#39;t give a damn.<br&gt;<br&gt;I got the lunch portion of the pasta carbonara and my companion got the salmon lunch special.   We asked repeatedly for knives through the meal ... finally got one at the end, yay!  I had to ask 3x for parmesan cheese and when I attempted to flag down a server .... any server, I got major eye avoidance.  Apparently, teamwork is not a principle here ... every waiter is out for himself.<br&gt;<br&gt;Food was mediocre and quite frankly, not worth the aggravation.  Carbonara sauce was too watery for my taste.  <br&gt;<br&gt;The only time I got any sort of decent service is when I asked for the check.  Surprise and totally cliche.  Wish my experience had been better.", "rating": 2, "date": "12/3/2014"}, {"text": "I really like the food here and they have alot of good choices but the wait is always long and I feel like they make you stand around and wait for a table to give the appearance of being alot more busy than they really are. Service and seating process need vast improvement but than again it is The Cheesecake Factory.", "rating": 3, "date": "3/18/2018"}, {"text": "Not the worst, but not the best... here&amp;#39;s why:<br&gt;<br&gt;Pro&amp;#39;s: as always, lots of choices of food and drink, the service is pretty quick (please note-we sat at the bar on a Saturday early evening for dinner), and it&amp;#39;s convenient.<br&gt;<br&gt;Con&amp;#39;s: because it&amp;#39;s attached to the mall, expect it to be packed, filled with kids/babies/families, and it was not only dark inside, but really dirty (floors had chunks of food and the counters were a mess).  <br&gt;<br&gt;Pretty much you get what you pay for here... just wish it was up kept a little more.", "rating": 3, "date": "4/18/2017"}, {"text": "&amp;#34;Why you gotta fight with me at cheesecake, you know I luh to go there!&amp;#34; - Drake. <br&gt;<br&gt;Yeah I had to haha. Anyway, the famous cheesecake factory is so damn good I don&amp;#39;t know why I haven&amp;#39;t tried it sooner. It&amp;#39;s pretty straight forward All-American chain restaurant with huge portions and delicious food omg. I had a bacon burger with a simple salad and iced tea. It was sooooo packed like geez, we waited 30 minutes which isn&amp;#39;t too long but it is seems like forever when you&amp;#39;re hungry as hell. My aunts and I were seated promptly, the waitress was bubbly and the food was 100% on point. For starters we had fried calamari (AHHHHH sea alien) and warm complimentary bread with butter on the side. Afterward, I had a godiva cheesecake which I didn&amp;#39;t really like that much because I prefer plain cheesecake but I decided to be adventurous. Ugh, everything was so tasty. I finally understand why this restaurant is so popular.", "rating": 5, "date": "4/10/2017"}, {"text": "I feel like the food has gone downhill, and mind you I&amp;#39;ve been coming here since this location has opened. The food just always leaves something to be desired and also is very bland. I&amp;#39;m not sure what the real problem is but I guess you can blame the managers and the owners for poor food quality. Tonight I ordered something as simple as a Greek salad and the dynamite shrimp and I gotta tell you I was not pleased. I ordered online and these people couldnt follow simple directions. The saving grace is obviously just the cheesecakes because they clearly dont make them there.", "rating": 2, "date": "9/21/2018"}, {"text": "Food is consistently good but service has dropped WAY off. Service use to always be awesome. Now the attitudes of the servers are &amp;#34;Meh&amp;#34;. A big no-no in the restaurant biz is the customer having to wait and wait for an initial greeting from the server , even if it&amp;#39;s a &amp;#34;Hi ! I be right over to get your drink order&amp;#34;. At Cheesecake it is now wait wait wait. Drink service is slow with our 3 beverages coming at 3 different times. God forbid you need a refill/ second round. Wait time for apps and entrees is fine but oddly enough , desserts can take longer to come out than the entree ! I mean - how long does it take to slice a piece of cheesecake ??? <br&gt;<br&gt;I don&amp;#39;t know if this is a chain wide problem or just at Short Hills but it is very noticeable the last 4-5 times we visited. I keep going back  for the food but it can be an ordeal.", "rating": 3, "date": "11/9/2016"}, {"text": "Our son works at the Mall at Short Hills and I was looking forward to Mother&amp;#39;s Day brunch before he had to go into work.  My husband ordered his favorite, Eggs Benedict and asked our server Alex for the eggs to be soft and runny as it should be.  When the runner brought it out, the eggs were hard cooked.  The runner brought it back and within seconds, new eggs were put on top. They too were hard cooked.  We asked for a separate poached egg and and egg came back loaded it with hollandaise sauce.  It was disgusting. We asked for the manager who took the dishes back and offered my husband another meal.  I insisted that he eat something and he asked for 2 scrambled eggs.  We got to the restaurant at 10 am.  We were promptly seated and then the kitchen messed up a simple dish.  3x!  If the eggs cannot be served runny than please tell the servers to ask the guest to pick another dish.  My Mother&amp;#39;s Day meal was ruined as I watched my husband get disappointed and upset each time. My son&amp;#39;s omelette was perfect.  It would&amp;#39;ve been a better choice had we known of the kitchen&amp;#39;s limitations.  <br&gt;<br&gt;Re: Cheesecake Factory&amp;#39;s response: please reread my original post. I DID speak to a manager while we were still there.", "rating": 1, "date": "5/27/2019"}, {"text": "Nothing ruins your dinner more than bad service.  Unfortunately that was our experience tonight.  The wait was a reasonable 15min to be seated.  We patiently waited for appetizers when out came my son&amp;#39;s burger.  The waiter had forgotten to put in the order for the appetizer.  Never mind.  5 mins. Later 2 more dinners came out.  Several more minutes later my dinner finally came.    Took a while for waiter to come asking if we wanted dessert.  Disappointing experience.", "rating": 1, "date": "5/19/2019"}, {"text": "Terrible service. The waitress wouldn&amp;#39;t even be bothered to come back with the bread we asked for or to refill our water glasses. Never again", "rating": 1, "date": "4/19/2018"}, {"text": "If this app would take 0 stars I would have done that. I&amp;#39;m still recovering from food poisoning from last night. This place is awful in every way. Service was terrible, food made me soooooo sick. Prices are exorbitant. Heed my advice and Stay Away!!", "rating": 1, "date": "4/16/2018"}, {"text": "What started out as a nice family outing with my boyfriends family went bad really quickly!! We met the family at the restaurant from shopping in the mall. When we sat the rest of them had already gotten drinks. It&amp;#39;s started with our waiter not asking for our drink options. I asked for a glass of wine. Then he left for about ten minutes and came back with water. I asked about my wine. 5 minutes later he came back but no wine. We said can we order &amp;#34;please let us&amp;#34;. We all ordered and he finally brought my wine after. <br&gt;<br&gt;Two people had to leave so it was 4 remaining. Another 30 minutes came and our entrees still had not come out. But we ate more and more bread. Finally, the food started to come. 2 plates, 4 minutes later another plate, finally 5 minutes later the last plates came and we asked one to be wrapped for the person who had to leave. It was time to eat. Well I got garlic pasta with shrimp. this was supposed to have asparagus, but no asparagus. So then I asked for asparagus from another waiter. <br&gt;<br&gt;Then our actual waiter actually came back. I felt the pasta and it was cold, not a little warm , fully cold, so he took the pasta back. Then the missing asparagus came. I thought ok I can eat that. It was cold, refrigerator cold, and I was like I&amp;#39;m done. I grabbed the waiter and said to just cancel. It was enough incompetence for a night. When I asked the waiter to feel the asparagus he was embarrassed. He then walked away after I told him to cancel. He came back 10 minutes later and asked if the manager had come yet. She did not. Her name is Susan Luca. She did not come. Then the waiter asked if we wanted anything. I said yes, just get me wine. 10 minutes later it came. <br&gt;<br&gt;Now if you are already mad, that sucks. The waiter came back again, We said we want menus to see about possible deserts, he left to get them. 10 minutes passed, and in that time I got a menu from the waiter station in front of our table. Then more time passed so we asked another waitress to get the manager.  She said ok and came right back and said Susan was with another table. So we asked her to get our check. Once we got it, guess what was still on it? My cold food I sent back and the glass of wine I wanted in its place. Now maybe not the wine, but as pissed as we were, take off the item we sent back. Nothing was offered to make up for it. So we waited longer. <br&gt;<br&gt;The waiter came back ten minutes later with menus. We said we were done and why did it take him so long to get menus. We said forget desert we need the manager to take off the meal. He said under his breath, &amp;#34;she didn&amp;#39;t remove it yet&amp;#34;. I actually felt bad for this kid.  It was possibly the worst service &amp;amp; management I have seen. We asked asked for the manager Susan who never came before to come. <br&gt;<br&gt;Then finally after everyone was boiling and no manager and no real check, we did the math and took the dish off ourselves and left cash. As we were walking out, the manager Susan finally graced us with her incompetent presence. She&amp;#39;s the worst! Came over slowly, no hustle. At this point there was nothing to say. We already took the food off, we all wanted to leave and I was starving. I told her to take the check and we already took the dish off ourselves. That this place sucks and we will never return.<br&gt;<br&gt;She then turned to the waiter and said &amp;#34;some people don&amp;#39;t know how to talk to others&amp;#34;. Well you are right lady! After waiting over 40 minutes for you to come over and not eating, I don&amp;#39;t want to talk to you. After meeting this woman, I don&amp;#39;t blame the kitchen or the waiter I blame her. She runs the restaurant while managing and clearly doesn&amp;#39;t know what she is doing.<br&gt;<br&gt;I have managed, waited and bartended at many places and I have never seen a more incompetent lazy manager in my life. We will never be back to this establishment and we will tell everyone we know!", "rating": 1, "date": "7/2/2016"}, {"text": "I have never felt more rushed and not wanted in my life. From the moment I walk in I got the impression I was bothering the staff. The hostess was very unfriendly, the server was clearly having a bad day and the bus person gave me an attitude over 2 waters!!! I am in the business and was appalled at the way I was treated....i am spending my hard earned money on this place and they have the Nerve to be bothered by a customers presence???? I can only imagine what management must be like. Me nor anyone I know will ever eat at a Cheesecake Factory again I can promise you that.", "rating": 1, "date": "1/2/2018"}, {"text": "Let me preface this with the fact that I am a HUGE Cheesecake Factory fan, which is why our dining experience at this location today made me so sad. Overall, it felt like none of the people working there had any desire to be there which was reflected in the attitude towards customers and the overall vibe of the place. <br&gt;<br&gt;When we arrived we were seated fairly quickly, but it took over 10 minutes for us to get a high chair brought over to our table. Placing our order took at least 15-20 minutes after sitting down (we had to flag someone down multiple times), and the waitress then proceeded to come back and ask a ton of questions that we had already answered about our order. She also forgot our side. <br&gt;<br&gt;Food was good and fairly priced, but honestly the total lack of customer service made this such a distasteful experience that we are going to start trying some of the other eatery options at the Short Hills Mall.", "rating": 2, "date": "10/18/2016"}, {"text": "I got the Pasta Da Vinci, which is hands down my favorite dish. I recommended it to my friends and 4 of them ended up getting it as well.<br&gt;<br&gt;The pasta is penne with a wine sauce, chicken, and mushroom. It&amp;#39;s $16.95 and I always have enough to take home. Portions are huge! Definitely worth trying.<br&gt;<br&gt;We came here for my friends&amp;#39; birthdays and I told the waiter that it was their birthdays and he awkwardly said &amp;#34;ok&amp;#34; and didn&amp;#39;t say anything else. So I thought he weren&amp;#39;t going to do anything for my friends. After our meal, he didn&amp;#39;t offer to get the check after he asked if we wanted cheesecake, which we didn&amp;#39;t, and he and another waiter came out with small birthday sundaes in shot glasses for my two friends. Nice surprise for their birthdays. :)<br&gt;<br&gt;Yeah it&amp;#39;s noisy, but I&amp;#39;m fine with that. It&amp;#39;s a classy atmosphere in a nice mall with portions relative to the price (aka higher than normal). <br&gt;<br&gt;I didn&amp;#39;t get cheesecake this time but their cheesecakes are fabulous. Definitely recommend the tiramisu, pumpkin, and red velvet.", "rating": 5, "date": "12/13/2014"}, {"text": "Have recently discovered CF. Very pleasant staff, food choices are wide, my Cosmo was outstanding.<br&gt;I think the uniforms are not in keeping with the quality of the place, but who am to have an opinion?<br&gt;Have only had great experiences here.", "rating": 5, "date": "5/31/2014"}, {"text": "I always have a great experience at almost any Cheesecake Factory location! For breakfast, I love their waffles and for lunch/dinner I love the four cheese pasta! I have never witnessed a wait here longer than 5-10 minutes even on weekend breakfast days, or weekend evenings. Their service is very quick and the menu has a great variety, there&amp;#39;s some for everyone. It&amp;#39;s a lovely place and the mall itself is my favorite. Perfect for a bite after a long day of shopping!", "rating": 5, "date": "10/5/2017"}, {"text": "I went for happy hour and sat in the bar area. I got the chicken taquitos, sweet corn tamale cakes, factory nachos, and korean fried cauliflower. I enjoyed it all, the tamale cakes were sweet, chicken tosquitos were crispy, hot, and fresh with lots of flavor. The cauliflower looked and tasted like sweet sesame chicken. However, the service was lacking a little because the waiter took a long time to come to our table to take our order and refill the water. He was&amp;#39;nt a bad guy just the service was not what I&amp;#39;m used to when I normally eat here. That&amp;#39;s why I&amp;#39;m giving it 3 stars for the service.", "rating": 3, "date": "5/8/2018"}, {"text": "Just bought $900 worth of gift cards to score the 2 free slices For every $25 spent and now my tale of woe.  We bought these cards at the Christiana Mall in Delaware and we travel to NJ to visit family after Thanksgiving and usually about once a month. I have to say that the Short Hills location PALES next to the Christiana Mall In Delaware in both food and especially in service. We eat out too much and we have tried a ton of menu items and know what is good.<br&gt;<br&gt;The service in Short Hills is not very good, servers do not seem well trained and it is a bit chaotic for no reason. Every time I ask them not to over cook the Miso Salmon. It comes out rock hard and I choke it down so I don&amp;#39;t have to wait for another one. This is not a hard thing to do, Christiana Mall usually gets it right. Why have fresh salmon that comes out dry like canned tuna? It is just a few minutes less cook time, or an experienced line cook.<br&gt;<br&gt;The best Cheesecake Factory is in San Fran across from the St Francis hotel. The staff and the kitchen is top notch and cooks fish perfectly, so it CAN be done. Short Hills could do so much better with better training and staff!", "rating": 2, "date": "11/26/2016"}, {"text": "Oh my lordie, I&amp;#39;m reppin&amp;#39; chains hard lately. I went here yesterday with the future M.I.L before a bit of a shopping trip at Short Hills Mall. I haven&amp;#39;t been to a Cheesecake in like a decade, so it&amp;#39;s been a while.<br&gt;<br&gt;This one at Short Hills is BUSY! All the stay at home moms lunching with each other with some serious strollers clogging the passage ways. <br&gt;<br&gt;This Cheesecake is no different than the million others. Yet this one lacked any sort of personal charm through great service. The hostess was kind of rude, we weren&amp;#39;t offered any bread, which is fine, the waitress was alright, nothing special, pretty non existent. <br&gt;<br&gt;My skinnylicious Asian Chicken Salad was HUGE, filling and at $13 wasn&amp;#39;t too badly priced, but really didn&amp;#39;t taste like anything.<br&gt;<br&gt;If you&amp;#39;re at Short Hills Mall and don&amp;#39;t mind chaos and looking for a filling meal, Cheesecake is most definitely your spot.", "rating": 3, "date": "2/26/2014"}, {"text": "This probably has been an OK experience. The food was okay not the best. I ordered the fish and chips and it was mushy wasn&amp;#39;t even fresh. The pasta was kind of dry. Overall my waiter wasn&amp;#39;t the best I asked him for water for about 3-4 times and he forgot. I don&amp;#39;t recommend this cheesecake factory maybe the problem was that they&amp;#39;re busy, but overall it was bad.", "rating": 1, "date": "3/16/2019"}, {"text": "This has got to be my favorite Cheesecake Factory location! I&amp;#39;ve been to other locations, but this one is definitely the best. Even though it&amp;#39;s the same food, the chef makes it better at this location. I love their chicken piccata served with angel hair pasta. Their peach bellinis are AMAZING!! They taste like candy...just like peach sour rings. Their service is good too; the servers are always friendly. I&amp;#39;ve been here for my birthday a few times, and I have not been disappointed. Amazing food, and a great atmosphere. As you can tell, I would definitely recommend this location!", "rating": 5, "date": "4/22/2018"}, {"text": "This place doesn&amp;#39;t deserve ANY stars... what an aweful service. And the Mgr keeps a blind eye to the problems. I will make sure that none of my friends, business associates and clients will NEVER go there.<br&gt;Too much incompetence. it really Sucks.<br&gt;I was going to write what happened..but where do I start...  the service has been constantly bad... orders wrong or never placed.. wrong drinks.. even alcohol in a minors smoothy...  SUCKS BIG TIME", "rating": 1, "date": "11/5/2016"}, {"text": "Horrible. Save your time and money! Burger meat came out cold and the cheese wasn&amp;#39;t even melted. It looked like a frozen patty that wasn&amp;#39;t fully cooked. The pasta I ordered were all stuck together and not fully cooked either. The linguine came out in chunks and it was doughy. Even the free bread they give you in the beginning sucked. It was cold and no sourdough. Service was good but the food seriously could have been A LOT better. The Cheesecake Factory at Riverside Mall is so much better.", "rating": 1, "date": "2/2/2019"}, {"text": "This place is such a tragedy to be called part of the short hills mall. The staff is rude and uneducated about what the restaurant offers. They also only take reservations on a M-Th, which is fine, but I had to call and got placed on hold 4 different times because the staff isn&amp;#39;t properly trained. <br&gt;<br&gt;The fact that this is at short hills and they can&amp;#39;t find better people to manage the restaurant and their employees is unacceptable. I expect better from this area, even if it is a chain.", "rating": 1, "date": "3/1/2017"}, {"text": "Sadly, I had high hopes considering the wait-staff was very friendly and prompt from when I sat down.  The appetizer tuna tartare was maybe a 2.5/3-star. Definitely some tuna taste there but seemed to have a lot of bread crumbs, a total sucker punch.... <br&gt;<br&gt;The main entree is where everything really fell short. I ordered the Bang-Bang Chicken and Shrimp and ordered it extra spicy.... This is a thai curry dish.. that is supposed to be spicy to begin with. I received the dish and it did have the shrimp, chicken and rice on the plate.  The sauce was no where near what curry is.   This had the flavor or a dessert.... very sweet, I actually had to ask for hotsauce.  <br&gt;<br&gt;As I was eating, turns out the dish was made with cinnamon apples!  Yes you read that correctly, apples.... in a Thai curry dish.   This dish was not at all what it is cracked up to be in the description.  Whether the kitchen screwed up royally or if this is the standard.... its very misleading at the best or an utter failure at the worst. <br&gt;<br&gt;Will I come back here... probably not....", "rating": 1, "date": "6/2/2018"}, {"text": "Ordered through DoorDash and couldn&amp;#39;t be more pleased! The Southwest Chicken Sandwich was UNBELIEVABLE.  I ordered several things off the menu for a friend and I to share and everything was exactly as ordered.  Received my food in almost half the time that I anticipated.  I couldn&amp;#39;t say more about everything we received and my experience ordering online.  Definitely a new favorite of mine!!", "rating": 5, "date": "3/23/2019"}, {"text": "I knew it would eventually happen, but this chain is no longer the gold standard for mall restaurants.  The service is fair, the food is fair, and the menu even more complicated.  The server forgot spoons, didn&amp;#39;t refill sodas, etc.  A bit too casual - as if training has been overlooked.  As for the food, the quality just wasn&amp;#39;t there.  Corn dogs tasted long frozen, lettuce wraps were pre-made (as opposed to letting you make it yourself as before), etc.  Desert was still very good, but you&amp;#39;d expect that.  Overall, this chain and location have lost a bunch of steps, and I doubt they&amp;#39;ll reclaim them anytime soon.", "rating": 2, "date": "7/11/2016"}, {"text": "Perfect spot to grab a quick after shopping drink. I love to sit at the bar and order a blue cheese olive dirty martini. Went here last night after a long day of shopping and it really hit the spot. They have a &amp;#34;skinny menu&amp;#34; that makes it so easy to order healthy and guilt free. The service is always good here. And I love the warm bread they give you before your food comes out! I split the four cheese Pasta with shrimp with my friend and it was more than enough for 2. The best part was the giant pile of ricotta cheese on the middle! They also come around with fresh parmigiana cheese In case the 4 cheeses isn&amp;#39;t enough! I will definitely be back after my next shopping trip", "rating": 5, "date": "12/1/2015"}, {"text": "Just another standard Cheesecake Factory.  I prefer the one in Willowbrook Mall...it is much bigger, and the wait staff is more attentive.  Unfortunately the wait time for Willowbrook Mall is always much worse than this on at Short Hills Mall...", "rating": 3, "date": "3/13/2016"}, {"text": "Just an awful experience over the weekend.  Unfortunately, this wasn&amp;#39;t the first bad experience at this location.  <br&gt;<br&gt;The whole meal got off to a bad start when we ordered water for the four of us, and 10 minutes later, had to remind the server to bring them over.  10 minutes after that, we are wondering where are appetizer is and we were told by our server that it would come in 3 minutes.  Well, two of our four main courses came out in 5 minutes, along with our appetizer.  10 minutes later, we get the manager to come over to see what is going on and he says this is &amp;#34;simply unacceptable.&amp;#34;  Your telling me! Soon the two other entrees arrive.  <br&gt;<br&gt;My wife orders some shrimp and rice dish, and the rice is cold and hard, and the shrimp is scalding hot.  Can&amp;#39;t you just stick the whole dish in the microwave? <br&gt;<br&gt;All they did for us was take the appetizer off the bill.  <br&gt;<br&gt;I miss Joe&amp;#39;s American Grill already.  Hopefully Short Hills Mall can find a decent replacement for them because this Cheesecake Factory is a huge disappointment.  <br&gt;<br&gt;Oh - and they no longer serve the crispy crab wontons.  As if there&amp;#39;s any other reason never to visit this restaurant again...", "rating": 1, "date": "4/23/2018"}, {"text": "This is the all too well know chain. I&amp;#39;m sure everyone has been to one at some point. The calorific menu is a gut buster if you don&amp;#39;t watch it. Food quality is good for what it is. Plenty of items on the menu from salads to hamburgers. Their Cheesecakes are good but in moderation. I think the lettuce cups are one of the best options on the menu. Still plenty of food but you won&amp;#39;t walk out feeling disgusted and maybe even able to share a slice of cheesecake.", "rating": 3, "date": "11/27/2017"}, {"text": "Good food but way too long of a wait. Came in and waited over an hour for a table for 4. Probably on the smaller side compared to other cheesecake factories but still a large restaurant. By the way, I&amp;#39;ve never seen so many strollers by the exit. Is that a fire-hazard?", "rating": 3, "date": "10/3/2015"}, {"text": "Maybe this experience was out of the ordinary but it was a strange enough experience that I have to yelp it.<br&gt; <br&gt; First off the table looked like it was in the middle of being cleaned. Missing napkins and utensils. Our hostess kicks a crooked chair back into place and seats us. We had to pull stuff off of another table. Also the napkins shed like crazy.<br&gt;<br&gt; Next was food. Veggie burger was sold out and our waiter let us know a little far into my boyfriends dish being made so he was going to get his food first. Not a complaint about the waiter he was fine. I tried to order another item and it was sold out too.. annoying? But I ordered something finally it was available. My boyfriend ordered a burger and added bacon and got no bacon no problem he didn&amp;#39;t even charge for it so he must&amp;#39;ve forgot all together.<br&gt;<br&gt;Overall the food is always pretty good! It&amp;#39;s consistent within the chain. My Mac and cheese balls could have been warmer and were cold in the middle.<br&gt;<br&gt;The strangest part of our experience was the two tables next to us were celebrating birthdays. There is a women who works at the short hills location who SINGS her heart out.. Talented yes, but necessary no.<br&gt;We were sitting next to a POS unfortunately and we heard her co workers making fun of her and saying how it&amp;#39;s &amp;#34;not American idol&amp;#34;. And the teams personal conversations became our main entertainment for our dinner. It was very odd and distracting. Apparently she must do that often.<br&gt;<br&gt;Once the place started clearing out it was us and a table of teenagers left in the back to fend for ourselves. Wait staff m.i.a. The teenagers were throwing ice cubes at the tables next to us for whatever reason. <br&gt;<br&gt;I felt like I was on another planet. It was not a normal Cheesecake Factory experience that I&amp;#39;m used to.", "rating": 4, "date": "4/3/2018"}, {"text": "This restaurant is amazing the service is very good and friendly and they are there for your every need. The food is cooked to perfection and is reasonably priced. The cheesecake selection is very big and the cheesecake itself is amazing. All throughout the menu it is filled with flavorful cheesecakes and main courses. I overall recommended to everyone. Great atmosphere.", "rating": 5, "date": "3/3/2019"}, {"text": "Came here on a Thursday night with two friends. We were told by the person at the front that the wait was 15 min they gave us a buzzer for when to come back to the front to be seated. We sat at the bar and ordered drinks in the meantime. About 25 min go by, our buzzer did not go off. Our friend walked to the front and the person said &amp;#34;we called your name and you didn&amp;#39;t show up&amp;#34; then what is the point in having a buzzer if you are going to shout people&amp;#39;s names? Finally we get seated after 40 min. Our waitress was fake friendly and you could tell she hates her job. We ordered 3 dishes. Only ended up with two. We didn&amp;#39;t bother to mention it to the server because she completely forgot. The food was bland and not to mention the floor is extremely slippery almost as if they poured cooking grease all over the floor. surprised they haven&amp;#39;t had a lawsuit yet. Will never be returning here.", "rating": 1, "date": "8/4/2017"}, {"text": "I believe my servers name was Josh.<br&gt;<br&gt;He was very attentive, the food was the same at every other cheesecake factory I&amp;#39;ve been to... GOOD.<br&gt;<br&gt;I had a signature extra dirty martini, and it was made to perfection.<br&gt;<br&gt;I would definitely return to this location for food and drinks without hesitation.<br&gt;<br&gt;I likes the parking arrangements as well. Very close, and with the weather being somewhat chilly, it was a plus for me.<br&gt;<br&gt;we were seated right away on a Monday night.", "rating": 4, "date": "11/14/2015"}, {"text": "Do you know why I ADORE the Cheesecake Factory? Because they have the biggest portions Iv ever seen in a chain restaurant and it is honestly life changing....(*_*)<br&gt;<br&gt;My absolute favorite is there cheesecake cake of course... The strawberry cheesecake is very good....plane cheesecake topped with fresh strawberries! Sweetest strawberries ever! <br&gt;<br&gt;My suggestion is for you to order one piece to share there... then get another flavor to take home..... The cheesecake will last for several days in the fridge....and (if you can control yourself!) you take just a few bites every night.....Just right! <br&gt;<br&gt;As for food....the chicken madeira is pretty good... as well as the avocado spring rolls! Delish! <br&gt;<br&gt;The menu is HUGE.... so I would suggest going to their website in advance and taking a look....It takes forever to decide on what to eat! <br&gt;<br&gt;I would of gave this place four stars but due to the fact this location is smaller then the other cheesecake factor Iv been to by Menlo Park Drive...it felt somewhat cramped here....The seating are defiantly tighter! the wait to be seated is regardless...especially on the weekends...<br&gt;<br&gt;Oh.... one more thing! The table bread (the darker one) that they bring you is soft...only the brown ones though!! just Don&amp;#39;t eat too much bread! enjoy and have a lovely meal! ;D!", "rating": 3, "date": "10/1/2015"}, {"text": "Came here for a late lunch and got seated right away. Ordered  the meat loaf and fish and chips. Finished off with a strawberry cheesecake for dessert. Can&amp;#39;t go wrong with the cheesecakes here!<br&gt;<br&gt;The meat loaf was pretty tasty, but I can make a much better one. I really liked the mushroom gravy that they topped the mashed potatoes with. The fish was damn good and crispy. <br&gt;<br&gt;Also had the chicken sandwich recently, which was really crispy, delicious, and filling. At $12, it&amp;#39;s a relatively good deal, and will probably be my go to lunch item whenever I come here from now on. <br&gt;<br&gt;The waitress forgot to bring out my beer, and some of the silverware and napkins were a bit grimy. Had to knock this place down a star.", "rating": 4, "date": "11/10/2013"}, {"text": "Omg..chaos reigned supreme....I have never seen a restaurant run like this. We went for brunch on sunday..not too crowded. We had to wait about 15 minutes..our beeper went off signaling that a table was ready, we went to the host and handed him the gizmo and stood there for another 15 minutes..until we said something and reminded him that we were waiting. We were taken to our table, supplied with menus and waited and waited and waited...the table/booth was set for 6.we were 4, the other two settings were never removed. we ordered and waited and waited and waited...after 1/2 hour, the server brought two of the four orders, and we waited and waited and waited...she brought coffee with no milk or sweetener.....so after getting a hold of another server, she brought a couple of packs of sugar and a tiny amount of milk in a plastic cup...not enough to change the color of the terrible tasting coffee..we had to flag her down for more.and by then the coffee was cold..after 15 minutes, our breakfasts were delivered....!.one of my friends asked fo r a refill of water ..so the server refilled his water and despite the left without asking or filling the other glasses that were obviously empty...when my buddy politely said that the coffee was terrible...the server told him, not in a nasty way, yeah it is bad, if i got you another cup it would be just as bad...this is not starbucks......yikes......waste of money waste of time disgusting in every way.......very poorly managed, staff not well trained or not trained at all...very unpleasant not worth subjecting ourselves to this kind of service...message to Cheesecake Factory Management...you really need to get your corporate quality assurance people down to this place...I have never written this in any restaurant review but you&amp;#39;ve got a serious problem at the Short Hills Cheesecake Factory...corroborated by many of the other reviews that basically say the same thing.", "rating": 1, "date": "12/3/2018"}, {"text": "Average service but speedy. Very friendly staff but food did not come out hot. Great portions and so many choices. I sat at the bar so there was no specific interaction with a server.", "rating": 3, "date": "2/16/2019"}, {"text": "Unfortunately not worth the wait!  We were in that restaurant for almost three hours.  I understand it was a busy night, maybe have more staff in hand.  Our server was barely attentive  to our table.  I was so frustrated, I would not even let my kids get the cheesecake.  Waited a long time to try and order it so just gave up.  Our food did not even come out together.  My daughter was the last to be served a side salad!  Her salad came about ten minutes after the rest of us had our meal and that salad was her meal.<br&gt;I should of known after calling and the the phone ringing forever that going there was not going to be a good idea.  Never again.", "rating": 1, "date": "2/24/2018"}, {"text": "Service was AWFUL!  We waited over 20 minutes to even be acknowledged by our server.  Finally, a lovely young lady, Chianti, noticed us sitting there and took our drink order.  We asked if she could be our server but the manager refused.  You can get better service at a Burger King drive through!  Our daughter fell on oil on her way to the ladies room.  We flew up from Florida to surprise our grandchildren for our grandson&amp;#39;s birthday and it turned out to be a disaster.  We wrote corporate three times and they didn&amp;#39;t even have the decency to respond.  Even though we WERE regulars we will NEVER return to this awful location again.  As a result of corporates unprofessionalism, we won&amp;#39;t be going to any location.  Our only advice is run don&amp;#39;t walk away from this restaurant!", "rating": 1, "date": "10/14/2015"}, {"text": "Extremely slow service, waitress never came to ask how food was (if she did she would have noticed we needed refills. We had to ask another waitress for more drinks. The floors were so greasy, I slipped going into the bathroom where I was met by disgusting conditions and no hand soap...how can employees wash their hands without soap!? Never returning to this Cheesecake Factory.", "rating": 1, "date": "7/16/2017"}, {"text": "UPDATE: As you can see from the comments posted by The Cheesecake Factory, they are trying to pin this experience on DoorDash, when clearly as stated by me, the issue was with the food prepared at The Cheesecake Factory. There is no need for me to contact DoorDash as they delivered the food item just fine. There is no way DoorDash can check the quality of food The Cheesecake Factory hands over to them.<br&gt;------------------------------------------------<br&gt;Earlier Review: Ordered a salad and avocado egg roll from here which was delivered through DoorDash. No issues on the salad which was enjoyed by my vegetarian friend. However, the avocado egg roll, though delicious had a small piece of stone in it. Ofcourse there was no way I could have known until I had put that piece of egg roll in my mouth. Still trying to scratch my head around how it might have got inside the roll and also raises questions about the Cheesecake Factory&amp;#39;s food quality control.<br&gt;Order the avocado egg roll will caution, never know what secret surprise you might find in it.", "rating": 2, "date": "12/10/2017"}, {"text": "Nostalgia... why do you deceive me so?<br&gt;<br&gt;Cheesecake factory was my go-to place in college back in LA.  We even went there for my farewell party before I left for the East coast, so fond memories were always associated with the place.  So you can imagine my excitement when this place opened, despite the fact that my fond memories were years ago, and I&amp;#39;ve learned a lot more about what food should &amp;#34;really&amp;#34; taste like.<br&gt;<br&gt;So coming back to CF, yes the food is generic and formulaic.  Which is okay if you&amp;#39;re here because you&amp;#39;ve been loyal to the place even at your taste bud&amp;#39;s protest.  <br&gt;<br&gt;But this time... when you sit and wait for 20 minutes, no one to take your order, not even a glass of water, then try to hail down a waiter for another 5 min, you begin to question your choice of restaurants, your judgement in food, and whether basil belongs in a good cocktail.  And no one, should EVER have to question the deliciousness of basil.<br&gt;<br&gt;I think I&amp;#39;ll still visit my old joints in LA, but I won&amp;#39;t be back to this one.<br&gt;<br&gt;Sidenote: If you do visit and need to buy a whole cheesecake, note that they come from the freezer. And takes 2-3 hrs to defrost.  No joke, you can save some money buying at Costco.", "rating": 1, "date": "7/10/2013"}, {"text": "At the time of this review, this restaurant has an average of 3 stars from 121 reviewers. In my opinion, that is way too low. I was shocked that it isn&amp;#39;t averaging 4.5-5 stars. It&amp;#39;s got everything. Great atmosphere and lighting. Great food. Huge menu with lots of options. Portion sizes are huge - enough for two meals in some cases if you don&amp;#39;t mind leftovers. Fast service. Decent prices. I literally can&amp;#39;t think of anything to complain about. <br&gt;<br&gt;We had the made-to-order guacamole. Which was a surprisingly large portion for just $11. Fish and chips, Shepard&amp;#39;s pie and my favorite, Cobb salad. They were all excellent.<br&gt;<br&gt;Every Cheesecake Factory I have been to has been the same positive experience. These guys know what they&amp;#39;re doing.", "rating": 5, "date": "11/22/2015"}, {"text": "Today was almost the worst Cheesecake Factory experience I ever had. First we had to wait 20 minutes just to get bread and water, then another 40 minutes or more to get our food. After complaining to the manager about the slow service he compensated us with a free slice of cheesecake. I would have rather had my meal on time. FYI they do not have free Wi-Fi that only made the wait worse. I will not be returning to this location. Not to be totally negative the food was okay once it finally arrived", "rating": 2, "date": "10/21/2017"}, {"text": "Let me start by saying, my husband and I love Cheesecake Factory. We dine at this franchise often. Sorry bank account! But this was our first time dining at the Short Hills location and it was VERY disappointing and frustrating. At several points, we wanted to get up and leave and I wish we did. It was a weeknight around 8PM so needless to say, it was not crowded at all. When we first arrived, we were completely ignored by the greeters who were busy having their own conversations behind the counter to notice anyone around them. It was awkward waiting around for a chance to interrupt or be acknowledged. Sorry for the inconvenience! Luckily, the manager was nearby, saw what was happening and stepped in. Thanks! After we were seated, the service from staff just got worse. We waited 15-20 minutes for our waitress to introduce herself. 15-20 minutes!?!? We were left wondering if anyone even knew we had just been seated or if there was even someone assigned to our table. Even once our waitress made her grand debut, we had to wait yet again for her to bring out water and bread. How long does it take to get water and bread on a table?! There was just a lack of attentiveness at this location that I have never experienced before. Staff did not know or maybe did not care who was waiting for what. This theme continued up until we got our check but at that point we were just thrilled to be leaving. All in all, the service we got was terribly slow and seemed like the customers were more of an inconvenience than anything. I would not dine at this location again.", "rating": 1, "date": "6/28/2018"}, {"text": "Vanessa is great! Great customer service!!! Every time<br&gt;I go in everyone is nice and welcoming and I get taken care of right away. Really representing their brand.", "rating": 4, "date": "1/10/2017"}, {"text": "I&amp;#39;ve had the Worse experiences while trying to place an order and picking up a to go order. The service is awful! Your left on hold for an Extremely Long time- Only to be put Back on hold!! Their employees have no concern for return customers not do they care about new customers!They seem to care very little about happy customers altogether!!<br&gt;Each time I ordered I was told the order would be ready in 35 minutes- instead it took 1 1/2 hours and asking for a refund to actually get my order!<br&gt;I used to love to eat here and enjoy several items on their menu- But sad to say I will Never eat here again.", "rating": 1, "date": "1/6/2018"}, {"text": "First, I admit it is not exactly fair to review a restaurant in its first week.  But this IS Cheesecake Factory, so you know that even a new one is pretty likely to adhere to the corporate formula.  This is (so far) a welcome addition to the Short Hills Mall, having replaced a Johnny Rockets and some other stores I never shopped at.  It is pretty in that CCF faux-finish way.  <br&gt;<br&gt;It was not yet chaotic the Sunday I ate there in its first week, and the food was actually quite tasty, and arrived  in a well-paced, unhurried way.  Our table started with white bean hummus, sliders and (gasp) fried mac-and-cheese balls.  All were quite tasty, especially the latter, which, while utterly delicious, is loathsome from a health perspective.<br&gt;<br&gt;We had a variety of salads and pastas.  All were good.  We were all stuffed, so no dessert,  and I am not a big fan of their cheesecake in any event.<br&gt;<br&gt;I have a feeling that in the coming weeks this place will be mobbed once word of its opening gets out, so I have no illusions that I will have the patience anytime soon to wait for a table there again.  But I am glad I got to try it early on.", "rating": 3, "date": "7/24/2011"}, {"text": "Let me just say that I&amp;#39;m often coined a &amp;#34;Ball-Buster&amp;#34; by my wife because of my &amp;#34;no-bull****&amp;#34; approach to customer service and satisfaction guaranteed policy.<br&gt;<br&gt;As a consumer, I do not tolerate mediocre service and disrespect from ANY establishment and whenever I&amp;#39;m displeased, there should be some type of resolve that benefits both parties involved.<br&gt;<br&gt;My wife and I dined here last evening. Our food was amazingly good however, I was displeased with the drinks ordered.<br&gt;<br&gt;First, I ordered a Mojito. It was completely watered down with no hint of alcohol whatsoever. So when our waiter came, I asked him to take it back and I&amp;#39;ll have a Cosmopolitan instead. Well, the Cosmo arrived and tasted just as crappy as the last disappointment. So, again, I told him that this wasn&amp;#39;t acceptable and could he just bring red wine instead. <br&gt;<br&gt;This dude decides to bring the manager on call instead. She politely came over to tell me that they&amp;#39;re not taking the second drink off the tab. I replied: &amp;#34;Well...I&amp;#39;m dissatisfied with your drink service. I ordered red wine as the absolute last resort and I doubt I&amp;#39;ll send it back - as it is wine. I mean, you can&amp;#39;t really screw up wine.&amp;#34; Annoyed, she takes my drink from the table and never says another word. <br&gt;<br&gt;Ok. Fine. No drinks. <br&gt;<br&gt;We&amp;#39;re ready for the check now. It arrives with the Cosmo on it. I gave the check back and had it removed (it took a while to come back to the table. I guess she was pissed and had to contemplate it for a while).<br&gt;<br&gt;Whatever.<br&gt;<br&gt;The bill came back correct. We paid and left.<br&gt;<br&gt;If you ever visit the cheesecake factory, get plain alcohol with NO ice or just play it safe with wine. You can&amp;#39;t go wrong with it.", "rating": 3, "date": "8/15/2015"}, {"text": "Just came here and after waiting 40 mins in the middle of the day waiting for a table had the absolute worst service. Ordered drinks, waitress got them wrong, came back, took our order and then went MIA. Had to hunt her down to ask about our meal after an hour of waiting for a salad and a burger at 2:30p in afternoon. Table next to us had same issue. When we finally saw her again and asked why the food was delayed so long and never got a refill on any drinks/bread, she just said she would get the manager very apathetically. The manager proceeded to tell me that I should have come and got her bc she&amp;#39;s always around and then next time she can do something about it if I tell her sooner- somehow this was our fault for the poor service. Also did I mention we had our 8 month old with us? 8 month old. So yes, my focus should have totally been on getting the staff to do their job. The manager came back with our check and a piece of cheesecake. Not impressed with the service or the managers response to the clear issue with the staff.", "rating": 1, "date": "12/28/2018"}, {"text": "Been to this location over 2 or 3 dozen times in the past 7 or 8 years. Had a horrible experience on a Monday night.  Not too busy but once seated it was downhill from there.  Our waitress made us feel very rushed, inattentive and basically avoided eye contact every time she spoke with us. 10 minutes after my wife&amp;#39;s meal arrived we were still waiting for a knife. Totally ignored by the waitress who I guess forgot we asked for it.  While eating my order of Imperial Chicken and Shrimp I was totally grossed out.  <br&gt;<br&gt;I found a hair in the sauce. As gross as it sounds, I think i ate part of the hair as I had been slicing my food in the same area I found the hair within the sauce. We notified the waitress who said I&amp;#39;m sorry about that.  She took the plate away.  A few minutes later came back by the table and asked if I wanted another plate made.  Promptly the assistant manager stopped by the table.  She advised me she checked the kitchen and ensured that all employees were wearing the appropriate head coverings.  That response did nothing but make me feel as though I was responsible for the hair in the plate.  <br&gt;<br&gt;FYI: I am bald lol - so yea ok.<br&gt;After this, the waitress continued to be dismissive and uninterested in treating us like we were her customers. She never asked if we wanted to see the dessert menu (Isn&amp;#39;t this the Cheesecake Factory?). Dropped off the check and blurted out, &amp;#34;We took both orders off of the bill&amp;#34;. In a snarky tone once again displaying dismissive body language, not making eye contact and walking away briskly before I could say anything. I Still left a nice tip, because I like to give the benefit of the doubt.  Maybe she was having a bad day.<br&gt;Don&amp;#39;t know if I can go back to this location any time soon. I was sick to my stomach the rest of the night.", "rating": 1, "date": "7/28/2015"}, {"text": "This is the worst Cheesecake factory ( Short Hills) in NJ. The General Manager is the worst his name is Ralph Strivelli if your white you might have a chance. He Has a nasty attitude and is very unprofessional. He has no customer service skills. Nadine, which works at the front desk thinks she owns the place. Horrible service horrible management. I think they should be closed down.", "rating": 1, "date": "12/15/2018"}, {"text": "It&amp;#39;s the Cheesecake Factory.  Let me start off at the end.  The desserts are fantastic.  We all think the slice of cheesecake is smaller than we used to get.  But, the taste is great.  Linda&amp;#39;s cake is also great.<br&gt;<br&gt;The food.  The food is good.  it is not bad and certainly isn&amp;#39;t the best.  I try to stick with chicken marsala, jambalaya and a few other basics.  The bread is always hot and fresh.  The unlimited refills of great lemonades. <br&gt;<br&gt;The price point is perfect.<br&gt;<br&gt;Now for the rocky part.  The service is hit or miss.  The wait is unbearable.  <br&gt;<br&gt;Excellent to go with the kids.  Do not think about going here with a large group.  They really do not have a fair amount of large tables.", "rating": 4, "date": "1/6/2016"}, {"text": "Waiting for our waitress and never came by and we ask one of the waiter here she&amp;#39;s said I&amp;#39;m not your waiter in A nasty rude way !!!!!At least say On hold I&amp;#39;ll get her for you but no!!! Waiting almost 15min", "rating": 1, "date": "9/2/2018"}, {"text": "I have been a fan of Cheesecake Factory and have eaten here several times at the Short Hills Mall.  Last night i finished my dinner and then saw a cockroach behind my friends head, walking on the edge of he booth, she then told me she saw one walking behind my head on the booth! The manager obviously compt our food, but we had to pay for our wine? It turned my stomach.", "rating": 1, "date": "12/7/2018"}, {"text": "Food is good but service is slow and the dishes were dirty.   It is very loud also so not a very enjoyable lunch experience.  One of our lunch entrees came long after the other two and was clod.", "rating": 2, "date": "10/8/2018"}, {"text": "This was my first time in any Cheesecake factory, and I&amp;#39;m not planning on returning.<br&gt;<br&gt;Like everyone else says, the service is slow and it sucks. Walked in from cold outside, and first thing asked for coffee, it took no less than 15 minutes until I got it. Half way through waiting the waitress came to the table, saying she had to make fresh coffee. The place was mostly empty, a lot of staff was just standing around - nevertheless, inattentive, showing up sporadically. Asking if we want to see dessert menu in a tone like expecting that we&amp;#39;ll say no. Usually, tipping 17-20% I&amp;#39;d have loved to leave 10% just to be polite, definitely felt like 15% was too much. <br&gt;1 appetizer, 2 entrees, 1 cheesecake came to $64. For mediocre food &amp;amp; experience, it was not worth it.<br&gt;<br&gt;Left half a cheesecake on the plate - sounded good - nothing special. From 1 to 10, food was 7-8 - meaning it was just food, not &amp;#34;good food&amp;#34; or &amp;#34;great food&amp;#34;.<br&gt;Mashed potatoes were good considering it is almost impossible to find them good tasting anywhere. Shrimp tasted like soap. Avocado spring rolls while good, I was saying at the table, I wouldn&amp;#39;t order them again.<br&gt;<br&gt;Not going back.", "rating": 3, "date": "12/8/2015"}, {"text": "I have been here 3 times in the past week and I am upset that today, our food took extremely long to get, we were rushing to get to work-- and all the manager on duty said was &amp;#34;sorry, I will talk to the kitchen next time.&amp;#34; Really?? How about compensating me for the poor lack of service??  That&amp;#39;s not how you treat loyal patrons. Tip: please coach management and understand basic sales forecasting-- if it&amp;#39;s busy on a holiday-- it will likely be busy on the same holiday next year-- please staff appropriately.", "rating": 1, "date": "9/19/2018"}, {"text": "Adequate. There are very few food options in the mall at the moment and Cheesecake is always fine. You know what to expect: food is alright, nothing spectacular, and the service is alright. The bar area, however, smells like mildew to the point of being unappetizing. It starts to make your food taste off, that&amp;#39;s how strong the smell is. I don&amp;#39;t know where the smell is coming from, but I&amp;#39;m really hoping it&amp;#39;s not behind the bar...", "rating": 3, "date": "11/9/2018"}, {"text": "Terrible service. Waiters and waitresses literally avoid eye contact. Didn&amp;#39;t get our table waters until I got up and found someone, who happened to be the manager, to bring them for us. Today is Monday night and the restaurant was not even busy, I don&amp;#39;t understand what these waiters could have been doing but obviously it wasn&amp;#39;t their jobs. <br&gt;The waitress also gave us the wrong food and we waited 10 minutes for her to come to the table and by that time we decided to just eat because we were so hungry from already being there for an hour and a half. <br&gt;It&amp;#39;s such a shame that such a nice restaurant has such poorly trained waiters.", "rating": 1, "date": "2/23/2015"}, {"text": "Absolutely terrible restaurant ! The service is slow, the staff is rude. The food is subpar at best. Steak is flavorless the cheese steak came out so tiny on a hard hoagie roll the size of a Taco Bell taco. Our drinks were never refilled one of our kids burgers came out 8 minutes after the rest of the tables food. The waitress never said thank you or please to anything and seemed bothered anytime we asked for anything. The hostess are too busy dancing and texting to acknowledge you. They buzz you 10 mins before your table is ready and leave you standing in everyone&amp;#39;s way. It was our daughters birthday dinner and they brought everyone dessert but hers and waited over 5 minutes to come out singing with hers. I would never come back here.", "rating": 1, "date": "2/10/2017"}, {"text": "Will not come back. Waited for an hour for our food after numerous complaints. Pasta finally came but all dried and cold. Spoke to manager, he said they were ready 25 minutes ago but don&amp;#39;t know why waitress didn&amp;#39;t bring them out.", "rating": 1, "date": "7/29/2017"}, {"text": "Terrible service and undercooked food. Don&amp;#39;t waste your time. Very surprising considering this place is located in the short hills mall", "rating": 1, "date": "9/1/2018"}, {"text": "It&amp;#39;s a chain. It has a ridiculously large menu. It&amp;#39;s in a mall. Prepare to to be underwhelmed.", "rating": 2, "date": "8/18/2018"}, {"text": "TOO MANY CHOICES!!!<br&gt;<br&gt;All of the food is formulaic.  They make very good salads, but with that many items on the menu, it&amp;#39;s no surprise that most of the dishes are hit and miss.<br&gt;<br&gt;Of course, they do make excellent cheesecake.<br&gt;<br&gt;I find myself overwhelmed at every visit, simply because the menu reads like a phone book.  I get intimidated...", "rating": 3, "date": "5/16/2013"}, {"text": "Friday night at The Cheesecake Factory was unfortunately a disappointment. We accepted the 45 minute wait and waited to be directed to a dark hole of a booth.  Turns out when we look up at the ceiling, the light was out. We politely asked if we can be seated with adequate lighting. Take 2: We are in the booth by the kitchen. It was a 180 differences. Night to day. Literally. We are elated (It&amp;#39;s the simple things in life).  Server takes our order. The hamburger egg rolls came out so fast (less then 5 minutes from ordering) and turns out to be greasy and poorly executed. It was evident the dish was made in a rush as you hold up an evenly halved sloppy egg roll you see grease drippings.  As we wait patiently for entrees, 10 minutes go by. Another 10 minutes. And another. Mind you, we haven&amp;#39;t seen the server or been informed about our MIA entrees. This is turning out to be a long night.  We finally see the server and it&amp;#39;s acknowledged this is a long journey for two salads and a medium rare steak medallion dish. Our dishes have arrived and the medium rare is medium well which was sent back for another 20 minute wait and one of us loses our appetite.  Unbeknownst to us, the manager comes to apologize for the epic wait.  She was professional and comp two of the entrees.  Despite the miscommunications between front and back, the kitchen poorly managed time and execution.  This is a case when the supply couldn&amp;#39;t keep up with the demand on a typical Friday night.", "rating": 1, "date": "5/19/2018"}, {"text": "Very good food but extremely slow service. Waiter is very nice, seems that she has too many tables. It took way to long to get our food and desert", "rating": 3, "date": "6/30/2017"}, {"text": "I&amp;#39;ve always have a good time at The Cheese Cake Factory but today was the absolute worst. It&amp;#39;s like we were being rush to eat, our waitress placed our orders same time ; appetizers and dinner. I was still having the appetizers when our dinner was placed on the table, which she took up with me in &amp;#39;mid-bite&amp;#39;. I&amp;#39;m most annoyed and appalled my my experience today, it surely did not match up to the superb services I&amp;#39;ve come to know and associate The Cheese Cake Factory with!!!", "rating": 2, "date": "9/30/2018"}, {"text": "Just had my daughter&amp;#39;s birthday lunch here.  It was moderately crowded for a Sunday afternoon and our wait for a table was fifteen minutes.  The atmosphere is lively and very loud.  The restaurant is clean and the food a bit pricey.  Our server got us our drinks super quick and bread came out shortly thereafter.  <br&gt;<br&gt;The food took a while to come out but we were all happy with our entrees.  The burgers were pretty good, the fried shrimp nice portion size and the gumbo also good.  The cheesecake was half price today - score!  The cheesecake was beautifully plated and tasted super fresh.<br&gt;<br&gt;Our server Quasheem was TOP NOTCH!  Attentive and very pleasant personality. <br&gt;<br&gt;The staff sang happy birthday to my daughter and let&amp;#39;s just say it was very enthusiastic!  <br&gt;<br&gt;We will be back!", "rating": 4, "date": "7/30/2017"}, {"text": "Pretty classic meal all around, it&amp;#39;s exactly what you would expect.  It was tasty for sure, but not the best quality you are going to get for the money.<br&gt;<br&gt;We had the Avocado Eggrolls to start which were quite good.  The Americana hamburger had great toppings and was cooked as I asked (medium rare) but not he best tasting beef.  And, of course, the cheesecake itself was the best part.  Solid choice for the area.", "rating": 3, "date": "1/14/2015"}, {"text": "Wife and I had fish tacos for our meals and a Buffalo chicken blast app. Food and service was good an enjoyed eating on the patio. Took a slice of plain cheesecake home and wasn&amp;#39;t impressed.", "rating": 3, "date": "7/16/2017"}, {"text": "LOVE LOVE LOVE THIS PLACE!!! Although crowded all the time! The staff is amazing!!! The bar staff there rivals mixologist in NYC! Colin, Nadeem and Stacy are absolutely wonderful! I will not go there if I don&amp;#39;t see at least one of them there! They take care of you like family which is what a restaurant experience should feel like. GREAT PLACE!", "rating": 5, "date": "5/12/2017"}, {"text": "I decided to choose this spot to enjoy a romantic dinner with my darling. We were expecting to have some bread to start off the night... WRONG. The waitress totally forgot about our bread which creates a tense atmosphere between myself and my lady. She really likes the bread. Aside from that, the food was decent. Although my burger tasted slightly burnt. Next time I&amp;#39;m planning to impress my lady on a nice dinner date, this definitely will not be the place I choose.", "rating": 2, "date": "2/14/2018"}, {"text": "I&amp;#39;ve been here a few times. Everytime I come here for dinner, there&amp;#39;s ALWAYS a wait for a table. The entrees come in a large serving dish. <br&gt;For dessert, I recommend the s&amp;#39;mores pie...it&amp;#39;s really delish :-)", "rating": 2, "date": "4/18/2016"}, {"text": "The service here is okay. Our waitress kept disappearing and barely ever checked in to see how we were doing. When we arrived, it was late so there wasn&amp;#39;t much of a crowd. However, there was a 10 minute wait because none of the tables were clean. We ordered the Tomato Basil Pasta and when it arrived, it was hard and crunchy. It obviously wasn&amp;#39;t made fresh even the the menu says, &amp;#34;light and fresh.&amp;#34; When it arrived the second time it was cooked all the way through. Although, this wasn&amp;#39;t the best experience,  I still have had some great meals here.", "rating": 4, "date": "7/3/2018"}, {"text": "Today was the worst service I have ever experienced at a Cheesecake Factory restaurant. I went in for lunch at 2 pm and was seated right away. The server was prompt in the beginning by bringing us our beverages and placing our orders within minutes of us sitting. Sadly it went all down hill from there, we received our appetizer before we received our bread. Then we waited over 50 mins and never received our entrees. Our server went MIA after telling us our meals were being plated, which was 30 mins ago. We had to ask several servers to bring the manager. The manager was not helpful, he had no idea what was going on and gave us no explanation of what the hold up was. He asked us if we wanted to box our meals and we said no we do not want to wait any longer. We received our check for the drinks and app. Upon further investigation on the receipt, we noticed the server never even inputted 2 of our meals and only ordered one meal. This was the worst experience and will not be visiting again. We went into the restaurant hungry and left hangry.", "rating": 1, "date": "4/26/2018"}, {"text": "The sound of the restaurant is deafening. The kitchen is to close to the patrons and the tables are so close you could hear every word in their conversations. The staff was pleasant but the wait for food was long. I suppose this is part of the MALL experience. Poor service and loud plates and cutlery being dropped into sink. Stay away unless your starving.", "rating": 1, "date": "6/23/2018"}, {"text": "Food: the food portions are huge! There is nothing bad on the menu<br&gt;<br&gt;Service: the staff is slow and forgetful. And very pushy on dessert<br&gt;<br&gt;Atmosphere: LOUD. Unless you are in a booth you can heat the conversation of the table near you<br&gt;<br&gt;The hostess does not stick to the order people come in. The hostess seated their &amp;#34;friends&amp;#34; while other people were waiting", "rating": 4, "date": "8/19/2017"}, {"text": "This was my 2nd time visiting this particular location. The place is clean and service is outstanding. The fish tacos and pasta dishes are amazing. You can not go wrong here. Parking is bit of a hassle but once you find a spot, all green lights!", "rating": 5, "date": "5/10/2015"}, {"text": "We came here and the waiter was very polite, friendly and accommodated us 100%. Customer services excellent. Thank you Kevin!", "rating": 5, "date": "6/18/2018"}, {"text": "Normally everything is fine but not tonight 8/15. Server came to the table, didn&amp;#39;t introduce herself. The server brought the bread to the table and asked if we wanted anything to drink and was standing like we were taking too long ( 5 sec ) later. I said could we all have water with a lemon. She left and I said to my wife and mother- in- law. Maybe it&amp;#39;s Sunday so attention to detail isn&amp;#39;t important. Annoyed! Down hill from there. My check was the best part of the night because I could leave....", "rating": 1, "date": "8/27/2014"}, {"text": "It&amp;#39;s $11.50 for a &amp;#39;Titos on the rocks&amp;#39; here....just sayin. I always enjoy CF but how does this franchise justify that price? The drink was literally a splash of vodka.", "rating": 3, "date": "6/9/2018"}, {"text": "Rather familiar with this location.  Yes, sometimes the service is slow.  Yes, sometimes they screw up orders.  However, any time they messed up an order, they fixed it if we asked about it.  We special order for two people in our party, and 9 times out of 10, they get it right, and they fix it the other time. <br&gt;I really like the chicken dishes and the sides - the sides seem especially fresh.  The steaks can be hit or miss sometimes, I&amp;#39;d recommend a steakhouse if you want steak.  The french fries are very good, wonder if they are twice-cooked like they are supposed to be.<br&gt;Not being math-challenged, if they recommend a tip based on tax included, we cleverly can figure out the amount for tax not included.  Not being time-challenged, we don&amp;#39;t go when it is really crowded - that means we rarely if ever go in December because, heck, it&amp;#39;s a mall, people!  If we have to get a beeper, we go elsewhere.<br&gt;I really like their Skinny menu, especially the Skinny alcoholic beverages with calorie counts.  They are fine with substitution or changes.<br&gt;Yes, I do agree that sometimes their hosts and/or hostesses get distracted, but I&amp;#39;ve never seen the worst ones again.  We do see some turnaround with the wait staff, but the best ones do seem to stay.<br&gt;We do like the huge menu, we do like the food, but yeah, don&amp;#39;t visit if it is really crowded unless you want to get hammered so don&amp;#39;t care about the noise.", "rating": 5, "date": "9/6/2018"}, {"text": "They have good food, but are over priced in my opinion. Went in for dinner for two, and we each had a cocktail and the bill was over 100$. Service left much to be desired as well. Our waiter took almost 20 minutes when we asked for the check and even longer to come check and see if we needed refills.", "rating": 3, "date": "3/17/2017"}, {"text": "All I have to say is oy. Where to begin. My coworker and I thought that the Cheesecake Factory would be a great place to conduct a business meeting, boy were we wrong. We decided to head to this location around 3pm, right after the lunch rush and before dinner service. We walked in and asked the hostess for a table for 2. Immediately we received a look and an attitude - how dare we interrupt her personal conversation with her fellow coworkers. With a sneer, she took us to the smallest two top table, when every other table/booth were open in the restaurant (we were also carrying large bags and backpacks). It took over 10 minutes for anyone to greet us and when we ordered drinks and an appetizer, we could sense the server was disappointed with our order. Since my coworker and I are both in the food business, we know how hospitality should be and we made sure to take really good care of the server. While our server was tending to another table, I asked a fellow server for 2 glasses of water- the response? &amp;#34;She will get it for you&amp;#34;. Really? What happened to team work and helping out your fellow coworkers to ensure great hospitality for your patrons? We really didn&amp;#39;t ask for much, but boy was this experience just miserable. To top it all off, I accidentally left a bag with my purchases at the restaurant. I called about 2 hours after i left to ask if they found a Gap Bag. The manager quickly told me no bag was found and he would call me back if they found it. I heard nothing and called back the next day, asking about the bag, and then again was told no bag was returned. Really?????? Did the bag grow legs and just walked away? So not only did I waste my money on terrible service and mediocre food, but my purchases are lost and Cheesecake made zero of an effort to help find my bag. Save yourself some money and energy and don&amp;#39;t bother dealing with this establishment. Hopefully the management and servers can turn their frowns upside down and treat patrons properly.", "rating": 1, "date": "1/9/2018"}, {"text": "I&amp;#39;ve eaten at Cheesecake Factory locations a few times and have generally enjoyed the experience. Today was an exception. After my 2 daughters and I waited about 30 minutes for a table, we ordered 2 appetizers and lunch entrees. After 30 minutes our appetizers  had not arrived. One finally arrived followed 15 minutes later by the second. 2 minutes later our entrees arrived and one was wrong. When I asked if I had someone else&amp;#39;s meal or a mistake had been made in my order, the waiter checked his notes and said I had ordered what he delivered...which I know was incorrect. I ate what he brought because we had already been in the restaurant for an hour and a half. There are many other places to eat in this mall and doubt I will never eat in this Cheesecake Factory again.", "rating": 1, "date": "9/18/2016"}, {"text": "Management allows cold food to be served to tables . The compensation  to customer is an apology and the serving a replacement dish at the proper temperature. &amp;#34; cold mash potatoes &amp;#34;", "rating": 3, "date": "4/28/2017"}, {"text": "My friend &amp;amp; I have been to the Cheesecake Factory in both Shorthills Mall, NJ &amp;amp; Menlo Park Mall, NJ so many times we&amp;#39;ve lost count. The last time was this April.<br&gt;The menu is extensive. The bar service &amp;amp; table service has always been consistent along with the very long wait times. <br&gt;These 2 Cheesecake Factory&amp;#39;s make the best lemon-drop martini I&amp;#39;ve been able to find in the Tri-State area. I also like their frozen Georgia Peach &amp;amp; Peach Bellini drinks. (If you can make it early to their Happy Hour &amp;amp; get a small table by the bar I recommend it.)<br&gt;In an effort to make this review as brief as possible, I can tell you that the Fried Macaroni &amp;amp; Cheeseballs appetizer is our favorite. And I&amp;#39;ve always liked the following dishes: Chicken &amp;amp; Biscuits with extra gravy (always tender &amp;amp; savory), Steak Diane minus the peppercorns (usually tender with a nice glaze,)  BBQ Chicken Pizza &amp;amp; Roasted Pear &amp;amp; Blue Cheese Flatbread minus the arugula shrubbery. <br&gt;I never liked the Factory Burrito or the Bang Bang Shrimp &amp;amp; Chicken at all! The burrito was tasteless, hard &amp;amp; dry and the bang bang shrimp &amp;amp; chicken were both tough &amp;amp; very dry. <br&gt;Caveat :  Cheesecake Factory in Newport Mall Jersey City, to be avoided. Service there was terrible &amp;amp; the food quality was not consistent with other Cheesecake Factorys in NJ.", "rating": 4, "date": "6/8/2018"}, {"text": "We had the Ahi Tuna Salad. Very good and very tasty. Our server Joey was awesome.", "rating": 5, "date": "5/26/2016"}, {"text": "Typical Cheesecake Factory. The food is nothing extraordinary and the menu is about 30 pages long. The issue with that is the meals are inconsistent and there&amp;#39;s no &amp;#34;go to&amp;#34; meal. I tend to stick to the skinnylicious menu here because their regular portions are huge. <br&gt;<br&gt;The service here was pretty good considering we had a large party (20+). We made a reservation day of and they were able to accommodate. Food came out relatively quickly.", "rating": 3, "date": "10/13/2014"}, {"text": "Wait is always a killer...but if the mall is open you can shop around with the buzzer they give you.  We had the sliders and potato skin apps pretty good, tots were a little over fried for my taste.  The waiter started off great and then got less attentive as the dinner went on.  I waited ten minutes for more water.  The floor is super slippery in the bar area as my husbands chair kept sliding around during our whole meal.  We are waiting now for our cheesecake going on ten minutes.  I&amp;#39;ll take a pic lol so will be be back yeah, maybe in 5 or 6 months def not in the near future", "rating": 3, "date": "7/26/2014"}, {"text": "Well we had to wait for a table, but considering it was a friday night the wait wasnt half bad. The last time i came to a cheesecake factory I was left super disappointed but they totally made up for it. The food. The service. The drinks. On point. I ordered the pineapple mojito and it was heavenly. For appetizers we had crab cakes and they were a bit heavy handed on the mayo but I like that so I enjoyed them. My entree was the chicken madeira and I loved it. I practically finished the entire meal. The mashed potatoes were SO good. I didnt order any desert. I knew I wouldnt eat it, but its the cheesecake factory,  so im assuming with all confidence that you cant go wrong with cheesecake. Our server was really nice and super attentive. My water cup was NEVER empty and he checked him often enough with us. I really liked him. Over all a good experience in the chain restaurante department.", "rating": 4, "date": "10/3/2014"}, {"text": "Many people go here, but this was my first time. Very good location in the mall. Once you enter the mall your immediately at Cheesecake Factory. So I live local and had planned a Valentine&amp;#39;s Day date at Cheesecake Factory. I searched up recommended restaurants in the Short Hills Mall. Cheesecake Factory and California Pizza Kitchen came up. I chose Cheesecake Factory and am very happy I did. I highly recommend itIt always has somewhat of a long wait, around 20 minutes but that was fine because we just walked around for those twenty minutes. After we got our table everything went great drinks came quick, waiter excellent and very nice. We both ordered burgers and they came out. Very big portions. My date ate 5 bites while I ate the whole thing. It was a very smooth dinner. Great conversation, great table. The food also came out much quicker than expected. The dessert there is fantastic. Upon entering I immediately noticed the Celebration Cake. I knew from the start I needed that. Again, my date ate 3 bites and I ate the rest. Paying the check was relatively easy using the cake pay app which I highly recommend This location in the mall is perfect because you can walk while waiting and walk when your done. Highly recommend it especially for an informal date!!", "rating": 5, "date": "2/15/2019"}, {"text": "My first experience at Cheesecake Factory! The expectation might have been high, but the food is really just okay. The place is packed so i guess it&amp;#39;s good for the business. We were really happy though they kept our credit card after us forgetting about it.", "rating": 3, "date": "7/13/2016"}, {"text": "Waited at the cheesecake factory take-out area for 32 minutes. I contacted several employees - none of whom could assist me --- I was told that the job to take a take-out order and ring someone up was delegated to one individual who couldn&amp;#39;t be found. I ended up leaving. This was at 12:30 PM today.", "rating": 1, "date": "6/30/2017"}, {"text": "Don&amp;#39;t. Just don&amp;#39;t. Crowded, loud mess. Entrees came ten minutes apart. Mine didn&amp;#39;t come at all. Manager was summoned and said that a waiter took my entree and gave it to another table!!!! Dish finally came and the potatoes were stone cold. OMG.", "rating": 1, "date": "12/2/2017"}, {"text": "I LOVE cheese cake factory! While other moms may take their children to Mickey Ds for a treat, my mom loved to take me to the cheesecake factory growing up. We always got the same thing, shrimp angel hair pasta, and because it comes in a huge portion, we would split it, but not before indulging in the warm fluffy bread they serve before the meal comes! <br&gt;<br&gt;After walking back and forth in the short hills mall, we headed over here for some dinner and loved everything. My only complaint is the fish tacos which were not that great. Our waitress was efficient and nice! I would definitely be coming back here the next time I decide to go window shopping in this 5th avenue mall!", "rating": 4, "date": "1/5/2012"}, {"text": "I come here often- usually enjoyable lunch. Today my friend and I ordered burgers and fries . We were specific about how we each like our burgers cooked. When our meals were brought to the table , both of our burgers were way over cooked and both of our fries were cold. A gentleman came to our table, I assume was the Manager. We nicely said how our food was not cooked as we ordered it. He took our fries, no apology ( how hard is it to cook a burger?); and returned with hot fries when we were halfway done eating. We understand it wasn&amp;#39;t our servers fault and left a nice tip- but a gesture of apology would have been appreciated - maybe coffee on the house. This was my second time having lunch here this week and my meal Monday was very good. Today&amp;#39;s chef was a disappointment .", "rating": 2, "date": "3/15/2017"}, {"text": "We had the Mac n cheese appetizer and chicken teriyaki, delicious. <br&gt;Mac n cheese was creamy with cruncy shell and marinara. <br&gt;Chicken Teriyaki was incredible with enough to share for two people followed by banana cream cheesecake.", "rating": 5, "date": "3/12/2017"}, {"text": "This place is awesome.  They have a huge menu and there are so many things I want to try but I&amp;#39;m stuck in a rut.  I always go for the lunch size salads (either the cobb or luau).  The portions are huge!  The staff is super friendly.  I used to meet my sister here weekly and I miss it so much.<br&gt;<br&gt;I would recommend this place to anyone as they have all types of food. It&amp;#39;s always packed but you never really have to wait to long,", "rating": 5, "date": "12/3/2013"}, {"text": "If you&amp;#39;ve been to one cheese cake you&amp;#39;ve been to then all.<br&gt;<br&gt;The service was good. Brought everything out hot and quick. Waters refilled as needed. They had the soccer game on, which was nice. If you&amp;#39;re in the mood for the cheese cake factory, head here.", "rating": 4, "date": "7/7/2014"}, {"text": "This is my 1st time coming to The Cheesecake Factory and it was a great experience. The hostesses we warm and friendly. They greeted us immediately. No awkward &amp;#34;stand there in silence&amp;#34; moment. The wait was short for a Saturday night. We were seated before our quoted time (15 minutes). Our server Jarid was fast friendly and attentive. Our food and drinks came quickly and delicious. Will definitely be back!", "rating": 5, "date": "8/20/2016"}, {"text": "Tuna tartar is supposed to be accompanied by avocado. Avocado is not supposed to be accompanied by tuna. I ordered the ahi tartar and made sure to tell the waitress every time they give me no tuna and too much avocado. I watched her write it down. When it came out, it actually appeared as if there was even less tuna than normal. I immediately asked for a manager and when he came over he managed to try and explain to me that unfortunately &amp;#34;it&amp;#39;s measured out in the morning and I can&amp;#39;t do anything about this&amp;#34;. I asked him to take it back and to please just hurry my food up. I will NOT be back here and I will no longer recommend this place to people, and I am someone who came frequently (4x a month) NO MORE !", "rating": 1, "date": "1/11/2016"}, {"text": "Came here around 2:30pm on a Sunday and there was no wait for 2 people. We were seated right away, which is great because we are used to waiting 30+ minutes at other Cheesecake Factory locations. There seems to be a longer wait for larger parties.<br&gt;<br&gt;Our waitress was chatty but friendly, a little slow on the refills but that&amp;#39;s ok. I ordered my favorite Chicken Bellagio - prepared to perfection but was not as hot as I would&amp;#39;ve liked. The boyfriend had his usual crab wontons - this one was made juuust right. <br&gt;<br&gt;Things they could work on: <br&gt;<br&gt;The bread. Waaay too toasted and not warm enough. It felt like we were biting into croutons! <br&gt;<br&gt;Silverware. Lots of suspicious water stains. At least, I want to believe they were just water stains. I asked our waitress for a cleaner butter knife and received an equally dirty one.<br&gt;<br&gt;Otherwise a pretty solid Cheesecake Factory. Will come back again.", "rating": 3, "date": "3/16/2014"}, {"text": "What has the Cheesecake factory done to my beloved veggie burger? They are now using WHITE PASTA as a filler in the burger. The taste is somewhat similar, but the consistency is different. The problem with using the pasta is that they didn&amp;#39;t list it as an ingredient on the menu! The manager tried to tell me that pasta is indeed an ingredient and when I showed him the menu, he admitted they were rolling out a new menu in a week and trying something new. I am so disappointed that a company&amp;#39;s bottom line is more important than customer satisfaction! As another diner commented, this location is  &amp;#34;The McDonald&amp;#39;s of Short Hills.&amp;#34;", "rating": 1, "date": "7/25/2016"}, {"text": "Always eat here and usually always have great service. I recently visited and had to wait for the first time but only 10 mins. Got sat and server came right away and took our drink orders and brought bread and than ordered. Food came very fast and server came at least 4 times to check on us. Foods always good here. Will be here again soon and for happy hour.", "rating": 5, "date": "1/15/2016"}, {"text": "Let me start off by saying I came here yesterday to celebrate my birthday. I had to wait over 2 hrs to get a table for 12 which is completely unacceptable. Then I had one of the managers tell me at least 15 times that the table is almost done and they will be leaving soon. After about 10<br&gt;mins arguing with him I insist he walk over to the table and see what&amp;#39;s really going on. Told me the table was empty (no food, no drinks) and they had already paid their bill and they were basically talking the night away. Common courtesy, when the restaurant is busy and your done eating drinking and you paid your bill, please leave and don&amp;#39;t waste time. Once that was settled, he sends over the busser to wipe down the tables and reset them. Once that was done, we were directed to the back of the restaurant in a private and enclosed area away from everyone. First thing I notice before I sat down was the utensils plates and napkins were not properly placed on the tables, they were scattered everywhere. Our server then comes over and introduces himself to us. Order our drinks and brings over 2 baskets of bread for a table of 12. Since we didn&amp;#39;t order appetizers we munched on atleast 5 baskets of bread before we ordered our entrees. 15-20 mins later it&amp;#39;s already 10:45pm when our food comes to us and we basically didn&amp;#39;t enjoy the meal as we hoped we would. I barely ate my food that I had to pack it to go because of how late it got. The staff then came over and sang happy birthday to me which was a nice touch to ending the night. I would give this place a 1 star but I gave it a two just to be nice. Won&amp;#39;t be coming back here on a Friday night ever again!", "rating": 2, "date": "3/19/2016"}, {"text": "This was a first time experience for myself, having never been to the cheesecake factory, have to say it was satisfying. Not fantastic, not bad at all.<br&gt;<br&gt;A busy friday night, service was normal. Our waitress attended to my needs as well as my gf&amp;#39;s and was very polite with us, cant really say anything bad about service other than being sat very close in between two couples which was kinda annoying<br&gt;<br&gt;Food came out and for the most part was on point. Ordered the fettechini alfredo, fries, and strawberry cheesecake. You&amp;#39;ll find the pasta is better at olive garden to be honest, the pasta was just soggy, maybe not cooked completely, but it wasnt as good as other restaurants. However as for the other two, the food was really good and filling.", "rating": 4, "date": "11/3/2015"}, {"text": "This is a nice place for a group to meet with a variety of dishes to please all.  Either before or after dinner there is a bar area to relax and talk.", "rating": 4, "date": "12/30/2017"}, {"text": "It&amp;#39;s decent for a chain but it&amp;#39;s always so crowded and I find the service to be spotty. However, if you sit at the bar area during their happy hour the service is much better and they have a half price menu which is pretty good.", "rating": 3, "date": "1/12/2016"}, {"text": "I like to visit here when I am staying at the Hilton across the street.  I&amp;#39;ve only eaten at the bar and never sat down inside the restaurant.  The bartenders are always friendly, service is always quick and their food is usually consistent as a chain.<br&gt;<br&gt;If I had to be picky about anything at this restaurant is that when I was in the takeout area, I overheard one of the employees loudly complaining about customers.  She didn&amp;#39;t realize that I was there and was just venting but should probably be more mindful next time.", "rating": 4, "date": "12/30/2013"}, {"text": "One star reduction since they no longer have my shrimp and grits!! And they ran out of brown bread when we were there on Tuesday night.  <br&gt;<br&gt;I am happy they are keeping their small plate menu items so will most likely come back for that.  And of course, pasta da vinci, it&amp;#39;s their version of Milanese sauce but much better!!<br&gt;I like the bar area... Faster service since it is close to the kitchen, bar and registers.", "rating": 3, "date": "7/4/2013"}, {"text": "I&amp;#39;ll never go back. If I ever go with a group bigger than two I wait entirely too long to be seated.  I don&amp;#39;t think I&amp;#39;ve ever been greated by a host with a smile, everyone there always seems to have an attitude. Always have to wait forever for the server to come to the table. Service is always slow. Sometimes you get bread, sometimes you don&amp;#39;t. The portions are big and the food looks good on the plate and it tastes good. Can&amp;#39;t complain much about the food but the staff needs to be better trained.", "rating": 1, "date": "11/11/2015"}, {"text": "I&amp;#39;m not big on eating at chain restaurants, but, I love the Cheesecake Factory.  Kids roadhouse sliders are my kids favorite burgers (I&amp;#39;m always stealing bites...they are really good) appetizers are always good..especially Calamari  (another favorite of my kids, Asian lettuce tacos, corn tamale cakes, avocado egg rolls...all great...my wife ( also a food snob who doesn&amp;#39;t like chains) always gets the tuna tataki salad, which she loves...I love the fish tacos, hut, I&amp;#39;ve really never had anything bad here.", "rating": 5, "date": "7/5/2016"}, {"text": "I love the Cheesecake Factory but this location offers poor service and inconsistent food prep quality.", "rating": 2, "date": "2/23/2016"}, {"text": "I&amp;#39;ve been to multiple Cheesecake Factory locations before and I&amp;#39;m just disappointed at this locations service. I went there today for lunch with my girlfriend and we waited about 10-12 minutes before being greeted by our waitress. We ordered drinks (never got them). I ordered the spaghetti and meatball dish (I don&amp;#39;t know how you can mess up such a simple dish) and my pasta was under cooked (not the end of the world) but my meat balls came out frozen. I advised our waitress of the situation and she goes, &amp;#34;oh they&amp;#39;re frozen?&amp;#34; THATS IT. No apology (which isn&amp;#39;t her fault because she didn&amp;#39;t actually make the dish). She then comes back and advised us that the meal was going to be removed from the bill and the manager should have come over to talk to us about the situation. We then waited another 10 minutes for the bill and no manager ever showed up to apologize. Truly disappointed in the locations service. Most likely will not be returning to this location.", "rating": 1, "date": "1/13/2019"}, {"text": "My sister and I come to this cheesecake factory all the time and we have never had a bad experience! Tonight in particular, we stopped here to have a nice dinner together and the waitress we had kept making rude comments to us about what we were eating. We ordered an appetizer and when we were finished, another waitress took it away and our entees came out shortly after. Our waitress came over, and asked if our food came out before our appetizer, (she saw us eating the appetizer prior) we said someone took it away because it was finished and she proceeded to comment &amp;#34;Oh you finished those already?&amp;#34; and my sister and i just looked at each other and she proceeded to say &amp;#34;Oh oh so they&amp;#39;re ALREADY gone, gotcha.&amp;#34; From this point, we felt judged. When my sister ordered her entree, (she orders the same dish each time and has never had any issues) the waitress blantly said to her &amp;#34;why would you want that, it&amp;#39;s bland&amp;#34; this made my sister feel uncomfortable and we were hesitant to order any dessert in fear that we&amp;#39;d be judged again. We weren&amp;#39;t pleased with our experience tonight, and might need to stick with the Rockaway location from now on. (Our waitress was Melissa)", "rating": 1, "date": "11/24/2018"}, {"text": "The worst Cheesecake factory that I&amp;#39;ve been too. Since we live close by we&amp;#39;ve frequented this Cheesecake Factory many times. The service is just bad. Waiters might be polite but they and the kitchen staff have got to get their sh*t together. On one occasion my wife&amp;#39;s food came to us 45minutes later than my dish and it was room temperature and seemed as if they forgot to put seasoning on it. The management apologized and gave us a free cheesecake, but we&amp;#39;d much rather just have a good dining experience. Next time we&amp;#39;re here my dish is still not ready a half an hour after my wife&amp;#39;s dish arrived. I didn&amp;#39;t want to eat anymore because the whole point of dining out is to eat together. Anyway I told  the waitress to cancel my order. She said it&amp;#39;ll be ready in a few minutes, but by that point I just didn&amp;#39;t want it anymore. I feel bad for the management of this place ,because I see them going from the reception area to the kitchen and back, an they seem stressed all the time. I personally think from my experience that the staff is subpar in terms of service. Some workers are great I know, but overall steer clear of this Cheesecake Factory. It gives a very bad impression to this franchise. Mind you, me and my wife have been to several Cheesecake Factories in New York, New Jersey, Florida and California. Again this place has been far below in terms of service and food preparation. One more note. Cheesecake is supposed to be served cool, not room temperature. If you notice at this location they always are opening the refrigerated area where the cheesecakes are kept. Just go and watch. We&amp;#39;ve had cheesecake served to us on 3 occasions that was room temperature. Nasty. i hate leaving negative feedback, because we love the Cheesecake Factory, just not this location. Bad.", "rating": 1, "date": "11/18/2018"}, {"text": "I have no idea wth happend with the Cheesecake Factory tonight but it was a real disaster. To start things off when we got in the door we were initially given a 20 min wait time, real wait time 1 hour. My mother at one point when we were waiting had asked for a glass of water and it took me on line at the take out counter for 30 mins to be able to get that for her. I had even asked one of the staff members for the water and had nastily been told to wait on line. I&amp;#39;m not asking for cheesecake just water... Calm down.   When we finally got to our table the utensils were dirty wth? Our server was a nice girl but her head really wasn&amp;#39;t in it! First she forgot the wine we ordered and it took 3 times back to the kitchen to get my meal right. Mind you when it did get to the table my parents were done with the meals they had so I just had enough time to grab a bite or two and get the hell out of there. It wasn&amp;#39;t anything weirdly complicated either, just laziness. Beyond that the food was bland and really not worth the  80 bucks they squeezed out of us. <br&gt;<br&gt;Not going back.<br&gt;<br&gt;Oh.. Also... They need to have a more proactive policy on screaming toddlers. These kids had managed to scream throughout the entire meal and it gave me a throbbing headache. As a server or staff member doesn&amp;#39;t it ever occur to you that this may be really uncomfortable for the other guests to have to listen to?", "rating": 1, "date": "1/19/2015"}, {"text": "This is definitely my ultimate favorite chain!<br&gt;I used to go here since I was young to the Long Island Westbury location. I used to beg my parents to take me there when I was a teenager ... always delicious with good service. <br&gt;<br&gt;The factory nachos or buffalo blasts are the best for appetizer ... the bread is delicious ... I have tried so many different entree&amp;#39;s and they all have been amazing however my ultimate favorite is Chicken Madeira and Moroccan Chicken ( I ask for the mash instead of rice tho ... yum yum). Drinks are so yummy as well and can&amp;#39;t forget dessert!!!<br&gt;<br&gt;Overall I have been to so many different locations numerous amounts of times and love it there all the time !!!! Only downside is sometimes the wait is a little long ... but they say good things come to those who wait ... and it&amp;#39;s definitely worth it !", "rating": 5, "date": "10/27/2013"}, {"text": "No one is in the restaurant but we still wait for service for 20mins at 12pm........ So bad never come to this one again", "rating": 1, "date": "1/29/2016"}, {"text": "Sadly, after having to attend a birthday dinner here, I definitely won&amp;#39;t be coming back. The service really got all of us thinking that clearly they don&amp;#39;t care much about customer service. 25 minutes after we ordered our food, our waitress comes to tell me that they are out of the steak tacos which I had ordered. I chose the Kobe style burger, which was a huge mistake. I ordered it medium rare and got a hard, chewy and gray colored burger.  at this point, I couldn&amp;#39;t tell if it was really Kobe beef.. It took the waitress another 20 mins before we got the food. Then another 15 minutes to bring us ketchup. To top it all off, no one offered to fill our waters and sodas throughout dinner.", "rating": 1, "date": "8/6/2016"}, {"text": "Pretty typical Cheesecake Factory experience.  Service was pretty good.  Bummer they ran out of Dulce de Leche cheesecake and so we had to opt for another selection but overall a good experience.<br&gt;<br&gt;Side note:  The amount of birthday celebrations were crazy. I swear it was like 8 or more sing along Birthday chants.  Wow.", "rating": 3, "date": "8/13/2013"}, {"text": "Ok- do not like writing this review. This has been my go- to restaurant to meet friends for lunch since it opened. After today, crossed off our list. My friend ordered a cheeseburger with sautéed onions and mushrooms. It was not cooked the way she ordered it and, instead of sautéing the mushrooms and onions the chef grilled them- thereby burning them. We asked for the Manager, who never came. My Chinese chicken salad was your basic bag of salad ( too much lettuce) not enough chicken- it was hard to find; and I can&amp;#39;t believe there was a whole chicken breast there. My friend had to ask 3 people for catsup and it took so long to come she had pretty much finished . Last note- our bill came , we paid and we did not receive the 48 cents change we were due. My friend said it&amp;#39;s CF policy to round up or down. If this is true- it&amp;#39;s awful! Last note- I used to come here so often many of the servers recognized me and we would exchange hellos. Completely new staff-not very customer friendly- maybe some training would be a good mgmt idea.", "rating": 2, "date": "8/24/2017"}, {"text": "Maybe the cheesecake is good here but the dinners are very disappointing. We had a couple drinks in the bar while we waited for a table and noticed that the drinks didn&amp;#39;t have prices on the menu.  the wine did, the beer did, the food did, but no drink prices... which we found to be a little odd. When we asked how much things were they said it depends anywhere from 7 to $8 and up to $13.  I ended up ordering a skinny Margarita and it was 10.50 but no one could tell me what the price of it was  before I ordered it.  I don&amp;#39;t think that&amp;#39;s good practice to not put the prices of drinks on the menu and the servers and the bartenders didn&amp;#39;t even really seem to know what the prices were until they rang it up. Then we got our table<br&gt; and I ordered the Almond crusted salmon and kale salad and the reason I ordered this salad was because it had a lot of things in it that I like such as avocado, brussels sprouts and kale. when the salad came out it was just a big pile of kale with some arugula and a piece of salmon on it so I asked the server what happened to all the other things that are listed in it so she brought it back to the kitchen and 20 minutes later brought out that same salad with more kale and some pieces of avocado on it so I just gave up and ate it but they really didn&amp;#39;t seem to have any kind of quality assurance nor did they seem to care.  Tables to the left and tight of us were also having isses and sending things back.  the couple next to us had such problems with their food they sent it back and then one had their food 1 didn&amp;#39;t for at least 45 minutes.  The person with the food tried to wait for the other person to get their food which I&amp;#39;m sure the first person&amp;#39;s food was cold by the time the second person&amp;#39;s food came out 45 minutes later and when it did come back they rejected it and sent it back again.  All this time the waitress never came to check on them.. and then they ended up dining and dashing and suddenly  the waitress appeared and took off running after them!  another person next to us left their whole meal on their plate, no one seemed concerned to ask if something was wrong with it.  it seems like this place is really badly run and worse yet, no one seems to care...", "rating": 1, "date": "3/13/2016"}, {"text": "This is a neat place to have a nice meal whether it is a casual dinner or a special occasion. They have a pretty big menu with lots of options to choose from. Came here with family and was not disappointed at all. It was a birthday dinner so the wait staff sang a bday song while bringing the cake with a candle on it which was nice of them to do. The food, the drinks, and the service were great", "rating": 4, "date": "8/5/2014"}, {"text": "I often meet friends here for lunch and we usually have salads.  I get the Asian Chicken Salad, which has a plum dressing that is delicious.  Pretzel crusted chicken appetizer is amazing as is the fried zucchini.  Interestingly, the desserts aren&amp;#39;t that good.  The chocolate cake is good but it is so rich that you can&amp;#39;t even eat the whole piece ( which is huge).  The scary part is the number of calories in some of their items. The salads are near 600 calories and a slice of cheesecake is over 1000 calories!!!   Wait staff is usually attentive and frequently refill sodas and ice teas.  Prices are good.  Ambience is very nice.<br&gt;Please don&amp;#39;t review this business if you received a freebie for writing this review, or if you&amp;#39;re connected in any way to the owner or employee", "rating": 4, "date": "11/5/2015"}, {"text": "I should start by saying I usually love the Cheesecake Factory. My best friend came all the way from Virginia to New Jersey for my birthday and we chose to go to the Cheesecake Factory. We got there and they said it was a 20 min wait for 2 people. At least 20 minutes go by and we go to check how much longer only to find out that the wait is going to be at least another 20 min. When we eventually sit down we order our food right away. When we got our appetizers we asked for a dipping sauce it did not get it until we were completely down with the appetizers. Then I am told that they are all out of the Mac and cheese burger that I had been looking forward to all week. When I got my plain burger that I ordered medium, it was bleeding and raw. By the time my burger came back out it was soggy and watery. This was a devastating experience.", "rating": 2, "date": "5/13/2016"}, {"text": "One of my favorite restaurants in Jersey it never disappoints, Yes the menu is big and Yes it is more pricey than other restaurants in the area but it is worth it!!!!!!!!!  The service is all ways right on top of it,  are waiter never let are glasses run low with diet soda or water. I still am having dreams about my salad when that happens I know it was good.", "rating": 5, "date": "1/10/2016"}, {"text": "I&amp;#39;m not the biggest fan of chain restaurants, however when my Canadian friends came to visit, it was very high on their list of places to go. Why? I couldn&amp;#39;t tell you, except they were obsessed. On their last night here, we went to the Cheesecake Factory. <br&gt;<br&gt;After we were seated the waitress, not so nicely introduced herself, following it up with telling us that the restaurant closed at 10 - it was 8:30. While I thought it was a little unprofessional and rude, I ignored it. <br&gt;<br&gt;We were waiting for the forth member of our party - which we had told both the hostess as we were seated and the waitress when she came for our drinks orders. She seemed very annoyed that she had to wait, and disappeared... not to the point of we could not see her, she walked past us plenty of times, but she ignored us until SHE was ready. <br&gt;<br&gt;While she did seem very familiar with the menu, she did not seem to want to answer any questions. Thankfully a different server delivered our food. Of course, as it&amp;#39;s the Cheesecake Factory, my Canadian friends want cheescake (I had tried to take them to Juniors, but they weren&amp;#39;t interested). My Canadians friends and my boyfriend all ordered cheesecake, but as the only New Yorker in the world who doesn&amp;#39;t like Cheesecake, I ordered the Apple Crisp. Well, as the waitress had not written down away of the desserts we ordered, she brought me the Apple Strudel cheesecake. When we mentioned it was the wrong item, she took the dish back, but not before we heard her say &amp;#34;Bitch.&amp;#34; <br&gt;<br&gt;My Canadian friends were very upset and had the manager come over - who was very understanding. However, I don&amp;#39;t think a server should have that kind of attitude - at least not in the dining room. Like I said before, I&amp;#39;m not a fan of chains, but I will definitely be staying away from this particular location.", "rating": 2, "date": "9/12/2012"}, {"text": "worst experience ever. my blood was boiling. ordered 2 slices of cheesecake (which is already ready) and it took 20 minutes for them to bag it bc employees were too busy on their phones and talkin to friends and countin money on the counter where my dessert is placed. will not b goin back", "rating": 1, "date": "7/14/2018"}, {"text": "had the loaded baked potato bites. so good!!!", "rating": 5, "date": "3/29/2015"}, {"text": "The place always is crowded. Waiters are short handed. After waiting a long while waiter came by. Very rushed, he had lots to do. Salad was awful. Lettuce looked like it had been sitting out for a long time. All browned at the edges and dehydrated. The main course came. Not much better. Meat was cold and had little taste. I was trying to the waiters attention for another drink, it was not until I was done with my meal that he came by. Lots better places to eat at short hill mall.", "rating": 1, "date": "10/10/2017"}, {"text": "I wrote a fairly negative review when this CCF opened up in 2011.  However, we hung in and so did they.  Service got better and we probably averaged two visits a week since then. We generally time our visits in the late afternoon on weekdays to avoid waiting and, while spotty, overall it was good enough to keep us coming.<br&gt;<br&gt;That said, we have seen a considerable deterioration of both service and food quality over the last six months.  While there are some great waiters and waitresses, there is a lot of standing around and talking to each other when the restaurant is not busy and seeming overwhelmed when it is.  Either way, no one checks and refills drinks or comes around to see if everything is OK.  People walk around but still ignore customers.<br&gt;<br&gt;We put up with this because we loved the food, but almost every time we have visited this restaurant over the last two months something has been wrong with one of our meals (cold fries, cold mashed potatoes, mayonnaise when we asked for dry, etc..) such that one of us ate while the other waited for the correct food.  One visit, it took so long to get the correct meal that I ate dessert with my wife and took home my main course when it finally arrived.  We have also noticed great variation in portion sizes, things generally getting smaller then occasionally huge again.  Cake is most noticeable in the variation.  It also takes a long time to get food, even when the restaurant isn&amp;#39;t busy.<br&gt;<br&gt;The last straw was Wednesday.  We were seated immediately.  The waitress was friendly but overwhelmed.  My wife&amp;#39;s fries came out cold. And my meat loaf came with a few drips of gravy.  My wife got her new fries.  I asked for more gravy.  We did not see our waitress again for 10 or 15 minutes.  I never got gravy.  We had to eventually stop another waitress to ask for our drinks to be refilled.  We were so frustrated by the end of the night that even my wife, who cannot get enough of CCF agreed we were going back to other restaurants.<br&gt;<br&gt;Noticed lots of managers in the store CCF must know,they have a problem.  Doesn&amp;#39;t seem to be working.", "rating": 1, "date": "11/27/2015"}, {"text": "Awesome happy hour deals - drinks for $5.50 from 4-6pm in the bar area. Love the strawberry shortcake dessert! One of the best ever made with scones/biscuits and lots of vanilla ice cream and strawberries. Their beef sliders and guacamole are both pretty good too. Great service if you sit at the bar - friendly, attentive and efficient.", "rating": 5, "date": "5/25/2015"}, {"text": "I love the new location! However the staff can be unfriendly at times.. Avocado egg rolls never fail! It&amp;#39;s a nice place to eat after a day of shopping at the Short Hills Mall.", "rating": 3, "date": "4/24/2013"}, {"text": "After promising myself i would never return, I got inspired to come back but this time for takeout. My friend and i waited 45 minutes before mutually agreeing to leave. The waiter was extremely rude once he learned we were taking everything to go. Worst than any other time i have been there.", "rating": 1, "date": "2/16/2017"}, {"text": "Extremely good resturant. Always busy and really good cheesecake. Really attentive people. The downfall is the business.", "rating": 4, "date": "8/12/2015"}, {"text": "Usually order takeout. You call, someone picks up and puts you on hold... You wait and wait and wait. Finally, you hang up.  Then you call the reservation desk, explain that no one is taking orders, they take your order and walk it to the to go counter.  Need a better takeout/to go system!", "rating": 1, "date": "8/7/2015"}, {"text": "I was slightly reluctant on eating at the Cheese Cake Factory because One of the guest in my party has severe food allergies which makes dining out extremely difficult especially since it&amp;#39;s a child &amp;amp; I didn&amp;#39;t want to single them out ... I went in, asked to speak with the manager (as I always do) &amp;amp; was seated... When she came over i expressed my concerns &amp;amp; I have to say she went up &amp;amp; beyond to accommodate us &amp;amp; was totally grateful &amp;amp; surprised because of poor past experiences at other food chains... I will definitely return with confidence in knowing my concerns where just as important to them", "rating": 5, "date": "4/11/2015"}, {"text": "Had a great experience here for lunch yesterday.  I did not know that CCF had a happy hour menu and was kindly informed by my server Holly (who was amaze); This is typically not the case in the service industry where the service provider&amp;#39;s wages are based of &amp;#34;commission&amp;#34; of sales.  Because of Holly&amp;#39;s upfront honesty, attentive service ( she even struck up conversation about the book I was reading) and customer first mentality I ended up leaving her a 35% tip.  I would give CCF five stars but the host was a bitch and they put giant (five inch plus) sized pieces for chicken on my nachos that needed to be cut with a knife and it was soo much trouble that I took them home!", "rating": 4, "date": "8/17/2012"}, {"text": "Trying to order to go and no one will pick up the phone.  Pretty unprofessional.", "rating": 1, "date": "7/17/2017"}, {"text": "Wow food was just nasty service was good and fast our waiter was very nice but the food was just nasty I guess the Cheesecake Factory isn&amp;#39;t what it use to be..", "rating": 2, "date": "6/12/2015"}, {"text": "Ate here twice. Food was ok, hair in my food once... 2nd time the waiter was training another waiter. I guess there weren&amp;#39;t enough people working. Took forever to get my food even for utensils. Asked for extra dressing for my salad.... Didn&amp;#39;t get it until I was practically done eating", "rating": 2, "date": "2/12/2015"}, {"text": "I had not been to Cheesecake Factory in a long time mostly because it is not close.  In my recent visit I was pleasantly surprised.  While the food may not be gourmet it was fresh and very tasty.   We will go again. The fresh made guacomole was outstanding.  I also recommend the tex mex rolls.  Obviously ending with excellent cheesecake. Good food and large servings are a good combination.", "rating": 4, "date": "6/24/2017"}, {"text": "If you&amp;#39;ve been to one, you haven&amp;#39;t been to them all.  Even though the menu is basically the same at every CCF, the quality of the food and service may vary.  That being said, the food here was very good, came out hot, and tasted fresh.  In fact, my burger (Smokehouse BBQ) happened to be very good and was cooked to a perfect medium.  <br&gt;<br&gt;The service was solid, but nothing to write home about.  Lunch specials are reasonably priced.  I&amp;#39;ll be back next time I&amp;#39;m at the Short Hills Mall.", "rating": 3, "date": "10/21/2012"}, {"text": "I love the Cheesecake Factory.  I think the food is generally very good, the desserts are great, and the service is usually more than satisfactory.  However, I was not overly pleased with this particular location.  It seems smaller than most, which is fine, but will undoubtedly lead to long waits during peak times.  I came for dinner with a friend on a Wednesday evening, and we were seated right away.  Our waitress did not appear for several minutes, and then it took some time to receive our drinks and bread.  We could not find her to order for a time that seemed too long for our liking.  I ordered a tomato, basil and cheese pizza, and my friend ordered the chicken parmigiana sandwich.  We both were very happy with our meals.  The food was great, as always.  We then had to wait again for to-go boxes and the check for quite some time.  It was becoming annoying.<br&gt;<br&gt;I think this Cheesecake Factory location will be very successful, as the Short Hills Mall was slightly in need of another dining spot.  I think the food is great, but the service seemed to need improvement.  Hopefully over time, this will get better.  I think I will stick to the Menlo Park location.", "rating": 3, "date": "2/26/2012"}, {"text": "I really enjoy the IDEA of the Cheesecake Factory, and their exasperatingly huge menu...<br&gt;Each time we pay them a visit, I secretly fantasize that all the delicious menu items are lovingly handcrafted by five-star Michelin chefs who are simply waiting for each order to come to them.<br&gt;Usually, there is something or another that occurs at TCF that brings me plummeting back to earth. Take for example yesterday. My family and I went for a late lunch and were promptly seated. We ordered the cheeseburger sliders for our child and kale salad &amp;amp; Vietnamese style fresh rolls for me and my husband got the Chicken &amp;amp; Biscuits.<br&gt;When my child&amp;#39;s order arrived, my husband took a test bite and found a looong red hair embedded in his bite. We informed the waitress, who without a word brought back the offending plate to the kitchen and several minutes later brought a freshly cooked order of new sliders that were delicious AND hair-free.<br&gt;My salad and rolls were as good and fresh as always, and Hubby&amp;#39;s chicken and biscuits were fantastic.<br&gt;When we got our bill, we saw the child&amp;#39;s slider order was removed, which was completely the appropriate thing to do, and we added the amount towards the waitress&amp;#39;s tip.<br&gt;TCF is great in theory if you don&amp;#39;t really pontificate about all the moving parts that it takes to make it operate. Just enjoy it for what it is and keep an eye open for the occasional stray hair.", "rating": 3, "date": "10/19/2014"}, {"text": "One of my favorite locations. Service is great. Food is always good. Pasta dishes and miso salmon are my top picks. I had the bbq ranch chicken salad w/the buttermilk pepper dressing. it was decent. nothing too spectacular.", "rating": 4, "date": "5/19/2014"}, {"text": "We always have the pot stickers, wings, and ahi carpaccio for our appetizers, all of which were wonderful.  Great menu choices for everyone.", "rating": 4, "date": "1/8/2015"}, {"text": "The food was great as always and the service was spectacular! This location is especially gorgeous and well maintained! It was definitely hard to decide but if you&amp;#39;re looking for a good appetizer, I recommend the factory nachos! I&amp;#39;m coming back for sure!", "rating": 5, "date": "5/29/2015"}, {"text": "I used to love coming here with the spacious tables for larger groups, great kids&amp;#39; menu and good food.  Everything about our experience there tonight was miserable.  I expected the one hour wait.  What drove us crazy was that we waited an hour for a table for five only to sit at a table meant for 4.  The waiter took very long to come over.  We started by ordering just drinks and an appetizer.  We asked for bread twice before it came.  Since we waited awhile before the waiter came over to get the rest of our order I thought we wouldn&amp;#39;t be rushed with our food.  Well, the appetizer didn&amp;#39;t come until right before our main meals so we had no room for any food on the tiny table.  They wouldn&amp;#39;t clear away any dishes.  Our waiter was getting annoyed and made no apologies for the slow service or for forgetting everything.  We called him over because we were missing one entree.  He again was annoyed and apparently didn&amp;#39;t notice a meal missing because he asked us what else we needed.  We pointed out that we had no main meal and asked a second time for some Parmesan for my son&amp;#39;s cold pasta.  When the missing burger came, there were no fries.   We kept trying to order refills on drinks but he would disappear before we could ask.  We couldn&amp;#39;t even finish a sentence before he would leave the table.  We waited another 20 minutes after dinner was done to get the check.  I took my kids and left my husband at the table to pay.  We were hoping that would be a hint.  Apparently not. We have no desire to return ever again.  We were so turned off!", "rating": 1, "date": "5/19/2018"}, {"text": "Let me start off by saying that I love Cheesecake Factory food. Their Pasta da Vinci and salads are what keep me coming back. Cheesecake Factory is like BJ&amp;#39;s/TGIF/Applebee&amp;#39;s - a place you avoid like the plague unless your friend is throwing their birthday dinner there. Why? Because you&amp;#39;ll wait forever for a table, then wait forever for your waiter, wait for your food and so forth. Dining becomes a long drawn out experience peppered with frustration, self-questioning and muttered threats of going home and Yelping.<br&gt;<br&gt;I understand that these types of places are almost always busy and Sunday lunchtime is no exception. However our bread basket arrived 20+ minutes after our waitress asked us if we&amp;#39;d like some and by a completely different waiter. The bf&amp;#39;s soda had to wait 30 minutes to get refilled (also by a different waiter). Are you serious? Where did our server disappear to? I was not offered fresh parmesan for my pasta and um hello.. my middle name is &amp;#34;More Cheese Please!&amp;#34;<br&gt;<br&gt;Food is always consistent and service is consistently lacking. No thanks.", "rating": 1, "date": "1/9/2012"}, {"text": "This location isn&amp;#39;t one of the better ones I&amp;#39;ve been too.  The service is OK, not great.  Our server, Larry is always very cordial and does a great job with our orders.  He carries himself with much class and is always polite and respectful.  I feel he deserves to work at a much better restaurant.  This location is beneath him.  The food is not up to the standard of what The Cheesesteak Factory is known for.  My appetizer wasn&amp;#39;t good.  And my Mexican Omelette dish had dry, hard pork ends instead of pork chunks thats supposed to be in it.  I&amp;#39;ve been to this location numerous times for brunch, and they are getting lazy with their food presentation.  And they always want to seat us in a corner in the back near the kitchen or the register.  Today we went to the Woodbridge location, and everything was so much better.  Skip the Short Hills&amp;#39; location.", "rating": 3, "date": "11/8/2015"}, {"text": "Second time eating here, second time I get a hair in my food! Ugh!!!!!!!! Manager comes back with a replacement item for my hairy food. I had to tell him to just take it off the bill. On the second occasion I was with my kids having brunch and again a hair in my toast. When I told the waiter he got the manager who came out with replacement toast. So again I had to ask him to just take the food and take off my bill. I told him this was the second time and he just said , &amp;#34;oh sorry,they all wear head nets&amp;#34;. Seriously!  So so disappointing!", "rating": 2, "date": "8/2/2015"}, {"text": "Cheesecake Factory short hills mall NJ<br&gt;<br&gt;We&amp;#39;ve been to a lot of different cheesecake factories and it ranks as one of our favorite restaurants, usually with an understandable wait, but have never experienced a restaurant with this degree of disorder, rudeness and unprofessionalism.  We arrived to an hour wait which for CF on a Saturday we expected and accepted.  Since we had gone out of our way and were a distance from home this late we decided to hope for a high top table that might open up or a spot at the bar. Decent human decency would dictate when you are done eating and see others waiting that you might get up and make room.  Not this clientele.  Seems delighted to watch us all wait and watch. When one couple got up at the bar and we prepared to sit they waved another African-American couple over who took our seats and and had the nerve to say &amp;#34;sorry, wrong color&amp;#34;.  Wow.  In today&amp;#39;s world?  Finally a high top opened up and we sat down. The other high tops around us were wiped down and orders taken while we waited over 30&amp;#34;!!  Asked three times and were told they were too busy and would help soon.  The kind African-American couple next to us who had sat down 10&amp;#34; after even pointed it out to their waitress and still nothing. The bus boy went out of his way to avoid clearing our table and that of another family.  The waiter was forced to clear the other non-AA table a few down. Finally, our table was cleared by our clearly unhappy waitress. Half the bread finally arrived without butter. No drinks. No order.  Finally 20&amp;#34; later our disgruntled waitress took our order. 20&amp;#34; later cold food arrived and that was it.  Are as fast as we could. No dessert was offered. We paid and left our worst CF experience ever in over 40 different locations. Not even a close second. Clearly management tolerates poor attitudes, slow service, and behavior that has no place in a respected chain or today&amp;#39;s society. Very disappointed by our experience. But for all those those others also disappointed by your experience at this short hills location, fear not.  There is not another cheesecake in the USA this disappointing.  Try another. Sad and shame on anyone who treats anyone different based on sex or race in today&amp;#39;s society especially in this selfish, narcissistic world.  Usually CF is a pleasant escape but not here.  We won&amp;#39;t be back to this location", "rating": 1, "date": "4/29/2017"}, {"text": "I&amp;#39;m giving this five stars because I really like Cheesecake Factory (they are somehow able to mass produce tasty foods of a ridiculous variety) and this location is often quite free as opposed to other NJ locations.", "rating": 5, "date": "10/1/2014"}, {"text": "The service level on SUNDAY 3/22/15 was horrific. My friend and I arrived at 8:45pm, we were seated at 8:55p. After waiting at the table for 9 minutes, my friend asked the hostess who was our server. We then saw and heard several servers arguing about who didn&amp;#39;t  want to take us. Finally, after another 4 minutes our server appears. He just asks what would you guys like. Normally, Im asked would I like to start off with drinks or appetizers. Great servers even tell you the specials. I felt very dissatisfied as a customer and will never eat at CHEESECAKE FACTORY in Short Hills ever again. I will tell all my friends and family, this is a place that doesn&amp;#39;t redpect you, so dont spend your money there. Corporate will definitely be notified!!", "rating": 1, "date": "3/30/2015"}, {"text": "I would give 0 stars if I could! Pathetic!! Called right before leaving to get there, they told me that they had a lot of empty seating when I got there we had to wait for 35-45 mins.", "rating": 1, "date": "7/17/2015"}, {"text": "The mac and cheese burger. Lemon Raspberry Cheese Cake. WOW! I am even more so impressed with the service. Everyone I was with was stunned. The setting. The noise level was perfect. I highly recommend The Cheese Cake factory. I will be coming back to try every cheesecake!", "rating": 5, "date": "10/5/2014"}, {"text": "I have only been here once where there wasn&amp;#39;t a wait. However, I&amp;#39;ve experienced this at most of their locations. The food is still great though! The cheesecake is awesome.", "rating": 3, "date": "7/31/2012"}, {"text": "Order all screwed up. Sent my burger to wrong table. Rude manager.  I watched the four other people in my group eat their meals. Then they watched me eat. Great celebration. Management&amp;#39;s idea of compensation: a free slice of cheesecake. Not in a rush to go back.", "rating": 1, "date": "12/14/2013"}, {"text": "I went to Short Hills Mall to go to an Apple Store but the wait for my appointment was 1.5 hours long.  My husband and I decided that we can go to Cheesecake Factory and eat in. It was this past Monday night, Dec 5th and the place barely had any people and we got seated immediately.  My 3 year old had chicken fingers and mashed potato (chicken was a bit over cooked and chewy); Hubby had grilled salmon with mashed potato and broccoli crown (salmon a bit undercooked, no seasoning; broccoli well cooked and fresh); I had Steak Hibachi with mashed potatoes and mushroom. (That one was good and flavorful but the server did not bring the vegetable tempura that was supposed to come with it.) When I asked for it, she didn&amp;#39;t even know if it came with it and later on said that she will ask the cook to make it. No surprise, we were already done eating and she came with a small sausedish with greasy fried beans??? That didn&amp;#39;t at all resemble like a tempura.  We asked for two different kinds of tea, when my husband and I tasted each other&amp;#39;s tea, they were the same. I asked if it&amp;#39;s the green tea iced tea for me, she said &amp;#34;Yes.&amp;#34;  We also ordered a dish which is grilled chicken and vegetables &amp;#34;ToGo&amp;#34; THE SAME TIME we placed our seat in order...IT WAS NOT ready for SUCH A LONG TIME. The buswoman had cleared our table and I went to the ladies room, my three year old was already miserable, NO ONE CAME. The server told us our take out order was ready before we paid, but the stores were already closing. Apple texted me so many times for my appointment but I couldn&amp;#39;t make it because OUR FOOD took so long. The mall closed. I kept asking for a manager but no manager showed.  A receptionist came and told me that the server is standing by the kitchen waiting for my food (2 hours?). I paid. I paid my tip because I didn&amp;#39;t want bad karma on me.... but by far, THE WORST CHEESECAKE FACTORY I&amp;#39;ve ever been.", "rating": 1, "date": "12/10/2016"}, {"text": "It&amp;#39;s a fancy diner, if a diner could ever be fancy...<br&gt;I come here for their happy hour.  $5 LITS, mojitos, margaritas and a couple other cocktails.  They have several appetizers for only $5.  I love the breaded Mac n cheese balls, although they are clearly frozen and then fried.  They&amp;#39;re a guilty pleasure!  I am also a fan of the crab goat cheese wontons.  Its a very generous portion for $5.  I also ordered the ahi tar tar.  It was OK, as expected since Cheesecake Factory is neither a seafood nor sushi restaurant.", "rating": 4, "date": "12/9/2014"}, {"text": "I&amp;#39;ve been a very big fan of the cheesecake factory for nearly a decade, if not more. I usually go to the one in Menlo Park mall, but I was in the Short Hills mall area, and was in the mood for cheesecake factory!  Server was exceptionally great for a Saturday night being seated at 7:40pm. Granted, I&amp;#39;m still sitting, waiting for the check, but I haven&amp;#39;t had to wait too long for anything (my bf and I took awhile to figure out what we wanted). Buffalo blasts came out incredibly salty. Not only was the chicken and cheese filling seasoned (not complaining! It was great!) but the flour was heavily salted; adding the Buffalo sauce and blue cheese became very hard to do with all the existing salt. <br&gt;Then we get our main courses: shrimp and sausage pasta, and the Cajun jambalaya pasta with shrimp. The shrimp and sausage pasta dishes was out of this world good! Pasta was a tad bit too al dente for the bf, but it was spot on for me. The Cajun jambalaya, on the other hand, was severely overcooked, had NO sauce/taste, and absolutely not to my recollection, not even close. But I was so hungry, I ate a bunch of it, while waiting for the waiter to pass by. He ended up coming back with extra sauce from the manager of the kitchen and it was everything the dish was missing. My poor waiter, Joseph, was so apologetic when it wasn&amp;#39;t even his fault I felt bad.... I would give this review 5 stars just for Joseph, if I could, but unfortunately the food was sorely substandard. Consistency across meals and dishes in regards to salt and degree of spice is so lacking here.", "rating": 2, "date": "2/4/2017"}, {"text": "If I could give zero stars I would. Terrible terrible take out service managers have no control of their staff.<br&gt;<br&gt;Took me 30 minutes just to get a hold of someone to take my order.", "rating": 1, "date": "6/1/2015"}, {"text": "The food is delicious at The Cheesecake Factory in Short Hills Mall. The major con is that the service is very, very slow, and inattentive. The restaurant is extremely busy and noisy. There are other wonderful restaurants that have the key combination of delicious food and fantastic service.", "rating": 3, "date": "3/29/2017"}, {"text": "You know what you are going to get here, production line food that is bland and has no real thought in it.<br&gt;<br&gt;My advice is to go somewhere that care about the taste of the food that they are serving.<br&gt;<br&gt;At being said. They had a great selection for kids.", "rating": 2, "date": "5/24/2014"}, {"text": "This is one of my favorite restaurants of all time. Yes, the hour-long waits are ridiculous sometimes (the trick is to get in right as they open) but the food and service makes up for any inconvenience waiting might cost you. I always come here to celebrate special events because the menu is so large that there really is something for everyone. I haven&amp;#39;t had a single dish that I dislike. I especially like the roll sampler for appetizer and the chicken bellagio. Their herb crusted salmon filet is also very tender (can you describe fish as tender?) and flavorful. You can&amp;#39;t go wrong with the burgers. Calamari is perfect. I can get over my lactose intolerance for their cheesecakes. Be aware that the portion sizes are astronomical, so don&amp;#39;t hesitate to get the smaller size if given the option.", "rating": 5, "date": "2/20/2017"}, {"text": "ALWAYS leave something out of my to go order. Not necessarily a full item but an ingredient or two in a salad will always be missing or they&amp;#39;ll give me bread and butter when I said no and leave it out when I say yes. Just very inconsistent.", "rating": 2, "date": "11/13/2016"}, {"text": "Can&amp;#39;t beat the happy hour specials here - half off appetizers and drinks from 4-6pm!  Love coming here after a long day at work.", "rating": 5, "date": "10/31/2013"}, {"text": "Love love this Cheesecake Factory compared to the ones I been too stay away from Ridge hill cheese factory terrible service", "rating": 5, "date": "5/2/2014"}, {"text": "Service was terrible. Went there on a Monday afternoon 230 and didn&amp;#39;t leave until 4pm!!!! Everything took forever!!!! No apologies, no check in to see how we were doing. Also the restaurant itself was very hot it had to be at least 80 degrees in there.  I sadly will not go back to this one. I&amp;#39;ll drive further to Menlo Park", "rating": 2, "date": "1/13/2017"}, {"text": "Delicious foods but it takes forever. Be prepared to spend 1.5 hours here, 30min eating and 1 hour just waiting for your order to be taken, the food to be prepared &amp;amp; served to you, and your check to come.<br&gt;<br&gt;I like that they have a &amp;#39;healthy&amp;#39; menu, because all the normal appetizers are fried or made with a ton of mayo/cheese. <br&gt;<br&gt;Portions are large, cheesecake is plentiful. Lots of screaming babies &amp;amp; children.", "rating": 3, "date": "7/26/2013"}, {"text": "Instead of eating at Cheesecake Factory, stay home and eat a few tablespoons of salt. You&amp;#39;ll save money and won&amp;#39;t be consuming as much sodium as most of the entrees.", "rating": 1, "date": "11/24/2015"}, {"text": "Although I generally find chain restaurant food to be decent but underwhelming, the Cheesecake Factory seems to be the exception. I&amp;#39;ve been to several locations over the years, and only today I realized that I&amp;#39;ve never had a bad meal there. Two of my usuals are the Thai Lettuce Wraps (when I want something a little lighter) and the Stuffed Chicken Tortillas (those corn cakes on the side are ah-mazing). Today my boss treated the staff to lunch for Admin. Professional&amp;#39;s Day, and everyone loved their meals. We shared several appetizers: Avocado Egg Rolls (always a favorite; these are ridiculously good), Buffalo Blasts (really good; the portion is huge), the Crab &amp;amp; Artichoke Dip (okay but not great; the flavor was a little lacking), and the Fried Mac n Cheese Balls (I mean it&amp;#39;s fried mac n cheese. what&amp;#39;s not to love?) For my meal, I had the fish tacos with the tempura style fish. I&amp;#39;ve had plenty of fish tacos in my day, and these are pretty exceptional. The cabbage slaw takes it over the top with the right amount of acidity and crunch. The rice and beans on the side were better than average as well. I ordered my cheesecake to go because I was beyond stuffed at this point. I had the Lemon Raspberry Cream Cheesecake, and I&amp;#39;d definitely recommend it (as long as you&amp;#39;re not one of those if it&amp;#39;s not chocolate it&amp;#39;s not dessert kind of people). It was the perfect balance of sweet and tart, and the ladyfingers added an extra textural element which I thoroughly enjoyed. All in all, an amazing lunch and the leftovers made for a delicious dinner.", "rating": 4, "date": "4/26/2016"}, {"text": "Went for dinner on a Thursday night it was pretty busy we were told that it was about a 15min wait we patiently sat and waited. After about 20 min the buzzer went off we were escorted to a tight table between other patrons we nicely asked for a booth so we could have our conversation in private they obliged and put us in a booth they gave us our menus and left, after 5 min a manger or hostess came over and told us that we could not sit there because this table was promised to someone else???? After being sat we were now told we had to wait an additional 20min if we wanted a booth! Really we left and will never be back to a Cheesecake Factory restaurant ever again!!!", "rating": 1, "date": "8/7/2015"}, {"text": "What can I say? I absolutely love this place. I mean, it&amp;#39;s a chain, right? How different can they be? Well, not so different afterall.  But the location is good, right at the mall, and opposite one of my favorite hotels(Hilton), so all in all I&amp;#39;d say it&amp;#39;s a good place. Been here twice already, and I&amp;#39;m sure that it&amp;#39;s not my last!", "rating": 5, "date": "11/1/2013"}, {"text": "For its Happy Hour and the chicken potstickers on that menu - a cheap, cheerful and tasty time !", "rating": 4, "date": "11/22/2013"}, {"text": "Finally! Cheesecake Factory has arrived at the Short Hills Mall, what took you so long? You can&amp;#39;t beat the menu, but you will need to be patient.  Just  like every other Cheesecake Factory, you will need to wait, and that is just life at the Cheesecake Factory. Sade our server was happy, attentive and quite knowledgeable.  The meal of course was terrific.  They offer complimentary valet service when validated so take advantage of it.", "rating": 5, "date": "9/11/2011"}, {"text": "I cannot believe I am writing such a bad review for this restaurant as it used to be one of my favorites. I recently brought a good friend of mine here since it was his first time and I was super excited to introduce him to all the wonderful options. He ordered a Mai Thai drink to start off and noticed it was way too sweet compared to my passionfruit mojito. While drinking it, he noticed something floating inside and there was a mosquito at the bottom of his drink! We called the waitress and asked to talk to the manager immediately. The manager came out and apologized and said he wouldn&amp;#39;t charge us for the drink and if he wanted another but it was such a disgusting experience he just asked for water. He already drank almost half of his drink! I was really surprised that the only thing the manager offered was another drink. At this point, we were turned off but already ordered our food. The waitress messed my order up giving me more food for a higher price and my friend went back there to talk to the manager again about his unpleasant experience.  The manager offered to take two items off the receipt but it was the drink and my miscalculated meal. The people next to us were watching in dismay and said they would never go there again and my friend told me that was his last time as well. I am disappointed for such a great brand name restaurant to be empathetic and mindful to the customer experience and cleanliness. I would not go there again and advise you to do the same.", "rating": 1, "date": "9/4/2017"}, {"text": "The waiter Issac was AMAZING ! He gets 5 stars all on his own. The food we needed salt and pepper it was very bland. I got the combo plate with shrimp scampi and herb salmon. It&amp;#39;s not mentioned that with the shrimp scampi there&amp;#39;s no angel hair noodles when it&amp;#39;s on the combo plate. But, my complaint would be the manager Paul. We were told after the fact that the bar had closed and that&amp;#39;s when the services ended. So we requested to speak to the manager -- no harm done to ask, the worst he could say was no and we would understand -- but no, instead he made a comment &amp;#34; We wouldn&amp;#39;t just sale you a bottle even if the bar was open&amp;#34; -- we wanted champagne for my bestfriend- it&amp;#39;s her 26th birthday. We were very offended when he said &amp;#34;bottle&amp;#34; as if we wanted Ciroc or any other type of alcohol. Immediately we just said ok thank you and now I&amp;#39;m here making a review. I would not recommend this place to anyone and I will call and make a complaint about the manager.", "rating": 1, "date": "7/31/2016"}, {"text": "The food is consistent with the rest of the chain, predictable and plentiful. The wait staff seems to be in perpetual training mode and not at all clear about menu choices and preparation- yes it&amp;#39;s a very large menu. What frosts me the most is that after 3 visits it&amp;#39;s been the same, wait time 15-20 minutes stated by hostess, actually 35-40 minutes. Complaint to manager was met with an apology and excuse that hostess staff was understaffed, does that make sense??????", "rating": 2, "date": "7/18/2013"}, {"text": "Everything is pleasantly perfect, expect the fact that it is sooooo crowded... We arrived at 6 pm, and have our dinner at 8.30 pm.... However, the dishes are amazing that I believe I can forgive that....LOL", "rating": 4, "date": "8/25/2013"}, {"text": "Terrible experience - poor food quality, high price, slow service. Returned dish twice. Manager never came.", "rating": 1, "date": "11/5/2015"}, {"text": "I was there on a Sunday night. Almost 6:00PM. The place was packed. I was trying to place a carry out order. I was standing by the counter for almost ten minutes. No one would like to come over to check on me. A waitress saw me at least six times without saying a word. And a waiter passed a order to the customer in front of me and run away right away. He looked like he was afraid to talk to me. In this situation I left without any other choice.", "rating": 1, "date": "1/17/2016"}, {"text": "Great service and great food. Awesome atmosphere, not too dark not too bright. Service was great and I&amp;#39;d like to point out outstanding service of a young shnazzy good looking, sexy beast of a busboy Sam F who attended to my frequent request :)", "rating": 5, "date": "4/6/2016"}, {"text": "Ordered a medium well burger and got it extra well done (ie burnt and bitter from the char) and the patty falling apart. Sent it back for a medium and it was still more than well done and still bitter. I was just craving a decent burger after wasting an hour at lunch I didn&amp;#39;t get one.", "rating": 1, "date": "7/3/2015"}, {"text": "The first time I came here with my father, I thought the service was just okay. They were friendly, but the service lagged. We never got our complimentary bread, which is supposed to come with every meal at Cheescake. Food was superb though. <br&gt;<br&gt;Now the second time I came with my father, we had an amazing waitress who catered to our every need. She was kind and attentive and it&amp;#39;s unfortunate I was not able to catch her name. Food was great as always. But then, I forgot the necklace I purchased earlier in the day at the mall and didn&amp;#39;t realize until 12am during closing hours. I decided to give them a call anyway and luckily was able to get through. They were able to find my necklace, kept it safe after 10+ hours of not realizing I lost it thanks to Stephanie.  Even though the food is great, the service is as well. That&amp;#39;s why they get the 5 stars!", "rating": 5, "date": "8/23/2013"}, {"text": "This was our second visit to this Cheesecake Factory.  The service as very slow. They got my order wrong, and the coffee was so horrible that it needed two sugars to make it drinkable.", "rating": 2, "date": "8/22/2015"}, {"text": "What can I say? Its the cheesecake factory. Awesome service and great cheesecake and of course large portions.. So come hungry or be ready to take left-overs home to enjoy later..", "rating": 4, "date": "12/4/2012"}, {"text": "Not a fan!  Have tried twice and both times our food was not that good.  Really wanted a better place to eat at the mall.  Also, it really took way too long to get served.", "rating": 2, "date": "8/13/2012"}, {"text": "Happy Hour rocks at this place! Service and food were very good. Portions are quite large, so come hungry.", "rating": 4, "date": "6/13/2013"}, {"text": "Large portions of horrid, processed food served in a loud, crowded space inside a shopping mall. Basically, the perfect vision of Hell.", "rating": 1, "date": "5/25/2012"}, {"text": "The worst experience ever I was there yestrday with my wife and friends we got a table in about 10 min service was decent the waitress recommended there special Thai crusted salmon so I decided to try it    What a big mistake when I got home I had a special night of throwing up and stomach pain all night never again will I be eating in Cheesecake Factory", "rating": 1, "date": "9/8/2013"}, {"text": "We had a lunchtime party of 9.  Called at 11:00 that morning to have them prepare an adequate table. We arrived at 12:05 and the table was not ready.  Once seated it took over 15 min for a waiter to come &amp;amp; place bread &amp;amp; take our orders. We advised we are on an hour lunch break.  Our orders were salads and chicken lettuce wraps.  Our food did not come to our table until 60 minutes had gone by.  At that point, we had to hand our dishes back to the waiter and request all 8 dishes (which should have been 9) be taken back to the kitchen and wrapped to go.  One of our party&amp;#39;s order was inadvertently not placed by the waiter so she walked away hungry with no lunch.  The waiter did politely fess up &amp;amp; apologize and so, we understand that kinda stuff can happen with such a large group (really?) at lunchtime.  But also,  the food was mediocre at best.  Salads are simply romaine &amp;amp; iceberg with a few tiny strips of cold wet chicken.  Salad dressing was a heavy, sweet, thick consistency akin to a no name brand store bought bottled dressing.  No one in our party will visit this chain again.", "rating": 1, "date": "7/13/2017"}, {"text": "Usually I&amp;#39;m a big Cheesecake Factory fan, like the Willowbrook Mall location 1000 times better! I&amp;#39;ve tried the Shorts Hills Mall location several times and each time they have been worse. At first i thought because they just opened up and getting used to things, but nope. There service and food have gone totally down hill. The last time i went with my wife and son and both me and my wife got sick! Would NOT recommend!", "rating": 1, "date": "7/5/2012"}, {"text": "It took 20 minutes just to get someone on the phone so I can place my order, then they said to come in 20 minutes to pick it up. When I was there, it took an extra 30 minutes just to bag it and find which one was mine. I double checked with one of the staff to make sure my order was right before leaving and she  didn&amp;#39;t look but insisted that it was. When I left, i was sadly disappointed to see that it was not what I ordered.", "rating": 2, "date": "12/3/2015"}, {"text": "I did not like the Cheesecake Factory and don&amp;#39;t understand what attracts so many to wait so long for so much food with so little taste. Maybe it is the &amp;#34;family friendly&amp;#34; atmosphere where all the children appear to be having sugar rushes while their adult minders ignore their banging on the tables with their utensils and screaming at each other. Service is inconsistent. The food was fair but you can do a little better for a little less at a local diner.", "rating": 1, "date": "7/22/2012"}, {"text": "It serves the purpose.  Good consistent food.  The portions are large and the prices are good.  I&amp;#39;ve been twice.  Once for dinner in the summer and once for lunch in the fall.  It&amp;#39;s just what I want when I am meeting a girl friend for lunch at the mall.  The drinks and dessert look great but I generally don&amp;#39;t have either at lunch.  The bread could use some improvement.", "rating": 3, "date": "10/9/2012"}, {"text": "Reason for the one star -- the service and management is HORRIBLE! Just had one if the worst dining experiences and it wasn&amp;#39;t because of the food. 20 minutes without a greeting, 15 minutes to get drinks, waiter not knowing the menu... And worst... Obviously looking around and trying to get someone&amp;#39;s attention and not one person lifted an eyelash. Where was the manager or staff? I wouldn&amp;#39;t be this disappointed if a similar situation hadn&amp;#39;t occurred 2 weeks prior. I will not be going back. My advice- hire accountable staff, train them properly and be an aware and proactive manager. The level of service had decreased significantly since it opened at short hills. This is coming from someone who was in the service industry for years, I have beyond patience and understanding, so you can tell how upsetting this dining experience has made me.", "rating": 1, "date": "8/4/2014"}, {"text": "Short Hills Mall location - Food was good but I agree with the other reviews on here and on Facebook ... the service is terrible.  Our waiter took forever to greet us, after served us he never came back to check on us, he finally came with the check and took it while he had a pile of dirty dishes from another table in his hands.  If you&amp;#39;re looking for decent food and don&amp;#39;t care about slow/absent service than the Cheese Cake Factory at Short Hills is for you.", "rating": 2, "date": "7/14/2014"}, {"text": "All Hope Abandon, Ye Who Enter Here...<br&gt;<br&gt;We found ourselves at this Cheesecake Factory on a recent Sunday afternoon, at the suggestion of some friends who desperately wanted to share with us the fatty, poor quality food and poor service for which this restaurant excels. As others have pointed out, this place is always packed and the customer is the one that suffers.<br&gt;<br&gt;We were seated promptly, for which I give the hostess credit, but then it felt like forever before a) we could order b) we got our drinks c) we got our meals. It must have been an hour between the initial hello from our waiter (who, strangely was handling tables on two sides of the restaurant!) to actually being able to eat anything. <br&gt;<br&gt;And what a disappointment when the food finally did arrive. Look, I know it&amp;#39;s chain food and I shouldn&amp;#39;t have expected much. I figured I&amp;#39;d play it safe with a salad, and it was a good choice - except the salad was the size of a large mixing bowl. That&amp;#39;s not healthy. <br&gt;<br&gt;One of our friends mistakenly ordered the chicken and biscuits, and it was the single most disgusting plate I&amp;#39;ve ever seen. Frozen chicken breast swallowed-up by mountains of mashed potatoes and soggy, rubbery biscuits. Ick!<br&gt;<br&gt;Somehow, we accomplished to leave a little room for dessert. Each ordered a different cheesecake, hoping to share a bite or two. Lo and behold, only two arrived. It took a good 10 minutes to flag down our waiter to inform him the food had gone missing. He apologized profusely, and was very apologetic about it, but it took another 10 minutes before another server brought over the missing items. How can that happen? All they needed to do was cut two slices of cake and bring them to our table. It&amp;#39;s a 30-second process. And the name of the restaurant would make you think they have the whole &amp;#34;serving cheesecake&amp;#34; thing down to a science.<br&gt;<br&gt;Of course, in the interim, the manager came by to offer a half-hearted &amp;#34;so sorry, we&amp;#39;re really busy&amp;#34; apology and walk away before we could say anything. That was perhaps the most disconcerting part. Rather than make things right, he went through the motions and left before knowing the situation had been remedied. Bad, bad customer service.<br&gt;<br&gt;In all honestly, the cheesecake really wasn&amp;#39;t very good. It was obvious it had been made someplace else, put on ice for days, and stored in a very cold refrigerator to prevent spoilage. This wasn&amp;#39;t the kind of cheesecake you can get at Junior&amp;#39;s or any number of places in the NY area famous for that dessert.  And if you can&amp;#39;t get your signature item right, well, you know where this is going...<br&gt;<br&gt;By the time we left, a simple afternoon meal had turned into a two hour ordeal. It may not be hell, but it certainly was not a pleasant experience. There&amp;#39;s a very good diner just around the corner. You&amp;#39;d be better served going there instead.", "rating": 2, "date": "6/4/2012"}, {"text": "This place is what you&amp;#39;d expect from a typical Cheesecake Factory (or similar) chain. Think-a step above Applebees/Fridays (IMO). This location is always busy and the service is usually fine, nothing spectacular-I&amp;#39;ve worked in restaurants before so I can understand mediocore service during the dinner rush. The menu is absolutely insane (its spiral bound like a book) and I never end up liking what I ordered because there are so many options for meals. The entrees aren&amp;#39;t worth gushing over,  but the avocado spring rolls are a great appetizer and obviously the dessert is where it&amp;#39;s at-you pretty much need to order cheesecake when you&amp;#39;re here. When it comes to CF, keep your expectations medium to low so you are even more satisfied when you&amp;#39;re digging in to your peanut butter choc. cheesecake!", "rating": 3, "date": "8/15/2015"}, {"text": "My guest and I were reluctant to wait 1.5 hrs at 7pm on a Thurs. Come on already. Needless to say we decided to head to the bar for a drink. It was mobbed as well. To be expected. When all of a sudden a light came down from above and rows of people began to part as if Moses was in control. There 5 feet ahead was a couple leaving a table that was first come first serve. Like a linebacker I pounced on the table as is it was a quarterback. Success!!!  So the wait was under 3 mins tech but we got lucky. Ok well you get the idea. So when we finally settled in to several looks of jealous couples, we waited and waited finally someone came to take our order, for drinks. Once that was complete, it was time to review the book of food. Nearly the size of a phone book. So much to choose from. Burgers, pasta, chicken, apps, so much to choose from. When we finally received out drinks, which was a while, we finally put in an app order. Nachos with chicken. The chicken didn&amp;#39;t taste fresh. After a couple of tries I picked of the rest of the chips I ate. They were skimpy on the cheese as well. For a meal my guest had the ahi tuna salad which seemed to disappoint. I had the Cuban and I really regretted doing so. It tasted old and non fresh. So as far a meal, even though there is a large selection I have always left CF disappointed until ,that is, dessert. Again you get a separate menu with a laundry list of cheesecakes. Too many to even mention. All tasting better than the other. I opted for the tiramisu ck. I rarely am disappointed with dessert but this ck tasted like freezer burn. Ugh! The entire experience from the service to the quality of food was very frustrating. Although the waiter was nice his absence and prolonged disappearing acts was unacceptable. The food is overpriced. Their cks are their only saving grace and that was a letdown. Would I go back, good question. Be prepared for a long wait all the time.", "rating": 2, "date": "12/30/2011"}, {"text": "What kind of company has a name like The Cheesecake Factory and they don&amp;#39;t even make the cheesecake themselves, when the waitress asked me if I liked the cheesecake I asked her if it was fresh, I could tell it wasn&amp;#39;t freshly made but rather a frozen pre made store bought type cheesecake.  She told me they do not make their own cheesecakes.  What a shame!!  They should change their name.  Also  they have an enormous menu but no organic options not even one.  Restaurants lately have been adding organic options to their menus due to the GMO problem in this country with the food.  When or if they offer organic options to their huge menu then I will come back but not until then.", "rating": 2, "date": "8/5/2015"}, {"text": "So cheesecake factory the food is always amazing. But omg the service is the worst. We heard severs arguing bc they didnt wanna take us. We were two black men hungry n looking to drink. Now you get y they didnt want us. But the servers arguing  bout taking us were also black . He  came over n said yall ready. He gave  us little to no interaction unless i made eye contact. I was so mad that i still got my snicker cheesecake togo, which was delicious, but would have been to irrate to speak with a manager. People come out bc they have a crap day n when yu paying for something n wanna be tipped on it than take pride.  My friend payed the bill n i told him not to leave anything bc service sucked but good thing we have Hackensack n edison. I went there n there service games is on point.  Only given a three bc food again was good..", "rating": 3, "date": "3/22/2015"}, {"text": "I had the Herb Crusted Salmon. It was cooked perfectly with a lemon butter sauce that went well with the asparagus.", "rating": 4, "date": "8/14/2012"}, {"text": "You can never go wrong with the Cheesecake Factory! Always a favorite and never disappoints no matter which location I go to.", "rating": 5, "date": "4/10/2015"}, {"text": "I love the decor of the place.  Hostess was very friendly.  The front desk seem a little unorganized.  My food was not satisfactory.  I had grill pork chops with mash potatoes and spinach.  My pork chops was ok.  But the mash potatoes had too much pepper in it and the spinach was wilted, not cook leaves of spinach with white spots.  Both sides tasted terrible.  I brought it to my waiter&amp;#39;s attention and they did make another batch of spinach for me to go and it also was not done properly.  The waiter did not ask me if everything was ok or nothing before I left.    I was very disappointed on the service that night.  Next time I will not have dinner.  Just dessert and a drink.", "rating": 2, "date": "7/13/2012"}, {"text": "I went to this location for the first time today. The food was very good, the services friendly and fast. The service was much quicker than at the Wayne location although the food is the same.", "rating": 4, "date": "11/16/2012"}, {"text": "This was my first time to a Cheesecake Factory.  I thought the food was great! (which gets 5 stars) But the host table, wait service, and manager needs an overhaul.  This restaurant needs to start over on the staff.", "rating": 1, "date": "1/20/2012"}, {"text": "I&amp;#39;m gonna go ahead and admit I&amp;#39;m an employee here, but that doesn&amp;#39;t change that I looooove the food here, and knowing the trouble that servers go through to make sure the guests are happy, I doubt you&amp;#39;re gonna get better service many other places. Just know that although we have healthy options on our menu, I don&amp;#39;t think those options are our tastiest. I think the best cheesecake experience will be had when you kinda let yourself go and really indulge. That&amp;#39;s what the huge menu and all our waiter training is all about: giving you that one meal you reeeeaaally really wanted and making sure it&amp;#39;s perfect. If you go in restricting yourself and saying &amp;#34;I can&amp;#39;t eat what I want to,&amp;#34; then you probably won&amp;#39;t end up with the best food we could give you. Above all things, save room for cheesecake :-)", "rating": 5, "date": "8/9/2011"}, {"text": "Horrible service, had to eat our appetizers and bread without silverware or napkins after asking for repeatedly.  Waited 20 minutes just to get water and be acknowledged, 50 minutes in, still no food...later talked to the manager about our issues, didn&amp;#39;t even say sorry or do anything to resolve the situation.  Had to flag down other waiters and waitresses to get dessert and our bill paid.  2 hours at the table, rediculous!", "rating": 1, "date": "9/6/2011"}, {"text": "As always The Chessecake Factory delivers. Great atmosphere, great menu, great food and always a great time. There is nothing new here from any other location. They use the same great menu (where everything is a specialty) and the staff is fantastic. Yes its in a mall, but thats the only difference to it all. Might make it a bit harder to find parking but otherwise no drawback there. My only complaint is that for a Cheesecake Factory, its a bit small. We&amp;#39;ll definitely be going back as we&amp;#39;re very happy to have one move this close to us. Great addition to the area.", "rating": 4, "date": "12/12/2011"}, {"text": "we love cheesecake factory for the menu, and would get this once a week if we werent so frustrated by the management at short hills.  this particular location is very poorly managed.  we&amp;#39;ve gone out as a family several times here and always encounter lackluster service.  dont bother even trying to do takeout at this place.", "rating": 2, "date": "11/8/2015"}, {"text": "Can&amp;#39;t wait to check out the new gluten free menu that came out or is coming out. In the meantime, the staff was very helpful.  Service was great.  The place is so loud....but they always are.  BUSY BUSY BUSY, as expected.  If they have a gluten free cheesecake, I&amp;#39;l move in.", "rating": 4, "date": "12/16/2011"}, {"text": "I was trying to go to this place for the longest time because it just looks so nice inside. It looks like it would be so upscale, but the prices are totally manageable especially for short hills mall. I like the tomato basil pasta. I love all pasta but I liked the sauce they put on it. I will be going back again to try more stuff out.", "rating": 4, "date": "4/6/2014"}, {"text": "Ok, this place takes way to long to get your food. Lines are unbearable and the food is just way too much. Prices are decent but it just isn&amp;#39;t a great place to be. In pretty much every category, there&amp;#39;s a better place around the area.", "rating": 2, "date": "6/6/2012"}, {"text": "Food was very good - tomato basil pasta was light as promised and very tasty. The fettuccine Alfredo was also very good. The cheesecake with strawberries - excellent!  Three stars because the service was horrendous !  We came on Monday at 6 pm - the restaurant was 40% full and had ample waitstaff. Yet we waited 10 minutes to be seated in spite of many open tables and once seated waited 10 minutes for a server to take our order.  My dining partner&amp;#39;s order was wrong - he ordered whole wheat pasta and waited 15 minutes for the correct order. We asked for water when seated and finally flagged a bus boy after 20 mins to get a glass of water.  The waitress was polite but invisible. All in all the hostess and servers left the impression that they didn&amp;#39;t want to bother with us.  Very disappointing.", "rating": 3, "date": "1/21/2014"}, {"text": "We had an awful experience at this restaurant. My family and I went to celebrate my brother&amp;#39;s birthday and it took about 10 minutes of waiting before we got our drink order, which we then were also able to order our entrees since we had so much time to decide. The server apologized and we let that go since it was busy. However, things went downhill after that. Our bread didn&amp;#39;t come until after our entrees had already arrived. During that time, I watched another couple sit down across from us and get their drinks AND bread faster. My father ordered a salad with his burger and the dressing did not come with the salad, so we asked the server to bring it out and by the time she got it to us, everyone was practically done with their meals. Everything had to asked for twice from this server. She seemed to be more attentive with other tables and I don&amp;#39;t understand why we had to go through so much trouble to get anything from her. In addition to this, when we put in our drink orders, I requested lemon slices with all the waters. The lemon slices also did not come until after we were done with our entrees. It was honestly just not an enjoyable experience and I had never been to a restaurant where I have had to request everything twice (or more) before. I will not be going back to this Cheesecake Factory, as I think the service really needs to be improved on.", "rating": 1, "date": "9/11/2015"}, {"text": "I ate at the Short Hills Cheesecake Factory on Aug. 15, 2011.  I wanted to order what they call their specialty drinks.  There were no prices on the menu.  I asked the waitress to check on the price of three different drinks and she came back to me with an answer from the bar that they ranged from $7 to $10.  I told her I did not want to spend $10 and so I needed a definite answer on a pomegranate martini.  I ordered it and she came back and said it was $12. So I just ordered a glass of wine which had the price on the menu.  <br&gt;Why are there no prices on the drink menu? They post food prices, but not drink prices. Is this true in all the Cheesecake Factory restaurants?  Are you deceiving the general public? I will not go back to this restaurant for that reason alone.  In this economy people want to know what they are spending before the bill comes.", "rating": 2, "date": "8/23/2011"}, {"text": "Worst. Cheesecake factory. Ever.<br&gt;<br&gt;let me start by saying my family is big Cheesecake factory fans, but this place sucks.<br&gt;<br&gt;1) The waiter was just bad. So slow we could have cooked the food ourselves. Whenever we asked for something, like the bread which we got after the food arrived (and should we really have to ask for it at all?!), or the beer which we got after the food arrived too...., but didn&amp;#39;t get it, she claimed &amp;#34;it didn&amp;#39;t fit on the tray&amp;#34;. Huh?<br&gt;We waited for the drinks. We waited for the food. We waited for the check. We waited and waited and waited. <br&gt;<br&gt;2) French country salad with approximately one beet, one asparagus and one tiny piece of cheese. Where was the erst? Maybe it didn&amp;#39;t fit on the tray...<br&gt;<br&gt;3) My 3 year old wanted Mac N cheese from the kids menu. When it arrived the top was kind of congealed. I tested it for heat, and it was luke warm, so my son proceeded to eat, but he ate from the middle and SCREAMED from burning his tongue. Seriously - Microwaved Mac N Cheese for kids? What the...<br&gt;We called the manger over who proceeded to explain in a derogatory manner that when cooking mac N Cheese they boil the pasta and cheese. No shit, of course they do. But NO restaurant with any sense serves PIPING HOT FOOD to children. Boil it all you want (or in this case microwave it since it was hot in the middle and cold on the outside) but make sure it is safe fro children before you serve it. The manager kept protesting and really didn&amp;#39;t get it. He offered a free dessert. Really, we should have made a huge scene, but we were frankly to shocked. Again, the manger didn&amp;#39;t understand what was wrong with serving piping hot, microwaved food to small children. He should NOT be working in the food industry and he is lucky our son wasn&amp;#39;t seriously hurt. But he now refuses to eat Mac N Cheese, or pasta, he was so scared from the experience.<br&gt;<br&gt;4) After this seriously disappointing meal we headed to the bathroom. The ladies room smelled of urine and had paper towels on the floor like any old fast food place. Is this supposed to be a Cheesecake Factory?  Really? Disgusting. <br&gt;<br&gt;If I were at Cheesecake Factory HQ I would fire the manger and most of the staff and start over and I would teach those supposedly professional restaurant people how to serve kids food before someone gets hurt. Add some deep cleaning while you are at it...", "rating": 1, "date": "8/13/2013"}, {"text": "It&amp;#39;s tough to review a place so soon after it opens so I normally wait but my experience was so bad I just don&amp;#39;t see it making a difference. <br&gt;First off, this is a largely successful corporation that just did a multimillion $ renovation to bring its restaurant to demanding clientele of the Short Hills Mall. So, why in God&amp;#39;s name do you put two 18year old girls at the host stand to run your place? Two disasters that told us it would be a 20min wait and 50mins later still were not seated. <br&gt;The place is going to be packed as all their places are. So, they need to have someone with some sense at the door. Once seated things really didn&amp;#39;t get any better.<br&gt;Food was mediocre at best. Salads were bland with no dressings. But the one stand out was my Farmhouse burger with pork belly and fried egg. It was Very Good. It did take 45 min between salad and burger to hit the table....<br&gt;The corporate team better bring in the big guns quick or the doors will be closed.I&amp;#39;d say pass on this place for 6 months- <br&gt;On the brightside though, Joe&amp;#39;s will have less of a wait for a while so head over there.", "rating": 1, "date": "7/27/2011"}, {"text": "My husband and I had a very disappointing first visit to the new Cheesecake Factory. First off, the interior is VERY dark and the ceilings are low so it feels crowded and the acoustics make for an extremely noisy dining experience. As is always the case with TCF, the food was great. Unfortunately the food was hugely overshadowed by the ATROCIOUS service. Beyond S-L-O-W!! The server was quite nice, but she would disappear for ages before coming &amp;#34;right back&amp;#34; to take our order or bring us napkins and silverware. We ordered our cheesecake at the end of the &amp;#34;to go&amp;#34; so we could get the heck out of there. She finally took our order and then she disappeared. She didn&amp;#39;t come back. We had to flag down another waiter to take our check and get us our dang cheesecake. It&amp;#39;s so frustrating to feel like you are being held hostage by servers that don&amp;#39;t appear to have any training at all. They are nice enough, but no clue how to properly expedite orders in a timely manner. Only go to The Cheesecake Factory if you have at LEAST a couple of hours to kill.  I think I&amp;#39;ll stick to Au Bon Pain for a quick bite while I&amp;#39;m shopping. Even Joe&amp;#39;s is faster and they are always super slow.", "rating": 2, "date": "11/28/2011"}, {"text": "I&amp;#39;ve been a big Cheesecake factory fan all my life, but this one just doesn&amp;#39;t cut it. I think they went a little too grandiose and overlooked the details. While this location is aesthetically pleasing, unfortunately, it misses the mark where it counts - the food.  I know one shouldn&amp;#39;t expect too much from large chains - but the drinks were just okay and overly priced and the food wasn&amp;#39;t the quality I&amp;#39;ve had in their DC/VA locations (to the point that we cancelled one of our entrees). Also the silverware was dirty and we had to wipe them down before use. Not an experience I&amp;#39;d like to repeat.", "rating": 1, "date": "3/22/2012"}, {"text": "I&amp;#39;m normally a big fan of the Cheesecake Factory and am used to the fact that you typically have to wait.  Maybe it&amp;#39;s because they&amp;#39;ve only recently opened but it seemed last night that they definitely didn&amp;#39;t have their act together.  After the little buzzer lit up, we were told to stand to the side to wait for our table (this was after waiting 15 minutes).  The second wait (to actually be seated) took another 15 minutes.  The set up didn&amp;#39;t make any sense to me and staff really didn&amp;#39;t seem to care.  Once seated, we did like our meal but it seemed like the server had way too much to do and didn&amp;#39;t refill drinks, etc.  Hopefully this is just growing pains!", "rating": 3, "date": "8/10/2011"}, {"text": "I haven&amp;#39;t been to a Cheesecake Factory in a long time and this was the first time I went since going vegan. There was a short wait of a couple of minutes when we go there. Our waitress was Ally/Alexandra. She was the sweetest. I asked her for vegan options and she told me about a pasta dish, then a few minutes later came back to tell me that the pasta has egg in it, but they could replace the pasta with white rice. Perfect. My date (the 12 year old I babysit) ordered the Da Vinci pasta dish. The food came and unfortunately mine came with pasta. I told the guy that it was supposed to be rice, so he retuned it to the kitchen. Ally came over to apologize and so did a manager. He asked if he could get me anything while I waited. A few minutes later my food came out and it was DELICIOUS! I&amp;#39;m glad I went with it instead of a boring salad. I finished the whole thing. It was a lot, but since I don&amp;#39;t eat the cheesecake I figured I could. The kid loved her past and finished half, to leave room for some cheesecake. She had half of her (according to her amazing) red velvet cheesecake. Ally and the manager came ovr again to apologize for the wait before we left. It was a great experience and when I go back, I will try to get a table in Ally&amp;#39;s section.", "rating": 5, "date": "8/10/2011"}, {"text": "Horrific service both dining in and take out. Food is very good, but servers are horrible and slow. It took us 10 minutes for the waiter to acknowledge us and then when he saw us said he would be right back...10 minutes later! Tried to order take out one night so I didn&amp;#39;t have to deal with bad service and was put on hold for over 8 minutes....I used the time to review another menu and hung up!", "rating": 2, "date": "9/18/2011"}, {"text": "I&amp;#39;ve been to my fair share of cheesecake factories, and have always thought it to be  my favorite place, but I have to say my first experience the other night at the Short Hills Mall CCF was my worst experience ever.  I ordered a chicken sandwich and in it, I find and chew on a piece of a broken toothpick in the middle.  It was a club sandwich, so they do stick a toothpick in the middle, but the toothpick I pulled out was whole, so where did this borken piece come from?  How gross.  I lost my appetite thinking about that and that fact that I was spending $13 on a sandwich that had a broken toothpick in it and how dangerous that was.  I told the manager what happened and she looked at me like I was crazy when I said I lost my appetite.  She did not offer me anything else; I&amp;#39;m not even sure she apologized about it.  She just took it away and took it off my bill. Then I order cheesecake to go and when I get home and eat it later that evening, I end up chewing on and finding a thin piece of paper in the cheesecake!!  How utterly disappointing.  My friends and family are not huge fans of the CCF, like I was, but I&amp;#39;m beginning to see why.  Above all else, their prices have gone up drastically in the past few years.", "rating": 1, "date": "4/13/2013"}]}