{"address": ["931 Haddonfield Rd", "Cherry Hill, NJ 08002"], "monthly_reviews": {"2019": [[0, 2.5], [1, 2.5], [2, 2.5], [3, 2.5], [4, 2.5], [5, 2.0], [6, 2.0], [7, 3.0], [8, 3.5], [9, 3.5], [10, 3.5], [11, 3.0]], "2017": [[0, 3.0], [1, 3.0], [2, 3.5], [3, 3.5], [4, 3.0], [5, 3.0], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.5], [11, 4.0]], "2020": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.5], [11, 3.5]], "2018": [[0, 3.0], [1, 2.5], [2, 2.0], [3, 2.5], [4, 2.5], [5, 3.0], [6, 3.5], [7, 2.5], [8, 2.0], [9, 2.5], [10, 3.0], [11, 3.0]], "2021": [[0, 3.0], [1, 3.0]]}, "reviews": [{"text": "Loved it! Great service, and amazing food. The only bad thing was my family and I had to wait an hour and a half for be seated. We ended up waiting an extra 20 minutes because they had the wrong number, which we didn&amp;#39;t know how that happened. Overall, it was really good though.", "rating": 4, "date": "9/10/2020"}, {"text": "Staff were friendly &amp;amp; courteous.  My daughter liked her buffalo wings. My son liked his pizza and spring rolls. My Brussels sprouts were OK, but pretty darn greasy/oily. My shrimp and chicken jambalaya was not good at all. It was prepared with both green pasta and the correct pasta. Not esthetically pleasing in the least!!! The pasta was dry &amp;amp; flavorless. I detected NO tomato sauce or base. The food that I normally order is usually ok. I guess I made a bad pick this visit or the cook was overwhelmed:/", "rating": 2, "date": "8/1/2020"}, {"text": "We ordered on line for curbside pickup at 5:53 pm. Their website is great until you pay; we had a gift card and what a mess during the check out process. We included a 15 percent tip for absolutely nothing; please read on. Going forward I will never prepay; wait until after I get my food, make sure everything is correct, and if a tip is DESERVED/EARNED I will include one!<br&gt;<br&gt;Our curbside order was supposed to be ready at 6:18 pm. We followed procedure and called when we got there and nothing! Went inside and did not receive our food until 07:05 pm. For a restaurant that has seating for dozens of families cannot handle takeout orders. <br&gt;<br&gt;By the time we got our food it was two and half hours later from time we ordered, and look what we got for our money.<br&gt;<br&gt;The food was cold and so<br&gt;<br&gt;The mushroom burger was ordered medium and was way undercooked, raw!<br&gt;<br&gt;One the two chicken sandwiches was not prepared as ordered.<br&gt;<br&gt;The chicken soup was placed in a sandwich container and spilled. You are telling me for $8.50 bowel of would you don&amp;#39;t have the proper container l<br&gt;<br&gt;Unacceptable and disappointing on ever point and every level. Their prices are expensive for what you get. <br&gt;<br&gt;I will be calling the manager next day as I was too angry to call after we got our meal. I expect my money back.<br&gt;<br&gt;This will be our last meal with Cheesecake Factory!", "rating": 1, "date": "5/16/2020"}, {"text": "I have come to this location often and have never had an issue, but I was upset when I came to have dinner at 6:30 and was told that the indoor dining section was closed. I understand covid times, but I was most upset at the deliverance on how I was told about this. I walked in and the hostess and other employees sitting around the area looked at me without saying a word, obviously I was confused. Then one gentleman said &amp;#34;What do you need&amp;#34; then proceeded to say that the indoor dining was closed. I noticed when leaving, there was an older gentleman greeting and informing other guests about the situation, those employees should take after him.", "rating": 3, "date": "1/1/2021"}, {"text": "Terrible! Very disorganized. Placed my order online and said it would be ready in 40 mins.  Even after I arrived to pick up my order i still waited another hour! That&amp;#39;s is 100 mins for chicken fingers, pasta and a Caesar salad that were paid for online.  I understand they were busy but this is unacceptable! And they have every one waiting in the crowded vestibule so they can ask you you name and if you ordered online or by phone- VERY UNSAFE!!!!<br&gt;This was the worst experience I&amp;#39;ve had.  Cheesecake Factory is right down there with Applebee&amp;#39;s <br&gt;I won&amp;#39;t be back!", "rating": 1, "date": "3/28/2020"}, {"text": "I love the Cheesecake Factory because it is what it is.  A massive chain restaurant that has a menu as thick as a textbook and it&amp;#39;s as varied as a library.    You want Italian? Got it.  You want Asian inspired? DONE.  You want southern home cooking.  Yup, that too.   I&amp;#39;ve never had a not delicious meal from TCF, and I&amp;#39;ve tried so many things.  This location seems pretty standard as far as matching the other locations I&amp;#39;ve been too and I&amp;#39;ve been very pleased with everything I&amp;#39;ve gotten.  I even really enjoy getting drinks from here.  Their cocktails are usually pretty tasty and last night I had two of their new Strawberry Blossoms, delicious and worth it.    Funny enough, I typically don&amp;#39;t get cheesecake here but I appreciate that they backup their name with 20+ flavors.   I&amp;#39;m more here for the fried mac and cheeseballs and the drinks.  They also serve a pretty delicious veggie burger, one of my favorites.     This place is as family friendly as you can get when you want to feel like you are going out for a night on the town but really you&amp;#39;re rolling down 1 stop light on 70.", "rating": 4, "date": "12/22/2019"}, {"text": "I came in here to celebrate my father-in-law&amp;#39;s birthday with my sister-in-law who lives a block away. They don&amp;#39;t take reservation, but it was easy to get a table for 4 at 6 pm. It is just very difficult to find a parking spot in this popular shopping plaza. <br&gt;My mother-in-law ordered Fish Taco per my sister-in-law&amp;#39;s recommendation. BAD choice!!<br&gt;W we waited more than 15 min before they served our dinner selections, although the freshly baked bread was delicious. The grilled fish on the Fish Taco was pretty cold. We asked the waitress to fix the problem and dish went back to the kitchen and the same plate came back with no difference. The manager came address this issue after our second complaint.  Another  long waiting, she brought back the new dish that claimed that to be cooked in prefect temperature. Well, it was not much better than the first one. My moth-in-law already lost her appetite <br&gt;They did not charge us the Fish Taco Gabe is a slice of cheesecake to take home. However, I would definitely not recommend you fellow patrons order Fish Taco at all.", "rating": 2, "date": "12/24/2019"}, {"text": "We ordered the Baja chicken tacos and the steak tacos At first I was a little disappointed with the size <br&gt;BUT the entire meal was freaking DELICIOUS <br&gt;I have never experience full joy from a meal before when I&amp;#39;ve ate out <br&gt;I regret nothing on this plate everything was amazing <br&gt;I come from San Diego and live in Maryland I was visiting<br&gt;It&amp;#39;s been a long time since I&amp;#39;ve been able to eat a decent restaurant &amp;amp; order a decent meal this was 500 stars I&amp;#39;m so happy!", "rating": 5, "date": "8/31/2019"}, {"text": "A birthday dinner for two at a favorite restaurant of one. <br&gt;<br&gt;Appetizer were great (Thai lettuce wraps, and sweet corn tamale cakes). <br&gt;<br&gt;Unfortunately one of the birthday celebrants ordered the fish tacos and they were horrible, with that ammonia smell that bad fish has. They were sent back and the BDT shared my spicy cashew chicken (which was just ok).<br&gt;<br&gt;The piece of Dulce De Leche Caramel cheesecake we shared was delicious<br&gt;<br&gt;Usually we are feeling much better about the food when we leave TCF but were dissapointed in this dining experience", "rating": 2, "date": "1/14/2019"}, {"text": "Let me start off by saying I&amp;#39;m a huge cheese factory lover you can&amp;#39;t beat the consistency you get at this place even with the massive menu selection.<br&gt;<br&gt;Which is why , I do this with reluctance (insert tear face emoji ) .. cheesecake you let me down.<br&gt;I love this place so much I decided to order a quick grab to go meal for my toddler and myself after work bc I had no intention on cooking. I order a WELL DONE burger for myself and the chicken sandwich slider kids meal for the kid. By time I get to cheesecake the hostess lets me know my order is just being finished (perfect timing) . <br&gt;<br&gt;I pay for my food and hit the road . Now I have a good 20min drive before I get home depending on the traffic but by time we sat down and said our prayer and went to dig in, I was thoroughly impressed bc the food temperature was still warm enough to not have to reheat ( yay me )<br&gt;<br&gt;Now the kid is digging in and I prepped my burger with all the fixings and slice it down the middle to get the perfect bite and what do I see ... a pink burger and I don&amp;#39;t mean medium well pink ,which I could work with ,I mean damn near raw which  ..... DOGGONIT! the whole point was to not have to do work but now I gotta try to salvage this thing so I had to recook my darn burger . .. it was a sad day for me as I wound up having to preheat the oven , take all my toppings of the darn bun, remove the cheese from the burger , throw it on the cast iron pan and put it in the oven .<br&gt;<br&gt;I will say the burger was so raw that even after slicing it in half and reheating it didn&amp;#39;t dry out too much so when I remade it it was still nearly decent . <br&gt;<br&gt;Also I ordered the red velvet cheesecake slice for desert and for the first time ever the cake portion of it was a dry idk how long that one had been sitting but ,I can say I&amp;#39;ve had most of the cheesecakes they offer here and this has never happened before so maybe it was an off day . <br&gt;<br&gt;So I say all this to say beware of the takeout burgers. Although there&amp;#39;s really no way you can check for that .  attached pictures but they don&amp;#39;t really capture how the cow was still mooing ! :-/", "rating": 4, "date": "8/9/2019"}, {"text": "Door Dash has since refunded the amount of money. That is appreciated. But I&amp;#39;ve heard multiple people say that the Cherry Hill Cheesecake Factory is not clean. Others have had similar experiences.", "rating": 1, "date": "9/4/2020"}, {"text": "Ordered takeout today. The shrimp and angel hair pasta dish was good but they gave me a whole plate of pasta worth about 67 cents and 5 shrimp??? Really? Then had the nerve to charge full price. This is exactly why I rarely order take out from any restaurant during this pandemic. Every restaurant wants you to support them but they cut corners. You can order from Cheesecake Factory if you want to but expect to get ripped off.", "rating": 2, "date": "5/30/2020"}, {"text": "Tried to go to Cheesecake Factory two times now in Cherry Hill.  We had 9 people on a Saturday at 3pm.  We were told they did not take reservations on weekends.  We figured 3 pm was early but not so.<br&gt;<br&gt;Weeks later I tried again with 9 people .  This time at 2 pm. .   Again we were told it would be about 1  <br&gt;1/2 hr wait.  Others were going ahead of us cause they had 4 or less.  They could learn to move tables together.  <br&gt;<br&gt;We went to the Tuscan restaurant (Brio) just across the parking lot both times.  They were great.  Even giving us a private room.", "rating": 2, "date": "4/15/2019"}, {"text": "We ordered take out for our Mother&amp;#39;s Day dinner. I applaud all of the people cooking, fulfilling orders and running the orders out to their customers&amp;#39; cars. The servers delivering orders were under verbal attacks and accosted with frantic and demanding customers. Please people,  be patient and understanding of folks who are working in front lines trying their best to service you under these chaotic, frantic, and dangerous times. Tip your server... exercise empathy....please. These people probably need these jobs to survive during this pandemic and failing economy.  We should all show compassion during these times. Thank you to the cooks and service people at The Cheesecake Factory. I applaud you! The food was good too!", "rating": 4, "date": "5/11/2020"}, {"text": "I am torn weather to leave my review as 4 stars or drop at the three stars. when I checked in here and I saw that the restaurant was three stars I was confused because normally this place is pretty good. Our server was great we had no issues with her and the cheesecake is always top-notch. The dinners were okay guess you expect more for the price you&amp;#39;re paying. The Thai chicken lettuce wraps where the highlight. They are great appetizer. I guess I can see why the ratings dropped a bit is the food while good is not great. Also the kitchen seems to bog down and slow down when they are very crowded. I left my reading at a 4, because the appetizers and cheesecake were great as well as the service. Third time will be the charm to see if it drops. people nowadays are looking for a lot more bang for the buck, and after having an appetizer two meals and two pieces of cheesecake, and it&amp;#39;s $90...", "rating": 4, "date": "9/2/2019"}, {"text": "Have eaten here a few times and Everytime has been excellent. Restaurant is clean and well maintained including the bathrooms. Service is snappy and the staff is knowledgeable about the menu. This place is not cheap by any means and lunch will run you around $70-$80 with an app or dessert. I ordered fettuccini Alfredo and it was excellent! My wife had the 4 cheese pasta and she said it was very good. Apps are extremely plentiful as well as the dishes, they come in 1/2 and full size. Of course we had to try some cheesecake so I got the Godiva chocolate and my wife got the banana cream and both were excellent, $10 each but excellent. If your looking for something with good high end food but not quite the high end atmosphere this is the place to go.", "rating": 5, "date": "3/4/2019"}, {"text": "love love love this place!  very good food. <br&gt;my favorite cheese cake is reese&amp;#39;s peanut butter chocolate cake cheesecake!!", "rating": 5, "date": "6/28/2020"}, {"text": "Had the carne asada steak medallions then the apple crisp.  All thumbs up for carne asada perfectly cooked in a chipotle sauce with onions and peppers.  Paired with white--yums!!<br&gt;Dessert was warm apple crisp---not bad but not great--just ok.  I didn&amp;#39;t like the oats on it.  Entree left me busting at the seams. Nice portion.  Great friendly wait staff.  My sister had a decadent chocolate dessert.", "rating": 5, "date": "4/21/2018"}, {"text": "Came for dinner. Had thai chicken wraps. It was so good! I loved the sauces that went with it!! My favorite is the green one! It is definitely enough as an entree. I also had the red velvet cheesecake which was super yummy. It is my favorite! Service was good! Very nice. Had a good time.", "rating": 4, "date": "9/25/2019"}, {"text": "Beside the Philly location, I love this location too!!! However, you have to time everything or else you&amp;#39;ll end up with a wait time. The cheeseburger spring rolls are so delicious!! Be careful biting into them because they&amp;#39;re so hot from frying that all the oil is still so sizzly on the inside. The sauce that comes with the spring rolls seems to me like a mix of ketchup, maybe mayo? I don&amp;#39;t really know what it is, but I love it. I always get the Farfalle with chicken and roasted garlic. It is AMAZING and filled with so many flavors!!! You will not be disappointed if you want something bold. My boyfriend got the tomato basil pasta. He literally orders this all the time. It&amp;#39;s his favorite. If you&amp;#39;re craving chocolate, get the Linda&amp;#39;s fudge cake. It is SO YUMMY AND RICH. It totally hits the chocolate craving. <br&gt;<br&gt;It&amp;#39;s quite loud inside and I&amp;#39;m not a big fan of the tables for 2. I feel that I&amp;#39;m sitting so close next to the person next to me. This is not a 5 star review because I thought cleanliness was a bit poor and we went around 1 pm this past Saturday. Menus were EXTREMELY greasy. I was quite grossed out with it. Table and seats had crumbs atop when we were seated.", "rating": 4, "date": "11/1/2018"}, {"text": "The service was great and everyone was pleasant. I sat at a high tower and was greeted immediately. The The waitress was pleasant prompt with serving drinks water and suggestions I ordered the classic jambalaya which I&amp;#39;ve always got gotten. I&amp;#39;ve been going to cheesecake factory since the early 90s when they were not in Pennsylvania and New Jersey area. The first one I&amp;#39;ve ever experience was in Las Vegas. The jambalaya was on point and was served hot.", "rating": 5, "date": "9/7/2019"}, {"text": "The food is always GOOD here. My boyfriend and I usually go here in the daytime when they are less busy. So, we don&amp;#39;t usually have to wait for a table which is great!", "rating": 5, "date": "10/1/2019"}, {"text": "Best customer service walked in had reservations and was seated in seconds. Food was great and are server was also a10 he quick and New the menu", "rating": 5, "date": "2/11/2020"}, {"text": "After getting shi$$y a$$ service, I now come home hoping to dive into the cheesecake I ordered only to find rotten bananas!!!! Are you kidding me?? Who serves shit like this to customers?? I&amp;#39;m pissed!!! If I didn&amp;#39;t live over 20 minutes away, I&amp;#39;d take it right back. My kids have been looking forward to this cheesecake all evening after waiting 30 minutes for our food :(   Completely pissed and highly annoyed. I won&amp;#39;t be going back. Not to this location.", "rating": 1, "date": "5/18/2019"}, {"text": "Went in on 2/17/20 for happy hour. Was told they didn&amp;#39;t do happy hour on a holiday, even though there was a giant sign in the lobby advertising it. The bartender was very rude and abrupt. I attempted to contact them on their website and no response. Terrible customer service, will not be going back and will tell everyone I know. AVOID, so many other nice places in Cherry Hill with better customer service.", "rating": 1, "date": "2/20/2020"}, {"text": "I am a huge fan of the Cheesecake Factory. It&amp;#39;s one of the few chains I will eat at. We were here this past Thursday for an early dinner. I like this location.<br&gt;<br&gt;The server was extremely pleasant and helpful. We started with the crab cakes and the mozzarella wedges. The crab cakes were delicious and packed with crab meat, I actually bit into a shell. The mozzarella was just as good. Very fresh and not your typical fried junk.<br&gt;<br&gt;For entrees we went with the chipotle chicken sandwich and the turkey burger. Often turkey burgers are dry, not this one. The burger was amazing! Moist and flavorful, I did seek a bit of spice. The chicken sandwich was also very good but it was very very large and heavy. The chicken was a bit on the greasy side but hey it&amp;#39;s fried chicken. The buns on both were perfectly toasted. We opted for salad instead of fries. The citrus dressing is to die for!  We will be back! 4 stars..", "rating": 4, "date": "6/17/2017"}, {"text": "This is the best Cheesecake Factory location ever! The service is fast and friendly. The food is always fantastic and I truly believe it&amp;#39;s because it&amp;#39;s very well managed.  I don&amp;#39;t think people realize how difficult it is to run a business like this restaurant, with all the moving parts needed to serve people and prep work that needs to get done before customers actually come in. Kudos to the manager, for keeping everything great and consistently great! That&amp;#39;s the tough part right there, consistently great!", "rating": 5, "date": "2/8/2020"}, {"text": "The wait can be brutal so make sure you&amp;#39;re not starving. On any given weekend I&amp;#39;ve had to wait upwards of 40 minutes to an hour. The menu options are so vast that even after a dozen visits I&amp;#39;ve only discovered the tip of the iceberg. An all time favorite of mine is the Thai Chicken Lettuce wraps. It&amp;#39;s listed under an appetizer but it&amp;#39;s large enough for an entree. Every meal starts with delicious freshly baked bread and creamy butter; the hallmark of any higher end restaurant. I&amp;#39;ve tried and loved the chicken Marsala, the tossed green salad is superb and I&amp;#39;ve savored a number of their awesome and decadent dessert. Trust me when I say their food is well worth the wait!!! <br&gt;<br&gt;Ps the service is consistently good, manager is quick to get involved in any issues with your meal.", "rating": 4, "date": "4/30/2018"}, {"text": "The food is very good but VERY pricey for what you get. The service tends to be slow, but friendly and efficient. But let&amp;#39;s face it, you come here for the cheesecake... and it is fantastic.", "rating": 4, "date": "2/14/2020"}, {"text": "Just sat down to a dinner which took about 2 hours, in which, it felt like our waiter forgot us for about an hour. Dinner itself was good, but then tried to order a slice of cheesecake to be eaten in the restaurant. After another 10-15 minute wait, we received our cheesecake Except the cheesecake came out FROZEN! The waiter, when informed it was frozen, showed his manager, who DID ABSOLUTELY NOTHING! He did not come over and even say &amp;#34;sorry about that&amp;#34;.  We were not looking for it to be taken off the bill or anything but yet for the manager to not say anything is very, very disappointing. <br&gt;Extremely poor service from top to bottom tonight.", "rating": 1, "date": "3/22/2019"}, {"text": "I don&amp;#39;t want to leave this but there&amp;#39;s nothing I can do about the mistakes that were made on my order and this upsets me ALOT. <br&gt;<br&gt;I just ordered from this restaurant via DoorDash: I ordered the Nashville nuggets and factory burrito. Nuggets (WHICH ARE SPICY) came with no sauce and factory burrito (WHICH IS SPICY!) came with no avocado, sour cream OR lettuce to cool the spice! I have to admit that I&amp;#39;m mad af. I don&amp;#39;t want to be THAT customer but I am. Cheesecake Factory isn&amp;#39;t cheap; I can at least get the condiments that come with the fuckin food! <br&gt;<br&gt;And DoorDash is no help, as usual. Our money is a joke to these damn companies! Fuck y&amp;#39;all.", "rating": 1, "date": "5/4/2019"}, {"text": "2 stars because I still love Cheesecake Factory as a whole, but this location just misses the mark every time. The service is so horrendous. Like most parents with inpatient young children, I was sure to order my toddlers entree immediately upon being greeted so she could eat and not fuss. When she came back with our drinks, we placed our appetizer orders. Bread came shortly after... but then 25 minutes of NOTHING. This was 5:20pm on a Thursday. We were seated immediately upon arriving and it was no where near what a normal busy night at Cheesecake Factory looks like, so it was even more bizarre that our server ghosted us for 25 minutes before seeing our appetizers. No update, no checking on us, nothing. And definitely no sign of getting my daughters kids meal. Finally a food runner brings our appetizers out with the standard &amp;#34;be careful the plates are hot&amp;#34; warning... aka the food has been ready for quite some time now and has been sitting under the food warmers. My biggest restaurant pet peeve... probably only because I served for years and know that a hot plate doesn&amp;#39;t mean freshly made food. I had to again ask about my daughters food which was then brought with the same &amp;#34;hot plate&amp;#34; warning. We finish our appetizers quickly and it&amp;#39;s a good 10 minutes before anyone comes to clear the plates. Never got checked in on by our server either. At this point my husband is trying to talk me out of even getting dessert because at this rate we feel like we will be sitting here another hour before we see our entrees. Thankfully, entrees came out and food was great, as it always is at CF. Our server comes to check on our entrees and I quickly get in my Cheesecake order to try to expedite the already slow service. The Oreo cheesecake was amazing, as always, and thankfully put me in somewhat of a better mood than the awful service. The other CF locations I&amp;#39;ve frequented in NJ (Lawrenceville and Edison) have always had fantastic service and has always seemed to hold their servers to a high standard. This is not the first poor service experience I&amp;#39;ve had in Cherry Hill, but was the first experience bad enough to review.", "rating": 2, "date": "3/6/2020"}, {"text": "My all time favorite place to go for dinner with the family!! Of course the Thai Lettuce Wrap and the Steak Diane is my fav as well!! Good food for a great price. Drinks are pricey but taste good. Love this location!", "rating": 4, "date": "3/4/2019"}, {"text": "We had a party of 4 and we all tryed a different pasta dish . We all enjoyed our food . The atmosphere and the service was great.The prices were also good. It was a large portion meal and we took dessert home. The cheescake was exceptionaly delicious!! BANANA  . Pineapple and Hazelnut 3 separate flavors were what we had. Cannot wait to try key lime cheesecake next. Enjoyabe time.", "rating": 4, "date": "12/19/2019"}, {"text": "Had dinner here tonight for my sister&amp;#39;s birthday - from start to finish everything was delicious. Perfect timing on courses, refills when needed, and the burger I ordered was cooked perfectly to order. But the cherry on top of it all was our server, Calvin. He was patient, knowledgeable, and kind, and made the experience that much more delightful.", "rating": 5, "date": "9/4/2019"}, {"text": "The cheesecake factory is arguably my favorite chain restaurant other than Yard House in Moorestown. Huge selection, good sized portions, and of course, incredible cheesecake. I don&amp;#39;t come that often simply because I&amp;#39;m not in Cherry Hill a lot...but also because this place is ALWAYS packed. No reservations on weekends so you&amp;#39;re gonna wait no matter what. Even at noon on a Saturday there was a 15 minute wait and it was packed. The seating for tables of two isn&amp;#39;t ideal...as the tables are really close to one another. On our last visit it was so loud inside it didn&amp;#39;t really matter that the tables were close, you couldn&amp;#39;t hear anyone next to you and vice versa. The restaurant was clean and our server Veronica was really sweet and attentive, and went out of her way to split up our bill. On to the food! We came because we had a gift card and we opted for apps, drinks, and shared some cheesecake. Everything was delicious. The pork belly sliders with fried pickles were amazing. My new favorite appetizer here for sure. The pork belly itself was crispy on the outside but not dry, and was packed with flavor. The dynamite shrimp  was a little greasy but the breading was light so it was still good. The cheesecake is always a home run here as the name of the place indicates, and the white chocolate macadamia nut cheesecake definitely didn&amp;#39;t disappoint. Only 4 stars because it&amp;#39;s always insanely crowded and the parking lot is a circus. But the food is consistently good and I&amp;#39;m sure I&amp;#39;ll be back.", "rating": 4, "date": "1/27/2019"}, {"text": "Guess what! We put our order in and the they forgot my order. I got the chance to take in the ambience for a whole 45 mins before my food came. So, I had to become the bad guy which sucks uggggh. I hate having to be the bad guy but the other server did say she must have forgotten. So, here&amp;#39;s one star. Perhaps if she said &amp;#34;Hey, I&amp;#39;m sorry&amp;#34; I wouldn&amp;#39;t be writing this. Buuuuut. What the hell.", "rating": 1, "date": "8/21/2019"}, {"text": "It was a brisk September afternoon, I left work early that day to run some errands and found myself with some time to spare. Just peeking out the corner of my eye was the Cheesecake Factory. I figured let me stop in and grab a cheesecake slice for my beautiful wife to brighten her day a little. As I walked in I heard Jack Daniels calling my name so went straight to the bar, and ending up hanging out there for a while. Although I was having a drink alone, I was not sharing a drink called loneliness (Billy Joel reference). The atmosphere surely made me feel like I was somewhere else, and the staff all greeted me as they passed by as of I was just welcomed into their neighborhood. After finishing my drink, I parted ways and headed back to my car. As I was driving away and knowing it takes 25 minutes to make a u-turn in Jersey I completely forgot about the cheesecake....FML.", "rating": 4, "date": "9/19/2019"}, {"text": "Late night craving after a nice dinner with my beautiful girlfriend. We decided that we want some dessert. &amp;amp; we were close to cheesecake so we decided to give it a try. We order a slice of tiramisu to go. They asked us if we wanted whipped cream so we didn&amp;#39;t mind that. We wait 10 minutes there until we got your desert. Keep in mind we were the only one in line. The bagged up and gave it u to us. The surprise we got when we got home. Just look at this photo and tell me what wrong. We paid $10 for half of the cake was missing at the very least &amp;amp; it look like they tried to compensate with the amount of whipped. The first time I saw this much whipped cream on a slice of cake.", "rating": 2, "date": "8/11/2019"}, {"text": "The atmosphere was nice but the silverware was dirty, dried green stuff on my bread plate, something weird in my side of mayo. Not sanitary enough for me. But the place is always bumping. Not sure why. I must have missed something. Cheesecake was great of course. Nashville nuggets were good.", "rating": 2, "date": "7/30/2019"}, {"text": "This location made my 3 year old cheeseburger sliders. After she ate half of it, I realized it was uncooked. Not rare. Uncooked. The manager was nice and apologetic which I appreciate. They did remove one dessert and her meal off the bill. However, this is 100% unacceptable. She still ate uncooked meat.", "rating": 1, "date": "1/6/2019"}, {"text": "I really went back and forth with myself over writing this review, but I feel obligated to forewarn other guests. My friend and I stopped here for a late dinner after work on Sunday, and it wasn&amp;#39;t as busy as it usually is when I go. We had a wait of barely 5 minutes, and were sat in a little corner. <br&gt;<br&gt;I totally understand that servers work for tips, and sometimes it&amp;#39;s hard not to judge people based on appearance, but this is probably the first time that I&amp;#39;ve felt that what I was wearing significantly effected the quality of my service. Mistake number one, was wearing jeans and a T-shirt. I felt like we were stashed in a corner to not take away from the overall vibe of little dates and dinner gatherings that were going on around us. <br&gt;<br&gt;Our server brought us out two waters and greeted us, ran down dinner and drink specials and asked if we&amp;#39;d like to put in an appetizer or get anything else to drink. In retrospect, this was where we made mistake number two. My friend decided to just go with water, no alcohol to bump up the tab, and told him she was gong to have an appetizer as her entree. We asked for a few more minutes, as I hadn&amp;#39;t decided on a dinner yet. This was the turning point of our visit. <br&gt;<br&gt;The soda that I ordered took about 20 minutes to come out, when he then asked if we&amp;#39;d like bread while we wait. The bread took another 10-ish minutes, and the meal came almost immediately afterwards. No inquiry about a refill on any drinks, and we didn&amp;#39;t personally have his attention after the food was dropped for about another 45 minutes. However, he was gushing over the table seated immediately next to us, who appeared to be on a date. They ordered alcohol, appetizers, meals and were dressed very nicely. He stopped two or three times to have full 3-5 minute conversations with them, while totally ignoring us. No three bite check in, no refills, nothing. He was consistently present and attentive to his other tables, just not us. <br&gt;<br&gt;Maybe he thought we were a couple and didn&amp;#39;t like that? Maybe the casual, young adult in jeans and a messy bun appearance causes unintentional judgement because we look like we don&amp;#39;t tip well? Maybe our not ordering $100 worth of food made him feel as though we were a waste of time? In reality, we were saving room for the $50 in cheesecake that we wound up ordering at the take away counter, because two hours for a quick meal was too long to be there already, and if we didn&amp;#39;t ask for the check when we did, who knows when we would have seen him again. We didn&amp;#39;t drive 30 minutes to this establishment to be treated worse than a minimum wage fast food worker would have treated us. On top of everything else the bathroom was a disaster. Do better, Cheesecake Factory. This was such a disappointment. We won&amp;#39;t be back.", "rating": 2, "date": "9/26/2017"}, {"text": "The food was only average at best. One thing I cannot tolerate is a restaurant with a disgusting bathroom. This one seemed like the staff at Cheesecake Factory completely forgot there was a bathroom to check up on! It was a hot mess in there to say the least. If it weren&amp;#39;t for the nice ladies lined up in a synchronized line passing the single roll of toilet paper to the next person in line after coming out of the one stall that wasn&amp;#39;t clogged, I think there would have been a more serious problem. Cheesecake Factory: how do you expect us to use the bathroom?! Thank goodness it wasn&amp;#39;t #2", "rating": 3, "date": "9/11/2018"}, {"text": "Just an average dining experience.  My wife&amp;#39;s meal was burnt and not sure how it made it out of the kitchen without someone flagging it.  The manager removed it from the bill. My chopped salad was good and was from the skinny menu. We finished off the meal with the Oreo cheesecake which was good and very rich. We will go again? Maybe in a few months.", "rating": 3, "date": "7/3/2019"}, {"text": "Food was ok. Just shared chicken Madeira with my husband. Chicken was fairly good but the pasta it came with (replaced the potatoes) was quite cold and stuck together. The most offensive part of the meal was the waiter. He had just smoked a cigarette and every time he came to our table his following of a just smoked cigarette wasn&amp;#39;t very pleasant. This should not be allowed while serving.", "rating": 3, "date": "6/17/2019"}, {"text": "I thought it was better than the 3 stars listed. We arrived at 5:30 on a Friday night and it was totally full. A delightful night so we decided to eat out doors. We were the first to go outside to eat. We had a delightful waiter who recommended a &amp;#39;lite&amp;#39; dinner. I was very good.  Both of us had the capellini with shrimp and asparagus. Nice sauce and freshly made warm bread. I thought the pricing was high for a lite dinner but the service and food were good. I would not have eaten inside. The noise level was much too high.", "rating": 4, "date": "7/27/2019"}, {"text": "I used to love this place! Whatever I ordered was good.  It has been two years since I visited there.  Some of the menu item were changed/added.  Mushroom soup was good first three sips.  After that I only tasted salt and sherry.  It was not eatable.  Prosciutto flatbread had prosciutto shortage.  There was barely prosciutto on a pizza dough.  Korean BBQ style cauliflower was pretty bad.  The sauce was too heavy and sweet.  It was not Korean style at all.  It was almost sad to see one of the good restaurant is serving food like that.  And on top of that, little kid screaming from near booth.  The dining experience was not good this time.", "rating": 3, "date": "2/25/2020"}, {"text": "I literally come here every Sunday for brunch. I just wanted to post this picture of that cinnamon roll pancakes because they are so good. They come with this handmade syrup in is so good but you really don&amp;#39;t need it because the pancake it so flavorful.", "rating": 5, "date": "12/21/2018"}, {"text": "It was pretty good not bad at all. Service a little slow busy night! We had calamari and guacamole for appetizers. Our entries were the grilled salmon it was good. The Steak Diane it was ok not that great and the Chicken Maderia was really really good. Our bill was $113.00 I think it was pretty reasonable not bad at all for 3 people. I would go back to this place but it&amp;#39;s not one of my favorite places but ok if your hungry and want to have a lot of options. There menu is huge and you can special requests certain things.", "rating": 4, "date": "2/10/2019"}, {"text": "Do not order their skinny small plate Ahi Tuna Poke!! It&amp;#39;s a tiny teaspoon of food and four ... that&amp;#39;s accurate just 4 chips . 3 of them won&amp;#39;t be needed with barely any food on the plate. So then for this privilege to enjoy a night out of cocktails and appy&amp;#39;s , we paid $9.50. The drinks are excellent and the sliders very good but avoid small plates . How embarrassing for CF, since they&amp;#39;re always a target for ridicule for serving huge plates.", "rating": 1, "date": "12/3/2019"}, {"text": "The servers at this restaurant are very young and inexperienced. They seem lost as to how to attend to client needs. Most appear to be under the age of twenty. Perhaps this is the problem", "rating": 2, "date": "8/5/2019"}, {"text": "Excellent service delicious food was there celebrating my children birthday they love it thank i you n keep up the good work", "rating": 5, "date": "2/27/2020"}, {"text": "4 stars for the apps and service. 1 star for the &amp;#34;Sheppard&amp;#39;s pie&amp;#34;. It&amp;#39;s not even a pie. Sheppard is supposed to be the sheep not ground beef. It&amp;#39;s just beef stew and mashed potatoes on top. It was greasy and the flavor was not good. I just ate the mash potato cause I love mash potatoes but the meat was not the correct meat. Why are they advertising shepherds pie if you&amp;#39;re gonna get this trash. It ruined my meal and I left very disappointed. <br&gt;Don&amp;#39;t get this trash food. Cheesecake Factory has very delicious food and the service is excellent so I&amp;#39;m not bashing the company on why it&amp;#39;s bad, I&amp;#39;m just ranting on this dish.", "rating": 4, "date": "6/26/2017"}, {"text": "I ordered tuna tartar and Asian lettuce wraps ... took them 25 minutes to bring it out .... and just to be clear - that&amp;#39;s an appetizer . But the food is delicious ! Totally worth the wait !", "rating": 5, "date": "11/8/2018"}, {"text": "We had the worst service tonight. <br&gt;<br&gt;After a long wait for the table, we put our order in. The waitress didn&amp;#39;t bring us the bread basket for a long time and after that she pretty much forgot about things she told us she will bring (ex. hot sauce, utensils, &amp;amp; a clean dish). She brought a wrong chicken dish...She brought us desserts without any forks (because she cleared the whole table) so we waited again. Time in waiting was so wasteful and unnecessary. <br&gt;Service was terrible. Food was just ok. Won&amp;#39;t be going back.", "rating": 1, "date": "7/28/2019"}, {"text": "I finally had cheesecake at The Cheesecake Factory and I was very happy with it - I had the Godiva and it was both rich and light if that makes sense.<br&gt;<br&gt;My lovely &amp;#39;friend&amp;#39; had the salted caramel and that was really delicious too!  <br&gt;<br&gt;Their menu is so extensive that you could get overwhelmed but in the best way! <br&gt;<br&gt;Id go back to try a few others for sure!", "rating": 4, "date": "8/23/2015"}, {"text": "The staff was very accommodating. My little cousin wanted to change her order. They sang &amp;#34;Happy Birthday&amp;#34;, to my 80 year old Uncle. The waitresses were very pleasant. One con is that it was about a 45-minute wait for a table for a party of our size.", "rating": 4, "date": "7/13/2019"}, {"text": "I am not ashamed to admit that before today I was a 40+ year old Cheesecake Factory virgin. I had nothing against the business, but no real desire to lose my chasteness. Now that I am no longer pure, I can honestly say that I can see the appeal this place has on people from all walks of life. <br&gt;<br&gt;First of all, the decor in this location is quite interesting. We both remarked that it had something like a Disney and or resort-ish effect. For some reason you just feel good, and at ease too. Second, the sheer quantity of choices should be able to appease even the pickiest of the picky. I can&amp;#39;t comment on the quality, we were here for dessert only. And last but not least, their namesake option does not disappoint.<br&gt;<br&gt;My friend chose Godiva chocolate, and I opted for salted caramel. What I&amp;#39;m leaving out is that it took us ten minutes to narrow our selection down since the choices are vast. We enjoyed both slices. The tastes were fresh and intense, with lovely plating. Almost as lovely as my desserting companion, but not quite.<br&gt;<br&gt;To sum up, I would recommend CF to families with younguns, or those looking for casual fare with an ending that is sure to be happy. I think people from other cultures visiting the U.S. might also enjoy the experience of dining or at least desserting here. 3.75 sweet cheesy Yelps.", "rating": 3, "date": "8/23/2015"}, {"text": "I absolutely can not believe how rude I was treated by the manager. Our food had to be taken back two times after coming out late!!! The manager asked me to share my food with other guest while we wait for food to be returned!!! How about I have never been treated so rude in all my life in a restaurant! I want to leave but I have people with me that&amp;#39;s hungry because we waited so long!!!! AWFUL!!!! The Manager needs training.", "rating": 1, "date": "9/21/2019"}, {"text": "Loud. Slow service. Friday night. Worst dining experience. Literally sounds like you are in a high school cafeteria. Have to yell to talk to the person across from you. Sat in the middle area, like so you can smell the cologne on the person next to you that you didn&amp;#39;t come with. People next to us sat down after us and were greeted and served before us. Loud banging dishes, loud music, and screaming children the entire time.  Chicken tacos, white chicken chili and egg roll sampler were good but not worth the environment. The high $ menu items are better in a dozen more places nearby without the trash atmosphere.", "rating": 1, "date": "9/6/2019"}, {"text": "Who writes a review about a chain restaurant? Me that who. Graduation season is upon us so the wait was a little long but hey how can you be mad. <br&gt;<br&gt;I skipped the app and ordered the Crispy Chicken and Shrimp in a sweet and sour sauce. It had mushrooms,scallions, snow peas and cilantro. Other than too much breading on the chicken the dish was very  good. They offer a sautéed option for those that don&amp;#39;t want fried. Recommend", "rating": 4, "date": "6/20/2017"}, {"text": "delicious!!!!!! chicken and biscuits! i&amp;#39;m going back just for this dish!", "rating": 5, "date": "7/9/2020"}, {"text": "Great place to catch up with old friends and split lots of different types of food.  It is avrry busy restaurant so it may be best not to go during prime time.  But you have the ability to walk around Barnes and Nobles and the signal still reaches. <br&gt;<br&gt;First off, the service was great.  They were kind and considerate.  The server recommended their favorites and they were all great suggestions.  They were capable of answering questions about their extensive menu.<br&gt;<br&gt;Many of the pastas are great choices, but read the description to make sure you enjoy what it contains.  I would recommend the cauliflower apitizer, it will surprise you in both bold taste and melt in your mouth texture.  I would not recommend the cheeseburgers for those who do not like greesy burgers.  The cheesecake is fine, but can be overwhelmingly sweet.  Recommended to share a slice.<br&gt;<br&gt;The pricing is a little high, but to be expected for the location and food portions.", "rating": 5, "date": "11/19/2017"}, {"text": "Want a delicious alcoholic beverage poured riiight? The Cheesecake Factory never lets me down. LOVE the passion fruit mojito.... probably my absolute favorite drink.<br&gt;The chicken samosas appetizer is sooooo good.<br&gt;Also love the Jamaican blackened chicken and shrimp.... the rice, beans, plantains, pineapple along with the shrimp and chicken is sooooo good.<br&gt;Miso glazed salmon is another favorite", "rating": 4, "date": "6/17/2018"}, {"text": "So I have not been here in about 10 years. At that time I was not impressed.<br&gt; We happen to get a gift card for Christmas to the cheesecake factory and decided to use it sooner than later. We arrived and were seated promptly in a very nice clean booth near a window. We were greeted with water and bread right when we sat down. <br&gt; In my opinion the menu is too extensive. I had to turn the waitress away 3 times because there were too many choices.  This can end up being a blessing and a curse. I love that there&amp;#39;s such a variety on the menu, but it makes a very difficult to decide what you want to order. I got the ahi tuna small plate, and the farmers appetizer salad.  My fiance got the pizza style chicken Alfredo. He absolutely loved his. The ahi tuna was delicious! And my appetizer salad was far from being an appetizer. It was massive. The dressing was one of the best salad dressings I&amp;#39;ve ever had.<br&gt;Our waitress was unbelievably attentive and nice. We got the original cheesecake to share. My goodness what a delicious cheesecake! We have not dined at the cheesecake factory together before.  But you can bet that we will be back!", "rating": 5, "date": "1/23/2019"}, {"text": "My three colleagues and I stopped in for lunch.  It was my first time dining at a CCF.  We were seated right away.  The dining area was open and huge.  The menu was overwhelming- too many choices!  The appetizers we ordered were great.  In fact, the guacamole was the best that I have had.  The cheesesteak rolls were tasty too and the cocktails accompanied this course well.  My margarita was good but it was a little smaller than I expected.  I ordered the stuffed cheeseburger with no roll.  It was presented nicely but it was very average to me.  The others in my group seemed to enjoy their meals.  My colleagues were not interested in cheesecake so unfortunately I did not get to try any.  If I return, I will probably order an appetizer and dessert.  Overall, I found the  prices high.  The best part of the experience was our server Amanda.  She was on point!  Kudos to her for her knowledge, efficiency and friendliness.", "rating": 3, "date": "8/17/2019"}, {"text": "This is one of my favorite restaurants ! The food here is so good, and there are countless amount of options from seafood to Italian ! Also there dessert menu is phenomenal, I&amp;#39;m lucky I haven&amp;#39;t tried everything on it ! My favorite is the Oreo dream extreme cheesecake, but they have many other options! Also this restaurant is very kid friendly. :)", "rating": 5, "date": "7/15/2018"}, {"text": "Let me just say I come here a lot, I had came in last night at 10:25pm. I was seated by my server which is a light skin African American male with an Afro puff. We ordered drinks and he told my fiancé that since his ID isn&amp;#39;t horizontal some places wouldn&amp;#39;t serve him, incorrect, I&amp;#39;m a bartender myself. He provided the worst customer service ever, we asked for crab meat dip appetizer and our appetizer still wasn&amp;#39;t out yet. It was 11:07pm and we finally got our dinner with no appetizer. I had mentioned the appetizer to him and his response was &amp;#34;i can either take it off the check or bag it up&amp;#34; i asked him to bag it up, he comes back out and says &amp;#34;unfortunately it was never turned in Sorry guys&amp;#34;. Wtf? This is the worst service I&amp;#39;ve ever had, literally. Disappointing, Cheesecake Factory needs to live up to its name and luxury, you can&amp;#39;t have luxury and awful service.", "rating": 1, "date": "1/16/2019"}, {"text": "food was good besides the fact that they put my pizza on a dirty ass dish !!!!  old ass celebration cake sprinkles under my pizza is a major no! <br&gt;<br&gt;my fave thing to order is their &amp;#34;pizza with the works &amp;#34; and a side cesar salad ! juuuuuuust hold the sprinkles next time", "rating": 3, "date": "2/15/2018"}, {"text": "PARKING: Free parking lot outside!!<br&gt;<br&gt;Came here with 11 other friends(not including me) for a surprise birthday dinner after coming from skyzone... so yes expect this review to be more about if me and my friends were filled up!<br&gt;<br&gt;We had balloons which were &amp;#39;18&amp;#39; that we wanted to put on the birthday girl&amp;#39;s seat and the employees were very nice about it. We were a big group so I was a little hesitant if one waiter will be able to handle all of us.<br&gt;<br&gt;Starting off with the beverages... I got the Iced Mango Drink($6.50) THIS DRINK IS A MUST HAVE... 10STARS FOR THIS DRINK!!<br&gt;<br&gt;The waiter then proceeded to get the rest of my friends their drinks and their UNLIMITED free bread with butter. Not sure the exact names of the bread but some are white and some are brown. The BROWN ones are the best in my opinion!! Always a fight to see who get the brown one.<br&gt;<br&gt;The wait time was 20-30minutes but it was expected as we were a large group but the unlimited bread complemented the wait time with jokes and story telling between my friends. <br&gt;<br&gt;The food all came out at the same time which was good because no one wants their food to get cold while waiting for their friend to get their meal.<br&gt;<br&gt;For the main dish I got the Shrimp Bistro($18.50) with shredded cheese on top. AMAZING.... usually people look for the shrimp taste but I rather eat the pasta without the shrimp. The pasta was soooooo creamy and delightful. This has to be the BEST pasta I have every tasted in my entire life.<br&gt;<br&gt;After we finished, the employees sang happy birthday to the birthday girl and handed a Cheesecake to her. <br&gt;<br&gt;The food did fill me and my friends up... I had to take the left over pasta home.<br&gt;<br&gt;Another plus about this place was the waiter split the check between 12people... they have some amazing employees at The Cheesecake Factory.<br&gt;<br&gt;HIGHLY recommend this place to everyone and highly recommend the Iced Mango drink and Shrimp Bistro to everyone!! I will be back to this place with friends and family members next time!", "rating": 5, "date": "6/10/2017"}, {"text": "The wait is horrible. You watch groups of the same size party come in after you and be seated before you. Wait for food for 45 mins and plates are red hot and food dried out from sitting on line too long. Waitress was pleasant but she was an exception to the rest of the staff we interacted with. <br&gt;Would not recommend for meals only dessert.", "rating": 1, "date": "2/17/2018"}, {"text": "I come here a lot. Also have been since I was little. Love all their pastas.(They always make my day.) Their cheesecake is MINDBLOWING!!! Their little &amp;#39;Happy Birthday&amp;#39; song is nice too.<br&gt;<br&gt;I personally thought the service was ok. It depends on what and time you go though. Same as with the way the place looks. <br&gt;<br&gt;Overall I always enjoy myself here. So, I&amp;#39;all be back soon!", "rating": 4, "date": "7/14/2017"}, {"text": "Best burger I&amp;#39;ve ever had in my life !! Not to mention the waiter was super nice and friendly will definitely be back their!!!", "rating": 5, "date": "5/4/2019"}, {"text": "This place is gross. Food is awful. Took my son for a mommy and son lunch to celebrate his completion of kindergarten. First they tried to sit is 2 inches from another table. Who wants that?  Then they moved is to a booth and it was FREEZING!!!! I asked for the servers several times to lower the draft coming down on us. After waiting 40 min for our pasta dishes I just asked for the check and for them to pack them to go. We were very unhappy. Once getting our food, both my 6 year old and I were like, &amp;#34; what is this?&amp;#34;  I literally threw it out when we got home and just made a meal myself. I have been going to this restaurant in KoP and DC for years with no problem. Will NEVER go back to this one. The chefs should be ashamed of themselves. Completely disappointed and the food was gross!", "rating": 1, "date": "6/21/2019"}, {"text": "3.5 but I&amp;#39;m being generous. This place is a zoo.  It was my first time ever in a Cheesecake Factory, so I didn&amp;#39;t know what to expect.  It was a Sunday and our big family had a lovely gift card we wanted to use, so we tried to be smart and make reservations in advance and come in for an early dinner, but THEY DON&amp;#39;T TAKE RESERVATIONS ON THE WEEKENDS. &amp;#34;Expect an hour long wait time,&amp;#34; they said.  So we waited just over an hour (luckily, part of our family arrived early to &amp;#34;take one for the team&amp;#34; and get on the list and the little buzzy thing) while we came with my 86 year old mother a bit later so she wasn&amp;#39;t too inconvenienced. <br&gt;<br&gt;The food itself was fine. We ordered 10 different dishes and no one complained. My coconut shrimp curry thing was pretty good. What was over the top, though, was the service. Our waiter was bouncy and energetic and really happy. Nice to see that on a busy night, he seemed unfazed by all.  Good job, mister.", "rating": 4, "date": "5/2/2016"}, {"text": "Yikes! My family comes to the Cheesecake Factory frequently but each visit has slowly decreased our appetite for the restaurant. The menu changes frequently, each time cutting more and more vegetarian options.  We went for a late lunch and alas, there was a wait. We expected as much. <br&gt;<br&gt;After being seated, our server came out with water for the table but no straws. I had to actually ask for straws? (Question mark for the incredulous tone of the statement) We were waiting on two more people, so I had asked for the appetizers to be brought out when everyone had arrived but he replied that we would have to wait until everyone was here to order them or we could order them now and he would bring it out when it was ready. I don&amp;#39;t think our request was too complicated but still, unfulfilled. After the rest of the group arrived, we ordered our meals. <br&gt;<br&gt;Because the menu had changed since our last visit, my parents asked for the vegetarian dishes (my mom&amp;#39;s favorite falafel salad was no longer offered), and he said they had 3 vegetarian dishes. Now, I don&amp;#39;t claim to know the entire menu at the CF but I know for a fact that they have more than 3 vegetarian meals. What&amp;#39;s up with that? She decided to order the tomato basil pasta, the vegetarian version. Also, please note that this was an entire conversation, and not a simple Q &amp;amp; A. Our server knows very well that my parents do not eat meat. After some time, he brings the food to the table and doesn&amp;#39;t even notice the empty waters. Once again, we had to ask for more water??? <br&gt;<br&gt;Lo and behold, the tomato basil pasta my mother ordered has chicken in it. We flag him down and ask is this chicken? He says yes. He then proceeds to ask if it&amp;#39;s ok that the kitchen remove the chicken and bring the same food back. Personally, I was offended that this even happened in the first place. But then he has the audacity to ask if she wants the same meal, minus the chicken? WTF? It would be one thing if she had asked for the tomato basil pasta without chicken but after the conversation where they asked him for a vegetarian menu and whatnot, it was absolutely unacceptable, and he did not even seem apologetic. Honestly, it feels like he was trying to spite us or something because nothing made sense. I know for a fact that this was the Final visit to the Cheesecake factory.", "rating": 1, "date": "1/7/2018"}, {"text": "We have eaten at the Cherry Hill, NJ Cheesecake factory on several occasions. Our visit on Saturday was &amp;#34;EXCEPTIONAL&amp;#34; !<br&gt;Our waitrees, Erica, raised our dining experience to the excellent level.  She was cordial, attentive and professional. Our food was served hot and at the proper intervals.<br&gt;My wife, son, daughter and me thoroughly enjoyed our meals as well as Erica&amp;#39;s superb service.", "rating": 5, "date": "2/11/2018"}, {"text": "Just stopped by for some dessert and slices of cheesecake to take home.  Its nice to have this location on the way home from Philly.   I love the place, its one of my favorite restaurants.", "rating": 4, "date": "12/19/2017"}, {"text": "One of the better restaurant chains in the United States of A. Expansive menu, elegant decor and consistency in taste, quality and experience. Highly recommend their appetizers, cheesecakes and specialty dishes - chicken Madeira, bang bang chicken and shrimp, chipotle chicken pasta amongst a few.", "rating": 4, "date": "12/10/2017"}, {"text": "Why am I reviewing this place? Because I need to pump up my reviews. Why are you reading this? Either your sitting in Cheesecake Factory and waiting for your waitress or you&amp;#39;re really interested in someone&amp;#39;s opinion who you really don&amp;#39;t care about. Either way thanks for reading!<br&gt;<br&gt;Stopped by on Saturday around 10:30pm. There was no wait. We got sat immediately. There was a big woman sitting by herself on her phone. To the left of us and a couple making out at the bar. A no name boxing match was on. I will reveal who won the fight (4 time welterweight champion vs some guy, spoiler alert someone got knocked out round 3). <br&gt;<br&gt;We got drinks. I got a smashing whiskey something. It was delicious. My wife got a blue moon. Drinks came out very quickly.<br&gt;<br&gt;We skipped appetizers and went right in for the kill. Unfortunately even with no crowd the wait time for our food was 30+ minutes. Do not go here if you are in a rush. <br&gt;<br&gt;I got the steak Diane and chicken medeina which is apparently their favorite dish as a combo. My wife got the chicken parm pizza lol. The calories weren&amp;#39;t listed because in sure listing a 3500 calorie bomb should be illegal. Mine was good. Steak was perfectly cooked and the chicken was moist. I like the cheese on top. When the mashed potatoes with the skin were to die for.<br&gt;<br&gt;The waitress never asked if we wanted a second drink. Oh well her loss!<br&gt;<br&gt;When we finished I couldn&amp;#39;t find my waitress. We waited another 20 minutes before she emerged. I asked for a check and a box for the remaining 2/3 of the chicken parm pizza (which was essentially a huge patty of chicken covered in pizza sauce with some noods on top). <br&gt;<br&gt;She asked if we wanted dessert and oh yeah we&amp;#39;re at the Cheesecake Factory! I ordered the classic with the cherry preserves with some ice cream. It came out with two dollops of whipped cream! I totally forgot! Too much cream. I&amp;#39;m lactose intolerant. I would regret this choice. <br&gt;<br&gt;Bill came out to $68. Not bad. If we didn&amp;#39;t order drinks we&amp;#39;d have been okay. At least we shared dessert! Still working off those calories. The waitress took another 10 minutes to come over after we finished dessert. She immediately got the check then walked away (should&amp;#39;ve waited the 3 seconds for me to give her my cc) 20 minutes go by and I finally see her chatting up another waiter. I literally need to waive the check bill in the air to flag her down before she realizes I&amp;#39;m ready. <br&gt;<br&gt;We leave by 12:10am. Could&amp;#39;ve been done in 30 minutes but I could never find the waitress. That is why they get a 3 star rating rather than 5. Other times they have been way quicker.<br&gt;<br&gt;The boxer won by knockout in the first 3 rounds. He essentially won before our food came out! Also when we left the big lady was still texting with her empty plates in front of her! Must&amp;#39;ve been one intense text sesh.", "rating": 3, "date": "8/20/2017"}, {"text": "So, at lunchtime around 130pm, the parking lot is packed. No way time really though. Our waiter,  Eric was decent. Friendly and not overly attentive. I was disappointed that they didn&amp;#39;t have Rolling Rock beer though. The waitstaff here are helpful to one another and working in retail, I&amp;#39;m big on customer service and even how the employees treat one another.. While Eric was waiting other tables, another server noticed my empty salad bowl and asked if she could take it.  <br&gt;<br&gt;Onto the food.. I ordered a Caesar salad and a lunch portion  of a rigatoni dish with shrimp and sausage. One thing I HATE about a predressed salad is almost no dressing or too much dressing. This salad nailed it spot on.. Just enough without being watery or soggy.  However, this dressing tasted more like mayonnaise with pepper. Wasn&amp;#39;t a big fan but a little table salt and freshly cracked pepper saved my soul. Up next was my lunch portion of rigatoni with shrimp and sausage. Pretty tasty. Overall, I enjoyed the food and ambience but it&amp;#39;s not a restaurant I&amp;#39;d wait in line for an hour to get a table. I&amp;#39;ll try some dessert next time.", "rating": 4, "date": "11/13/2015"}, {"text": "We always enjoy our visits to the Cheesecake Factory, but I will admit we have to be in a certain frame of mind for it.  It&amp;#39;s a very busy, loud, noisy, crowded place and frankly, the noise and chaos grate on our nerves and gives us indigestion.  As others have mentioned, if you go at prime meal times, there is almost always a wait.  This restaurant is steadily busy ALL the time, even on off hours, although on off hours you might not have a long wait.  They don&amp;#39;t take reservations, either, which is a pain.<br&gt;<br&gt;On the plus side, the food is very tasty, portions are generous and service is usually friendly and attentive.  I love all the varieties of cheesecakes offered, and the cheesecake is pretty good - maybe a little on the dense/dry side for my taste, but still good.  I think the most appealing thing about their cheesecake is that huge number of varieties available.  One of my favorite desserts they serve is not a cheesecake at all - it is the strawberry shortcake (see my photo).  It&amp;#39;s a biscuit shortcake piled high with vanilla ice cream, strawberries and whipped cream and it&amp;#39;s the bomb.  Be aware - this dessert HUGE and can easily feed 3 people.<br&gt;<br&gt;I also love the Fried Mac &amp;amp; Cheese and Avocado Egg Roll Appetizers.  For entrees, my favorite is the Bistro Shrimp Pasta.<br&gt;<br&gt;All in all, I give this restaurant thumbs up!", "rating": 4, "date": "6/17/2016"}, {"text": "I used to visit this Cheesecake Factory years ago and it was good! Last night my fiancé and I decided to go because we had a gift card. Our waitress was super friendly and sweet. Our cocktails were yummy. My mojito was delicious. The food though... terrible. Greasy appetizers. My pasta dish was horrible that I ate 2 bites and was done. Nothing had flavor and the pasta was cooked for too long. The shrimp had zero flavor. I told the waitress and got it removed from our bill. We got cheesecakes and they were alright. This place is going downhill. The food isn&amp;#39;t great. Everything is greasy and too much garlic.", "rating": 3, "date": "8/18/2019"}, {"text": "About a 40 minutes wait on a Saturday night I guess isn&amp;#39;t too bad. They were also giving out samples for their holiday Peppermint Cheesecake.<br&gt;<br&gt;Fooood time!<br&gt;<br&gt;For starters:<br&gt;&amp;#39; Buffalo wings<br&gt;&amp;#39; Crispy Crab Bites<br&gt;&amp;#39; Stuffed Mushrooms<br&gt;<br&gt;The Stuffed Mushrooms had a Garlic and Herbs in a Wine Sauce which was good to dip with the complimentary bread that they gave you.<br&gt;*Side story: About that bread, I love it! The brown one. We even got another basket with just the brown ones. And when we were almost done, we asked for some more so our waiter went and got us a whole fresh roll! I was so excited! Thank you!!<br&gt;<br&gt;So for the main course, we had:<br&gt;&amp;#39; Cajun Jambalaya<br&gt;&amp;#39; Shrimp with Angel Hair<br&gt;&amp;#39; Farfalle with Chicken &amp;amp; Roasted Garlic<br&gt;&amp;amp; some kind of chicken salad with blue cheese.<br&gt;<br&gt;Jamabalaya = &amp;#34;Shrimp and Chicken Sautéed with Onions, Tomato and Peppers in a Very Spicy Cajun Sauce.&amp;#34; I wouldn&amp;#39;t say it was VERY spicy but it was a little.<br&gt;I felt like the angel hair was a bit bland so we mix the jamabalaya &amp;amp; the angel hair pasta and you get a nice new little pasta dish with more taste.<br&gt;<br&gt;For dessert:<br&gt;&amp;#39; Fresh Strawberry Cheesecake<br&gt;&amp;#39; Mango Key Lime Cheesecake<br&gt;&amp;#39; Pumpkin Cheesecake<br&gt;<br&gt;The Mango Key Lime was pretty good. I didn&amp;#39;t try the rest but everyone seemed to enjoy it.<br&gt;<br&gt;We&amp;#39;ll be back. I&amp;#39;ll be back for the bread but I&amp;#39;m sure everyone else will be back for the food &amp;amp; cheesecake.", "rating": 4, "date": "12/23/2013"}, {"text": "If I could do a 0 I would. Super unhappy w the service. Mac n cheese balls tasted worst than my ex husbands dirty human balls. Very very very very very very disappointed, don&amp;#39;t even waste your time going to this factory. It&amp;#39;s awful.", "rating": 1, "date": "7/30/2018"}, {"text": "The cheesecake factory is one of the best places that I&amp;#39;ve ever eaten I go there at least once a week if I possibly can I love it there I love the food I love the atmosphere I love the service I love everything about the cheesecake factory. It&amp;#39;s a shame that other places don&amp;#39;t have a clue maybe they should get a job at the cheesecake factory to find out how to please the customers. The cheesecake factory will always be my go to place because I know the menu is great", "rating": 5, "date": "1/17/2019"}, {"text": "The portions are huge not as large as the wait though. I find the menu overwhelming. The bread basket that comes out with a variety of breads is nice especially with the butter. Being the menu is so large I make up my mind and then change it 3 or 4 times before the servers makes it back. The cocktails are not anything special. The cheesecake options are always promising. I love cheesecake so it&amp;#39;s pretty hard to mess that up in my opinion. I don&amp;#39;t find myself craving the food that often and mostly it&amp;#39;s due to the wait the food is not worth waiting 1.5 to be seated. I usually go with the ceasar salad which is HUGE and well dressed. Their margaritas leave much to be desired flavor wise but are pretty strong. <br&gt;<br&gt;Also, I tried arranging a dinner with a large group and they do not take reservations so I decided to wait the 2 hours they asked me to wait in order to put together a table large enough for us all but then they changed their minds once I arrived and we had to go elsewhere. They should take reservations for larger groups (like most  other restaurants) but is evident they didn&amp;#39;t want our money then therefore I take my money elsewhere on other nights.", "rating": 3, "date": "10/10/2015"}, {"text": "This is the worst Cheesecake Factory location I have ever been to.  I used to love this chain and felt that they had reliably good food.  At the Cherry Hill location, the food was just inedible, restaurant itself was unsanitary, and the bad service did not help either.  My cousin and I came for lunch on Thursday 7/13 at around 3pm.  The restaurant was nowhere near full and it appeared that most tables were available.  We were told by the hostess that it would be a 20 minute wait if we want to have a table with service (??there is an option for table without service??), otherwise we could go sit at the bar.  We browsed around at nearby shops and waited the 20 minutes... When we got buzzed for a table, we were seated in the far corner of the restaurant (awkward spot where there were A LOT OF FLIES!!! EW) and on our way to the table, there were so many empty tables that had not been cleared/cleaned (this could be what is attracting flies? and causing a wait at an off hour?).  I ordered the Louisiana chicken pasta... and it was so terrible... it was pasta floating in so much oil that I caught myself SLURPING the three bites that I took!  I ended up just eating the chicken cutlet part of it.  My cousin got an everything pizza... and it looked and tasted like a frozen pizza that was not microwaved all the way! The cheese looked like individual shredded pieces that did not melt... and I heard loud crunching as she bit into the crust (which was not &amp;#34;crispy&amp;#34; but more from being stale).  Our waitress was so hard to get a hold of and with all the flies, we were just anxious to get out of there.  She never made eye contact or asked how our food was, just dropped off the check and walked away quickly.  I will not be returning to this location and certainly do NOT recommend.", "rating": 1, "date": "7/14/2017"}, {"text": "Whose not a fan of The Cheesecake Factory?? This has always been a place I visit at the end of my day, trying to always avoid the crowd. I luv their mojito&amp;#39;s and they have a pretty large selection of vegetarian food. Not, just the typical vegetarian meals, but something that took some thought to create.<br&gt;<br&gt;On this visit, my daughter and I came in an hour before closing. I started with my usual pineapple mojito but ended up with two by the end of the night. I decided it was to late to eat a large meal, so I stuck with the small plate menu. I was craving a Greek salad, and it truly can&amp;#39;t be appreciated unless you add extra feta cheese, YUM!! I also enjoyed a variety of fried sticks, that included zucchini, avocado and port mushrooms. All fried to perfection with two dipping sauces, I was in veggie heaven.<br&gt;<br&gt;Overall, this was a very healthy and inexpensive meal. The customer service was great and we opted to sit outside, since the AC was blasting. I luv getting those little moments alone with my daughter, she&amp;#39;s the best company. I&amp;#39;m a regular here, so I&amp;#39;ll always be back!!", "rating": 4, "date": "9/8/2016"}, {"text": "I haven&amp;#39;t been much of a Cheesecake Factory fan, but I went for brunch &amp;amp; I may be changing my mind. I had the California Omelette &amp;amp; Brûlée French toast which was delicious. The french toast was nicely toasted on the outside with a soft melt-on-your-tongue center. I also tasted the Crab Hash which was very tasty. The crab meat was perfectly flavored &amp;amp; paired very well with the poached eggs &amp;amp; potatoes. I can now add the Cheesecake Factory to my list of places that serve a good brunch ;-)", "rating": 3, "date": "5/15/2016"}, {"text": "I love the cheesecake factory.  It has been a good go to restaurant every since I was a teenager.  There is something for everyone on the menu and a wide variety of food.  Service can be a hit or miss depending on how busy they are but the food has always been delicious.  I recommend checking out the happy hour.  The happy hour menu is much larger then most restaurants.", "rating": 4, "date": "10/28/2018"}, {"text": "I mean no need for a long review.<br&gt;Every single time I am here IT IS JUST AMAZING<br&gt;<br&gt;The atmosphere is great! The food is always fresh EVEN A TOGO.. Its such a clean atmosphere... <br&gt;<br&gt;The food I MEAN UGHHHHHH ... Its just great..", "rating": 5, "date": "3/3/2016"}, {"text": "Must say, cheesecake phenomenal, drinks are good, service below average. Had a few drinks with my sister and brother in law but majority of the time was sat waiting for a refill and 25 minutes to pay our bill. The bartenders were very unattentive, and it was like we were unnoticed when needed to order or pay. I love the food and drinks just the service was frustrating.", "rating": 3, "date": "11/12/2018"}, {"text": "Worst customer service i&amp;#39;ve ever witnessed.. i like giving restaurants the benefit of the doubt as i&amp;#39;ve been in the industry for quite some years and understand the in&amp;#39;s and out&amp;#39;s of the job better than others.. but wow no words.<br&gt;<br&gt;I came back a total of 2 more times after the first horrible experience in order to give it a fair review in hopes that my server was just having a bad day that time, but it only got worse.<br&gt;<br&gt;The last time in particular, the server had given me nachos with chicken when i asked for without, no big deal. I told him i wouldn&amp;#39;t mind eating it but I don&amp;#39;t feel comfortable paying for something i did not ask for, he huffed and said nothing, only removed the plate from the table. Came back 10 min later and said you won&amp;#39;t be charged and practically threw the plate down and walked away.<br&gt;<br&gt;No apology.. nothing. Me and my husband just sat there and ate the cold nachos. This was only the beginning of the rather eventful night to say the least. Never was checked up on.. had to search him down for another round of drinks.. and much more, unfortunately.<br&gt;<br&gt;Sad because i&amp;#39;ve always loved the food.. but the service is what will assure me that I will not be coming back any time soon.", "rating": 1, "date": "2/23/2019"}, {"text": "Sometimes I get take-out cheesecake but order two slices instead of just the one I want so the cashier thinks I&amp;#39;m nice (getting cheesecake for someone else) and that I have company waiting to eat cheesecake with me at home around 10 pm on Saturday night. <br&gt;<br&gt;Luckily the cashiers will never be able to distinguish between times when I&amp;#39;m doing the above and times when I&amp;#39;m ACTUALLY getting two pieces for myself AND another ACTUAL person. I may never order two for myself again anyway so if I come back and order two slices most likely the second one isn&amp;#39;t for me.<br&gt;<br&gt;I want to add that it would be nice if the lovely faces which are painted on the tops of the columns inside the restaurant were lowered. It might be hard to lower them since they seem permanently cemented to the ceiling but I think it&amp;#39;s worth it if you ask me. If they were lowered to eye level it&amp;#39;d create this illusion of more people dining which would make the atmosphere a bit warmer and frankly a bit more exciting. There is always the risk of neck injury with &amp;#39;doing a double-take&amp;#39; as they say which could present as a problem if people are now constantly doing &amp;#39;double-takes.&amp;#39; What I&amp;#39;m saying is if the painted faces were lower the likelihood of people thinking someone is staring at them might be higher which means their likelihood of quickly doing a &amp;#39;double-take&amp;#39; only to find out it is a painting of a face rather than a real human face staring at them (if you can even say that) would be higher which may lead to a higher likelihood of neck or other injury. The last thing I&amp;#39;d want for the CF would be a lawsuit for such an injury. Maybe we should keep the faces where they are.<br&gt;<br&gt;I will just continue my &amp;#39;double-take&amp;#39; of cheesecake for which I haven&amp;#39;t sustained an injury other than to my ego but that was in the past. I will admit I&amp;#39;m also concerned for my arteries but that is an injury for the future. Let me summarize: presently no injury is taking place. Like I said from now on I&amp;#39;ll buy cheesecake for myself (1 piece) and another person who definitely has a real human face and therefore mouth to eat the cake with (another 1 piece). <br&gt;<br&gt;Oh yes the cake is very good.", "rating": 5, "date": "6/23/2018"}, {"text": "A Saturday dinner with family, surprise seating times by 25 min . Service by nice server she bring drinks and fresh breads with butter very fast.  Ahi Tuna with Wasabi butter sauce taste amazing , 100% love it . My family ordered different food. They also like it and we have no more room for Cheesecake. Maybe next time come here only for cheesecake. Nice place for dinner.", "rating": 5, "date": "10/14/2017"}, {"text": "I was here last night on a Saturday in December during holiday shopping season.<br&gt;<br&gt;As expected, there was a long wait, but we were seated before the estimated wait time.<br&gt;<br&gt;The hostess and server were very friendly. The food came out much quicker than anticipated given the hectic conditions.<br&gt;<br&gt;The menu is a little crazy considering the types of food they offer. I don&amp;#39;t know what you&amp;#39;d consider their &amp;#34;specialty&amp;#34;. I got the Spicy Cashew Chicken and it was tasty, so that&amp;#39;s all that matters!", "rating": 4, "date": "12/3/2017"}, {"text": "Delicious food of course great service I had spaghetti nothing like the one I make.Good drinks <br&gt;Must try the original cheese cake they have <br&gt;A little pricey but well worth it", "rating": 5, "date": "10/9/2017"}, {"text": "Was planning on taking my party of nine to have a casual birthday dinner.  I attempted to call early in the week to get a reservation since the party was large, however, they stated they didn&amp;#39;t take reservations.  hmmmm... so went there in-person the day of and was told it was over a 1.5 hour wait.  Seriously?!?! So you don&amp;#39;t take reservations, and if you come in person you have to wait that long.  One-star for not having weekend reservations set up.  Just because you KNOW that you have enough business to not have to deal with reservations doesn&amp;#39;t mean you degrade the customer experience in such a manner.  Instead we went across the street to get AYCE sushi instead and had an amazing dinner.", "rating": 1, "date": "8/2/2017"}, {"text": "The front service host named Robert was extremely rude to our party. When approached with a question of a possible party change he confronted us with an attitude. From 1 hour and a half to a 3 hour wait. For what? Because I said maybe there will be another person. Mind you, this person is one hour away and the guest joining our party arrival was still in question. Yet he went and added another guest to the party. Extremely rude, did not enjoy our night. We were here to celebrate a birthday, but this cheesecake will no longer be receiving our service.", "rating": 1, "date": "1/25/2019"}, {"text": "I kinda dig this place after 3 visits. I always thought you had to dress up or at least be somewhat casual but you can come as you are, just don&amp;#39;t show up in pajamas or something ridiculous. The food was extremely hot and the bread basket I demolished. Service here is always great and I never regret traveling to this location.", "rating": 4, "date": "8/25/2018"}, {"text": "Pretty good. Though there is so much on the menu, and it can sometimes be hard to choose, the food is satisfactory. The atmosphere is nice, service was good, and food was yummy. The food took a little while to come and was a little pricey, but it was worth it. I recommend the Four Cheese Pasta.", "rating": 4, "date": "1/13/2018"}, {"text": "Today, there was good parking spot! We got a good seat fast. It was lunchtime and I order a salad . The chicken seem like it wasn&amp;#39;t cooked done  but the salad was good. I also got a carrot cake it&amp;#39;s okay . The staff was okay and it&amp;#39;s clean. I&amp;#39;ll recommend this to anyone who want some good food and drinks are okay. Thanks for the fast food, I was hungry and this ain&amp;#39;t my first here.", "rating": 3, "date": "5/26/2018"}, {"text": "Great exterior. As well as restaurant. Service could be better with the food coming out waiting times. But The Cheesecake Factory is one of my go too&amp;#39;s. Awesome food place. I love their Strawberry Lemonade as well.", "rating": 5, "date": "1/1/2018"}, {"text": "After standing for over 1 hour for a table and people that came in after us were able to sit, we finally got a table. The air was blow straight down on us on one side. <br&gt;As for the meal we got wings, nachos,  and burgers which were all good. Cheesecake was very good also. Just wont be back for the long wait.", "rating": 4, "date": "11/5/2017"}, {"text": "The only thing good about this place is the cheesecake. I came here at 7pm on a Wednesday, ordered one slice of cheesecake, and for some reason did not receive my one slice of cheesecake until 7:50pm. I didn&amp;#39;t realize that putting in a slice of cheesecake took almost an hour. You&amp;#39;d think if I didn&amp;#39;t order any entree, I&amp;#39;d want my cheesecake at the same time as everyone else. I&amp;#39;ll stick with ordering my cake to-go next time. That white chocolate raspberry truffle always has me coming back to this terrible place.", "rating": 2, "date": "10/1/2018"}, {"text": "Let me start this review with we ended up at Chili&amp;#39;s bc they always do me right. <br&gt;My husband &amp;amp; I initially went to cheesecake bc I wanted their nachos (super good) &amp;amp; we waited for an hour (poor hungry husband) got seated, the server (Jamal) got us water, then when he came back took the order for our food &amp;amp; asked if we wanted the bread as we waited, I said helllll yeahhh. Well I said &amp;#34;yes pls.&amp;#34; 15-20 mins later people got seated RIGHT next to us. As soon as they sat down Jamal came &amp;amp; put down the bread then said &amp;#34;hey girl, how you been??&amp;#34; So obv they were friends. Then took their drink order. I waited 5 more mins to see if he would bring us our bread &amp;amp; he didn&amp;#39;t. So I went to the manager &amp;amp; told him what happened. It&amp;#39;s fine if you&amp;#39;re talking with your friends, but you&amp;#39;re also at work. &amp;amp; if you see your friends I know you can see us bc we are sitting less than a foot from them. The manager said he would come bring us bread &amp;amp; check on our food. Some random servers come to bring us our actual food, then the manager comes out with the bread, but they ran out of the brown bread (ofc my fav. but the table next to us had brown bread which should have been mine #salty) so the manager said he would come bring us brown bread when more was made. They walk away &amp;amp; I realize my nachos don&amp;#39;t have chicken on them &amp;amp; I ordered chicken. The manager comes to ask how everything is &amp;amp; I tell him my nachos have no chicken. 5 mins later the server comes back &amp;amp; there&amp;#39;s just chunks of shredded chicken on my nachos. He leaves &amp;amp; I realize there is no guacamole with my nachos. I ordered guacamole. So I wait for him to come back &amp;amp; I ask him &amp;#34;isn&amp;#39;t this suppose to come with guacamole?&amp;#34; He goes &amp;#34;yeah usually, do you want me to go get it?&amp;#34; I say &amp;#34;no, just take it back &amp;amp; take it off my bill&amp;#34; he says &amp;#34;okay, np&amp;#34; then the manager comes back with the nachos &amp;amp; goes &amp;#34;we have taken this off your bill, you can have them for free&amp;#34; I said &amp;#34;no, you can take it back. It&amp;#39;s apparent these nachos were the first ones that were brought out to me 20 mins ago. I don&amp;#39;t want them. Can we get a box &amp;amp; a check?&amp;#34; He says &amp;#34;yes&amp;#34; now update on my husband, he is loving his food. He told me how bomb it was but as soon as the server leaves he goes &amp;#34;I&amp;#39;m not taking this babe, we will go somewhere else, if they give it to us for free I&amp;#39;ll take it but otherwise no&amp;#34; so the server comes back &amp;amp; hands me the check. THEY&amp;#39;RE REALLY TRYING TO CHARGE ME FOR HIS FOOD. Like no 10% discount. No free dessert. Nothing. So my husband could tell I was livid &amp;amp; he tells the server &amp;#34;look, I&amp;#39;m not taking this food &amp;amp; we aren&amp;#39;t paying this bill. We are going to have to go somewhere else to eat anyways. I&amp;#39;m not eating this food in front of her. This experience has been awful&amp;#34; the server goes &amp;#34;okay, yeah, no problem, have a good night&amp;#34; like wtf. Worst experience ever. 0/10. Would not recommend. &amp;amp; that&amp;#39;s how we ended up at chili&amp;#39;s.", "rating": 1, "date": "9/8/2018"}, {"text": "I don&amp;#39;t know what is going on with this place lately. I never in all the years I&amp;#39;ve been going here have I had a bad experience and the last 2x it&amp;#39;s been terrible. I&amp;#39;m wondering if they hired a new chef or under new management but I was there 2 weeks ago and they give us rock hard stale bread and the waiter says oh I can get you new bread but it prob won&amp;#39;t be any better  seriously? Then I went again last night and same thing. The food was not good. I hope this isn&amp;#39;t going to be a regular thing now. So disappointing", "rating": 1, "date": "11/27/2018"}, {"text": "The bitch that answered the phone was rude as fuck. She hung up on me when we were just asking if they did call ahead seating. I hope she gets fired. She&amp;#39;s rude and shouldn&amp;#39;t be working there. If I could give 0 stars I would.", "rating": 1, "date": "3/29/2019"}, {"text": "Went here on Super Bowl Sunday to talk about the Bachelor, and despite the restaurant being empty we were sat shoulder to shoulder with other guests. Chicken teriyaki was whatever, avocado egg roll was decent, my date had gumbo after ordering salmon and having them coming back saying they were out (who does that?) and even though she&amp;#39;s gorgeous she didn&amp;#39;t look to happy with it. Bartender was super nice, but for the price of 4 shots of Don Julio you could just buy a bottle at your local liquor selling establishment.  <br&gt;<br&gt;Ps-one of the couples next to use was using sign language and boy having that out of the corner of your eye is distracting. Move those tables apart Cheesecake Factory!!!", "rating": 2, "date": "2/6/2017"}, {"text": "I love this place the food was delicious, the Lasagna was well cook the employees was very friendly and helpful , I would definitely be back here. I recommend this place if you have in mind bringing your family I recommend this restaurant .", "rating": 5, "date": "7/29/2018"}, {"text": "I would give this place zero stars if i could. <br&gt;Went here for my boyfriends birthday - party of 8.<br&gt;Once sat down, drinks were ordered and given to us. <br&gt;Took over an hour to get our food, we actually ended up leaving before our food was brought to us for the simple fact people who were seated AFTER us were already served their food. Manager was no help, just kept saying sorry and that it will be 2 more minutes. Our food never came. Never had this issue with any restaurant. This was ridiculous. <br&gt;Our party ended up going somewhere else and my boyfriends birthday dinner was ruined.", "rating": 1, "date": "8/23/2018"}, {"text": "This review has 2 stars because the waitress was super friendly. Now for the bad:<br&gt;1) Bone in chicken parm pizza special. <br&gt;2) the entree I got wasn&amp;#39;t good or really what I asked for<br&gt;3) everything was extremely slow", "rating": 2, "date": "3/11/2017"}, {"text": "We had such a bad experience with Cheesecake Factory in Cherry Hill, NJ last night.  <br&gt;Utensils and the plate settings were given to us 10 minutes after our Appetizers were brought out to the table. <br&gt;Our food came out 45 minutes late. The manager came up with some ridiculous excuse for our food  coming out of the kitchen so late. One of my son&amp;#39;s Pasta da Vinci was so dry, our Tex mix egg rolls were over fried. <br&gt;We have been to many other Cheesecake Factory before, from Pasadena, Glendale, marina delray to Philadelphia, Delaware and Maryland. We never experienced such bad service.", "rating": 2, "date": "10/9/2018"}, {"text": "My mother-in-law called to make a reservation for 17 people at 6:30pm. She was told she could not make a reservation for that time, reason being is because schools are having graduation parties and it would be to late for a reservation. And she called Brio and they were more than happy to accommodate. The next time we have a party The Cheesecake Factory will not be on our list of places to go.", "rating": 1, "date": "6/5/2019"}, {"text": "It was a busy Saturday night so I understand that things will be busy and chaotic.  After an expected 30 minute wait for a table, I ordered the classic bang bang chicken and shrimp.  Being a busy night, it took almost an hour for the food to arrive...but I again understand.  The problem was, my chicken and shrimp arrived SANS chicken!  It was pretty obvious too since the plate consisted of a mound of rice with a few shrimp and sauce.  It was clearly half the normal portion.<br&gt;<br&gt;After letting the waitress know, she was very friendly and offered to correct the issue.  Apparently though, my order went to the very back of the line again since it took about another 45 minutes before I received my corrected order.  By the time I got my food, the rest of my party was finished eating and ready to go.  So let&amp;#39;s hope the food tastes okay reheated since my dinner out involved picking scraps of food from the rest of my party.  <br&gt;<br&gt;The manager did come by to say &amp;#34;Sorry about how long it&amp;#39;s taking.  The kitchen is very busy tonight&amp;#34;.  While I don&amp;#39;t expect the manager to give free food because mistakes do happen...but ANYTHING, even an appetizer or more bread would have been nice...rather than begging for leftovers from my companions.  The scraps of food I had were tasty though and our waitress was very friendly.   Manager definitely could have handled the situation better considering after around two hours waiting, I never did get to eat what I ordered.<br&gt;<br&gt;Update:  While my experience with this location was lackluster...I have to say that Cheesecake Factory corporate did an excellent job.  The Guest Relations Department with corporate read my review and contacted me right away.  They apologized and asked for additional details to allow them to investigate the problem to prevent such occurrences from happening to others.  The fact that they actually read online reviews and address potential issues is impressive.", "rating": 3, "date": "9/14/2017"}, {"text": "It&amp;#39;s always a hit and miss with this location. While I love going here and just sitting at the Hi Tops and ordering apps and drinks with friends, I find they usually screw up every other time. It&amp;#39;s mainly the kitchen, you either get a chef who can cook or you get a chef who just doesn&amp;#39;t get it. We never try to customize our food orders because the menu is so extensive that you can find something that fits your palette without a problem. Yesterday after a business meeting we decided to visit CF before heading home. I ordered my usual Basil, Tomato and Cheese flat bread and opted to try 2 new things: the cucumber mint lemonade (amazing!) and the parmesan cheesey garlic bread (fail! There was no cheese at all on there). Sent the garlic bread back and just asked for an order of fries. <br&gt;<br&gt;Just a note about their French toast for brunch. Just say no! Or go to Grand Lux across the street. Their French toast is horrible. I needed a steak knife to cut it! Not cool! They don&amp;#39;t use proper bread for french toast it&amp;#39;s more like a hard shell sourdough. <br&gt;<br&gt;For every good meal I have at CF there is always one where their kitchen screws something up. They need new chefs. Consistency is key.", "rating": 3, "date": "8/22/2016"}, {"text": "They messed up a simple order of Tiramisu take home on a Valentine Day Called the manager and they offered that it may look like a mush but will taste good. Really ?", "rating": 1, "date": "2/21/2019"}, {"text": "After a long day at the Adventure Aquarium we were exhausted and couldn&amp;#39;t wait to have a great dinner.  We arrived and were seated right away by very friendly hostesses.  We sat down anxiously awaiting for our drink orders to be taken and much to our disappointment it took the waiter over 10 minutes to get to us.  He was very polite and finally took our order and then we didn&amp;#39;t see him again for another 5-6 minutes.  He brought our drinks, but no bread.  It was still baking.  We ordered our food and about another 5 minutes passed and the bread came.  Delicious.  Soft, fresh, softened butter.  Highly satisfying - especially since we had been seated for almost a half hour at this point.  About 20 minutes later our food came out...  in drips and drabs.  The plates were so hot they couldn&amp;#39;t be touched, which tells me they sat under the heat lamps for a while before the runners got to them.  The stuffed mushrooms came out in a broth that  resembled soup.  They tasted great but we&amp;#39;re not cooked long enough to reduce the sauce.  The chicken littles are great, HUGE portion (11 strips) and cooked perfectly.  Only complaint is that they are supposed to have a Cajun flavoring to them, which isn&amp;#39;t noticeable at all.  The BBQ sauce makes up for it though - delicious! The Chicken Taquerias were also very good and do have a bit of spice to them.  The kids pasta Alfredo left something to be desired.  Tasted very milky.  The waiter never came back to check on us or refill drinks.  We waited for about 10 minutes after finishing our meals for him to resurface. We paid the bill and went to the restroom before leaving.  Very messy and not well attended to.  Both stalls were out or low on toilet paper.  The sink area was covered in water and the smell wasn&amp;#39;t pleasant.  Overall if good food and huge portions are what your looking for, this is a great choice.  But if you&amp;#39;re looking for the overall experience, beware, because the staff and facilities leave something to be desired.", "rating": 3, "date": "8/22/2018"}, {"text": "I&amp;#39;ve been the cheesesteak factory before in the king of prussia mall, PA as well as in tyson&amp;#39;s corner ,VA..... this location just isn&amp;#39;t as good. <br&gt;<br&gt;The tuna tartare was the best thing. It&amp;#39;s under the Apps. <br&gt;<br&gt;For my entree I got the chicken carbonara, pretty good. For some reason I just think the other locations have better cooks or something. The service was good here but the taste of the food was a bit off.", "rating": 3, "date": "11/6/2014"}, {"text": "Went for lunch for a family members birthday and it was absolutely delicious! Their skinny menu is fabulous and their low cal steak medallions- with edamame instead of mashed potatoes- was off the charts, only downside was the wait for a table and wait for food", "rating": 4, "date": "8/15/2017"}, {"text": "Estimated 45 Min wait. It took an hour and 45 min to be seated. I started checking in after the first hour and we were told &amp;#34;only a few more minutes&amp;#34; about 6x. I&amp;#39;m sorry but that&amp;#39;s absurd. I wouldn&amp;#39;t have stuck around if I knew it would have taken that long. <br&gt;Food was fair. It took 20 min to get drinks and after the hr and 45 min wait I was in need of a good cocktail. Cosmo was 95% cranberry juice. FAIL. The whole experience was horrible. I&amp;#39;ll never go back. 4 hours of my life I&amp;#39;ll never get back.", "rating": 1, "date": "3/10/2018"}, {"text": "Good food keeps me coming back. <br&gt;Albeit service has been spotty. Last two visits we didn&amp;#39;t receive the right order. This most recent visit, as an example, our server&amp;#39;s response to the situation was &amp;#34;I work with idiots&amp;#34; no apologies at all. Just took my dish to the back and added the missing ingredient while repeating &amp;#34; I work with idiots &amp;#34;. Extremely unpleasant. More customer service trading needed !", "rating": 2, "date": "8/7/2017"}, {"text": "My absolute favorite restaurant. Great service and a nice atmosphere every time. I get the Lemon Garlic Shrimp every single time I&amp;#39;m there because I literally cannot tear away from it. I tell everyone that it would be my last meal on death row. Best meal and it gets better every time. Also, obviously the Cheesecake is phenomenal (I love the fresh strawberry one!). Just fantastic time and time again", "rating": 5, "date": "7/19/2018"}, {"text": "Yea 5 stars for a chain location... <br&gt;I brought my wife here Sunday night for an early anniversary dinner(seeing on Tuesday i am at an interview) We have eaten at their other location in King Of Prussia and i must say seeing this is the second time.. no complaints..<br&gt;<br&gt;We had outside seating seeing the weather was Gorgeous and the wait time was 1 min, compaired to 15-20 min for inside dining. Which is common for this place, also its not as cold as it was inside.. felt like a cold box once you walked in. My wife as much as i LOVE her she is always cold.. it could be 85 outside and she can still complain about it being cold.. Don&amp;#39;t know its her Latino blood.. but thats besides. The outside was perfect, light breeze, beautiful scenerie.. a look of the stores and how it was lit up by the lights and florals outside. (Not saying inside was bad, that too looked comfortable, easy on the eyes)<br&gt;<br&gt;Our service was great, our waitress was friendly recommended some specials there were doing. They also have a newer menu out its their 500 calorie or less menu(for those of you who want to enjoy the great food, but not to worry about gaining weight)I saw the menu, i looked over it , i must say i was impressed, the meals they had on there.. you wouldn&amp;#39;t think they were 500 cal, or less.<br&gt;<br&gt;OK now lets get into the goods... <br&gt;<br&gt;We started off with some drinks, wifey got the Pina Colada, i got the Pomegrante Mojito.. (very very good) , our appitzers we both went salads, my wife got the veggi salad,(this is one big salad) and myself a Boston salad.. Lets say Boston won this battle of the salads, very tasty, had bacon on it so you know its a winner hands down, shredded and little chunks of  blue cheese and ranch dressing.. I reccommend that salad if you guys like salads.. <br&gt;<br&gt;For our main course, which i gotta say the portions are incredible.. more like HUGE. My wife and i both went with steaks but she had the shrimp scampi with a fillet cut medium, with wasabi mash, and veggies. Looked great , cooked to her likings. Myself i went with the Hibachi steak, medium with tempura asparagas, also wasabi mash, shitake mushrooms in a sweet, but not overbearing sauce.. gotta say they knocked it out of the park with this... Phenominal. <br&gt;<br&gt;Our waitress did a great job, made sure if we liked evrything, or any problems.. it did get a little cold outside(for my wife) i enjoyed it... but i did ask if she could turn on the heater they have, she did, without any hesitation or surroundings people. I think the wives/gf&amp;#39;s around us were also grateful of this.. <br&gt;<br&gt;We didn&amp;#39;t get any cheesecake  because we were full , but i know she brought home 2 slices, dulce de leche, and a vannilla bean.. do you think i will get a taste.. ERRRRR wrong lol . But we did walk around after the meal to look at the stores .. i recommend that after this feast you will embark", "rating": 5, "date": "4/16/2012"}, {"text": "This hit the spot today. Great way to end the day on a high note with a late lunch at Cheesecake Factory. Its as good as i remember it since last time I was here. Went light today so ordered a Sante Fe salad. Nice fresh ingredients, black beans, vorn, and tortilla. I was loving all the fixings in this salad. I really enjoyed this meal!!!!", "rating": 5, "date": "8/5/2016"}, {"text": "Came for brunch. The food was pretty good. Surprisingly no wait even though it&amp;#39;s Saturday. It&amp;#39;s pretty much what I would expect from Cheesecake Factory. Food pretty good and excellent service with somewhat cheesy ambiance (no pun intended.$", "rating": 4, "date": "1/15/2017"}, {"text": "Unless you want to keep your group or date waiting around for a table, this isn&amp;#39;t a good spot for special occasions nor dates. And yet that&amp;#39;s what virtually Everyone comes here for. Seems logical, i know.<br&gt;<br&gt;The decor is nice as usual, but it&amp;#39;s getting a bit dated/run-down from all the hordes of patrons.<br&gt;<br&gt;The service is spotty; sometimes you get an energetic smiley server, and sometimes you get an aloof one eager to finish their shift.<br&gt;<br&gt;Once the obscene portions of the food are overlooked, the food is actually pretty good. I am a big fan of non-boring flavors-- bitter, sour, pungent, umami, etc. So that narrows the chain&amp;#39;s encyclopedia-sized menu down a bit.<br&gt;<br&gt;I recommend any of the cajun, thai, and comfort-style meat dishes for these types of flavors. Some lemon-based Italian dishes too. I say the comfort dishes (shepherds pie, chicken madeira, chicken &amp;amp; biscuits, etc) due to the umami flavor caused by the jus mixed with the starch.. The Mexican-style dishes are mostly Tex-Mex which are not interesting.<br&gt;<br&gt;Arguably, only a few cheesecakes are really worth getting: purist related. Original, orig. + strawberries, oreo, vanilla bean, white chocolate rasp, &amp;amp; red velvet. That&amp;#39;s pretty much it. Nothing too complicated, nothing chocolate-centric--if you wanted to cover up the cheesecake flavor, just get sponge cake. <br&gt;<br&gt;So that&amp;#39;s my .02...a good place aside from the evening wait times", "rating": 3, "date": "2/23/2016"}, {"text": "Love this place. Such a great chain all around. Clean, very friendly and attentive staff and quick service.<br&gt;<br&gt;I am aware that this is a chain and sometimes I feel it goes against my nature to review chains and support chains because I feel it necessary to support your local businesspeople! But either way, I came here once with my boyfriend after shopping at Wegmans and it was delightful.  Granted it was at like 3 or 4pm on a weekday so it wasnt busy but the service was excellent, fast and friendly.  The food was amazing.  The fried mac and cheese was out of this world and I just got the quesadillas because I was in the mood for them.  They were delicious as well.  The fact that you have a million different options on that menu is alone a treat.  I would recommend this place for birthdays with family members or large parties like that because everyone can get something they like because the menu is THAT extensive.  For a chain- Cheesecake factory takes the cake (oooooh, get it?!?!?!?)", "rating": 4, "date": "10/30/2014"}, {"text": "Long wait but what can you expect at 5:00 pm on a Saturday night?  Absolutely delicious dinner, cooked to perfection but top that off with fantastic service from a young server named &amp;#34;Will&amp;#34; and you have a great dining experience!  Too bad every good restaurant can&amp;#39;t have a few &amp;#34;Wills&amp;#34; because he&amp;#39;s the one who sets the tone for an enjoyable dinner!", "rating": 5, "date": "3/23/2019"}, {"text": "The good place to go for any occasion the service was good the food was and of course the cheesecake there is good the burrito I had was good I would definitely go again", "rating": 4, "date": "2/6/2017"}, {"text": "Awful service. I purchased the children&amp;#39;s pasta. I told the waiter it was very hard. He brought over the manager. He agreed it was very hard. I asked for it to be taken off, they did so, only after asking. We waited so long for our checks. Our waiters switched mid service. We were asked to tip both waiters. The first sat us down only. We sat for 45 minutes waiting for basic food items. Very very poor service.", "rating": 1, "date": "5/2/2018"}, {"text": "There&amp;#39;s nothing wrong with this place, but I am not a Cheesecake Factory fan.<br&gt;<br&gt;My daughter and I had dined in one in Baltimore a couple years back.  We were totally unimpressed.  My wife has wanted to go, but after our review, she&amp;#39;s been a bit gun-shy.  We visited here when we realized we were kind of trapped in the area for some time and were hungry.  <br&gt;<br&gt;The menu in this place is entirely too large.  There is no reason to have so many selections.  This tells me they want to cater to everyone, but excel at none.  And that pretty much sums this place up.<br&gt;<br&gt;This was a better experience than the Baltimore store, but the food is very generic and nothing I would ever say, &amp;#34;Hey, you have to have this dish.&amp;#34;  You can visit and find something that isn&amp;#39;t horrible and overpay for it.  Other than that, I&amp;#39;ll pass from now on.", "rating": 3, "date": "9/10/2017"}, {"text": "Host was very rude, unreasonable and extremely unprofessional. Robert has terrible customer service when we asked to simply add one more person to our table he added an additional 2 hours to our wait time. When I asked for explanation and chance to change our table situation he had an attitude and told me to relax..I don&amp;#39;t know who trained their employees on positive customer service skills but there were none. Disappointing to say the least.", "rating": 1, "date": "1/25/2019"}, {"text": "Don&amp;#39;t come on a Sunday. I was told a 30 to 40 minute wait..........more like on 2 hours now. ‍ Also I didn&amp;#39;t know you could make reservations.....when did that start? There was a whole section blocked off for a party. I will make reservations next time. ‍", "rating": 4, "date": "2/25/2018"}, {"text": "excellent execution for all three entrees ordered ! the bacon cheeseburger, the chicken and shrimp gumbo and the huevos rancheros !!!!!!cant go wromg with anything on their menu! the gumbo sautee was perfectly cooked moist tender pieces of chicken and shrimp they too were moist and cooked perfectly.", "rating": 5, "date": "11/26/2017"}, {"text": "Good food and drinks. Had the wrong dish delivered to me and before I could mention it the server was there and corrected my order. Staff was great and service better.", "rating": 4, "date": "5/24/2016"}, {"text": "i think it&amp;#39;s safe to say that Cheesecake factories are busy and a wait is expected when you come in.  With that being said, our last visit was actually a pleasant surprise.  Our party of 5 came in for sunday brunch and *gasp* no wait.  All of the food was good, i cant remember what everyone ordered but my meal was the GREEN CHILAQUILES WITH CARNITAS AND EGGS.  It was delish and pretty big- honestly a two person meal.  My husband ordered the chorizo and avocado omelet and it was really good and on the bigger side too.  Our niece ordered the kids mac and cheese and it was tasty! <br&gt;<br&gt;If you decide to visit i definitely recommend the sunday brunch and the cucumber mint lemonade.", "rating": 4, "date": "7/5/2016"}, {"text": "Oh cheesecake factory, you are like my standard go to little black dress when I&amp;#39;m not really sure what I want to wear, that I can just pull out of my closet in a pinch and still look fab!<br&gt;<br&gt;I&amp;#39;ve been to the cherry hill cheesecake factory multiple times.  Now- for any of you who know anything about the cheesecake factory, you can expect a wait when you go during prime times. Off hours the wait time is not bad at all, particularly for late night bites. <br&gt;<br&gt;Drinks can be a little expensive ( draft beers run ~$8)/ but cocktails are fresh and usually pretty good. The menu is HUGE. You can get jut about whatever type of continental food you would like to order. I feel like I am never disappointed. The staff is courteous and friendly. Your meal always starts with delicious fresh bread (pumpernickel and white).<br&gt;<br&gt;And then of course the dessert, I usually don&amp;#39;t even like cheesecake but give in and order while I&amp;#39;m here. <br&gt;<br&gt;A great standard go-to in south jersey when you are really not sure where to go.", "rating": 4, "date": "3/28/2016"}, {"text": "Terrible service.   The server never asked if we wanted drink refills.  The server basically ignored us.    The food was subpar to say the least.<br&gt;<br&gt;This was my second time to the cheesecake factory,  and sadly this experience was worse than the first. <br&gt;<br&gt;I won&amp;#39;t go back.", "rating": 1, "date": "3/19/2018"}, {"text": "Food was as expected. It was not bad. Fish tacos were good, my shrimp with angel hair pasta with marinara sauce was good... A little bit on the spicy side but still good. I ordered he dinner portion even though there was a lunch portion available for $3 less. I ordered the dinner portion cuz the waitress said most people can&amp;#39;t finish it and they take home the left overs. I did not have any left overs. Either my appetite has increased or the portion wasn&amp;#39;t anything humongous.  The hibachi steak was sweet and yummy and the pasta with white sauce was good as well.", "rating": 4, "date": "6/25/2016"}, {"text": "Absolutely LOVE this place, always my to go place for a nice night out with family!! Zack was great! The Herb Crusted Salmon is awesome! The Pasta Da Vinci as well!!", "rating": 5, "date": "8/27/2016"}, {"text": "Service was excellent, great team work led by Ryan.  Ryan was on top of things . Did not miss a beat. The requests were delivered without waiting and wondering when they will serve. They fill our drinks without asking. Same with Ben, refill the bread with lots of butter. Food was ok. Chowder needs to be thicken a little bit. Overall the good was ok. Thanks Ryan and ben", "rating": 4, "date": "5/22/2015"}, {"text": "I find the appetizers I ordered are filling. The crispy wontons &amp;amp; spicy crispy chicken taquitos... But, ohhhh the cheesecake.....<br&gt;<br&gt;This place is a sin just walking through the door but who cares with all their delicious food and dessert. But if you feel too guilty they have a Skinny Girl menu.......", "rating": 4, "date": "7/6/2013"}, {"text": "Jan 18, 2018 we went to this location for dinner.   When we were seated, we didn&amp;#39;t have enough menus and waited for our  waitress to come which took a little longer.   Bottom line is  that she wasn&amp;#39;t attentive at all and when paying my Bill, she got the nerves to circle the receipt like she did a outstanding job.", "rating": 1, "date": "1/18/2018"}, {"text": "Just got back from eating dinner here with a friend. We specifically asked to be seated in a spot that was less loud than the rest of the place. We were sat at an end table by a window but when the mother and her 10 year old kids came to sit..they were obnoxious..cursing..not sitting.. yelling and the mother did nothing. I went to the front desk to tell them about the nuisance and they just said sorry. I then found the waitress and told her and she also said sorry. When I asked if our seats could be moved, she said no because it was too crowded. No body offered to move us, I had to ask. My friend and I couldnt have a conversation because they were so loud and inappropriate. We told the waitress we have to take our desserts to go because it was too loud. Nobody offered to discount our meal or comp the desserts at least. On way out, we asked for manager and told him and he apologized like 5 times yet didn&amp;#39;t offer coupons or any incentive to return. All he said was ask for him next time and when I said there wont be a next time he didn&amp;#39;t say anything. Managers shouldnt put customers on the spot by saying &amp;#34;what can I do to fix this.&amp;#34; They should already know and just do it. Ridiculous management.", "rating": 2, "date": "1/17/2019"}, {"text": "Always a little wait when going to this location, but nothing major. One of my favorite restaurants. Food is always awesome! My go to is the chicken Little&amp;#39;s or buffalo blast as an appetizer. The Tex mex egg rolls are also good as an appetizer. Overall, I never have any complaints with The Cheesecake Factory !", "rating": 4, "date": "1/6/2018"}, {"text": "It took forty five minutes to get our food, my daughter&amp;#39;s tacos were cold, and my husband&amp;#39;s fries were cold. The lemonade apparently was very good though. My baked potato soup was just average. The waitress was good.", "rating": 3, "date": "1/6/2018"}, {"text": "The Cheesecake Factory has a lot of different cheesecake. When you coming in to the Restaurant your eyes go straight to the Cheesecake. Their Happy  Hour is a nice place to unwind after a long day after work. The menu has a lot to chose   from. The outside seating is a breath of fresh air.", "rating": 4, "date": "2/26/2017"}, {"text": "Great chain!!!! I can&amp;#39;t believe I&amp;#39;m giving it 5 stars but it totally deserves it! The wait was insanely long (60-90 mins), but what else would you expect on a holiday weekend Saturday night. We got a great waitress and a bunch of awesome appetizers and great entrees. I got the Mac and cheese burger and it was TO DIE FOR. Please try it - you won&amp;#39;t regret it. Okay, yes you will because you&amp;#39;ll be so full... but don&amp;#39;t think of that! Their cheesecake of course was amazing as well.", "rating": 5, "date": "2/24/2016"}, {"text": "Super yummy. Definitely a place to try out. Got the salmon with herb and it was delicious. The atmosphere is really nice. Their free bread is yummy also.", "rating": 5, "date": "8/9/2015"}, {"text": "Always love to go to the Cheesecake Factory and this visit for my birthday it was horrible should of went to melting pot but last second I decided to go here as it &amp;#34;was&amp;#34; one of my favorite places. First off took for ever to get our apps when they did arrive the stuffed mushrooms were a joke half of them not stuffed cause they were so tiny waiter said he get a manager.  No manager showed up he said they get another one to us in 7 min well 10 min later no app 12 min our meals arrived.  So i was like well it&amp;#39;s too late for the mushrooms he said he will get them wrapped.  Well then I order blacken shrimp not spicy at all and no flavor they were size of a nickel and my guest order shrimp scampi they were huge and had flavor. This night felt like a disappointment and horrible way to end my birthday.  I was so un happy I just said no to desert here which was a first for me. On top of that they charged me twice for the mushrooms then only took one off I ask for a manger and 13 min later no one arrived I just paid and left.  I should of went to the melting pot for my birthday huge mistake.", "rating": 1, "date": "9/1/2018"}, {"text": "Always a pleasure to eat at The Cheesecake Factory, no matter where at. Service and food is always great.", "rating": 4, "date": "8/29/2017"}, {"text": "What is it about this place that draws ENORMOUS crowds everywhere?  No matter the location, I&amp;#39;ve never walked into a Cheesecake Factory and been seated without a wait. My recent visit to the one in Cherry Hill was no exception.  Thinking we were &amp;#34;early&amp;#34; for dinner on Saturday evening, we were told to expect a 50 minute wait by a very efficient hostess.  Thankfully it didn&amp;#39;t take quite that long (more like 25 minutes) before we were seated. <br&gt;<br&gt;Busy restaurants means tight tables, no matter how big the interior may seem. We were nestled next to two couples on either side, which wasn&amp;#39;t too big a deal, although it&amp;#39;s always awkward to hear every word of other people&amp;#39;s conversation. <br&gt;<br&gt;I&amp;#39;m always overwhelmed by the mish-mosh of offerings at CF (which seems to match the decidedly un-themed, lavish decor).  This time, I decided to stick to appetizers, allowing me to try a few different things.  We split the fried mac and cheese balls and the crabby bites, which were both delicious.  I then ordered veggie fries (fried avocado, zucchini, and portobellos), which were unfortunately very disappointing.  I&amp;#39;ve had awesome avocado fries before, but the breading seemed all wrong on these.  Luckily I&amp;#39;d also ordered the pear and blue cheese flatbread, which was excellent - the arugula on top had a lemon-y drizzle that I thoroughly enjoyed. <br&gt;<br&gt;Despite being stuffed, we couldn&amp;#39;t leave without cheesecake, so we ordered it to go. I don&amp;#39;t think you can go wrong here, as they&amp;#39;re all delicious, but my Adam&amp;#39;s peanut butter/caramel/brownie concoction was perfect, and actually lasted two days. Perhaps next time I&amp;#39;ll skip the wait and just order cheesecake to go!", "rating": 3, "date": "4/16/2015"}, {"text": "I&amp;#39;ve been here a half dozen times and find this to be a decent restaurant. <br&gt;<br&gt;They have great ranch dressing, I must say. It has a hint if garlic, yum. Their alcoholic drinks are made well. Their dessert is good, but eight dollars for a small piece if cake is outrageous! Not worth it, when it costs that much to make an entire cake. Their food is hit or miss. My friend got fish tacos once and then shrimp scampi, and didn&amp;#39;t like either. I tasted a friend&amp;#39;s French fries, and they were over salted. That&amp;#39;s annoying coming from fine dining. My sweet corn tamale cakes were too sweet and lacked a good contrast in textures - the cakes should be crisp with a crunchy exterior, but they were super mushy. I&amp;#39;ve found their pasta and salad dishes to be the only consistently yummy dishes. The pumpernickel with oats served right away and warm are a favorite as well. <br&gt;<br&gt;They also don&amp;#39;t put the prices on the menu for the alcoholic drinks...not a fan of not knowing what you&amp;#39;re getting for the price.<br&gt;<br&gt;If you&amp;#39;re going here, I say stick to the classics. They don&amp;#39;t pull off trendy, unique dishes very well at all. Cocktails tend to be very sweet as well, so watch out if you don&amp;#39;t have a sweet tooth.", "rating": 3, "date": "7/2/2013"}, {"text": "The Cheesecake Factory how i love you so, everything about you from the decor to the food makes me wish i could stay here forever. This place is spotless at all times not a spill or a napkin out of place. The bathroom doesn&amp;#39;t smell and its clean. Clearly, people must agree considering the fact that its almost always packed dinner time. which is completely understandable. Some people would walk out and find another place if they said 25-30 minute wait but no one leaves because the food is well worth the wait. <br&gt;<br&gt;The menu has food from every continent and every culture. Even the bread and butter is delicious. The food comes out not only smelling good and tasting delicious but looking like a piece of art. The decor alone will make you forget your in a restaurant because you&amp;#39;ll be too busy admiring the architecture and the artwork along the ceiling and the walls.  The waitresses/ waiters manage to always look clean with their white shirts always crisp and never dingy. The silverware isn&amp;#39;t just &amp;#34;clean&amp;#34; it&amp;#39;s shining and the knives are never dull. The bar is fully stocked with a huge flatscreen to compliment it. What&amp;#39;s not to love about The Cheesecake Factory?", "rating": 5, "date": "4/2/2013"}, {"text": "Like my cousin Drizzy Drake(not really) says&amp;#34;Why you gotta fight with me at Cheesecake/You know I love to go there,&amp;#34; no fighting but it is always reliable for a great food. To be honest, they under salt everything which i understand is common practice amongst chains(i might have made that up) so i will let it slide and i feel guilty complaining about salt levels on more than one review. Maybe im the problem? lmao anyways food was awesome schmashed it all and murdered the salted caramel cheesecake...easily the best cheesecake in history...ask Junior and Jesus i bet they agree", "rating": 5, "date": "5/9/2017"}, {"text": "I&amp;#39;ve been on a Cheesecake Factory kick for the last two weeks and I can&amp;#39;t seem to figure out why. Usually, I find their main dishes to be mediocre, but lately, I&amp;#39;ve craved their appetizers , drinks and cheesecake, so I guess I just answered my own question.<br&gt;<br&gt;For two weeks in a row, I have shared an app and a salad with the parties I was with and gotten a slice of cheesecake to-go. I ordered the skinnylicious chopped vegetable salad two weeks in a row, and it doesn&amp;#39;t disappoint.  One week, my group ordered the factory nachos, which I found mediocre, and the other week, the tex mex egg rolls, which were a hit.<br&gt;<br&gt;One person ordered the four cheese pasta which was absolutely amazing, and another, the black pepper shrimp, which was okay.<br&gt;Their passion fruit martini  and Asian pear martinis are always a hit, and although they are pricey, they are pretty strong, so it is a good deal.<br&gt;<br&gt;As far as cheesecake goes, I have taken a bite of their tiramisu cheesecake (not too great) and their banana cheesecake (delicious) in the past two weeks and have had the red velvet cheesecake (my favorite) in the past.", "rating": 3, "date": "2/6/2015"}, {"text": "What happened to this place?!?! I used to love it there. My friend and I went to eat there on 4/25. We were greeted ( or not) by a host I believe. We asked for a table for two. First she said we were standing in the wrong place. She was clearly frustrated. She proceeded to give us a poor attitude. Finally I became irritated and asked if there was an inconvenience? We came in at 9:55pm so I wasn&amp;#39;t sure if they were trying to close. She told me they closed at 11. I told her she seemed unhappy that we asked to sit and she responded by saying she didn&amp;#39;t feel like being there. Wow... that left me speechless.<br&gt;When we sat down to eat, I&amp;#39;ll admit the food was still great. The waitress was nice at first but then became a little snippy when it came to boxing our food. I felt like we weren&amp;#39;t wanted there. I would usually chalk it up to a one time thing but i visited there 3 weeks ago and noticed the customer service was declining then. <br&gt;     Personally, I love a friendly atmosphere. I love to tip. But I couldn&amp;#39;t bring myself to leave more than the average tip (15%) and I rarely ever do that. In the future, I&amp;#39;ll probably love you guys from afar and just buy cheesecake. The people who take the orders for the Cheesecake are at least friendly. Especially this lady who works Tuesday night with short hair.", "rating": 2, "date": "4/25/2017"}, {"text": "So... The Cheesecake Factory.... for one, this place has a pretty good size menu with a very extensive list of food varieties and drinks. Oh you can not forget the cheese cake lol. The atmosphere was very nice, and our waitress was very professional. I think I would recommend coming here for lunch versus dinner as this place gets pretty packed in the evening hours. I would definitely recommend at least one visit to this place to scratch it off of the bucketlist!", "rating": 5, "date": "11/10/2014"}, {"text": "Yeah it&amp;#39;s a chain, and yeah maybe it takes 4 hours to get a table, but the CSF is top class.  The menu is no lie 40 pages long so you can get a steak or a pizza or a burger or probably something you didnt even know existed.<br&gt;<br&gt;The cocktails are great and the cheesecake is awesome, if it wasn&amp;#39;t I think they would have a different name.<br&gt;<br&gt;This isn&amp;#39;t actually a factory, keep in mind, and it does have a classy casual atmosphere with some great decor and lighting.", "rating": 5, "date": "1/2/2015"}, {"text": "Love coming here for brunch on Sundays! Had Julia as a server the other day and she was wonderful! Keeps the drinks full and makes sure the food comes out quickly.", "rating": 5, "date": "10/21/2018"}, {"text": "Place is all hype, mediocre food. They have to much of a menu they need to focus on just a few areas of their menu to make them fantastic. Pricey, loud and we all have been that guy waiting an hour outside for a 3 star overpriced meal. I do really love the patio Seating though and the wait time to eat outside is usually small If there is one at all.", "rating": 3, "date": "6/29/2015"}, {"text": "After waiting 2 1/2 hours still didn&amp;#39;t get seated they told us we still have 45 minutes to seat it was to crowded and the staff was very rube including the manager. We was told we have tables assigned to us but the customers didn&amp;#39;t get up yet after being there over 4 hours. You would think after waiting 3 hours and 15 minutes they would be a lil nicer but my family couldn&amp;#39;t wait so we left I would never go here again this location anyway", "rating": 1, "date": "10/7/2018"}, {"text": "The food was great<br&gt;We enjoyed the avocado eggroll and the pasta was very good as well<br&gt;The service was ok but the waitress wasn t patient at all", "rating": 4, "date": "6/11/2016"}, {"text": "I went out on a date here and was so excited! I&amp;#39;ve been here once before but never realized how LOUD this place was. We were seated immediately, but then it took almost 15 minutes until someone even came up to us to take our drink orders. Our waiter was a young guy, but he was sort of awkward and kinda gave us an &amp;#39;eh&amp;#39; perception. Our apps came out fast, and our second round of drinks did too. I thought to myself, &amp;#34;alright things are looking up.&amp;#34; Well I went to grab my drink and there was a fruit fly in it! I wasn&amp;#39;t grossed out, but taken back a little and just scooped it out with a spoon and proceeded to ask myself &amp;#34;is this gross if I drink this?&amp;#34; I did Anyway. Things were going pretty well until the waiter next to us used my chair to lean his arm against while he was talking to the guests he was serving.... I was so baffled and looked at him and he removed him arm but jeez! That place is close seating as it is and just felt like my space was invaded. The sun was out so they ended up opening the shades, which revealed all of food splatter, hand prints and dust on the benches and tables. Our meal and dessert was great, but the atmosphere was very disappointing. A bunch of the waiters were standing around up front chatting and the tables Surrounding us took forever to be cleared. Very disorganized. The bathrooms were also very messy. I will not be returning here! Pick ups ONLY.", "rating": 2, "date": "8/5/2018"}, {"text": "We are not difficult to please, and this is not our first visit to a Cheesecake Factory. In fact, this is my first negative review EVER on Yelp. However, it&amp;#39;s hard to describe how disappointing today&amp;#39;s lunch visit was in this Cherry Hill Location. We were seated quickly, as the restaurant was not too crowded. Our waiter, Eric, was friendly when he took our drink order, and gave us plenty of time to study the menu. I did not realize that was probably because time apparently didn&amp;#39;t matter to him. We made a simple order--Asian lettuce wrap apps, a macaroni and cheese burger (medium well), and a soup and salad. <br&gt;<br&gt;Eric left, and two other couples came in and were seated near us. We sat and waited for our appetizer, and time started ticking away. The appetizer took FOREVER to come out, and Eric apologized for the wait. We were fine with that. Then, it came time to wait for the meal. We waited and waited, and watched the other two couples receive their meals. They had burgers and salads too. Their burgers had so much meat that they looked like they did not fit on the bun. Their salads had lots of fresh looking veggies, and their burger came with an abundance of fries on the plate. Eric walked by several times, but never with any food for us. He apologized again for the wait, and left and came back, but still did not have our food. <br&gt;<br&gt;We had been in the restaurant an hour at this point. Eric walked by again, and I said, &amp;#34;any luck yet?&amp;#34; He said, &amp;#34;Yes, soon.&amp;#34; I said, &amp;#34;I don&amp;#39;t understand, those two couples came in and ordered long after we did, and are almost through with their food. We only ordered soup and salad and a burger. I don&amp;#39;t understand the delay.&amp;#34; <br&gt;<br&gt;Eric left, and the next time we saw him he had our food. I look at my husband&amp;#39;s burger. It was half the size of the bun, and look like it was cooked to the point of being a hockey puck. There were no fries on the plate, and Eric said the fries will be right out. Eric lay down my stupid salad as well, the soup looks fabulous but the salad was nothing but greens tossed in a light dressing. I was surprised that there was not even a cucumber or tomato or a shredded piece of carrot in sight. <br&gt;<br&gt;My husband and I just looked at each other stunned, and started eating. He could barely chew his char-burnt burger that was supposed to be medium well. Several minutes later a table runner brought out a small cup of cold french fries.  <br&gt;<br&gt;My husband and I were quiet the rest of the meal, and did not see Eric again for a while. No asking how the food was, no offers for refills, nothing. He finally showed up, and spoke just one word, &amp;#34;desserts?&amp;#34; My husband and I responded simultaneously with a somber &amp;#34;no&amp;#34;. Eric quietly gave us our check in and we paid and left. To add insult to injury, The cloth table napkins had shed white lint all over my black sport, my husband&amp;#39;s shirt, and his shorts.", "rating": 1, "date": "7/25/2017"}, {"text": "Has a host ever ruined your dinner? Well thus was our experience today: we arrived today (Tuesday) to meet their hosts Robert and a young blonde lady. We were advised that our wait was 45-60 minutes. After waiting 50 minutes we realized there was no one else waiting outside so we walked back in. Upon entering we realized there was no one else waiting, at all. I approached the host and ask about our estimated time of wait and her response was &amp;#34;you were told 60 minutes and it hasnt been 60 minutes&amp;#34;. Her tone was no means friendly or polite. 2 minutes later a new family, a party of 10, just like us walk in and are seated right away. Again, I approach the hostess and ask her why were they seated before us if their table was for the same size party as ours and I have been here 65 minutes now. She says your table is being cleaned now, at this point, my twmper has reached the roof. I polite answer that was not my question so she quickly rushes us to our tanle to avoid the question. As we are being seated we find dirty plates set on the table. We asked to speak to the manager who&amp;#39;s name us Ryan, he was very apologetic for our experience and offered a free appetizer to make us feel better. At rhis point, i am no longer hungry but my family shouldnt have to suffer after waiting such a long time to eat.", "rating": 1, "date": "7/17/2018"}, {"text": "went today for lunch. service was horrible and food took forever. was there for about 2 hours and it was not crowded at all. waitress didn&amp;#39;t come by for drink refills. food tasted bland and lettuce was wilted. won&amp;#39;t be back here for a good while.", "rating": 1, "date": "5/15/2018"}, {"text": "Middle of the road chain restaurant. The Cherry Hill location is very aesthetically pleasing, and the food is above average. I especially like the white chili chicken and the fennel salad. The menu is ridiculously overwhelming, however. Be prepared to spend some time pouring over the 20+ page menu. Drinks are overpriced and nothing special. Bread basket is good, especially the brown bread. A good option before/after shopping at the CH mall or in the plaza.. if you don&amp;#39;t mind chain restaurants.", "rating": 3, "date": "10/1/2014"}, {"text": "Despite our disappointment with the removal of certain items (more on that) the Cheesecake Factory does not disappoint when it comes to consistency or portions.<br&gt;<br&gt;We met some friends for brunch on Saturday and were seated right away (we got there when it opened - 11am..ideal) and ordered some drinks.  The cafe mocha, a rich chocolate and coffee blend, is one of my favorite coffee-style drinks.  We were planning to start off with our all-time favorite CF appetizer, the chicken croquettes, but were saddened to learn that they had been removed from the menu.  (deep breath) but we had to move on.  It&amp;#39;s actually a good thing that we didn&amp;#39;t since we filled up on bread and still couldn&amp;#39;t finish our entrees.<br&gt;<br&gt;I ordered the breakfast fiesta burrito; loaded with cheese, potatoes, scrambled eggs, chorizo sausage, peppers and onions, stuffed inside a giant tortilla shell and served on top of a very spicy and delicious tomatillo sauce.  They also present it with a side dish of black beans, but I barely touched the mundane additives; I&amp;#39;d ask for the burrito without them next time.. or substitute some fruit.  Either way, the burrito was amazing and I almost finished it, but remembed to save room for dessert.<br&gt;<br&gt;My wife was feeling more lunch&amp;#39;ish and went with the chicken littles (an oxymoron if I&amp;#39;ve ever seen one).  Her plate came loaded with fresh (easy to tell it&amp;#39;s not factory compressed) chicken tenders, mashed potatoes and a corn/zucchini succotash.  The chicken was delicious, especially with the bbq sauce.<br&gt;<br&gt;Our companions chose the same style of entress, one got a hamburger and the other a breakfast sandwich.  Both reported them as tasty.<br&gt;<br&gt;Dessert brought the next round of disappointment.  Maybe they moved it, but they used to have an awesome chocolate cake, layered with chocolate and coconut.  By far, one fo the best non-cheesecake desserts in their repertoire.  It, along with the chicken croquettes, will always be remembered.<br&gt;<br&gt;Nonetheless, we&amp;#39;ll definitely be back!", "rating": 5, "date": "3/27/2013"}, {"text": "Love it here! Haven&amp;#39;t had a bad experience yet and hopefully it stays that way.<br&gt;<br&gt;You can&amp;#39;t go wrong ordering the Louisiana Chicken or Spicy Chipotle Chicken Pasta. Super tasty!<br&gt;<br&gt;The days that I want to eat light, I&amp;#39;d order the BBQ Ranch Chicken Salad with the dressing on the side. Portions are always huge and delish!<br&gt;<br&gt;For cheesecake, I&amp;#39;ve only tried the Red Velvet and Oreo. Both arw superb!<br&gt;<br&gt;Service is always very good and friendly as well.", "rating": 4, "date": "9/11/2014"}, {"text": "Went on Good Friday to celebrate my daughter&amp;#39;s and cousin&amp;#39;s birthdays.  Service was good, drinks (both alcohol and non) were tasty.  Food was good except my cousin&amp;#39;s pasta, which was very dried out.  I encouraged her to send it back, but she was starving and did not want to wait for a new plate to arrive.  The rest of the meal was good and our waitress was very attentive.", "rating": 4, "date": "4/25/2017"}, {"text": "Ugh hate to leave another review but service has gone down. Went to eat and didn&amp;#39;t sit at the bar this time. Say a high top . Waitress didn&amp;#39;t come over for over 15 minutes to take our drink order. Food took over 35 minutes and all we ordered was an app and a sandwich! Took even longer to drop the check and scan it, and was just generally only there when we didn&amp;#39;t need her, not there when we needed her. Also, I stood at the host stand for ten minutes before someone acknowledged me and finally just sat myself at a high top. Maybe only takeout from this location for now on.", "rating": 2, "date": "5/12/2017"}, {"text": "Brought my boyfriend here for this birthday, tagging along my friend and her boyfriend. The 1st time I was here, there was a very cute server, and he was our server. (I was still single then, so it&amp;#39;s okay) I didn&amp;#39;t know if I was drooling over the food or over his cuteness", "rating": 3, "date": "8/15/2016"}, {"text": "Went for my daughters 18th Birthday dinner, appetizers were great, recommend the fried chicken sliders. Dinner portions were large, and the menu ranged from Italian to Mexican a little something from whatever you would be in the mood for. As expected the cheesecake selection was plentiful, our family ordered four separate types, celebration was our favorite. Waitress was young and a little distracted by friends of hers at another table that is only negative and that wasn&amp;#39;t too bad, would definite go back again", "rating": 4, "date": "8/4/2017"}, {"text": "So tonight my son and I went out for a late dinner (he got off work at The Cherry Hill Mall at 10pm). We got in the restaurant about 10:10, we were seated immediately. Our server greeted us, seemed very friendly at first. We asked for waters with lemon and for bread, we got water no lemon, no bread... I flagged him down for lemon. No problem, he got it for me. Let&amp;#39;s say it&amp;#39;s approximately 10:20. He never returned to our table until 10:53. We asked for bread again... I told my son,&amp;#34; if my food is not on this table by 11:00 I&amp;#39;m leaving&amp;#34;. The food arrived at 10:56 for my son, mine came at 10:57. He was moving in a way that we could barely ask him for anything. He was more attentive to a couple 2 tables away. I just want to say, I tip over 20% when I&amp;#39;m out. I keep extra cash to make sure I can be generous. Needless to say the $20 I had on me to go towards his tip, I used for the food (14.95). Our total was 27.14 (my son got an appetizer). The highest tip was $5 and some change. I planned for $10 no matter what. He got me a container for my leftovers and went to get me a bag... He never came back... I was gonna leave $5 but not returning with the bag cost him another $3 my son left $2. I used cash so he wouldn&amp;#39;t have my card info... If this is the job you chose, do it! I love being a Blessing to someone, but not when I&amp;#39;m ignored. If you can&amp;#39;t show interest in your customers don&amp;#39;t expect interest in my wallet... Good Night...", "rating": 1, "date": "7/26/2018"}, {"text": "Best cheesecakes ever! I have not dined at this restaurant, I have only gone in to order cheesecakes several times for birthdays or other occasions. Great selection, very creamy and soft texture and a lot of different flavors to choose from. Yes, average price of $8 or $9 for a little slice of cheesecake is expensive, (or $50+ for a whole) but it is not easy to find a comparable product elsewhere, even though The Cheesecake Factory cheesecakes are not freshly made; they just come frozen from their factory on the West Coast. They are still delicious!<br&gt;The service is ok, depending on how crowded the place is. Sometimes it takes a little while to get your order ready to go. The only thing I hate about the experience is the parking lot! The parking lot is almost always full, and it is very hard to find a spot closer to the restaurant. However, they do have a couple of to-go parking spaces, if you order online and enter the make and model of your car, they will bring it out to you, for a tip. Wish they just had a cheesecake shop without the restaurant, maybe in a less busy shopping strip.<br&gt;Oh, and this is funny but the doors to enter the restaurant are so big and heavy, you need some real muscle strength, which I completely lack. I always end up needing help from someone to pull open the door to enter.", "rating": 4, "date": "7/25/2018"}, {"text": "Absolutely terrible service again, however this time we were never sat. Came in large party had called about a wait earlier and was told by a manager seating would be possible by 5:30. Arrived there and was told a hr wait which was fine however the manager had a nasty I don&amp;#39;t care attitude towards us so we left and went to brio, better service there anyway. Needless to say I will never step foot in that store again. Didn&amp;#39;t catch the managers name but a very nasty individual.", "rating": 1, "date": "8/28/2018"}, {"text": "Note that if you&amp;#39;re going here for CHEESECAKE, it gets 12 stars. The Red Velvet Cheesecake should be illegal its so good. With that said, the 3 stars is for overall.<br&gt;<br&gt;First things first; I have never been here and NOT had to wait a ridiculous amount of time to get a table. It is CONSTANTLY packed. When you finally do get a table, settle in, because the menu is TWELVE PAGES LONG. Yes. The food menu....for a restaurant....is 12 pages long. Its like a phone book of food choices. It is an obnoxious amount of choices. <br&gt;<br&gt;When you make it past your 2 billion choices and settle on something, I hope youre hungry. My little brother got a starter salad, AND GOT THE HALF PORTION, and I think they brought it in a wheelbarrow. Do people seriously eat this much?! (although by looking at the usual bloated, obese Cheesecake Factory clientele, it would appear so.)  As for myself, I ordered the americana burger, medium, which came overcooked, yet still juicy. <br&gt;<br&gt;The food is good and the dessert is transcendent. The decor is nice, but spacing between tables is kinda tight. Prices are pretty standard for going out to eat; $10-12 for a burger, and $9-12 for mixed drinks. (Full bar is a plus.)<br&gt;<br&gt;Overall, Cheesecake Factory is a very safe bet. You&amp;#39;re almost guaranteed to find SOMETHING on their War and Peace sized menu to enjoy, and it will most likely be tasty at worst. If you can SOMEHOW save room for dessert, you will end your meal on a high note.", "rating": 3, "date": "5/22/2012"}, {"text": "My friend and I stopped by here to grab a bite before the pre-screening for Snow White and the Huntsman at AMC Lowes nearby. We did not have to wait for a table/booth, and he had already been seated and served bread by the time I arrived.<br&gt;<br&gt;Within moments of my arrival, we were informed that the original server was finished her shift and another waitress was taking over. No problems there. Plus our order was taken in a timely manner (a cobb salad and a side salad). My cobb salad was amazing, from presentation to taste, and was like literally the best salad I&amp;#39;ve ever had (even though I ordered it without the avacado and tomato. The only thing I&amp;#39;d say is they never give you enough salad dressing (I ordered some mixed in as well as 2 on the side) Our server was really on point with refills and dressing/bread refills though.<br&gt;<br&gt;Definitely worth stopping if you&amp;#39;re nearby!", "rating": 4, "date": "5/30/2012"}, {"text": "Don&amp;#39;t ask me how, don&amp;#39;t ask me why, but when hitting The Cake it&amp;#39;s essential to get Mexican food, believe me. Hopefully they don&amp;#39;t have to do an overhaul of the kitchen staff this upcoming year. Good service is a hit or miss, server forgot our guac and chips last meal. Sad.", "rating": 4, "date": "12/4/2016"}, {"text": "Great restaurant w extensive menu, friendly service, beautiful decor, and priced well for generous portions.", "rating": 4, "date": "8/30/2014"}, {"text": "I love this place! We went on a afternoon and our server Frankie was awesome! It was a real great experience except for half way true there was a couple coming in sitting down next to us who seemed to be working there cuz a lot of servers stopped by to chat and it&amp;#39;s fine, I know this happens but it became annoying after a while cuz they where kind of loud and it became busy around that table!", "rating": 4, "date": "7/6/2017"}, {"text": "Freddie was hands down the BEST server I&amp;#39;ve had this year. Customer service overall is in the toliet, but I actually had to give Freddies&amp;#39; manager an earful of positive praise! Fantastic service, Freddie, you made me day.", "rating": 5, "date": "7/5/2017"}, {"text": "The mac and cheese bites are amazing. Love their burgers. Cookie dough cheesecake is great!", "rating": 4, "date": "2/10/2017"}, {"text": "We ordered two pasta dishes tonight. Garlic Noodles &amp;amp; Evelyns Pasta<br&gt;LONG SILIVER HAIR  in Garlic Noodles and Evelyns pasta tasted burnt.<br&gt;Manager came over and couldn&amp;#39;t make eye contact with us, sounded like a drunk!<br&gt;Our waiter was on point, he could give the manager a few tips!<br&gt;How disappointing, better to go somewhere else, this place is going down hill fast!", "rating": 1, "date": "8/20/2016"}, {"text": "I was so surprised my friend and I had to wait 20 minutes for a seat on a Thursday night! You can definitely tell this is a hot spot for people in the area. I wouldn&amp;#39;t call this fine dining by any means but the environment for this chain is quite nice with their high ceilings and dim lighting.<br&gt;<br&gt;I ordered some salad while my friend ordered the chicken madeira. I haven&amp;#39;t visited a Cheesecake Factory since freshman year of college but the portion sizes are big just like I remembered. The salad&amp;#39;s ingredients weren&amp;#39;t particularly fresh but I guess I didn&amp;#39;t expect much coming here.<br&gt;<br&gt;My main beef with this place is that my phone was dying and I asked the hostess in the front if I could charge my phone up there. &amp;#34;Sorry, we don&amp;#39;t have outlets for the public&amp;#34;. Ummmm....excuse me??????? I&amp;#39;ve never been turned down like this at any restaurant. Either way, I&amp;#39;d probably come back since, like McDonald&amp;#39;s, since the price is fair for the food quality, which is predictable. But I&amp;#39;ll just need to remember my portable battery next time.", "rating": 3, "date": "3/12/2017"}, {"text": "Terrible for brunch... Uncooked pancakes and French toast. The cook can&amp;#39;t make a proper omelet. Extremely disappointed!!!", "rating": 1, "date": "8/3/2014"}, {"text": "I love cheesecake factory, but today is my anniversary and I could not go out to a restaurant because my daughter is very ill. We decided to order cheesecake factory when i called I was on hold forever and then the person specifically asked if I wanted bread and butter I told her yes. We got our food and mine looked like food slopped together no presentation and I am assuming the sauces just mixed together looked like soup and my mashed potatoes were not mashed but potato chunks and my steak was so done I could hardly get my knife threw. I guess to get good food you have to eat in the restaurant! Don&amp;#39;t order take out they don&amp;#39;t take pride in what they put in container. I got the combination dinner chicken meridea and steak Diane, 21$$ meal and it was ice cold...", "rating": 1, "date": "12/19/2015"}, {"text": "My girlfriend and I walked in. Their were a lot of people waiting to be seated, but for a Saturday evening I can understand. We walked up to the hostess and she told us about a 40 minute wait.  I was surprised but about 40 minutes later we were seated and during our wait we were smart and looked at the menu and already knew what we wanted. Our waiter Jason was very nice and knowledgeable with the menu. We both ordered burgers and I ordered a drink, we shared a Caesar salad and it was very good. Before we left we bought a slice of cheesecake to go, overall good experience here just wish the prices were a bit lower.  The menu has a lot of items on it so if you have time look through it prior to being seated.", "rating": 5, "date": "11/16/2014"}, {"text": "I have eaten here a number of times for dinner or lunch. This review however is not about the dinner items. On this trip two weeks ago, I was here to sample the breakfast brunch for the first time. My wife ordered her usual breakfast favorite, bagel &amp;amp; lox platter. Besides the fact the bagel came nearly five minutes after her platter arrived, she enjoyed her breakfast. I ordered the Lemon Ricotta Pancakes. Now I love my pancakes cooked a little extra but these pancakes were just a little too overcooked. They were edible; but burned.  <br&gt;<br&gt;Service was decent, just felt like it was early and everyone wasn&amp;#39;t quite awake yet. Never got a second cup of coffee.", "rating": 3, "date": "10/13/2012"}, {"text": "5 star Megan... she came to save the day... our family sat for nearly 20 mins waiting for a server to wait on us, nothing. Finally we flagged Megan down and she sincerely apologized for our wait and explained to us that this was not her area of dining but was more than glad to take our order. She is very attentive and sweet... I had read other reviews and was quite unsure how this experience would turn out from our usual CS Factory near our home. Kudos to the management for hiring such a wonderful young woman.. Megan really takes pride in her work! And as I stated before she truly saved the day!! Btw Dinner was DELICIOUS!! Megan recommended a tasty delicious meal for our daughter whom is quite the picky eater...", "rating": 5, "date": "11/13/2016"}, {"text": "My fiancé and I ate at cheesecake for lunch today after shopping at the mall. I ordered Renee&amp;#39;s special (chicken salad sandwich and chicken tortilla soup...and a side salad). I almost always order this because it&amp;#39;s 1.delicious 2.a lot of good 2. Great price. I usually get the sour dough bread instead of the bread the chicken salad comes on.  I ended up taking half of it home and I&amp;#39;m sure it will taste just as good tomorrow. Victoria was our waitress at the high top by the bar. She was very friendly and great waitress.", "rating": 4, "date": "12/30/2014"}, {"text": "I pretty much always like my visit to cheesecake.  If it weren&amp;#39;t for the long wait, I would prob like to go more often. <br&gt;<br&gt;Fortunately, when we went on a Thursday night at 6:30pm at this location, we were able to get seated right away.  Definitely a plus. <br&gt;<br&gt;I ordered the Grilled Chicken and Avocado Sandwich.  Good as usual.  The chicken may have been a little bit on the dry side but I enjoyed it anyway.", "rating": 4, "date": "10/16/2014"}, {"text": "I&amp;#39;ve been here 2 times now and I&amp;#39;m not entirely impressed. The food is average but the cost is unreasonably high. The service is poor and you are left waiting a while for anything you ask for. The place itself is kept well and presentable. I could see going here every once in a blue moon but it&amp;#39;s not really a place to go all of the time. The menu is a book with many options so it&amp;#39;s a good group eating type of place.", "rating": 3, "date": "10/17/2015"}, {"text": "Pretty sure they gave me an uncooked veggie burger last night, or it was just flat it disgusting. Avocado egg rolls had brown avocados in them. And I stood out the counter for pick up and the girl took a few people before me although I was there first. Completely disappointed.", "rating": 1, "date": "1/21/2017"}, {"text": "Anybody has stomach problem after Friday 01/06/17. The whole family was sick over weekend. The service is good. The food is so so.", "rating": 3, "date": "1/8/2017"}, {"text": "Great food. A lot to choose from a large menu. We made it a regular place to eat on Sunday morning brunch after church. It&amp;#39;s slower and you don&amp;#39;t have to wait in their long lines. Highly recommend!!!!!", "rating": 4, "date": "2/21/2017"}, {"text": "I just got home from a big family brunch at the Cheesecake Factory. It was probably my last visit. There was a ridiculously long wait for the food. I did enjoy my pancakes, which were served with only a tiny cup of syrup. My tomato juice was sour. Others needed more coffee, and were complaining about not having enough syrup. There was a long wait for the server to come back, then another long wait for coffee, syrup, and to have my sour tomato juice replaced with supposedly fresh squeezed orange juice. I stopped eating for quite some time, because I had nothing to wash down dry pancakes. The orange juice at least wasn&amp;#39;t spoiled, but I have a hard time believing it&amp;#39;s fresh squeezed, when my supermarket brand orange juice that comes in half gallon cartons tastes much better. I understand that people are busy, but the service was so horrible that meal should have been comped. No one even apologized for the endless waits for anything, or offered any reasons.<br&gt;<br&gt;2-18-18<br&gt;I&amp;#39;m updating my review after having breakfast with my family at the Cheesecake Factory. I didn&amp;#39;t pick the place! There was a long wait to be seated. Once again, the service was horrible. The meals were not all served at once, or even close to all at once. One meal was sent back. There was a long wait for it to be corrected. One was wrong but eaten anyway. There is too long of a wait for ANYTHING. My French toast was served without syrup. Supposedly, the syrup had to be heated. Couldn&amp;#39;t that be done while the meal was cooking? The food was only lukewarm when I finally got room temperature syrup. I didn&amp;#39;t send it back, because I didn&amp;#39;t want to wait all day for a replacement. I didn&amp;#39;t take home any leftovers because I didn&amp;#39;t want to wait all day for a box. It was bad enough that we finally left 2 1/2 hours after being seated.", "rating": 2, "date": "2/18/2018"}, {"text": "I come from a restaurant background and am not usually a complainer unless I feel necessary. We decided to go to The Cheesecake Factory because it was conveniently in the shopping center we were in, but I can guarantee you I will not be back. We ordered a burger, a Salad, Red wine and sangria. I stared at our drinks sitting up at the bar for at least 10 minutes already made before they were brought to the table. 40 minutes into our wait for our food someone came to us stating the chicken from the salad fell on the floor and they are currently remaking it.  It came about 5 minutes after that and the fries with the burger were ice cold. I told the waitress and she quickly came back with more fries and they were the exact same temperature.  Frustrated and annoyed, we simply said forget it. We got our full priced check, paid, and still left a non-deserving 20% tip. Thanks for nothin&amp;#39; and see ya never.", "rating": 2, "date": "1/15/2018"}, {"text": "I&amp;#39;ve eaten here a number of times and have been satisfied with each visit. For starters the Buffalo Blasts are really good. Really thin and crunchy fried chicken bites that come with dipping sauces. Really good If your into your wings. Chicken Romano was my last entree and was on the heavier side but was really good. The Oreo cheesecake was a chocolate lovers dream. And the cocktails at this place are exceptional as well. It can be a little pricey but I think that you can work around the pricing by learning the menu. Like to think this is one of the better chains around. So for a chain it&amp;#39;s a 4. Reason being even with it being really good I&amp;#39;ve never caught myself urging to come back and I wouldn&amp;#39;t plan my day around going. So it&amp;#39;s a 4.", "rating": 4, "date": "2/22/2016"}, {"text": "Unbelievably crowded. $7 beer on tap, $10 suavigion blanc. Mediocre food at best. Stay away from this over priced and awful chain restaurant. Baked potatoes soup was like paste. Hibachi steak was swimming in teriyaki making it inedible. Burgers were just OK. Kids liked the cheesecake. Bad, bad,bad. Go visit something owned by a hard working chef.", "rating": 2, "date": "5/7/2016"}, {"text": "Absolutely horrific customer service and I&amp;#39;ll start from the beginning. I called 2 weeks prior stating my son requested to dine there for his birthday with his family, a party of 15. I was told that they do not take reservations but reccomend coming around 3pm, between lunch and dinner, and they should be able to accommodate us within 30 minutes. In my opinion, if you don&amp;#39;t take reservations for at least large parties you are setting yourself up for failure and fail they did. We arrive and are given a 60 to 90 minute wait time. That was hard to swallow but, that my friends was only the beginning. We were finally given our tables, yes 2 different tables, after 90 patient minutes they couldn&amp;#39;t figure out how to sit us all together. So my husband and I kindly got to wave occasionally to my son and part of the family throughout the meal. When we asked why we were separated they had the audacity to blame it on me for walking away to speak with the family for 1 minute and then returning to put my name in. You had 90 minutes to make it right after I told them the poor information I was given on the phone. We made it very clear we were all together but, one table was provided much faster service, luckily it was my son&amp;#39;s. My table however,  took 30 minutes for drinks and both my husband and I were forgotten. My son&amp;#39;s table was finishing appetizers by the time we had a beverage. We ordered, waiters switching shifts, timing was off at every step, the food comes out eventually and again my husband has no meal. We were told there was a mix up and it would be out in 5 minutes. My husband was so disgusted he couldn&amp;#39;t even eat anything. I asked to speak to a manager and instead of owning what a terrible job they&amp;#39;ve done his response is we really don&amp;#39;t handle large parties well. If you know your deficiency then why aren&amp;#39;t you improving something? The hostesses did nothing but, act annoyed and bothered by everything. The manager had zero remorse and took my husband&amp;#39;s meal off the bill because I asked him to.  The food was subpar at best and one star is a gift. I have never felt more uncomfortable at a restaurant in my life and you should be ashamed of the rude and disorganized mess you are running.  Side note, you also should stop putting chairs on the end of booths, its an ADA violation I&amp;#39;ll be reporting.", "rating": 1, "date": "1/27/2019"}, {"text": "The menu is huge, with a lot of fusion between cuisines.  Its good to have a lot of choices, but it also means that there isn&amp;#39;t really anything that they do particularly well.  I have gotten the black pepper shrimp, which is spicy enough.  The Vietnamese spring rolls are pretty good, but over priced.  The Cheesecake Factory definitely has better food than Friday&amp;#39;s, Applebees, Chili&amp;#39;s and the like.  <br&gt;<br&gt;Everyone always talks about the potion size at the cheesecake factory, and they are huge.  I&amp;#39;d recommend taking half of your food home for the next meal.  <br&gt;<br&gt;The service at the cheesecake factory can be pretty slow, it seems common for appetizers to arrive a minute before entrees, and even drinks tend to take a while. <br&gt;<br&gt;This cheesecake factory is always busy, and you&amp;#39;ll likely have to wait for a table.<br&gt;<br&gt;Very loud when dining.", "rating": 3, "date": "3/21/2012"}, {"text": "Don&amp;#39;t live too close so only go out here on a Sunday when I am going to food shop at wegmans. This place is always a mad house and always packed! We wanted to sit outside so the guy said he could seat us right away , while stepping to the side of the counter the hostess was so confused he walked outside twice until 10mins later finally seating us. Was a nice day so didn&amp;#39;t mind sitting in the sun, but the table was black and hott couldn&amp;#39;t even put our hands on it so I decided to move it sideways out the sun myself. I ended up gettin a pizza n salad n my boyfriend got a turkey club and salad. Normally your salad would come out first , but here it came out with our meals and I wasn&amp;#39;t too happy about that. The Caesar salad was so good. The pizza not so much it was fought and flimsy and I complained and the waiter just shoved my pizza back in the oven, like u couldn&amp;#39;t offer to make a new one ? Very weird. We didn&amp;#39;t know it was Cheesecake day so Cheesecake was half off so we ordered the birthday celebration and it was amazing and I&amp;#39;m not a Cheesecake fan. This review is based on their pizza and service because services took forever. I would go back for another salad that&amp;#39;s about all !", "rating": 3, "date": "8/1/2017"}, {"text": "First, the wait is too long. The service wasn&amp;#39;t great. Food wasn&amp;#39;t all that. Tried it once never returning.", "rating": 1, "date": "1/6/2017"}, {"text": "The service was great &amp;amp; our food was amazing ! My only disappointment was the &amp;#34;freshly baked bread&amp;#34; which was kind of hard and definitely didn&amp;#39;t taste fresh. Other than that, everything was great. I&amp;#39;d definitely go again!", "rating": 5, "date": "3/14/2017"}, {"text": "Menu is very expansive, which is good &amp;amp; bad. Lots of choices, but also a lot to navigate. The wait can be long on top of parking being difficult, but I don&amp;#39;t mind parking far anyways. Service was decent and food was very fresh. Although it feels rushed towards the end of their visit, the whole part of dining is the cheesecake selection. I don&amp;#39;t eat cheesecake very often, but they set the standard for the stuff!", "rating": 5, "date": "1/15/2016"}, {"text": "This is the WORST cheesecake factory ive been to. The wait was horrible and the food was not cooked all the way and un-seasoned. They did not seem to care about customer service at all worst experience Ive ever had!!", "rating": 1, "date": "2/23/2018"}, {"text": "You can never go wrong here. Have been so many times and always leave happy! The banana cream cheesecake is to die for! I cannot leave this place without getting a slice.", "rating": 5, "date": "3/13/2015"}, {"text": "Had dinner on a Saturday night.  The wait for the table was endless. Don&amp;#39;t understand the appeal.  Finally sat at tiny table for 2.  The noise level was unreal.  Had to practically shout at the waiter to be heard.  Forget trying to converse with my date.  Then they lowered the lights. I could barely see what I was eating.  The food was actually good but no plans to go back there.", "rating": 2, "date": "10/28/2017"}, {"text": "I want to start with the wait. I came here with Jesus Christ and he is no longer with me. I&amp;#39;ve changed my clothes easily over a million times. I&amp;#39;ve seen the menu change from berries and leaves to decadent cheesecakes, not that I would know how those taste..", "rating": 1, "date": "1/2/2016"}, {"text": "We came here at my foreign guests&amp;#39; request, and it was a great reminder of why I hate Cheesecake Factory. It&amp;#39;s all hype and the products are never very good. Case in point- our drinks were entirely flawed and the waitress didn&amp;#39;t even apologize (the tea was missing the teabag... By the time they brought it the water had gotten cold. The cream had started to turn, and sodas were flat. Total fail). In general, it annoys me that they don&amp;#39;t respond to customer requests-- CF policy prevents customizing orders, and if you ask for a meat salad without the meat you still have to pay the full price, despite the fact that they offer few vegetarian salads. Coming here makes me hate consumerism and the American market system. Ugh.", "rating": 1, "date": "5/30/2016"}, {"text": "This place never disappoints. If you have never been here it&amp;#39;s a must. The only thing that is a bit of a hassle is the wait time. They only take reservations during the weekdays, weekend is first come first serve and that means anywhere from 45-hour and a half wait. We waited hour and a half. Their menu is the size of a library book they offer probably a good 200 items I have been here a handful of times and still always get the same appetizer user after trying a few. Thai lettuce wraps. Huge portion deliscious always. This time I got a bacon date pizza and my wife got the pasta carbonara. I would call this place more of a gourmet diner. Kids are still present its super loud the menu is extensive they offer brunch on the weekends but the food quality does not lack at all. I give four stars bc of the wait times, not food quality although this time I went I did have to send an appetizer back because it had a hair on it but honestly let&amp;#39;s face it that happens everywhere. We all have hair and can&amp;#39;t cover it up 100% of the time so I don&amp;#39;t get mad about it. Just sent back and server was great about the whole thing. Service is always top notch here even though their extremely busy.", "rating": 4, "date": "2/23/2016"}, {"text": "Went with A chargrilled coulette steak they were offering for a decent rate. It was better than any filet mignon I ever had. Ate every last bite. Good service. Nice atmosphere. Will cost you aorund a hundred bucks for a family of 4 if you include price of drinks. They do NOT have a kids menu. We ordered a plate and had them split it for our kids since the portions are too big for each of our kids.", "rating": 5, "date": "7/14/2016"}, {"text": "Came here on a weekend and was shocked on how fast we were sat. Normally, I&amp;#39;d be waiting at least half hour to over an hour, so definitely A+ to that. I had my baby with me so they were also very kind enough to give us a nice size booth so the car seat would fit in with us. Service was excellent! Everything we ordered came out at a decent time.<br&gt;<br&gt;For apps, we ordered mini crab bites and these chicken wonton things. Skip the crab bites if u plan on getting them! Extremely overpriced and they were so tiny. The chicken wonton things (forgot the names) was delicious though. It had a somewhat curry taste to it. For main meals, I ordered fish tacos and my husband ordered this spicy pasta with shrimp. They both weren&amp;#39;t that great. I ordered my fish tacos tempura style, but when it came out, it was this heavy fried dough. Tempura is supposed to be light. They should not ask if I want it tempura or grilled. It should be wiuld u like it fried or grilled. If I knew it wasn&amp;#39;t tempura battered, I would have gone for grilled. The tacos weren&amp;#39;t horrible but could have been better if I actually got what I wanted. My husband&amp;#39;s pasta was good, but he didn&amp;#39;t like it much. He didn&amp;#39;t think it had enough spice to it. He said he remembered it differentially.<br&gt;<br&gt;Upon leaving, we decided to order a whole cheesecake. They didn&amp;#39;t have it ready and was completely frozen. I was a bit upset bc I couldn&amp;#39;t eat it right when I got home, but once defrosted, it was quite delicious!! Go for the banana cream. Mmmmmm", "rating": 3, "date": "5/21/2013"}, {"text": "I took my wife here for her birthday. It was 8PM on a Friday, I did expect it to be a little busy. I tried making reservations the day before but they don&amp;#39;t take reservations. We ended up waiting 45 minutes for a table. It took the waitress a while to get our drink order. When she came back with our drinks she took our appetizer order and asked for our dinner order. It then took an eternity to get our appetizers. We had the appetizers and the dinner came immediately before we finished. I was aggrevated at this point but to be fair the food was very good. I had the chicken Marsala and my wife had the chicken colleto (a lemon sauce) which she enjoyed very much. We both had cheesecake for dessert. I had the chocolate chip cookie dough and my wife had the Oreo. They were both excellent. The atmosphere was very nice and we enjoyed the surroundings. The waitress was friendly but either over worked or unorganized. My biggest complaints were the lack of reservations, the wait for our drinks and appetizers and the fact that dinner was brought too soon after the appetizers.<br&gt;I do recommend this place but would avoid Friday nights.", "rating": 3, "date": "5/13/2016"}, {"text": "We just moved to Cherry Hill and were asking around for a good place to get dinner one night and someone suggested we check out the cheesecake factory. Being from New York we are very familiar with the cheesecake factory as a Times Square establishment and were kind of surprised to find that it is the literal local gathering place for all people all of ages combined in our neighborhood. I personally just don&amp;#39;t get it. It&amp;#39;s a it&amp;#39;s a chain restaurant and feels very dime a dozeny inside. People actually dress up to go here, which confuses me as it would be like dressing up to go to a TGI Fridays. The food wasn&amp;#39;t bad but it wasn&amp;#39;t great. The cocktails were weak. The service was decent (our waitress was wearing at least 23 pieces of visible flare lol for the office space fans out there!) If you want to eat mediocre chain food head on over to the Cheesecake Factory, or Fridays, or Outback...is there really a difference? Okay, outback has the blooming onion which is bangin.", "rating": 3, "date": "9/22/2017"}, {"text": "I would say as a first timer here it was very good. I was only a little confused as to the theme of this place because I was able to get everything from Vietnamese shrimp summer rolls to hot white chicken chili, and I mean hot. Though aside from that I can see why there is a line out the door because this place is very good and their cheesecake is as well. I recommend coming here for a nice family outing.", "rating": 4, "date": "12/28/2013"}, {"text": "Always a good option when dining with multiple people who have different tastes! Over 100 menu options that are extremely varied, and I mean, who can pass up a cheesecake. The drinks aren&amp;#39;t all that strong, but they are yummy. Probably wouldn&amp;#39;t come here for the bar scene, but definitely would suggest for apps and dinner!", "rating": 5, "date": "2/5/2016"}, {"text": "Good food with nice huge portions.  I think they have a little something for everyone on their menu. It&amp;#39;s a large variety. Service is usually good too!  My only complaint would be the last time I visited, I froze.   I ordered Steak Diane  and Shrimp scampi combo. The steak and gravy was perfect, my shrimp were over cooked and mushy. Also had the crab dip appetizer. It was tasty but spicy. I for one can not do spicy food. They should note it on the menu or have the server explain it. I saw no clues in the ingredients. I&amp;#39;d visit again still.", "rating": 3, "date": "1/31/2017"}, {"text": "I&amp;#39;m tempted to give four stars, because I&amp;#39;ve never had a bad experience (besides the standard wait time for a table, of course), but something is holding me back... most likely, the extra weight I put on after my meal on Saturday evening.<br&gt;<br&gt;Picture this: three relatively health-conscious girls out to dinner.  Nobody was trying to get all South Beach or anything, but it was clear that we wanted healthy meals so we could splurge a little on dessert.  Two orders of wasabi tuna and an order of miso salmon seemed like a safe enough bet.<br&gt;<br&gt;Not so much.  My friends&amp;#39; wasabi tuna entrees were really delish, but the wasabi crust had a fried consistency to it-- good for sure, but totally not necessary.  My salmon dish had an absolute river of thick creamy sauce going around the plate.  Luckily, the salmon itself was on dry land, located on top of an island of rice.  <br&gt;<br&gt;I just don&amp;#39;t understand why the people behind the menu at Cheesecake Factory think that healthy food has to be bombarded with fat before people will order it.  The salmon was fantastic with just the miso glaze-- and the tuna didn&amp;#39;t need such a thick, greasy crust.    <br&gt;<br&gt;Oh, the CF does have healthier selections on the menu.  You&amp;#39;ll know what they are because they are listed with the words &amp;#34;Weight Management&amp;#34; before each item.  What genius came up with this idea?!  Can I take his or her place on the marketing team when he or she gets fired?", "rating": 3, "date": "10/7/2008"}, {"text": "If you want to see a wide range of inspect species, come here. Flies everywhere, gnats over your bread, smashed relatives of both underneath your table. Gross.<br&gt;<br&gt;Our table was wet when we were seated and the utensils that we were to eat off were laying right on it. Appetizing!<br&gt;<br&gt;While I love the food at Cheesecake, you&amp;#39;re better off ordering take out and eating on your dashboard in the car.<br&gt;<br&gt;Bugs are a no no, especially if I&amp;#39;m dining in. Try placing your silverware in the folded napkins versus the nasty tables wiped by dirty ass rags. Kitchen 101, surfaces carry the most germs!<br&gt;<br&gt;Never felt this dirty leaving a CF.  Super disappointed. Guess I&amp;#39;ll have to wait for the ones out of state.", "rating": 1, "date": "7/19/2015"}, {"text": "This place is one of my favorites, but I can usually only stand to go for lunch since the wait time for dinner is almost always RIDIC.  Momma W. and I tend to make this our favsies mom-daughter date spot, and this Saturday was no exception.<br&gt;<br&gt;I love their new &amp;#34;Skinnylicious&amp;#34; menu, which gives lighter versions of menu favorites.  Most of the time I don&amp;#39;t even realize it&amp;#39;s been lightened up, since it&amp;#39;s still so tasty.  There are also some great lunch specials that won&amp;#39;t overwhelm your GI tract too.<br&gt;<br&gt;One thing I was impressed with was our server, (I believe his name was Jeremy?), who was not only crazy friendly, but looking out for us as well.  My mom had ordered a sandwich off of the skinny menu, with a bowl of soup as well... and he informed us that it would be cheaper (and the same exact thing) if she were to order the lunch special of soup and sandwich.  What a guy!  Most servers, I feel, would have just let her go with the more expensive option since a bigger bill = bigger tip.  Two thumbs up!<br&gt;<br&gt;I love, love, love the factory chopped salad (although disclaimer: the skinny version doesn&amp;#39;t have bacon.  fail).  I&amp;#39;ve also had the chicken and avocado sandwich (phenomenal), and the chicken salad sammie (rockin).  I love the pumpernickel bread they bring out to munch on, and I also love that since Momma W. and I both ordered from the skinny menu, he asked if we wanted the bread.  OBV we want it... but it was nice that he was being conscious of our choices.<br&gt;<br&gt;The cheesecake speaks for itself... but full disclosure: I can&amp;#39;t bring myself to order it on the regular.  My waistline just can&amp;#39;t afford it.", "rating": 4, "date": "4/10/2013"}, {"text": "I love cheesesteak factory but every time I come to this location it&amp;#39;s just a**. Walk in immediately greeted by a rude hostess, he was rude and cranky and then we waited 20 minutes for a waitress to even show up at our table!! We had to ask", "rating": 1, "date": "9/29/2017"}, {"text": "Very good dinner. The family and I went. I do feel it is too expensive. $15.95 for spaghetti and 3 meatballs is crazy. Franky, our server, was excellent.", "rating": 4, "date": "12/24/2015"}, {"text": "Visited cheese cake factory in Cherry Hill because we had a $100 gift card. I remember when there used to be only one cheese cake factory in the area, and that was in King of Prussia. I used to love visiting this chain. However, the quality has gone down significantly. During our most recent visit we ordered the firecracker salmon appetizer, which was pretty tasty, so we were excited to get our entrees. I ordered the jambalaya with white rice (instead of pasta). My boyfriend ordered a special pesto tilapia which came with mashed potatoes, tomatoes, in a pesto sauce. He liked his entree. Mine was below mediocre. My entree arrived and looked like chicken, tomatoes, shrimp, with peppers, and onions on a bed of rice. There was absolutely no spice at all. If I had a stomach virus, I could have eaten this entree with no problem. It was bland, unseasoned, and just a big plate of nothingness. I asked our waitress for extra sauce. I was told it would take a few minutes. A gentleman arrived 10 minutes later with a bowl of hot liquid with more tomatoes. Great, is what I thought until I poured the alleged sauce over the jambalaya. I tasted the entree again and was met with the same disappointment. More blandness with even more tomatoes. I finally asked for a to-go container so I could take the entree home and fix it myself. I sat while my boyfriend finished his food. The waitress returned with a to-go box and never even asked if we liked our entrees. I&amp;#39;m pretty sure she didn&amp;#39;t really care to hear what we had to say. She was more interested in offering desert. Needless to say, we spent $97 out of the $100 gift card and don&amp;#39;t care to return to this place again.", "rating": 2, "date": "9/13/2015"}, {"text": "We were shopping in Jersey and hungry for lunch, so we decided to chain it up.  The menu here is absurdly large.  Everything seems good in theory, but its all just a little boring and unnecessarily greasy.  I felt bloated and slimy when I left.  No thank you.", "rating": 3, "date": "9/3/2013"}, {"text": "The food was surprisingly really GOOD for a chain and the decor was nice enough.  Service was good as well - but the noise level?  Deafening and the place was loaded with kids - mine included.<br&gt;<br&gt;The veggie salad is great - and it&amp;#39;s enormous - 2 of us shared it easily with leftovers.<br&gt;<br&gt;And for $7 a slice - the ginormous piece of Red Velvet Cheesecake (sooooo good) was enough for 3.<br&gt;<br&gt;This was (shockingly) my first EVER visit here - and I really liked it.  Not a healthy place, as Michelle C. says - but tasty grub for sure and not too pricey.  (Save for the cheesecake.)", "rating": 3, "date": "8/28/2009"}, {"text": "Typical Cheesecake Factory. Amazing portion sizes (you definitely get the bang for your buck), extensive menu, and delicious cheesecakes for eat-in or to-go.<br&gt;For $10, they even let me take home a big container of this cilantro sauce there that I am in love with. It comes with lettuce wraps, which are also amazing, by the way.<br&gt;<br&gt;Service here has always been good to me. <br&gt;<br&gt;I just don&amp;#39;t trust the fresh fish here. My boyfriend got the ahi tuna that they had as a special once and had warned me of its mushy consistency and bland taste. The ahi tuna tataki salad caught my eye though so against my better judgement I went against his word and got it. And low and behold, a mushy mess of tuna. And a very bad tummy ache later in the night. I firmly believe you should stick to ordering what the restaurant is good at, i.e. don&amp;#39;t get seafood if its not a a seafood place.<br&gt;<br&gt;Just stick to the safe food at a place of this quality (easy pastas, chicken, burgers, veggie salads) and you won&amp;#39;t be disappointed.", "rating": 4, "date": "10/29/2013"}, {"text": "Me and a friend came for the first time in a while. They have parking at this location so it was more convenient than the downtown Philly location. We were greeted by a friendly hostess and our waitress was good. The food was okay-my take home dish had a long piece of hair in it. I didnt discover it until the next day. The drinks are not what you go for, it has to be the food. The drinks are sweet-you can barely taste alcohol.", "rating": 2, "date": "2/3/2016"}, {"text": "Every time I have come here, the food has been great, the servers were awesome and friendly and I have never had any complaints or problems.", "rating": 4, "date": "4/6/2016"}, {"text": "Best place for a relaxed dining experience with a wide variety of options...The flatbreads and salads are delicious and the cakes of course, are absolutely the best!", "rating": 5, "date": "9/3/2017"}, {"text": "Visited on a Friday evening just before 5pm. No waiting, seated right away. Our waiter was monotone and very mechanical, like he&amp;#39;s said the same thing 10,000 times before. Our drinks were delivered very quickly. My 2 companions and I all ordered the meatloaf without hesitation, that&amp;#39;s why we came here! The food was delivered quickly and was filling and delicious. One of my companions complained that the succotash was missing lima beans. Personally, I hate lima beans, so I had no such issue. Overall the meal was very good, and we were promptly seated and served...therefore 5 stars! We will be returning!", "rating": 5, "date": "11/1/2015"}, {"text": "Go to the KOP location - I think it may be closer.<br&gt;<br&gt;No matter when you come here there is always a 2 hour wait - even on Wednesdays! The reason? Their menu covers every cuisine under the sun and they seem to have every type of chef back their perfecting their own dishes. <br&gt;<br&gt;No matter who you are you will find something here: pastas, hamburgers, comfort food, wraps and fish. My favorite is the Navajo sandwich (warm pita with mayo, chicken and fresh avocado) or the Da Vinci pasta.<br&gt;<br&gt;You should never leave without at least getting a slice of their famous cheesecake. In my opinion, the White Chocolate Raspberry is the best.", "rating": 5, "date": "2/14/2007"}, {"text": "Horrible service. Waited an hour to be seated. An hour to get our food. My steak was way over cooked, my wife&amp;#39;s steak was dry and my sons pasta was under cooked. Called the manager over and he listened but did nothing! This was my sons favorite place and since it was his birthday dinner we went. That will be the last time we ever go. The place just sucks!!!!", "rating": 1, "date": "10/11/2017"}, {"text": "I&amp;#39;m a HUGE fan of The Cheesecake Factory! I&amp;#39;ve been to the Cherry Hill location twice now--and to the Buffalo, NY and Pittsburgh, PA locations numerous times--and have never left disappointed! A couple of my favorites are the Spicy Jambalaya and Bacon Blue Cheese Burger. Even the salads are amazing here! My only advice is to steer away from the specialty drinks menu-- unless you&amp;#39;re willing to pay $7-8 per drink.<br&gt;<br&gt;Definitely check this place out! Oh, and save room for the cheesecake. You can&amp;#39;t go wrong with a slice of the Godiva Chocolate Cheesecake!", "rating": 5, "date": "3/4/2013"}, {"text": "Tuesday night<br&gt;25 min wait :( but well worth it!  <br&gt;They were out of a ton of items which I thought odd... Ordered cat fish... Out went with my second choice steak very, very good!  Got cheesecake to go my wife ate hers there she said it was excellent!  Atmosphere was a bit loud had a hard time hearing across the booth. Our server Emily H was excellent!! So 4 out of because they were out of chicken and catfish but great food great service", "rating": 4, "date": "6/3/2014"}, {"text": "THE WORST RESTAURANT EXPERIENCE EVER!!!! My boyfriend and I just left the Cheesecake Factory and it was by far the worst dining experience ever. We were seated and only had knives for utensils. Then we ordered appetizers and drinks. Our drink order was right the first time and then after that the server, Nicholas M brought out the wrong drinks - not difficult, we both ordered a diet coke. <br&gt;<br&gt;Our table was never fully cleared after our appetizers were finished. Then for the really &amp;#34;great&amp;#34; part of the night, our meal. After waiting for over 45 minutes (the restaurant was not nearly as crowded as I have seen it before) our food arrives. My boyfriends was right, mine on the other hand was not. I ordered the fettuccine with chicken and sun dried tomatoes. My ONLY request was to have penne pasta instead of fettuccine. Surprisingly enough, they gave me fettuccine. <br&gt;<br&gt;As my boyfriend finished his meal, mine finally came, this time only about 35 minutes later. Neither time did our actual server bring us our food. I ate about three bites of my food and was so angry that I wanted to leave. I even wanted to have dessert but was so annoyed at how poorly our service was that I opted out. <br&gt;<br&gt;But wait, it still gets better. Our bill came to $54.84, which another waiter brought us the check, maybe our original waiter saw the sheer look of disgust on my face and didn&amp;#39;t want to hand it to us. I wish I could say the mess-ups were over but they continue. Our original waiter hands us the receipt back with our 15 cent change, clearly he couldn&amp;#39;t do math since our bill was $54.84, making it 16 cents change. Not that I give a crap about a penny, but at least after completely ruining our evening you could hand us the right change. <br&gt;<br&gt;Needless to say, this was the worst experience ever. And I will never be returning here again.", "rating": 1, "date": "4/21/2013"}, {"text": "Went with my husband for lunch on a Saturday. There was a 20 minute wait (which turned out to be more like 40 minutes) and the place was packed! Decor was nice, service was pretty good. Food was eh...I&amp;#39;ve had much better at much less expensive places. Hubby got a bacon burger &amp;amp; calamari for an appetizer. I got a couple small plates; chicken potstickers and crab bites. Got oreo and carrot cheesecake. All just ok. Nothing to write home about. We had 2 drinks and our total BEFORE tip was $93! For lunch! Way too expensive for the quality of food. <br&gt;<br&gt;One more thing. The seating is like a long bench on one side and chairs lined up on the other. You are sitting VERY close to your neighbor so if you&amp;#39;re looking for privacy, don&amp;#39;t go here!! You will, however, be able to hear every single word of their conversations. <br&gt;<br&gt;Totally underwhelmed and won&amp;#39;t be returning.", "rating": 2, "date": "7/22/2013"}, {"text": "This staff here sucks . The male hostess doesn&amp;#39;t even look up to great you . He just ask how many in your party ?No hello ,no good evening ,no whatever . I asked if I could be sat without my entire party not being present and he just ignored my question and asked &amp;#34;how many in your party&amp;#34; ? Very cold and robotic . Than I stepped aside as told and two people who came after me were seated before me because the first hostess did not communicate with the other hostess . While standing there I moved over so that they could see I was waiting and I was skipped AGAIN . I told the hostess I was next and a rude customer said &amp;#34; I&amp;#39;m next she just stepped in &amp;#34; um noooo I didn&amp;#39;t cut in front of anyone so when I told the hostess that the customer got loud and rude and I had to explain what had happened and none of the hostesses apologized for the miscommunication nor defended ME for THEIR mistake . So I got cursed out for the robot up front and when i told him he just said you&amp;#39;re table is next in his scripted voice . Ughhh I was immediately turned off . I only stayed because I had friends meeting me there from out of town . This was my second time here at this location . First time experience was for happy hour which btw isn&amp;#39;t so bad . <br&gt;<br&gt;On top of it all it was my friends bday and I asked the waitress to sing happy birthday but of course she forgot ;( . She apologized at the end when she gave me the bill and asked if I still wanted her to do it but at that point I was over it and over the Cheesecake Factory .", "rating": 1, "date": "8/10/2015"}, {"text": "Why do people review this place? Do any Cheesecake Factory Restaurants differ? <br&gt;<br&gt;Long wait...longer wait on service. Have your credit card armed and ready for when the bill comes so there is no additional lag.<br&gt;<br&gt;Otherwise, GREAT, consistent, high-quality food that can be expected from Cheesecake Factory.<br&gt;<br&gt;Chicken Romano and Tuxedo Cream Cheesecake. If you have not figured out this wisdom yet, please graduate to this order soon.", "rating": 3, "date": "9/26/2012"}, {"text": "Just what you would expect from the Cheesecake Factory great food and good service l! Had the new skinnylishous chicken salad and it was good. Saved some calories for white chocolate raspberry truffle cheesecake! It was better than good it was great! We sat on the patio and it was nice. It made it a little nicer because we could here each other talk.", "rating": 4, "date": "6/17/2015"}, {"text": "Poor service and no compensation for an incorrect order.  It was impossible to track down a server.  We began with one server and were assigned to another after our order was placed because of a shift change.  Neither were friendly or attentive.  When our food came out, one of our orders was incorrect.  When we finally got the server&amp;#39;s attention, we informed him of the mistake.  All he said was &amp;#34;sorry about that&amp;#34; and walked away.  There was no offer to replace this order or to take it off the bill.  Very disappointing experience.", "rating": 2, "date": "11/12/2015"}, {"text": "Besides it being super congested, and them having seating issues... The food is consistently good. They serve up my FAVORITE extra dirty martini&amp;#39;s with blue cheese stuffed olives. YUM! And we can&amp;#39;t forget about my all time favorite dessert. Key lime cheesecake. Hands down the best thing on the menu. You&amp;#39;ll never be disappointed eating here.", "rating": 5, "date": "5/31/2015"}, {"text": "This is my absolute favorite restaurant. Every time I come here, I always have EXCELLENT customer server. Although the food is pricey, you get what you pay for, and the portions are HUGE! the red velvet cheesecake is to literally die for!", "rating": 5, "date": "6/24/2016"}, {"text": "Food and service was good, still find it ridiculous they don&amp;#39;t take reservations after 5:30. It would be nice to come here and not wait over a hour for a table for once", "rating": 3, "date": "3/23/2016"}, {"text": "I will start by saying that the Cheesecake Factory is one of my most favorite restaurants. First time eating here at this location and I will probably never go back. It was very disappointing and a big let down. From all the entrées ordered, 2 out 4 were okay. The other 2 were nearly inedible. The chicken was burnt, dry and so difficult to chew. Chicken on another platter was served over pasta but on the bone. So gross. The pasta was bland and overcooked. Our server was friendly but very inattentive. We ordered immediately after sitting because we were in somewhat of a hurry. Still took over 20 minutes for our food. Another 20 minutes to get takeout containers, and another 20 to get and pay the check. The dessert of course was still amazing.", "rating": 2, "date": "8/3/2015"}, {"text": "Took an hour for our food to come out. The waitress said they ran out of burger meat after we were waiting for 45 min. They rushed the burger and it tasted cheap. Not worth $14 for this burger. The drinks are also very expensive. The waitress should have comped something or gave us a free slice of cheese cake. Bad customer service and I will most be coming back", "rating": 2, "date": "6/20/2015"}, {"text": "We ate there around 9pm and were seated right away since we were only a party of 2. Time served was an okay wait. Food served soup was hot. The salad I ordered was my issue. I found a fly in my salad. I called the waitress to the table and she offered to replace the item. The manager visited our table and offered to replace the salad. At that point of the meal I couldn&amp;#39;t get the thought of the dead fly out of my mind. The issue was when the bill was brought to our table I was charged for the salad. After I complained again it was removed.", "rating": 1, "date": "6/14/2017"}, {"text": "I am very disappointed in the service of this restaurant recently. It seems like every time I am there, it is just so hectic you can&amp;#39;t even hear what anyone is saying. The waiters and waitresses look so overwhelmed it is like a circus. I went this past weekend and there was an hour wait so we decided to sit outside..... it slowly started raining and the staff looked around and didn&amp;#39;t know what to do. After waiting another 25 minutes we got a table (a booth would have been another hour) and the experience seemed rushed.", "rating": 3, "date": "8/1/2017"}, {"text": "Our service at this Cheesecake Factory was beyond exceptionable. Matthew M is one of the best servers I have ever had. He was so kind and helpful, not to mention how personable he was. The food was delicious, as expected, but the really delicacy at this establishment is Matthew M. Be sure to request him to be your waiter, as it will make your meal 10x better.", "rating": 5, "date": "7/29/2017"}, {"text": "One of my favorite spots to eat even tho it can be a bit noisy and crowded. Got their around 1pm and waited 30 mins to be seated. Got the buffalo Blasts for my appetizer and Louisiana Chicken Pasta for entree. It was soo good! Also got the strawberry lemonade to drink excellent !!", "rating": 5, "date": "7/31/2015"}, {"text": "what can I say about this place it has  arguably the best dessert around and that is CHEESECAKE!!! I love everything about this place the food is fantastic my recommendation is the Chicken Bellagio it has two chicken breast that is coated on top of a big portion of Arugula Salad. They have a wide array of cheesecake but the one that I always get is the snickers cheesecake my opinion it&amp;#39;s the best one but like i said they have a wide array but from the one&amp;#39;s that I&amp;#39;ve tried the snickers won me over.<br&gt;<br&gt;the food is fantastic like the chicken bellagio and the bang bang shrimp and chicken but def come for the cheesecake you will not be sorry.", "rating": 5, "date": "5/12/2013"}, {"text": "I have never had a bad meal here at this location (or any other). Whoever has been with me has always been very pleased with their meals as well. <br&gt;$$$ Value for the portions (always enough for lunch next day) is well spent. <br&gt;Drinks are expensive but top notch quality (I guess you do get what you pay for sometimes!) <br&gt;Service is always excellent. <br&gt;Of course the cheesecake is to die for. <br&gt;The tasty bread is just a bonus. <br&gt;My favorite at the moment are the Tai Chicken Lettuce Wraps that I order as my meal. <br&gt;Bathrooms are always clean. <br&gt;My only complaint would be they charge $3 for a cup of coffee and charge for refills. I do not order coffee when I go.", "rating": 5, "date": "7/8/2012"}, {"text": "Me and my girlfriend try to come here at least once a month. I would recommend this restaurant to anyone/everyone. I would highly recommend the fried macaroni and cheese balls, burgers, and pasta dinners.", "rating": 5, "date": "5/24/2015"}, {"text": "Always love coming to Cheesecake Factory. Was there tonight 5/18 after a graduation ceremony. Our party must have had a new waitress, she didn&amp;#39;t even come acknowledge our table for 10 mins then forgot plates with the bread. Her name was Jessica C. She clearly had no knowledge of the menu. She screwed up my dinner order and while everyone else ate, I waited for my food 20 more minutes due to her ERROR. At least she offered a soup which I declined since it was 92 degrees outside? Who eats soup when it&amp;#39;s that hot? By the time my meal finally came out of the kitchen, everyone else was finished the meal. At that point I took it to go. I don&amp;#39;t think it&amp;#39;s too hard to not mix up Crusted Chicken Romano or parmesan herb crusted chicken. Disappointed in service tonight on what should have been a special night! I really wish we had a different experience like the normal 5 star service we are accustomed to. Already called corporate for this experience since no one can bother to even acknowledge me.", "rating": 1, "date": "5/18/2017"}, {"text": "The beeper works all the way inside Barnes &amp;amp; Noble. That in itself is worth 5 stars. Oh, the 15-20 minute wait was actually only 7 minutes! (which cut into book shopping time...)", "rating": 5, "date": "7/30/2014"}, {"text": "Almost everything that I have had from here has been from good to great. The only dish that let me down was the Orange Chicken. It was very dry and tasted like the boxed fried chicken bites from TGI Fridays that you get in the grocery store. Chicken parm sandwich is AMAZING. Most of their Mexican food is really good and as expected, much better than places like Don Pablo&amp;#39;s or On The Border. The cheesecake is obviously this places specialty and they don&amp;#39;t disappoint. They have at least 30 different types ranging from the basic to the extreme. My favorite is the Banana cheesecake. Simple yet good. This place is a regular stop for my gf and I. OH! And they do breakfast on Sunday&amp;#39;s. The French toast is probably the most amazing thing I&amp;#39;ve had in a long time.", "rating": 4, "date": "2/23/2016"}, {"text": "We visit Cheesecake Factory often, but never this location, and after our experience will not be visiting again. The one by our house in west Windsor delivers exceptional service and along with great food makes for a very good experience. This location however, was the worst service I&amp;#39;ve ever experienced. 10 minutes to get greeted, no bread brought to the table, and no offer of dessert. It&amp;#39;s Cheesecake Factory and we were not offered Cheesecake. I believe our servers name was Ariel. Very impersonal and unprofessional. The food was good as always but because of the service we will not be visiting this location again.", "rating": 2, "date": "7/3/2017"}, {"text": "Hello...dined here today at at 3pm.. I had the steak Diane which was delicious. My wife had the same and my son had the herb crusted chicken...everything was great and I couldn&amp;#39;t have had a better experience. I&amp;#39;ve ate here many times and they never drop the ball. I will definitely be returning. I don&amp;#39;t live near the restaurant but it&amp;#39;s definitely worth the drive.", "rating": 4, "date": "8/9/2015"}, {"text": "I&amp;#39;ve never been disappointed. Their chicken Madeira is absolutely amazing. I always get the low carb cheesecake and it tastes as if it&amp;#39;s full of yummy carbs!", "rating": 5, "date": "7/27/2015"}, {"text": "So disappointed in my visit yesterday.  I&amp;#39;ve been to the one in Freehold many times, this was my 2nd time to Cherry Hill.  Ordered my favorite dish that I&amp;#39;ve had at least 5 or 6 times over the years at Freehold - the Wasabi Crusted Tuna.  It&amp;#39;s one of the higher prices meals at $22, but so worth it.... But NOT yesterday.  My mother was with me &amp;amp; we both ordered the tuna.  Server was pleasant &amp;amp; attentive, very nice.  Wasn&amp;#39;t a long wait to be seated or to get our meals.  It was early - just before 5pm (body clocks at 4pm with daylight savings) - so it was not busy yet.  Meals came &amp;amp; the tuna (which should come rare - as described in menu &amp;amp; how it&amp;#39;s always been when I&amp;#39;ve gotten it before) was cooked well done - I&amp;#39;m talking the look of canned tuna well done!  It happens, our server sees, apologizes &amp;amp; brings both dinners back.  Manager comes over apologizes &amp;amp; says he will assure our meal comes out correct.  Not too long a wait &amp;amp; our waitress is back - the tuna now has BARELY touched the grill &amp;amp; is completely raw &amp;amp; cold - not cool/room temp, like I&amp;#39;ve ALWAYS had it before, where it has a nice sear on both sides, but red in the CENTER - nope!  Red Raw all around the edges.  I could not cut through it with my dinner knife raw!<br&gt;<br&gt;In the past I&amp;#39;ve worked at fine dining restaurants, and I know the kitchen can get pissy when food is sent back.  Like it&amp;#39;s a personal insult.  I really felt like the Raw Tuna was an FU to us - &amp;#34;these bitches want rare?  I&amp;#39;ll give &amp;#39;em rare!&amp;#34;  <br&gt;<br&gt;No, what I wanted was it how it is suppose to be prepared!  How I&amp;#39;ve had it so many times before!  Someone should really get ahold of their staff with attitudes!  Allow me to enlighten the average restaurant patron on something... MOST patrons will take this out on their server - who has NO control over the asshats with egos in the kitchen!  Those very asshats get an hourly wage - they get paid no matter if you like your food or not.  But your server, who bears the brunt of your frustration due to receiving two plates of ill prepared food, gets yelled at, gets the complaints...and usually in the end - gets a crappy tip!  You know they only make $2 -$3 per hour, heck 20 years ago, when I waitresses, I made $2.25 per hour.  They depend on tips! But those asshats in the kitchen get minimum wage at least, most get more!  It&amp;#39;s WRONG!!!<br&gt;<br&gt;The waitress apologized again, took the food.  I was over it!  Tried not to take it out on her, I ordered a dinner salad.  Great &amp;#34;dinner&amp;#34; at Cheesecake Factory&amp;#34; - NOT!  Manager came back, apologized, offered to have asshats in kitchen make it a 3RD TIME.  No Thanks!  Spit comes with a 3rd dish, or a swipe on the floor before it hits the grill - I worked in restaurants... I&amp;#39;ve seen it happen!  I tried to explain this concept to the manager about retaliative kitchen staff(I didn&amp;#39;t call them asshats to him), but he replied, &amp;#34;well, I don&amp;#39;t know what kind of restaurants you worked in before, but it&amp;#39;s not our policy&amp;#34;. Yeah, NO KIDDING!  It&amp;#39;s nobodies policy!  It&amp;#39;s the asshat in the kitchen of your upscale CHAIN RESTAURANT, who thinks his mistake is my problem to choke down.  It&amp;#39;s his inflated ego, thinking he&amp;#39;s actually a &amp;#34;chef&amp;#34; who knows how to create new &amp;amp; flavorful, delicious gourmet meals...when in reality, he is a connect the dots &amp;#34;cook&amp;#34; - take meat A &amp;amp; add premade sauce B, cook for x minutes with C cooking method - dump on plate!  That&amp;#39;s why it&amp;#39;s always been good when I had it in the past!  Follow 3 or 4 steps - comes out exactly as it should!  My guess is someone didn&amp;#39;t pay attention to the &amp;#34;x minutes&amp;#34; the first time - but PURPOSELY under cooked the second time... To show me!  I just wanted it done how it was suppose to be done!  <br&gt;<br&gt;So my mom ate 1/2 her raw fish, saying - I like sushi, and I&amp;#39;ve never had it before...so I don&amp;#39;t know the difference.  Well, I like sushi too...but I didn&amp;#39;t order sushi. The waitress got tipped on a dinner &amp;amp; a salad (but they didn&amp;#39;t charge me for my salad), even though she technically did the work of waiting on us twice &amp;amp; brought us 4 dinners... So you see, she lost out - her pay was docked....but the ASSHAT in the kitchen will cash his full paycheck on Friday!  It&amp;#39;s just wrong!!!!", "rating": 1, "date": "3/11/2014"}, {"text": "Food is always great. Service is always good. It gets very busy so I just avoid the prime times. Of course the cheesecake is yummy!", "rating": 4, "date": "3/27/2015"}, {"text": "This was quite possibly the worst dining experience of my life. For starters, the plates on the table were filthy. I ordered a plate of nachos. Granted, there were a couple modifications to them. However, messing up an order twice is completely unacceptable. The second attempt, the cheese was so burnt that they wouldn&amp;#39;t have been edible even if the order was correct. Then, the manager tries to tell me that the item I ordered can&amp;#39;t be prepared that way when, in fact, someone in my party has ordered the item that I ordered the exact same way on numerous occasions. I preemptively rejected a third attempt due to the fact that I had lost my appetite during this fiasco. Any other restaurant would have, at least, credited a portion of the check due to their poor execution. I feel I was lucky to get credited for the botched part of my order. Needless to say, I won&amp;#39;t be coming back anytime soon. Especially when it was someone in our party&amp;#39;s birthday.", "rating": 1, "date": "7/30/2016"}, {"text": "The food here never disappoints. However, my 3-stars is for poor service. The waiter seemed overwhelmed. My husband and me had to constantly remind her to bring our drinks, napkins, utensils, etc.  She kept forgetting to bring things that we had asked for. As one example; I requested extra sauce for my side order of calamari but of course she forgot to bring it. This happened about five different times. I understand the place was packed (t was a Saturday evening and our wait time was 40 minutes). However, that is never an excuse to be incompetent.<br&gt;<br&gt;I love the Cheesecake Factory. It&amp;#39;s really the only chain restaurant that I like to go to but I prefer the one located in the King of Prussia Mall. They are always crowded but their SERVICE is always GREAT!!", "rating": 3, "date": "9/27/2013"}, {"text": "Excellent food and excellent service! This Cheesecake Factory never disappoints! Every time we get a great waiter/waitress! Buffalo chicken blasts are my favorite appetizer ever! Also the brown bread is awesome and I have no ideas what it is.", "rating": 5, "date": "6/1/2015"}, {"text": "Never had a bad experience here, or at any other location. My fiancé and I stop in plenty of times, to eat in or take out! I love the chicken piccata, so lemony and good! I get that almost every time we eat there. Service is good, very friendly staff. Sometimes I am guilty of skipping their amazing cheesecakes (only because I&amp;#39;m so full from my meal)  but when I do I get the Godiva cheesecake, which is amazing and super rich in flavor! I also like the tiramisu! I&amp;#39;m sure the others are good also!", "rating": 5, "date": "8/27/2015"}, {"text": "This was a good place to sit down with the family and chit chat while eating. The food was very delicious and priced well. The building was a little understaffed for the number of people eating there. Not a bad Cheese Cake Factory.", "rating": 4, "date": "8/23/2015"}, {"text": "The restaurant is expensive for the kind of food they serve. I ordered a pasta with chicken (Louisiana style) and an iced tea and ended up paying 25$ with a tip. This was my first time here and i feel like they completely robbed me.", "rating": 1, "date": "6/9/2014"}, {"text": "The food is good. They give big portions but WTF!!! The service Sucks.  Ain&amp;#39;t nobody got time fo&amp;#39; dat.", "rating": 2, "date": "7/2/2014"}, {"text": "Food was horrible- I had broken pieces of plate in my food and almost broke a tooth.  The staff was nice the atmosphere was not to my taste very loud.  I had never been to this eatery and had I known this was the environment I would have gone elsewhere.  If you enjoy processed food and crowds by all means have a ball!", "rating": 2, "date": "5/8/2017"}, {"text": "The food is always excellent here, and I have had many great servers the many times I have visited. Specifically Alex (female) and Desiree. The only issue I have had is twice now I have had a very poor server. I think his name is Eric - I hope this is the right name. We were in Saturday afternoon. Only saw him once. The table next to us was complaining about him also. All four tables in his section seemed to be looking around for him most of the time. We waited 15 minutes after our plates were clean to see him and ask for check. Finally we saw him and asked, waited another 10 minutes and he was nowhere to be found. The restaurant was not crowded and we did not have to wait for a table. We saw the server for the table next to us over 10 times but never ours. We ended up just leaving a gift card on the table as we never saw our bill. The woman who brought our food and cracked the pepper on my soup deserved a larger tip. The rating is due to consistently good food and service at this location but I felt it was necessary to voice my complaints on this server if a manager perhaps reads this. I quote the woman at the table next to me &amp;#34;He is a horrible server.&amp;#34; Soup and salad combo was absolutely delicious!", "rating": 4, "date": "2/26/2017"}, {"text": "Arrived at 830, 10 minute wait, that wasn&amp;#39;t bad. Placed order at 850. Now it&amp;#39;s 930. That&amp;#39;s ridiculously long, server told me my fish and chips order &amp;#34;was not to his or her liking, so it had to be remade&amp;#34; not too happy after the long wait. Servers not attentive.", "rating": 1, "date": "4/17/2014"}, {"text": "The food here is excellent. A bit of a wait but totally worth it. The staff is very friendly and the cheesecakes are so good esp the red velvet", "rating": 5, "date": "4/16/2017"}, {"text": "Came here last weekend for lunch. It was a Sunday and it took about 10 minutes just to find parking. The wait given was about a half hour which was accurate. I spent that time browsing all the cheese cakes in the case. Yum! Once seated, service was fast and the server was nice. I ordered the tomato basil pasta- always delicious. I also ordered an app of tempura shrimp. It said it was supposed to be spicy but it wasn&amp;#39;t spicy at all- which was fine with me, but could upset someone else since it is advertised that way. the other person with me had the lunch portion of orange chicken which was done perfectly- portion was way more than any lunch portion should be- perfect for leftovers. I also ordered a slice of regular cheesecake with cherries to go. Always worth it. Overall, good experience, just hate the wait and parking situation.", "rating": 4, "date": "2/19/2015"}, {"text": "That&amp;#39;s right- I gave the cheesecake factory 5 stars. It is exactly as the description for 5 stars says- as good as it gets. This is my idea of a perfect restaurant. Affordable, GREAT food, great ingredients, great desserts, tons of booths, so many different kinds of food, great for any occasion, great service, and tons of locations. <br&gt;<br&gt;First of all- I have never been to a place where out of 500 entrees, every entree has been delicious.<br&gt;Not only that, but whether you get American, Chinese, Mexican, Thai, etc etc, it is actually made really well and rivals any restaurant of similar ethnic food. The Guacamole here is some of the best I&amp;#39;ve ever had. If you think that&amp;#39;s a joke, go try it for yourself. If you still don&amp;#39;t believe me then you just don&amp;#39;t know guac. The nachos are also great. The avacado egg rolls, the southwest egg rolls, and calamari are pretty great too.<br&gt;<br&gt;Some people are all about the bread- I don&amp;#39;t see how it&amp;#39;s so amazing but I do like it anyway.<br&gt;<br&gt;Another thing I love- consistency. I can order the same entree any any cheesecake factory all across America (and I have) and it tastes just as good anywhere. Same thing goes for the cheesecakes and the entire menu.<br&gt;<br&gt;The portions are huge, I usually end up taking food home. <br&gt;<br&gt;Some of my favorites (including everything above):<br&gt;<br&gt;1. Baja tacos<br&gt;2. Green Chile Cheeseburger<br&gt;3. Chicken and Biscuits<br&gt;4. Thai Style Chicken Pasta<br&gt;5. Key Lime Cheesecake<br&gt;<br&gt;Everything here is awesome. Hands down- my favorite restaurant.", "rating": 5, "date": "8/24/2011"}, {"text": "The food is decent but not a clean place, old glasses and dishes sit around, poor customer service, overworked and overwhelmed employees.", "rating": 2, "date": "4/15/2017"}, {"text": "Went for my Lucky 30th B-day food was great! Would definitly return &amp;amp; kids really enjoyed it as well......dessert , mayb nxt time.  Big portions", "rating": 4, "date": "3/28/2013"}, {"text": "I am never disappointed when I come here. I&amp;#39;ve gotten the filet mignon, which was butterflied and it was DELICIOUS. <br&gt;<br&gt;They serve you a roll of some kind of brown bread (honey wheat, I want to say) and white bread, the brown bread is SOOOO good.<br&gt;<br&gt;Every time I go, I get the crab bites (tiny crab cakes) as an appetizer, it comes with a delicious dipping sauce.<br&gt;<br&gt;If you go, try a sour apple martini. They are TO DIE FOR.", "rating": 5, "date": "3/3/2013"}, {"text": "Yes its a chain restaurant but by far, one of the best chain restaurants out there! I have only been to the location in Cherry Hill. The wait time is always ridiculously long and everytime  we ridiculously wait!<br&gt;<br&gt;The restaurant itself is huge! It has some pretty interesting decor to look at as well. Huge romanesque pillars with touches of egyptian architecture really make this place look exotic but it has a more casual, warm and inviting feel. The menu is vast! I never know what to get which can sometimes be good and bad! I like the creativity and thought behind all of the menu options. They have everything from mexican to italian choices with all american dishes as well! Pretty much whatever you have a hankering for, I am sure you will find it at TCF. Besides all of their yummy choices, they are more known for their cheescakes! Every cheescake combination you can think of, I am sure they have it! Im a simple gal so I always go for the plain cheescake topped with strawberries and whipped cream which is always oh so good! When I am feeling a little naughty, I go with the red velvet cheescake! Ultimate yum! Everything is well priced and the portions are HUGE so you might want to share with someone. Service has always been above and beyond! Even though the wait time is long, once you are seated everything comes out promptly! I really love this place! If you must chain, link into this place!", "rating": 5, "date": "11/5/2013"}, {"text": "This place is always packed, no matter what time or day of the week you go there. The menu is huge which is a good and a bad thing. There&amp;#39;s something for everyone, but trying to decide what to order is hard when the menu is so extensive.<br&gt;<br&gt;I did have a bad experience once, and was a little peeved that the manager didn&amp;#39;t even come out to speak with us. We ordered chicken wings, and they were not fully cooked, and raw near the bone. The waitress just took the food back and took it off the wings off the bill. Maybe I&amp;#39;ve been spoiled at other places I&amp;#39;ve been to, but I expected the manager to come out and apologize.", "rating": 3, "date": "2/23/2015"}, {"text": "What can I say, that you wouldn&amp;#39;t already know about Cheesecake Factory?<br&gt;<br&gt;This one located near much shopping in Cherry Hill is a good example of a normal Cheesecake Factory.  It&amp;#39;s got the gigantic menu.  Everything comes in large portions for a relatively low price.  There is a good drink menu and everything tastes pretty good.<br&gt;<br&gt;Service here has always been pretty good and as long as you don&amp;#39;t come at a big rush time you can usually get seated pretty quickly.  Up to this point, I&amp;#39;d easily give this location 4 stars.<br&gt;<br&gt;The only problem is the floors are so greasy.  This isn&amp;#39;t an isolated problem.  It seems like this is a recurring problem at many Cheesecake Factory locations.  Perhaps their kitchen ventilation installations aren&amp;#39;t enough for all locations?  Maybe the staff at locations don&amp;#39;t have the proper equipment from corporate to properly maintain the floors?  Either way it&amp;#39;s a serious annoyance and speaks poorly of the overall cleanliness of the chain as a whole.", "rating": 3, "date": "5/14/2012"}, {"text": "Always delicious and food coma inducing, just like it should be! Went with a party of 9 for my birthday and they told us that they don&amp;#39;t take reservations after 5, so a table large enough to accommodate us may not be available. Pretty weird to me! However we did get a table, had a great server, and a great time. Best part is, I have enough leftovers to enjoy it AGAIN!", "rating": 4, "date": "8/27/2014"}, {"text": "the food was good but the noise level in this place was terrible plus the food was way overpriced. every time we went there we had to wait for a table which was stupid when you see tables around. i suggest you wear ear plugs cause this place is loud.", "rating": 3, "date": "10/23/2016"}, {"text": "This isn&amp;#39;t really a restaurant, it&amp;#39;s a feeding trough. The tables are about 2 inches apart and the waiters just shovel the food as they pass. Our waiter never put in our appetizer so when they brought our dinners and we told them, they took our entrees back and just put them under hot lights. Our appetizer was greasy (firecracker salmon). My carbonara when they brought it after sitting under lights for so long was congealed and rubbery. I would have ordered another drink but the waiter never came back or asked. Twice he put our food down in front of the people sitting at the next table and then realized his mistake. Very crowded, noisy, no attention to detail, no customer service. I left feeling very unrelaxed, rushed and annoyed. Not how I want to spend an evening out. I will never be back.", "rating": 1, "date": "2/4/2017"}, {"text": "Great food and atmosphere. The menu is a bit confusing, there is just so much to choose from. The wait to be seated is usually a bit long since it is a local hot spot, but the food makes up for it.", "rating": 4, "date": "1/31/2017"}, {"text": "Absolutely inconsistent and disgusting.  I ordered orange chicken which I&amp;#39;ve gotten before at a different location.  This order was nothing like I received in Atlanta.  Half of the pieces had sauce on them, burnt at the edges, crunchy and stale.  Worse representative of orange chicken I&amp;#39;ve ever witnessed. Save your money.", "rating": 1, "date": "10/6/2014"}, {"text": "I had eaten here several times since having to have a waiter removed from serving us back in January for being nothing short of an asshole and obnoxious... As I told the manager at the time, I&amp;#39;d continue to come and not let that one experience ruin what has always been a good place to have a meal with good service..<br&gt;My wife and I stopped in last night planning to have dinner. But after having the crispy calimari, crab balls, a salad, and mint green tea, there was no way that  we could eat a meal.. So we chose to have dessert... We chose to share their dutch caramel apple cheesecake, which was out of this world good... And we ordered cheesecake for the kids to have when they get out of school today... The service was great, and we had a good time around very friendly people dining there... <br&gt;The best thing about this place is their hours... Open til 11 Mon-Thurs. And til midnight on weekends...", "rating": 4, "date": "6/16/2011"}, {"text": "Usually great but 2 hours to get seated is too long for a sunday night", "rating": 3, "date": "12/24/2013"}, {"text": "Only have experience with their seafood menu. Everyone we have ordered, we have had a pleasant experience. Restaurant is always packed for a reason. <br&gt;<br&gt;Their portions are large and more than filling. have tried all their seafood dishes and very happy with all of them. <br&gt;<br&gt;Every waiter/ress has been nice as well. <br&gt;<br&gt;their order by phone and park service is a good option to explore when restaurant is extra busy", "rating": 5, "date": "2/24/2012"}, {"text": "I loved the fried Mac and cheese balls the cheese vanilla bean cheesecake is taste like a vanilla milkshake very good", "rating": 4, "date": "6/25/2016"}, {"text": "So although it&amp;#39;s a chain the food is very tasty. The portion size is humongous but tasty. I went on a friendly date/celebration of the spring semester being over.<br&gt;<br&gt;Pros:<br&gt;Great ambiance, the location (surrounded by stores in a well lit beautiful shopping center), the wheat bread, the selection is huge (a little overwhelming), it&amp;#39;s a really pretty restaurant.<br&gt;<br&gt;Cons:<br&gt;small bathroom (i went to wash my hands and almost was taken out by a swinging door), the view I had of the game (celtics vs heat - okay so i wasn&amp;#39;t at the bar...but i was mad b/c i couldn&amp;#39;t see the game!), the way they cut the strawberry on my drink (b/c when i went to sip it, the berry fell off and rolled onto the floor)<br&gt;<br&gt;i got the carrot cheese cake and my friend got the apple cheese cake. Both very yummi but it&amp;#39;s a lot of food. I&amp;#39;d go here again (:<br&gt;<br&gt;went here again on 5/21 pretty good, i had a cheeseburger, i wasn&amp;#39;t super impressed but the ribs my buddy had were delicious so it all worked out.", "rating": 4, "date": "5/11/2011"}, {"text": "First time ever eating at a Cheesecake Factory. It was good! My daughter and I each had a Little Caesar Salad (not on the menu, our server Quentin told us about it!) and we shared the Hot Spinach and Cheese Dip and the Buffalo Blasts. Portions were very good, especially the &amp;#34;little&amp;#34; salad, it wasn&amp;#39;t little at all! Quentin was very attentive and friendly. Large menu to choose from, a bit overwhelming. Unfortunately our food was so filling we didn&amp;#39;t have room for cheesecake! Maybe next time!", "rating": 3, "date": "6/2/2014"}, {"text": "Had a great time tonight !  Good company . I was seated within 10 minutes of arriving. The waitress Emily was new but was very helpful.", "rating": 3, "date": "7/27/2014"}, {"text": "Sometimes chain restaurants can get a bad reputation because they lack inventiveness or because some people think the food lacks the same caliber as some non chain places.  With Cheesecake Factory though, I feel like people are drawn to the &amp;#34;tried and true&amp;#34; menu...and I, for one, look forward to their always dependable and always consistent cheesecakes. All of the cheesecakes. And surprisingly, Cheesecake Factory also hase some of the best salads. I especially love their Cobb salad and their Santa Fe salad. Be warned if you&amp;#39;ve never been though because their salads are huge! Imagine the biggest plate of salad you&amp;#39;ve ever seen...and then double it! Yep, that&amp;#39;s about right.  Actually all of their food portions are pretty huge. This is why foreigners have bad impressions of Americans...it&amp;#39;s because of these gluttonous food portions LOL. Don&amp;#39;t fret--just take the rest home and pig out the next day. Their complimentary bread basket is also something I look forward to...and dread...since I could scarf down the entire mini loaf of honey at bread if someone didn&amp;#39;t hold me down. So the overall take away from this is go hungry and go prepared to eat ginormous amounts of delicious food. Oh, also, the super long wait for a table will help to make you more hungry...be prepared.", "rating": 4, "date": "9/13/2015"}, {"text": "I&amp;#39;ve read alot about the wait here but I personally haven&amp;#39;t experienced it. This could be because I have only been here at lunchtime.<br&gt;<br&gt;I&amp;#39;ve been here a number of times and had either the Factory Burger, pretty good, or the Santa Fe Salad. The &amp;#34;lunch&amp;#34; version of the Santa Fe Salad is mountainous and I cannot imagine how bug the dinner version is. I like it because it has lots of stuff in addition to the lettuce - black beans, corn, chunks of chicken - to make it actually feel like I&amp;#39;ve had a real meal.<br&gt;<br&gt;Yes, it&amp;#39;s noisy, but for the most part pretty good. The service is friendly and attentive.", "rating": 3, "date": "9/5/2009"}, {"text": "The food was good and there was a huge selection. Too big, it was hard to make a decision. The service was prompt and it was really nice. My only complaint was the long wait and they don&amp;#39;t take reservations. My brother went over before us and checked In so we wouldn&amp;#39;t have to wait as long,since we were taking out my father. But they were able to accommodate his needs easily and the wheelchair was<br&gt;Not a problem or in the way at all which is really nice and easy. Just<br&gt;Because of that I know we will go back again. Next time I&amp;#39;ll go early and run into DSW since it&amp;#39;s right there!", "rating": 4, "date": "9/17/2011"}, {"text": "I love their skinnylicious menu!! My mom and I both ordered off it.All selections from the menu are 500 calories or less. I got the salmon and she got the Tuscan chicken. Both were super yummy!!  My only reservation about the salmon was they cooked it with the brown part on and it was a bit fishy. The BBQ burger also comes highly recommended. Our waitress was very friendly and attentive. She was almost too attentive. I drank half my drink and she&amp;#39;d just replace it. She didn&amp;#39;t bother asking if I wanted another drink, she assumed ït was ok. I just wish she&amp;#39;d at least ask.", "rating": 4, "date": "10/28/2013"}, {"text": "Visited this cheesecake factory location for the god only knows how many times, and i was impressed but feel misguided. You see with a lot of these more elegant yet casual restaurants you really have to be wowed to come back within reasonable time period. I once again got the shrimp scampi which has yet to let me down once, but this time it lacked that something that told me to come back. Service was good, food came quickly and it was hot. I love this place but maybe ill take my business elsewhere.", "rating": 4, "date": "9/23/2016"}, {"text": "No matter who&amp;#39;s visiting (from my tea party uncle to my lesbian cousin) this is a great standby place in Cherry Hill to take folks who want to go &amp;#34;out to eat.&amp;#34;  Prepare yourself for the menu, it&amp;#39;s exhausting, and concentrate on apps and dessert.  I hear the cheesecake is &amp;#34;the bomb&amp;#34; but IMHO, you can&amp;#39;t go wrong with their Lemon Cake which I got both time I&amp;#39;ve dined here.   <br&gt;<br&gt;Maybe it&amp;#39;s the soft bigotry of low expectations, because I never thought I&amp;#39;d give this place 4 stars.  But the food and service are too solid to give anything less.", "rating": 4, "date": "11/13/2011"}, {"text": "Food was awesome and was immediately seated.  The service however, sucked. The service was so bad that we asked for our check and to take our food to go shortly thereafter being served.  We wanted dessert but didn&amp;#39;t wanted to be waited on the said sucky server so we just went to the to go counter and took our dessert home. Won&amp;#39;t be back.", "rating": 2, "date": "9/12/2014"}, {"text": "I was so surprised that the Cheesecake Factory has the best veggie salad I&amp;#39;ve ever had and a fabulous veggie burger!  So if you are a vegetarian, you can eat here and leave full.  A burger is still a burger but it&amp;#39;s meat free!", "rating": 5, "date": "8/17/2014"}, {"text": "From Chicago, to Philly, to Pittsburgh, the Cheesecake Factory is consistent with great service, but the whole display doesn&amp;#39;t really move me.<br&gt;<br&gt;I&amp;#39;ve been to the KOP location, not this one... and it&amp;#39;s eh. The menus here are like middle-age scripture, and they literally have EVERYTHING. Save for dessert, nothing&amp;#39;s worth writing home about. I always stay in the Asian-fusion, and it&amp;#39;s just... bleh.<br&gt;<br&gt;If you want a nice $40 a person dinner, there&amp;#39;s countless places with more personality, better food, and close-enough desserts. When I want truly knockout Cheesecake, I go where Diddy goes, Junior&amp;#39;s in downtown Brooklyn. Chea!", "rating": 3, "date": "3/9/2007"}, {"text": "Just as fake, soulless, and depressing as any of its competitors. Arrived at 9:30pm on a Friday and was seated within 15 minutes. Not bad. We waited at the bar and ordered mixed drinks that were well made, but the bartender couldn&amp;#39;t look less happy. Kind of sad. <br&gt;<br&gt;After being seated, our server bum rushed our conversation while looking off into the middle distance. She was beat, I get it, but please try to smile. I asked her name again because I like a little personal interaction and she looked at me like I had two heads. My three companions also noticed the look. <br&gt;<br&gt;The food was like if Chilis turned up their game. Still soulless and fake, but with enough flavor to make things passable. <br&gt;<br&gt;Long story short, I&amp;#39;d rather hit the Tortilla Press around the corner if I had a choice. Foodies don&amp;#39;t eat here, just easily impressed, fooled flakes who don&amp;#39;t go any deeper than the surface.", "rating": 2, "date": "8/7/2010"}, {"text": "Food was excellent, but the service was terrible.<br&gt;<br&gt;Ate the Salisbury Steak. The portion was large and filling. Very tasty. The mashed potatoes were excellent. Everything was warm and very good, although my mom thought that it could have used some more gravy.<br&gt;<br&gt;Ate the tuxedo cheesecake and lemon raspberry for dessert. The lemon raspberry was very good, but the coffee wasn&amp;#39;t very good.<br&gt;<br&gt;However, the service was poor. We felt rushed and unwanted the entire time. The waitress took the bread away quickly and took my mom&amp;#39;s food away when she wasn&amp;#39;t even finished eating. It wasn&amp;#39;t like there were hordes of people waiting to get in to eat, so I&amp;#39;m unsure why we were treated the way we were. Thought it was funny, though, when the waitress overheard me talk about her tip and then started to treat us a bit better.", "rating": 3, "date": "8/6/2011"}, {"text": "had a horrible experience at this location .... Came in wanted to sit outside and got seated in an area without shade asked the woman who sat us to sit under an umbrella she for whatever reason did not comprehend but got someone to clear off a different table...And in the whole time we were there, no waiter or waitress came over to us but made sure to attend to the couple who came in after us .... We definitely felt discriminated against", "rating": 1, "date": "7/10/2016"}, {"text": "The food is pretty good, but the wait is always so stupid that the 7 times out of 10 that I&amp;#39;ve gone here, I ended up leaving because the food isn&amp;#39;t that damn good that I would wait 2-3 hours!!!  So the food gets 4 stars, but the wait gets zero stars!", "rating": 2, "date": "3/2/2014"}, {"text": "At first glance one may think that the Cheesecake Factory is something more than just another chain restaurant. The interior and exterior is beautiful, from the giant pillars to the hot waitresses--beautiful.  But in all seriousness, when it comes to food the Cheesecake Factory is your average chain restaurant.<br&gt;<br&gt;The food is plated in a lousy fashion most of the time. I mean, with the beautiful atmosphere, I would expect the food to at least look better on the plate rather than just being plopped onto it and given a rushed garnish. The food is very inconsistent, which goes along with being an average chain restaurant. The last time I went I ordered the pasta chicken dish and the pasta was not fully cooked.<br&gt;<br&gt;The menu definitely offers a ton of things, which is good if you are going out with a crowd that cannot decide on what type of food they want. I had a particular problem with one item on the menu--the Kobe beef burger. This is very misleading since it&amp;#39;s only called Kobe beef because it&amp;#39;s from one of the tough parts of the Kobe beef cows. Real Japanese Kobe beef is illegal to import into the States. Wagu Kobe is domestic, and the good parts of this beef go for around $15 per ounce on restaurant menus.<br&gt;<br&gt;The Cheesecake Factory has average food. The service is good, and it should be since to become a server one must undergo a rigourous written test. The food might be heavenly to a student on a tight budget or with an average palate, but it&amp;#39;s below par to a person who really appreciates food.", "rating": 2, "date": "4/29/2008"}, {"text": "Fairly disappointed. The only reason we stopped here is because it was the only place hungry and we were starved. The menu has TOO many choices. How can they keep all that food fresh? The services was good and the server was very friendly, but the food was just blah. Don&amp;#39;t know why the Cheescake Factory is gets such rave reviews.", "rating": 2, "date": "8/27/2013"}, {"text": "I really, really want to like it here but it&amp;#39;s just eh. I mean everything is like a good microwave meal. Now the cheesecake....slammin! But food...not so great.  Atmosphere is cool, building and bar are nice.", "rating": 3, "date": "9/25/2013"}, {"text": "I went to the Cheesecake Factory on December 10th around 6:30 after a fairly overhyped yet mild snowstorm. I went with my husband and two teenagers menboys.  We chose this time we could get in without a wait.  We ordered off the whole menu.  We had beer, soft drinks, appetizers, small plates and dessert. The teenagers had the fried macaroni and cheese balls.  My husband and I shared the chopped salad.  The kids had burgers and fries for their meals, I had a chile relleno and polenta fries as a small plate combination and my husband ordered a shrimp and pasta dish. Everyone enjoyed their dishes.  We ordered the 30th Anniversary Cheesecake and the Oreo Cheesecake and shared it.  Also one of my sons ordered the milkshake.  I deducted a star for service because I felt that our server took forever bringing us back the dessert menu and then we waited a long time again for him to take our dessert order.  Considering that it was a pretty slow night for the Cheesecake Factory, I felt that the desserts could have been emphasized a bit more.  I will return to this restaurant again.  The food was good, overall a bit pricey.  Dinner with appetizers and desserts for the four of us cost $173 (inclusive of an exactly 18% tip).", "rating": 4, "date": "12/11/2013"}, {"text": "Never been a fan of the Cheesecake Factory chains but this one in particular. Parking is impossible. The bar is tiny. The calories you can consume in one meal here is outrageous. From the high calorie drinks to high calorie salads to 800 calorie pieces of cheesecake! Just know that when you go here your going to gain a roll. The menu is huge, pages long. That is how you know that everything is frozen and nothing is fresh. But that&amp;#39;s a chain for ya. Only plus side of this place is the options of cheesecakes there is about 30 different kinds. There are so many better options in walking distance from here so don&amp;#39;t waste your time.", "rating": 2, "date": "4/25/2013"}, {"text": "I think sometimes people forget what defines a chain restaurant as a chain!  A chain restaurant, even the most high-end ones, needs to maintain its identity no matter where it may be located.  The food needs to pretty much taste the same on your plate as a person&amp;#39;s plate across the country.  That being said, The Cheesecake Factory in Cherry Hill is one of the great ones, that stands out from its other identically-dressed sisters.  Why? Because of the x-factors:  the service is usually top-notch, the parking lot is ample, and since any seasoned Cheesecake Factory diner knows that there will always be a wait, no matter what day it is (unless you go for lunch on an off-hour...seriously, try that) it helps that there is a budding shopping center growing around it, that keeps opening up new stores at a rapid pace!  <br&gt;<br&gt;If you&amp;#39;re not familiar with the menu, here&amp;#39;s the real deal:  you can basically eat any cuisine there.  So if you are in the mood for anything, and you feel like plunking down some money for a somewhat costly meal, head on over, put your name on the list, grab a menu, and find your match.  You wanted Asian? There&amp;#39;s a salad and entree that will be good for that.  You wanted Italian?  There&amp;#39;s an entire page of that.  Thai?  Go right ahead and turn that page... there it is.  Once you&amp;#39;ve browsed the menu, go outside and shop!  Or look at some of the interesting people you&amp;#39;ll soon be dining with.  This *is* South Jersey, you know.   By the time your name is called, you&amp;#39;ll have a fantastic meal planned out and, adding to the mystery of the long wait, your service will be pretty darn quick!", "rating": 4, "date": "5/20/2008"}, {"text": "Hello people wake the hell up it&amp;#39;s a chain with cheesecake. Stop making it out to be a bistro or something it&amp;#39;s not!<br&gt;<br&gt;I had a pleasant brunch there with my mother this morning. Little secret. They open right at 10 on sunday for brunch and we had no wait. Try to get there between 10-1030 and there is no wait which is generally NOT the case.<br&gt;<br&gt;They have a brunch menu along with the rest of the menu. My mother had a great belgian waffle and I had fish taco&amp;#39;s. As usual the portions are huge.<br&gt;<br&gt;I had the strawberry shortcake which is delightful. Their vanilla ice cream is divine. <br&gt;<br&gt;It&amp;#39;s cherry hill for godsakes people.", "rating": 4, "date": "3/15/2009"}, {"text": "Great salads - the lau salad with chicken is my favorite.  You must try their lettuce wraps.  Staff is  very friendly- my server was Gina, I must say she did an amazing job.  I will go back", "rating": 5, "date": "7/28/2016"}, {"text": "This chain has been around for many years, must be doing something right, Nationwide, &amp;amp; been to many locations .Haven&amp;#39;t let me down yet in service or food.Drinks are great!! Went to one San Diego, Los Angles, Florida, Near Ft .Lauderdale, &amp;amp; <br&gt;Baltimore. Huge menu..but again not too bad for chain restaurant. Go again, but sometimes the lines are long, get pager, wait up to 1 hour..", "rating": 4, "date": "2/22/2010"}, {"text": "I&amp;#39;ve been hearing about the Cheesecake Factory for YEARS, and just recently went for the first time the other night.  I know it&amp;#39;s just a chain, but I have to say, I was pretty impressed.  <br&gt;<br&gt;First of all, I always heard about the terribly long wait from other people, but when we got there, it was pretty crowded, but not too bad at all.  They told us the wait was about 15 minutes, and the actual wait time wound up being about 7.  We were only a party of two, so we had to sit in an akward section, very close to the people next to us on either side.  I know they must just try to jam as many people as possible in there, but it was to the point where if I got a little too Italian waving my hands around while talking, I would have slapped the guy next to me in the face.  It was also incredibly loud, to the point where I couldn&amp;#39;t hear my boyfriend across the table, or our waiter.<br&gt;<br&gt;The food, though, was very good.  Their portions are HUGE and I could barely finish half of the burger I ordered.  And the cheesecake is out of this world, as it should be, given the name of the place.  <br&gt;<br&gt;So why three stars?  Well, minus one for the close proximity to other guests and the loudness.  But you also have to take into account the price - The two of us got an appetizer, two entrees, and dessert for $75.  It was yummy, but for that kind of cash, you could probably go somewhere a bit fancier, quieter, and non-chain restaurantish and leave a little happier.  Don&amp;#39;t get me wrong, I&amp;#39;m a fan of the Cheesecake Factory, and intend to go back....  But only once, maybe twice a year.  And only after being paid a bonus or stumbling upon extra money.", "rating": 3, "date": "5/28/2009"}, {"text": "We love this place!!  Having said that the quality is slowly diminishing this past year.  They have, on several occasions, run out of items on the menu.  The portions have slimmed down and this particular location seems to have a fruit fly and fly issue which brings to light a sanitation concern!  Sorry however for the price quantity and quality are expected not recommended!", "rating": 3, "date": "8/22/2013"}, {"text": "Somewhere along the line, The Cheesecake Factory (at least this location) has drastically fallen off.  I actually don&amp;#39;t even really like the food here anymore and only come with friends.  Everything about it - other than the cheesecake - is just &amp;#34;meh&amp;#34;. But the most important part, the cheesecake is always amazing.", "rating": 3, "date": "9/25/2012"}, {"text": "I heard about Cheesecake Factory alot.<br&gt;Finally once they opened a location near us we went to check it out.<br&gt;The wait was too long, the place was too crowded and really overpriced... and food itself was barely okay... even the cheesecakes, which you&amp;#39;d think would be good, were average at best...<br&gt;Don&amp;#39;t waist your time...", "rating": 1, "date": "8/11/2009"}, {"text": "Shared Mother&amp;#39;s Day weekend lunch here on a Saturday afternoon.  We were seated immediately, and greeted by our waitress within a few minutes.  Service was prompt, apps &amp;amp; lunch items came out at a good pace.  Long island iced tea and mojito were well prepared and tasty.  We shared the guacamole as an app, it was delicious.  Also ordered cashew chicken salad, a pasta dish, shrimp summer rolls, chicken lettuce wrap tacos....all were excellent!  <br&gt;The only negative is that the ladies restroom was a complete mess, overflowing trash, no toilet paper to be found in any of the stalls.", "rating": 4, "date": "5/19/2014"}, {"text": "Went here for lunch with seven coworkers. Everyone seemed to be content with their meal, but I wasn&amp;#39;t completely happy with my Santa Fe skinnylicious salad. Six hours later and I am still super thirsty due to my super salty salad. Meh. I am really not a fan of chain restaurants...", "rating": 2, "date": "2/22/2013"}, {"text": "As another person put it, the food here really is what you can expect from a chain restaurant.<br&gt;<br&gt;I went here for a birthday party (not mines, thank goodness) with about 8 other people.  We shared a couple of appetizers, including a spring roll type with avocado in it.  Not bad, considering deep fried things hardly ever go wrong.  <br&gt;<br&gt;Got a couple of drinks, basically got what every other chain restaurant makes, premixed mixers tasting really artificial with just a little bit of alcohol.<br&gt;<br&gt;On to the entrees, I got a seafood pasta dish which was okay until I found a chunk of beef in it.  I don&amp;#39;t eat beef, or any other red meat or chicken, at that.  And dishes should never be cross-contaminated like that.  I flagged down a waitress, and she wasn&amp;#39;t sorry about it.  She took it and later some manager type person came and asked me to tell him what was wrong.  He said things like this &amp;#34;should not happen&amp;#34; - well right! they shouldn&amp;#39;t! but he wasn&amp;#39;t exactly sorry either.<br&gt;<br&gt;They obviously comped my dish, but for the rest of everyone else&amp;#39;s stuff, consisting of either deep friend appetizers or pasta ala oil, the charge came to be much more than it was worth.  <br&gt;<br&gt;The only halfway redeeming quality of this restaurant is obviously the cheesecakes.  Which are pretty good and packed well to-go, since we didn&amp;#39;t want to spend anymore time there.", "rating": 2, "date": "11/12/2008"}, {"text": "Service was excellent our server was Cali she was awesome. There was no wait food came fast we had the Cajun chicken littles with a side of mashed potatoes and Mac n cheese and the crispy crab cake littles with a side Caesar salad. For dessert we had the white chocolate caramel macadamia nut cheesecake...DELISH!!", "rating": 5, "date": "8/23/2013"}, {"text": "I am not hating Chains , because they give employment to the average joes like me who cannot afford to set up shop and be my own boss.<br&gt;<br&gt;I have eaten here 4 times in a span of 3 weeks and what did I get  food that keeps you coming back and a free slice of cheesecake(try the cookie dough cheesecake)<br&gt;Their chicken fingers(my son had to share it with me) is huge and the sauce great.<br&gt;Their Chicken specialties with Pasta and the Castoletta was superb, you will have no room for it expect the take out box.<br&gt;The burgers here are great too.<br&gt;<br&gt;The hustle and bustle says its got to be good and the only down side is the wait but hey its worth it.", "rating": 5, "date": "4/22/2009"}, {"text": "I really can&amp;#39;t believe I&amp;#39;m giving this place 3 stars. We went on a Saturday night, party of 2. Was told the wait would be 20 minutes but only ended up being 10. Sweet! We were then seated and sat and waited for 15 minutes until someone came over to our table. Turns out we just so happened to be seated at a &amp;#34;change of shift&amp;#34; time. Um, what? I&amp;#39;ve never even heard of that at a restaurant in all my years on this earth. Anyway, by the time our waitress realized we were waiting, we were ready to order our food. She didn&amp;#39;t even ask what we wanted to drink. After finally getting our drinks, our complimentary bread came to the table. The honey wheat was good, but the Italian bread was soooo hard and crusty I couldn&amp;#39;t even chew it. Completely inedible. I&amp;#39;m all for crusty, hearty bread but this was insane. Fast forward to appetizer.. delicious! We got the crab wontons, they were fresh and hot and tasty. Now, on to my main dish. Sigh. I ordered the fish tacos and the plate was at-best lukewarm when it got to the table. The ingredients in the tacos were weird. It almost had a sour/bitter taste and the ingredients were piled into the taco so high that it was difficult to pick up and eat. The black beans were salty and the rice that was served with it was so weird. I can&amp;#39;t even explain the flavor, all I know is it didn&amp;#39;t go with the dish. Should I also mention the tables? They have so many tables crammed in there, when the girls next to us got up to leave their bodies were actually touching our table because there simply was not enough room to get by. We could hear their conversations and I&amp;#39;m sure they could hear ours. I was probably sitting 12 inches away from our neighbors. So much for an intimate dining experience. I&amp;#39;ve always loved Cheesecake Factory for many years, I&amp;#39;m totally disappointed in my experience this past weekend. Won&amp;#39;t be back for quite a while.", "rating": 3, "date": "6/25/2017"}, {"text": "I will admit, I loved this place when there were only 2 in the area (King of Prussia and Menlo Park). I got a bit excited when I heard they had one in Cherry Hill.<br&gt;<br&gt;Portions are large (always taking some home)<br&gt;Wait is FOREVER (we found that standing by the bar area is first come first serve)<br&gt;<br&gt;Ah the discoveries, the 4 cheese pasta, the bar...<br&gt;<br&gt;Soon, everyone wanted to come here for EVERY occasion. The haze began to clear...my taste buds started to scream at me. ... This food is not even that good! I cannot even vouch for one meal. <br&gt;<br&gt;I refuse to come here now. Ok, I really like that black bread. That might be the best part of that place now, but not worth coming back to.", "rating": 1, "date": "11/15/2010"}, {"text": "There&amp;#39;s lots of times we&amp;#39;d go but just don&amp;#39;t because of the mobs of people.  When we go we sit outside.  Even picking up can be arduous.  Bottom line is they can afford to deliver and should do so.  I&amp;#39;d otherwise give it five stars for food and drink variety and quality and service.  Favorites are the Oriental Chicken Salad, or Ricotta Pancakes for brunch.", "rating": 4, "date": "6/7/2015"}, {"text": "I stick to 2 dishes here, fried fish tacos and the crispy chicken littles. Dessert is the chocolate cheesecake and a cappuccino. Delicious. Service is always friendly and atmosphere is clean and chill. I recommend the spot.", "rating": 4, "date": "3/17/2013"}, {"text": "I have visited this place several times and enjoy it.  The menu is extensive (21 pages plus specials).  The food is not stellar (and I would not expect it to be from a chain restaurant), but it is pretty good and there is plenty of it.  A person with a medium appetite or less with probably have enough for 2 meals.  I find their shrimp roll appetizer to be especially good.<br&gt;<br&gt;As for the other stuff.  The building itself is beautiful and has indoor and outdoor dining (although the view is a parking lot).  Some of the tables tend to be very close together, especially the tables that accommodate 2 diners.  The restaurant is also very noisy and there tends to be a wait (sometimes a ridiculously long wait) at busy times so I avoid prime times like Saturday nights.  Oh, and the cheesecake is good too.", "rating": 4, "date": "6/27/2010"}, {"text": "First thing I have to say, super-expensive. Ordered a nacho platter, meatloaf, and mashed potatoes. The nacho platter was pretty much nachos and cheese whiz. Meatloaf was fatty. Mashed potatoes were more boiled potatoes than they were mashed. When the waiter saw I didn&amp;#39;t really touch my food, he offered me to eat something else. I went with the chicken fingers, which I didn&amp;#39;t see on the menu but he said they have some items they don&amp;#39;t list. I got them, they weren&amp;#39;t bad, similar to Church&amp;#39;s chicken, but much more expensive. They didn&amp;#39;t charge me for the food I didn&amp;#39;t eat. Cheesecake is amazing. Get the cheesecake and that&amp;#39;s about it.", "rating": 3, "date": "6/23/2012"}, {"text": "Was told our wait would be @ 40 minutes. After @ an hour or so I asked the guy hosting if perhaps our paging device was broken. He said that no they were waiting for a table to open up. After several other groups who had come in after us were seated I inquired again and was told again that they were waiting for a table to open up. Finally after waiting about 1:20 we got a table. The food was good but the service was slow and I think they punished us for complaining by putting us in a booth near the service area. It was highly trafficked and loud and several busboys dropped glasses plates utensils etc while we were seated there. We asked for dessert to go and the waitress said she would be right back after another 10 minutes or so she returned and took our orders. @10 minutes after that she returned and started cleaning our dinner dishes and proceeded to put out utensils for dessert at which point we reminded her that we wanted the cheesecake to go. About 15 minutes later she brought back our check and the dessert bagged to go. That being said the cheesecake is really great.", "rating": 2, "date": "4/30/2017"}, {"text": "Exremely dissatisfied with our visit to your location. When we arrived we were told a manager would get a hold of us for our party of nine. This was after we called ahead to find out if call ahead seating was available. The hostess was extremely rude to my girlfriends sister and told us they don&amp;#39;t do that here and HUNG UP on her. On our arrival we were told to wait 30 minutes to speak to a manager an hour later he came out and told us it would be an hour. 2 hours later we were still waiting for a table, when we went in for an update again extremely rude and told we would we get seated when they were ready for us and we were being impatient. No concern for your customers at all. Is your philosophy that you don&amp;#39;t care and you have many other customers for a income base? My girlfriends nephews birthday was supposed to be a special event, but instead we were treated like trash. I&amp;#39;ve worked in the food service industry before I know how bad one review goes. I wouldn&amp;#39;t normally post anything, but I think you need to take a look at how your employees and management treat your clientele at this particular location", "rating": 2, "date": "2/19/2017"}, {"text": "The food is overpriced for the quality.  And, nothing appeals to me on the menu, especially since they removed the delicious(but wayyy overpriced) ribs off the menu.", "rating": 2, "date": "3/17/2012"}, {"text": "Took my girlfriend to the cheesecake factory for dinner and had a great time. The wait waa crazy but who doesn&amp;#39;t know they are going to wait when coming here. So we sat down,unfortunately everyone is seated on top of each other at these tiny 2 top tables. Ariel came up to us, explained the menu a little bit she was very knowledgeable about the food and helped us pick out appetizers and our entrees. She helped us get something different for once. We always get stuck on the same thing.smoke house burger and four cheese pasta. The Jamaican shrimp was so good and my girlfriends chicken Romano was even better. We ordered a pineapple mojito and Georgia peach, i wish I took a picture they were visually appealing and tasted great. their bartenders know what they are doing. We ended the night with an anniversary  cheesecake and vanilla bean which our server helped us choose also.  The atmosphere may be loud but it is a really good place to eat,service was great,  I will most definitely come back.", "rating": 5, "date": "5/7/2017"}, {"text": "This place is too much like a cafeteria to me.  Nothing like being rushed to order your food (menu is huge and confusing - so many types of food/brunch/dinner items...almost like a diner).  Order an appetizer and entree and having them delivered almost within 10 minutes of each other.  <br&gt;<br&gt;Too noisy...place is popular and many families dine here so if you have kids it&amp;#39;s ok.  But if you are out on a date and looking for a quiet dinner for 2 then look elsewhere.  Their cheesecakes are awesome....but the over rating is fair....would return but not on the top of my list.", "rating": 2, "date": "10/1/2010"}, {"text": "A good place for Lunch with Business Associates or Friends but be prepared to wait a bit to be seated if you don&amp;#39;t get there early as the place is always crowded. Food is very good, albeit a bit on the mid-level pricey side. Also watch out for those calories and carbos! Yes their food tastes good but it comes at a price, your waistline if you make it a habit of eating here. Service can be a bit slow but they deliver good food while you&amp;#39;re waiting. Enjoy the room and relax talk with friends while you&amp;#39;re waiting for your food. Parking in the adjacent lots is a nightmare. Suggest you drive around the back of the shopping ctr, behind Barnes &amp;amp; Noble, where there&amp;#39;s a big and often half-empty lot used by the employees. There is a well-lit access tunnel linking the two. Also the parking garage is a good alternate. Overall a good place to eat, but watch those calories and be sure to park at the alternate locations I&amp;#39;ve noted.", "rating": 3, "date": "2/14/2014"}, {"text": "A year ago, on the occasion of our 20th wedding anniversary, my wife and I had a great dinner at The Cheesecake Factory in Cherry Hill. One year later, on our 21st anniversary, we went back. A tradition has begun! Here are my thoughts from our most recent romantic visit.<br&gt;We dumped the kids at the home of some excellent friends, and arrived at the restaurant about 2PM on a Sunday afternoon. Incidentally, though kids are welcome at the Cheesecake Factory, I think it would be hard to enjoy myself there with our 4 kids in tow. Our kids are pretty well behaved, but even still, I&amp;#39;d worry about them disturbing other restaurant guests, and that would keep me from relaxing and enjoying myself. Also, it&amp;#39;s a bit expensive to take kids there. Honestly, my kids would be just as happy at the golden arches...<br&gt;We were told our wait would be 20 minutes. Turned out to be only 8. Not bad. That&amp;#39;s just enough time to peer into the cheesecake cooler and decide what to have for dessert. (More on that later....)<br&gt;The atmosphere is loud, but that actually works to your advantage inasmuch as the noise level allows your conversation to be private. Surrounding conversations are simply part of the room noise, and that&amp;#39;s important since tables are spaced pretty close together.<br&gt;Some reviews I&amp;#39;ve read complain about the 19-page menu and the insane number of food choices. I personally love lots of choices. Heck, this is America, and freedom of choice is what we love, like one of those inalienable rights!<br&gt;I chose the Sausage and Broccolini Pasta. That was a real winner. Perfect pasta, fresh veggies, good flavor. The dinner portion was a lot of food, but I could handle it!<br&gt;My wife chose the Hibachi steak, accompanied by mash potatoes with wasabi butter and tempura asparagus. I sampled her steak, which was good. But I don&amp;#39;t get the idea of deep-fried asparagus. Whatever.<br&gt;Our server was very pleasant and did a fine job. Knowing that we loved that brown bread they serve, I think she included some extra bread in our doggy-bag. <br&gt;And then, of course, there&amp;#39;s the cheesecake. My wife went for the Tuxedo Cheesecake, which she loved, but I took a simpler approach: the Vanilla Bean Cheesecake.  My wife commented, (but without a trace of criticism) that my selection seemed a bit &amp;#34;boring.&amp;#34; Maybe so. I admit to being much less adventuresome.  But for me, I needed purity of flavor at that point. And vanilla is never wrong. Remember that. I was quite satisfied.<br&gt;Based on a fantastic experience of great food and a new yearly anniversary tradition with the love of my life, The Cheesecake Factory is nothing but happiness for me.", "rating": 5, "date": "1/8/2013"}, {"text": "Hadn&amp;#39;t been here in a while and wishing id never stopped going. Dinner was awsome. bread was good, I had one of my fav&amp;#39;s steak diane and shrimp scampi with angel hair pasta. The pesto sauce was awsome. Steak was yummy, tender and perfectly cooked. I dont know why its hard for other restaurants to cook a Medium steak the right way. Got the Ritz martini and it was awsome! i love champagne and they put just the right amount. We didn&amp;#39;t get away cheap but it was well worth it. 2 entrees, 2 alcohol drinks, 2 pieces of cheesecake and a soda $78.00. Id pay it again anyday. My bf loved it. It was his first time. We went around 5:00 and didn&amp;#39;t have to wait at all for a seat. It wasn&amp;#39;t too packed but it was a Monday night. Also, the waitor Brian was really nice and attentive. Ive never had a bad experience here, yet.", "rating": 5, "date": "4/17/2012"}, {"text": "I&amp;#39;ve been to A LOT of Cheesecake Factory restaurants in the area and this one is by far my favorite. <br&gt;<br&gt;Service has always been good and I guess this place is good on staffing because I never get the impression that my server is handling 10 tables at once and super stressed out. (Either that or they are very good at keeping all of their tables under control.)<br&gt;<br&gt;I hate the tables where you are a foot away from the couple next to you but I know that&amp;#39;s a corporate decision as every C.F. is like that.<br&gt;<br&gt;Never had to wait too, too long here for a table. 20, 25 minutes tops.", "rating": 4, "date": "6/3/2012"}, {"text": "I was a big fan of the Cheesecake Factory and I hadn&amp;#39;t been there for a while. We went last night to celebrate my friend&amp;#39;s birthday and it was so disappointing! The avocado rolls were horrendous, lots of avocado and no flavor. I ordered Baja chicken tacos and there was very little chicken in them; rice was horrible, like it had been sitting out for a day or two. Portions are smaller, even for their cheesecakes, and prices have gone up. Service was average. With so many other new options around, I probably wouldn&amp;#39;t go back.", "rating": 2, "date": "9/18/2012"}, {"text": "I like this chain. It is what it is, not gourmet not fast food and doesn&amp;#39;t pretend to be.<br&gt;<br&gt;Hamburger was juicy and cooked as ordered.<br&gt;<br&gt;Fettuccine Alfredo was good. (just as good as many Italian places I have eaten at)<br&gt;<br&gt;Service was quick and friendly.<br&gt;<br&gt;Value was decent.<br&gt;<br&gt;What do people expect?", "rating": 3, "date": "8/7/2011"}, {"text": "Arrived here at 12:30 for lunch  with my mother. We were seated immediately. We were greeted by our waitress in about  three minutes. (Nice.) We were immediately offered bread, but we declined. We ordered iced teas with extra lemon and splenda which came out quickly as ordered. Refreshing iced tea! Brewed in house I believe. We both ordered from the &amp;#34;Skinnylicous&amp;#34; Menu. We had the Chicken Salad sandwiches, which were on very nice bread. It comes mixed with a little mayo, celery and sliced almonds. It&amp;#39;s also served with a fresh, green salad, which was also good. We had the honey citrus dressing. A very enjoyable lunch. Extra points for the &amp;#34;Skinnylicious&amp;#34; Menu, which offers meals under 590 calories, and several cocktails for under 150 calories. Of course, they still offer their regular, plentiful menu as well.", "rating": 5, "date": "7/11/2012"}, {"text": "If I could eat here more often, I would. But I&amp;#39;m not one to wait in line to eat my dinner, nor do I like eating meals that are a couple days worth of calories regularly but I do like delicious food and good service which is usually consistent at the Cheesecake Factory.<br&gt;<br&gt;If you&amp;#39;re going on a weekend night, be prepared to wait as a line does form for dinners.<br&gt;<br&gt;I, just about always, get the Cajun Jambalaya Pasta. I don&amp;#39;t think there is anything better on the menu and if there was, I wouldn&amp;#39;t know. I usually don&amp;#39;t even look at their very extensive menu simply because I like this dish so much, and I usually have leftovers. It&amp;#39;s rare that I don&amp;#39;t clean my plate but I find it extremely difficult to do so at the Cheesecake Factory!", "rating": 4, "date": "6/24/2011"}, {"text": "okay, so i&amp;#39;ve been hearing alot about this place, blah blah blah. we went there at like 3pm and still encountered a wait, of course. <br&gt;i&amp;#39;d like to talk about something strange.... immediately upon entering, something struck me.... there was no food smell! at all! no bakery smells, no aroma of things gently frying, no general cooking odors at all! this is probably one of the weirdest facets of any dining experience i&amp;#39;ve ever had.<br&gt;regardless, my &amp;#34;luau&amp;#34; salad was delicious and actually pretty authentically hawaiian. everyone liked their meals. the service was a little bit wacky and the menu is ridiculous (17 pages long and lots of furniture and real estate advertising). it was a little expensive for not being super nice, and the atmosphere was bizarre. but i&amp;#39;d probably hit it up again for that salad.", "rating": 3, "date": "6/4/2007"}, {"text": "My favorite restaurant, fried Mac n cheese for appetizer, factory meat loaf for entre, and for dessert any cheesecake well do, you can&amp;#39;t go wrong.", "rating": 4, "date": "2/12/2012"}, {"text": "I was very pleased with my experience at this resturaunt. I&amp;#39;ll start by saying the food was excellent; amazing selection, great flavors, and portions slightly larger than what could be held in an army barracks kitchen. (some may not like large portions, however i am always happy to bring home leftovers.) Although my overall experience was a thumbs-up there is a reason for my tri-starred rating, i felt cramped in the resturaunt. Our seating arrangement found us sitting at a table nearly flush with the adjacent (packed with a seemingly overzealous MD crowd discussing work rather intrudingly). I would assume however that every experience will not have a downfall such as my last visit and therefore i will recommend this resturaunt for anyone looking for a moderately priced delicious meal.", "rating": 3, "date": "10/10/2006"}, {"text": "Love their pasta carbonara!! My dad tried steak (unfortunately I can&amp;#39;t remember which one, but it was delicious..). I have always had good experiences here. It is very loud in there though, but it is a big restaurant and lots of people fit there. The staff is always very friendly!", "rating": 4, "date": "4/27/2014"}, {"text": "Yummy...large portions of food....i can never finish....but...they have good malibu bay breeze", "rating": 5, "date": "3/24/2011"}, {"text": "Very busy place, food was excellent but they give you too much food unless you want to take it home and eat the same thing twice. Server appeared rushed, drink prices were not listed on the menu for a good reason; an glass of &amp;#34;exotic&amp;#34; Yuengling was $6.50. Highest I&amp;#39;ve paid anywhere. Microbrews were probably a lot more.", "rating": 3, "date": "10/23/2011"}, {"text": "Cheesecake Factory is always a good stand-by place.  The portions are ridiculously huge, and I&amp;#39;ve never had a bad dish.  This location gets pretty crowded, so go in early.", "rating": 4, "date": "9/20/2011"}, {"text": "My boyfriend and I went on a Saturday night. I guess they don&amp;#39;t take reservations on the weekend. We waited for at least an hour and a half. The place was packed. The wait, for us, was deff worth it. We tried their spinach dip, I had the Bang bang Chicken &amp;amp; shrimp, and the upside down pineapple cheesecake. The entree was a huge portion, it lasted me about three more servings after I took it home. Very good food. Wait, not so good.", "rating": 4, "date": "2/1/2011"}, {"text": "nope.<br&gt;<br&gt;I&amp;#39;ll admit I high expectations coming into this chain the other night with my girlfriend for dinner service.<br&gt;<br&gt;terrible.<br&gt;<br&gt;huge menu.<br&gt;too expansive.<br&gt;it felt like i was ordering food from a diner or something.<br&gt;they should keep it simple so they could focus on a few good dishes.<br&gt;any chef or cook for that matter should be able to make some sort of good food which was the next huge issue!<br&gt;<br&gt;my order of chicken carbonara was very bland. the chicken was rough and overcooked and the portion was huge and unimpressive.<br&gt;<br&gt;my girlfriend ordered some sort of cajun chicken over penne which just to be completely honest had absolutely no flavor to it. when i hear cajun my mind jumps to big flavors, smoky and robust!<br&gt;there was nothing but heat.<br&gt;and a lot of heat.<br&gt;enough to kill any sort of palette you could hope to use to enjoy any meal!<br&gt;<br&gt;no substance<br&gt;no redeeming value<br&gt;completely inedible<br&gt;im sure there was some sort of idea in the kitchen that this dish would be sub par when almost immediately after serving the food the waitress came to ask how the dish was cooked.<br&gt;<br&gt;after about three bites we left.<br&gt;i would have expected much better for the price in this place.<br&gt;i would have expected at least something i could eat.<br&gt;<br&gt;would never go back", "rating": 1, "date": "1/28/2011"}, {"text": "The rudest staff of any Cheesecake Factory we have ever been to. Today was our last visit to this location. When we came in we asked for a warmer table as we had forgotten our sweaters and it was FREEZING inside. The hostess rolled her eyes and said it will get warmer later. I said, maybe but it&amp;#39;s really rather cold now. She rolled her eyes AGAIN so we decided it was too &amp;#39;chilly&amp;#39; for us, excused ourselves and as we were turning to leave she SLAMMED the menus on the counter. We would have stayed to eat if she hasn&amp;#39;t kept rolling her eyes at us... We were just wondering where the warmest spot was. It really is one of those places where they keep it way too cold. I understand the staff gets hot when they work, but since when does the comfort of waiters come above the paying customers. And there&amp;#39;s no reason to roll your eyes at someone hoping for a heater or a spot near the kitchen where it might be a bit warmer. Unbelievable.", "rating": 1, "date": "9/29/2012"}, {"text": "The food is pretty good here.  If you want to eat here get their early.  It gets very busy for dinner.  If you want , put your name on the list and check out Brio a new Italian restaurant  across the parking lot and see how long the wait is.  The cheesecake has very eclectic food.  For appetizers check out the Roadside Sliders (Mini Burgers) and the Lettuce Wraps.  For dinner try the Bang Bang Chicken or The Jamaican chicken and shrimp.  Finish it off with a piece of cheesecake.", "rating": 4, "date": "9/19/2007"}, {"text": "Great olive stuffed dirty martini.  Great food and the cheese cake is amazing.  Always bring some home and eat it there!  Love love love for a chain resturant!", "rating": 4, "date": "4/11/2014"}, {"text": "We went here because an in-law gave us a gift card and we were broke that week.  I should have just returned the gift card.  The food is inedible and apparently meant to count for 3 or 4 meals calorically.  I typically avoid chains but since everyone seems obsessed with this place, I went in with an open mind.  This was honestly really, really gross.", "rating": 1, "date": "11/15/2010"}, {"text": "I tend not to go to chain restaurants, but this is the exception. The service is excellent. The waiters are very informed of every item on the menu. The prices are very reasonable. The quality of the food is excellent, have not had a subpar meal there yet. There are lines to get in sometimes, just try to avoid the peak hours. Definetly worth a visit.", "rating": 5, "date": "9/7/2011"}, {"text": "Like Caitlin said, there is ALWAYS a wait at CF.  I was pleasantly surprised by the food... the meatloaf sandwich is amazing, and obviously the cheesecakes are noteworthy.  While the KOP location is convenient, I recommend putting you&amp;#39;re name on the waiting list before you shop.  Your table should be ready by the time you have checked out every square inch of the mall.", "rating": 4, "date": "3/9/2007"}, {"text": "I&amp;#39;ve had better food at less expensive restaurants. My gumbo had over-cooked shrimp and under cooked rice. The slice of cheesecake that I payed 8 bucks for was nothing special. The seating is horrible!!! There is a long bench against a wall with chairs on the opposite side with very small tables in between. Other guests might as well sit on your lap the seating is so tight! You will hear every detail of their conversation. The staff are dressed in all white, showing  the stains from grease and  food.  I will not be visiting a cheesecake factory again.", "rating": 1, "date": "11/18/2013"}, {"text": "Amazing restaurant!!!! The menu is the longest one I&amp;#39;ve ever seen, so you&amp;#39;ll definitely find something you like. The portions are mammoth, and will easily feed you for two days. The wait tends to be pretty long (gotta love the American desire for gluttony!), so get there early. All in all, a great place for date night or to take the family. The only downfall is that they do not accept reservations.", "rating": 4, "date": "7/15/2010"}, {"text": "I went to the Cheesecake Factory for my 21st birthday with my parents. The staff was very friendly, and our waitress Sue was great. The food was delicious; I had the garlic noodles, and the asparagus in it was wonderful. The food came out fast, and the drinks were good. When Sue carded me, she noticed that today was my birthday and they sang happy birthday to me without my parents having to ask. The food was great, but the customer service was excellent!", "rating": 5, "date": "7/9/2013"}, {"text": "Great food, horrible wait times. We have gone here many many many times and have walked away because the wait is over an hour. I can&amp;#39;t wait that long with three children, not to mention its over priced unless you go for lunch. Will I go again of course but wish they would take reservations.", "rating": 4, "date": "10/13/2013"}, {"text": "Average Cheesecake Factory. Went on a Tuesday night and it wasnt busy at all which was nice. Standard menu and nice atmosphere.", "rating": 3, "date": "12/4/2007"}, {"text": "Very, very rushed service.  We had to ask the server to slow down!", "rating": 2, "date": "7/26/2012"}, {"text": "Blue Cheese BLT burger did not have enough bacon and too much blue cheese. The Caesar salad was eh. And, the server waited until we had our mouths stuffed with food to always make an impromptu appearance to ask us how our food was. A little space please. Maybe, come back when I can actually offer a response. My wife loves this place which is why I always keep going back.", "rating": 3, "date": "2/11/2011"}, {"text": "This place is fine for what it is. It&amp;#39;s a chain, there are always going to be quality control issues and you&amp;#39;re trying to please a huge range of diners so I was overall fine with the experience. We managed to slip through the long line and grab a bar table which turned out to be a great move, saving us at least an hour. We also decided to go tapas and order a series of appetizers and small plates which was also a good move. Overall, fine.", "rating": 3, "date": "4/15/2011"}, {"text": "It&amp;#39;s great if you go at off-peak hours.  Food is good and dessert is better.  It&amp;#39;s not worth the wait if you go at a crowded time though, since it is slow inside for waiting on your food or even a drink as well.", "rating": 4, "date": "9/1/2010"}, {"text": "I&amp;#39;m a regular at CCF, but I usually frequent the one in Willow Grove. This was only my second time to the one in Cherry Hill. We went here for a special occasion and we were seated immediately; surprisingly,  it wasn&amp;#39;t overly packed and/or busy. I did not like our server, Desiree, at all. She had a very flat affect, standoffish attitude, and seemed to pre judge us maybe because we looked young (possibly). I&amp;#39;m not sure, but I&amp;#39;ll leave it at that. She walked past our table so many times before introducing herself as our server. We waited patiently and I even went to the bathroom and she still hadn&amp;#39;t stopped at the table. She is the worst server at CCF I&amp;#39;ve had in the past 5 years. Desiree finally asked us about drink orders after about 8 minutes and it took forever for us to receive bread. Desiree may require additional training with serving and cultural diversity. We ordered the Fries Mac and Cheese balls which were scrumptious! For entrees we ordered the Steak Diane with Shrimp Scampi and Jamaican Black Pepper Shrimp &amp;amp; Chicken (my absolute fav). I rated the visit a 3 only because the food was very tasty. Now that I think of it, Desiree never even asked how everything tasted or if everything was ok. Sadly, I have to change my rating to a 2. She had absolutely below subpar service. I usually order my Caramel Pecan Turtle cheesecake and eat a little while I&amp;#39;m there and take the rest to go, but I didn&amp;#39;t want to increase her tip by anymore because she SUCKED. So I purchased cheesecake at the counter. I usually tip minimum of 20% because I was a former server... The only reason she got over a 15% tip is because I don&amp;#39;t believe in not leaving a tip... Maybe I should&amp;#39;ve abandoned my morals this one time. I will not be frequenting CCF in Cherry Hill anytime in the near future.", "rating": 2, "date": "7/7/2015"}, {"text": "Mmmm...chicken costoletta and the yummy cheesecake...what&amp;#39;s not to like? In my world, the more cheesecaker, the better! Great place to go after hitting the mall or the movies.  Never a super long wait for seating either!", "rating": 4, "date": "7/6/2013"}, {"text": "I went on a Monday night and there was no wait. The food was great and not overly expensive.. however the drinks were a little too pricy. I got a strawberry martini which 12 dollars for a 4 oz drink. Im a bartender and know that fruity martinis are basically all mixer and a standard 1.5 oz vodka measure, so 12 dollars seems exorbitant. I wish I could give 3.5 stars.", "rating": 4, "date": "2/9/2010"}, {"text": "If your looking for large portion that lack flavor and taste with an inflated price this is the place to go. I&amp;#39;ve given this place numerous times to redeem itself and i have left disappointed and with brutalized pockets. Its has a nice inner and outer decor and a upbeat environment but the food is definitely lacking from appetizer to entrees...i would suggest coming here for dessert or for some drinks besides that keep it moving! 2 stars for Cheesecake Factory!", "rating": 2, "date": "2/21/2010"}, {"text": "I have never been disappointed by a meal at Cheesecake Factory. This is the only chain restaurant I can say that about.  <br&gt;<br&gt;The Thai Peanut Chicken is excellent, I really enjoy the Beef Ribs and of course the Cheesecake is not to be missed. But if you can get there for Sunday Brunch the best thing on the menu is the Crab Hash - hash browned potatoes with crab meat and hollandaise sauce. It can&amp;#39;t be beat.", "rating": 5, "date": "11/4/2009"}, {"text": "I went here with a group of people that had been before and they were raving about it.  Because it is located in Haddonfield, where there are people packed into the city like sardines, there was a 30 min. wait.  The service was decent.  The food was amazing.  I ordered Evelyn&amp;#39;s Favorite Pasta, which was penne with eggplant, pine nuts, artichokes, and a few other vegetables.  I was told the cheesecake was to die for but I thought it was just ok.  I didn&amp;#39;t even finish my slice (which cost $7).  I ordered the Cherry Cheesecake because all the others sounded like too much sweetness.  I expected there to be a generous serving of cherries on top but there was only a little drizzle (a huge disappointment!)  I would probably go there again for the food if it was a special occassion.  The experience wasn&amp;#39;t worth the cost.  Total for me: including tip was $25.  That was for water, penne pasta, and one piece of cheesecake.", "rating": 3, "date": "8/16/2007"}, {"text": "when you can&amp;#39;t make up your mind for lunch or dinner. come here. they have a huge menu. they also have a new heath conscious menu. i favor the tiramisu cheesecake. this place does get really busy during prime dinner time. nice dining area outdoors during warm weather. last time i came here was on a sunday night and had the tuna salad for dinner. it was pretty good. but more memorable was the adult milkshake that had salted caramel peanut butter.  oh man it was sinful.", "rating": 3, "date": "10/2/2011"}, {"text": "everything but the actual cheesecake is highly overrated. it&amp;#39;s way crowded, the waits are ridiculous, it&amp;#39;s loud - it&amp;#39;s a typical chain restaurant on sterroids. the only time i would ever go here is if i ordered a cake ahead of time and went to pick it up... but even then i&amp;#39;d probably have to wait about a half hour.", "rating": 2, "date": "1/8/2009"}, {"text": "Cheesecake Factory breakfasts (served all day) are unexpectedly delightful. Try the asparagus, portabella and artichoke omelet. I don&amp;#39;t know how they run their HR deparment, but the staff is consistently pretty attentive and friendly, from Jersey to California.", "rating": 4, "date": "3/9/2007"}, {"text": "Not the best.  Y&amp;#39;know, sometimes it&amp;#39;s better than other times.  Been here quite a few times since it is conveniently located and they do have a big selection of food.  The salads are pretty decent.  I do like the guacamole, but that is also hit or miss.  It&amp;#39;s nice to sit outside, but inside is scary because there always seems to be a lot of commotion...like if you want to use the restroom, you need to have experience traveling through a maze or something and be careful not to bump into any wait staff...it&amp;#39;s not their fault, it&amp;#39;s just so busy all the time...which is a bit of a surprise because the food is okay, but not outstanding.  They even changed their fries to &amp;#34;coated fries&amp;#34; which I am not a fan of.  They have good drinks... decent sized beer.  Good lemonade and other soft drinks.  I wouldn&amp;#39;t say that I am not a fan, but when I go, my expectations are always so-so.  Hope you go on a good day.", "rating": 3, "date": "7/14/2011"}, {"text": "Above average chain restaurant.  Food was above typical chain restaurant food.  Expect to wait around for 10-15 most nights.  I&amp;#39;m going to rank as one of the top 3 chain restaurants in the area!", "rating": 4, "date": "1/19/2010"}]}