{"address": ["2500 W Moreland Rd", "Ste 3225", "Willow Grove, PA 19090"], "monthly_reviews": {"2019": [[0, 3.0], [1, 2.0], [2, 3.0], [3, 3.0], [4, 3.5], [5, 3.5], [6, 3.0], [7, 3.0], [8, 3.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2017": [[0, 3.0], [1, 2.5], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.0], [7, 2.5], [8, 3.5], [9, 3.5], [10, 3.0], [11, 2.5]], "2020": [[0, 3.0], [1, 2.5], [2, 2.0], [3, 2.5], [4, 2.5], [5, 2.0], [6, 3.0], [7, 3.5], [8, 2.5], [9, 2.0], [10, 2.0], [11, 2.5]], "2018": [[0, 2.5], [1, 3.0], [2, 2.0], [3, 2.0], [4, 2.0], [5, 2.0], [6, 2.5], [7, 2.0], [8, 2.0], [9, 2.0], [10, 2.0], [11, 2.5]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "Great service today. Huge menu! There was no wait which is always a treat. They have weekend lunch specials that are valid through 5 pm on the weekend.", "rating": 5, "date": "10/27/2019"}, {"text": "We went there on Sunday,  it was 9 of us. THEY gave us a new server, she was only there for 3 days,  I  don&amp;#39;t think they should of gave her a large group like that.<br&gt;As we got seated , she took our order. We got our appetizers which was delicious but....<br&gt;We waited almost an hour to receive our dinner, by than we were all tired and ready to leave so we asked for take out containers. <br&gt;Other than that the food was delicious", "rating": 3, "date": "3/9/2020"}, {"text": "I called to place an order by phone and the person that answered the phone asked me if I tried to place the order online, I said no and she said it would be a lot faster. I told her I would order from somewhere else that didn&amp;#39;t mind taking orders over the phone. Laziness is not a good thing when you&amp;#39;re running a business.", "rating": 1, "date": "10/23/2020"}, {"text": "The CheeseCake factory is one of my go to restaurants were I know I&amp;#39;ll  get a good meal. Their food is always consistent and most of the time the service is good. I must admit that I pick and choose when I go there because it can get really crowded and a wait long. Unfortunately there is no call ahead seating, so on a Friday or Saturday night you could easily have over a hour wait.<br&gt;Out with my husband and decided to stop in for some lunch.<br&gt;We started with some hot wings as an appetizer.  They were a little too spicy for my taste, but my husband loved them. Next time I&amp;#39;ll get the sauce on the side.<br&gt;I got a California Cheese Steak and a side salad.  To be honest, it was pretty good, but they were very stingy on the meat. May not order this again. but the roll was nice and fresh as was the salad.<br&gt;My husband got a Bacon, Bacon Cheeseburger and Sweet potato fries.  He said it was delicious, cooked just right.  The portion size was great. <br&gt;Both of us could only eat half our sandwich.  It was probably the delicious warm bread and butter they give you before your food comes out. <br&gt;We skipped on the Cheesecake .....maybe next time!<br&gt;The waitress was knowledgeable and efficient as well, differently knows her job. <br&gt;It was a nice afternoon with good food and good company!", "rating": 4, "date": "8/10/2019"}, {"text": "Came here for happy hour food 4pm to 6pm, while I was shopping. <br&gt;<br&gt;I honestly am really disturbed by how dark it is in here. I have really bad astigmatism. I can&amp;#39;t see when it&amp;#39;s even heavily lit, let alone when everything is lit by candle light. <br&gt;<br&gt;Cheesecake Factory, it&amp;#39;s 5pm on a Monday. I don&amp;#39;t know if you&amp;#39;re trying to conserve energy or what but this is ridiculous. I had my husband pick out our food because I could not see. The couple next to use had to use their phone light to read the menu. <br&gt;<br&gt;I didn&amp;#39;t even end up ordering cheesecake out of frustration. The light from my phone while writing this review is killing my eyes, due to the contrast.  <br&gt;<br&gt;My husband picked out...<br&gt;<br&gt;Sliders: decent portion (4 sliders),<br&gt;Comes with slaw, pickles and ketchup. It could use a little seasoning on the meat. $6.50 <br&gt;<br&gt;Tex-mex spring rolls: I really like the sauce they came with. Large portion, easily split between two people. The spring rolls themselves weren&amp;#39;t that great. I took one bite and put it back down. $6.50<br&gt;<br&gt;Tamale cakes: sauce is amazing, the cakes are dry but flavorful. $6.50<br&gt;<br&gt;Overall.. I would only come here to pick up cheesecake to go. Not really a place to bring your kids.", "rating": 2, "date": "1/14/2019"}, {"text": "It&amp;#39;s the Cheesecake Factory, what else is there to say? It&amp;#39;s not exceptional but not too shabby either. <br&gt;<br&gt;I don&amp;#39;t usually do big chain restaurants but this place is kinda convenient especially if you&amp;#39;ve put in a couple of hours shopping around the mall.  <br&gt;<br&gt;I usually sit at the bar and almost always have gotten good service there. They have a good variety of menus - apps, lunch, dinner, etc. From what I remember, they have a pretty good happy hour. The food portions are huge so I feel like you get a lot of bang for your buck. <br&gt;<br&gt;I&amp;#39;m not a big dessert person but if you are, they got you covered...especially if you&amp;#39;re into cheesecake ;).", "rating": 3, "date": "2/13/2019"}, {"text": "Cheesecake Factory may be the quintessential modern American diner. Huge diverse menu and awesome desserts. Yeah, it doesn&amp;#39;t exactly look like a stainless roadside palace; designed to appear more like a massive adobe warehouse on the outside and something out of the fantasiful Arabian Nights, within. While not a regular visitor, sometimes it is exactly what I am looking for, especially when the answer to every existential question is, &amp;#34;cheesecake!&amp;#34;<br&gt;<br&gt;It certainly filled that bill last night. We weren&amp;#39;t sure what we wanted for dinner, but knew what we didn&amp;#39;t. Tired of checking off all the ethnic styles available within driving distance and eliminating most of them, we came to Cheesecake Factory. It had dishes from all continents, a bar, and those awesome creamy sweet cool desserts. Perfect cure for indecisiveness. We drove to Willow Grove in about 30. The expansive hall was busy but not full. We were seated immediately near the bar.<br&gt;<br&gt;We caught the final minutes of happy hour and celebrated with half price glasses of an excellent cabernet. We selected the Crispy Brussel Sprouts for an appetizer (wonderfully done with bacon and maple syrup), and their Southwest Chicken Sandwich (strong contender in a crunchy baguette and spicy aioli), and Shepherd&amp;#39;s Pie (savory ground beef and veggies in mushroom gravy topped with a load of mashed potatoes and melted cheese). Toasting our way through the meal, we completed with a flourish of a thick slice of shared almond cheesecake (they bake them right). <br&gt;<br&gt;This was a full and fun dinner that permitted us to chose cravings that we didn&amp;#39;t know we had. We couldn&amp;#39;t finish any of it, and brought enough home for another meal. Cheesecake Factory may not see us again for a while, but it&amp;#39;s good to know it&amp;#39;s there when we need the modern American diner to help us decide what to eat.", "rating": 4, "date": "12/23/2018"}, {"text": "I always like going to the cheesecake factory. I am normally pleased with my meal each time I go with the exception of their brunch and my visit yesterday. I got a cobb salad with salmon instead of chicken and it was $23.50!!!!!!! They gave me the smallest peice of salmon that I have ever seen. I was completely disappointed! For such an expensive salad, you would have thought I wld get an adult sized peice of salmon not a toddler portion. It was a complete ripoff! And I am sure someone checked the meal before I got it, so that says a whole lot about their quality control or lack thereof.... SMH! Guess, I&amp;#39;ll have to put then time out for awhile. I dont have money to waste on an awful meal.:(", "rating": 3, "date": "4/15/2020"}, {"text": "Had an excellent dinner date tonight. We were seated right away, introduced to our waitress and ordered as soon as we were ready. The Korean fried cauliflower was such a delicious and flavorful appetizer that I highly recommend. Our waitress was also wonderful, very kind and continued to check on us through out the night..she even started us out with two loafs of the brown bread instead of one which was obviously what we were craving :P<br&gt;For my entree I had a combination of herb grilled salmon and shrimp scampi. It was a small portion of shrimp (only three) with a very large side of mashed potatoes. I left extremely full with plenty of leftovers for tomorrow, but of course topped off my dinner with a chocolate tuxedo cheesecake. This one is my favorite and I recommend it if you&amp;#39;re a chocolate lover or not a fan of traditional cheesecake.", "rating": 4, "date": "9/23/2019"}, {"text": "Get ready to wait for an hour and a half and if you don&amp;#39;t not want to sit down get ready for your food to be an hour wait and freezing not just cold .. very upset since this was my place ever since I was a child, sad to say I can&amp;#39;t come here anymore rude service as well .", "rating": 2, "date": "9/19/2020"}, {"text": "Hair cooked right into the chicken. It&amp;#39;s great when I have to thrown out a 19 dollar dish.", "rating": 1, "date": "5/8/2020"}, {"text": "So, I called the restaurant directly to place an order and was asked if I would hold briefly. I agreed. After about 20 minutes on hold I decided to place an online order...while still on hold. The online order would be ready quicker than I had already been on hold. Just for fun I maintained the call all the way to the restaurant to pick up my order. After showing the manager, Ryan, the still continuing call (40 min) he had no answer, no excuses, and no customer relation answer. He just had a deer in the headlights look and sent me on my way  as there was another couple waiting behind me with their own complaint. By the way, the restaurant was maybe 10% full. <br&gt;Also ordered a medium-well burger and got (see pic). Not a fan of this location.", "rating": 1, "date": "1/20/2020"}, {"text": "The food here can get salty, but most of the food on the menu is set. You pretty much know what to expect when you go there. I got the New York style steak and I enjoyed it very much. The meat was decently seasoned and medium rare. I would go back for the steak.", "rating": 4, "date": "7/31/2019"}, {"text": "This is definitely one of my favorite restaurants to go to ....I mean I&amp;#39;m like a kid in a candy store when I&amp;#39;m in cheese cake factory and it has nothing to do with the cheese cake but everything to do with the service and the menu! <br&gt;<br&gt;I visited 5/9/19 around noon and my waitress&amp;#39;s name was Alexis. Alexis was attentive, smiled often, asked if we were alright frequently, paid attention to our dislikes, and recommended an amazing cheesecake. <br&gt;<br&gt;I ordered my favorite the famous chicken Madeira--it traditionally comes with mushrooms but I substituted them for peppers and a side of teriyaki sauce. My son ordered a raspberry lemonade and chicken fingers and fries and as always he was awwwweedddd at the taste of their honey mustard. We double downed on the brown bread and enjoyed fresh breaded buffalo wings with a side of blue cheese....I also ordered a passion fruit margarita and it was rather  tasty. <br&gt;<br&gt;I was like super full off of my meal but ummmmm how do you come to cheese cake factory and not get cheese cake? With the help of Alexis I finalized my cheese cake order to select the Cinnabon cheesecake and it took me a day and a half to finish it ---not because it was enormous in size but because you know this thing has approximately 1370 calories in it and it&amp;#39;s like sooooo doggone good you just don&amp;#39;t want the goodness to end...so I prolonged finishing it ...I mean I still don&amp;#39;t want that taste to go &amp;#34;bye bye&amp;#34;. <br&gt;<br&gt;All in all I&amp;#39;m a firm believer that you can&amp;#39;t go wrong at the Cheesecake Factory --the menu is intense you have so much to choose from, and it also caters to your diet including skinny margaritas etc.....hands down one of my favorite places to go and thanks again to my waitress Alexis for making my experience an amazing experience once again. :) <br&gt;<br&gt;And the bathrooms were extra clean!!!!", "rating": 5, "date": "5/10/2019"}, {"text": "So I had an amazing dinner tonight at cheesecake with some of my girlfriends. What made my dinner even better was my waiter joey and the busser Connor. They&amp;#39;ve made our dinner so nice. We will be coming back!!! Oh and , AMAZING FOOD", "rating": 5, "date": "8/28/2020"}, {"text": "First, I will start that the atmosphere was impeccable. I love sitting outside, but after seeing how gorgeous it was inside, I changed my mind. Our waitress was attentive, and our food came out in a timely manner. They started us out with a free bread basket (the oat bread is phenomenal) and brought us a second one as well. We had the stuffed mushrooms as an appetizer. They were absolutely delicious, and we dipped our bread in the leftover sauce in the dish because it was too good to waste. I&amp;#39;m glad we tried it, but I don&amp;#39;t know of I&amp;#39;d get it again because of the price. I got the lunch sized portion of the farfalle with chicken and roasted garlic. Even the lunch sized portion was so much I had to take some home. It was the most  delectable pasta dish I have ever eaten. It had the fresh bite of peas, black pepper seasoned chicken, savory mushrooms, juicy tomatoes, and salty panchetta. The flavors melded together amazingly. My boyfriend got the marsala chicken. Pricy, but a good portion size for the price. They used bowtie noodles and breaded chicken for this dish. He said the wine sauce was cooked perfectly, and the overall taste was tangy. He said the dish could&amp;#39;ve used more sauce in general, and the chicken was cut pretty thin, if that is something that bothers you. For dessert, I had the caramel pecan turtle cheesecake. Yummmmmmmy. A pecan brownie topped with caramel cheesecake, caramel turtle pecan topping, and a fudgy swirl. This is one of the best desserts I have ever eaten. My boyfriend got the Hershey&amp;#39;s Chocolate Bar cheesecake. He said there was plenty of chocolate, very sweet, and the whipped cream was real and not artificial tasting. Overall, I highly recommend dining here. Be prepared to spend a pretty penny, but the portion sizes make it well worth the price.", "rating": 5, "date": "8/23/2020"}, {"text": "This place is terrible, we made a reservation for outside dining for my 87 year old grandmother only to be told they&amp;#39;re not serving outside. Ok, no big deal I thought. Told me we&amp;#39;d still have to wait for a table inside even though I had a reservation to begin with. With it being dirty and smelly and crammed people I skipped it and went to the yard house next door, which was amazing! Nobody that worked at the Cheesecake Factory seemed to care, manager was a joke, and for the amount they charge for sub par food, I would avoid this place like the plague!", "rating": 1, "date": "10/25/2020"}, {"text": "Tried their egg roll sampler--  very good.  The dipping sauces were just the right amount. It was fun to mix and match the sauces with the egg rolls. The avocado egg roll wasn&amp;#39;t the prettiest- but it was the tastiest. (Egg rolls were avacado, Tex mex, cheeseburger and chicken taquito)<br&gt;<br&gt;Always love coming here- wish it was closer.   Server was nice and prompt. Only had to wait 45 minutes. <br&gt;<br&gt;And of course, finished it off with their Dulce De Leche Carmel Cheesecake.. the ultimate best slice!! Had to take it to go- too full.", "rating": 5, "date": "3/31/2019"}, {"text": "I like this place when its not busy once they get packed the food isn&amp;#39;t as consistent. I ordered soup and the miso  salmon. My soup was barely warm and my miso  salmon was just fish on top of a bed of rice. That is the dish but it had no vegetables and no crispy wontons, like it was rushed. I ordered brown rice it came with white drowned  in butter, the bartender offered  to change it but I hate to send food back. The fish tasted very good  but the whole experience was ho hum.", "rating": 3, "date": "1/25/2020"}, {"text": "Cheesecake factory so good. I had steak tacos.... they were so good.. yes a little expensive. But as the saying goes you get what you pay for.... Also had a peice of original cheese cake. Being known for cheese cake. Definitely by far the best around. I aways like to arrive early and eat. Because about 5pm It starts to get packed. Get there by 4... The server was great. On it with drinks and bringing the food out in minutes.... Coming back to the table seeing if I needed anything...<br&gt;<br&gt;Can&amp;#39;t wait to go back in the near future... Might try the lunch specials!!", "rating": 5, "date": "12/28/2018"}, {"text": "Food is always good. Vince our server is always professional, knowledgeable and kind. Our go to spot.", "rating": 5, "date": "5/25/2020"}, {"text": "Terrible. My boyfriend and I made reservations and waited for an hour just to eat. Employees were rude and unprofessional.", "rating": 1, "date": "9/26/2020"}, {"text": "I ordered the fish and chips but we got fried shrimp and fries.  Now this is not totally off shrimp is a fish, but when you can&amp;#39;t shrimp it&amp;#39;s a problem.  But not all was lost the wife ate it and said it was OK.  She ordered chicken quesadilla, her&amp;#39;s came but it didn&amp;#39;t have any chicken in it and was only filled with vegetables.  I ate it and was just ok. The lemon raspberry cheesecake we ordered for dessert was very good.", "rating": 2, "date": "9/26/2020"}, {"text": "I came here for my birthday with my boyfriend on a Saturday night. Our server Joey was beyond great.  Great service and Attitude and he was very attentive. Food was great as always. Will definitely be back.  Thank you.", "rating": 5, "date": "9/26/2020"}, {"text": "Absolutely amazing as always ! Had a great time! In this post , pictures are over a thousand words ! We always enjoy ourselves here!", "rating": 5, "date": "1/16/2019"}, {"text": "I had jambalaya pasta. It was awful. Green dry noodles I didnt ask for.  Two pieces of chicken and three shrimp with pieces of shell still on them. A huge oversize plate of dry noodles and five peices of meat. Just sad<br&gt;<br&gt;The biggest problem my drink was so disgusting  I vomited alllll night. I had a soda and I couldnt see because of the suds. Once I drunk half I saw my cup  was so dirty there was residue sticking to the glass. The particles were floating around in my drink and I consumed it. Smh pisssseddd", "rating": 1, "date": "11/26/2018"}, {"text": "Far worst cheesecake factory that I&amp;#39;ve been. Ordered shrimp with angel hair and Louisiana pasta. Shrimp came out half burnt, tomato pasta was watery and had no flavor. Louisiana pasta tasted nothing as well. I do not expect much from a chain restaurant; but damn..", "rating": 1, "date": "2/8/2020"}, {"text": "I have heard a lot about the Cheesecake Factory and I may have ate at one before but it wasn&amp;#39;t memorable so here you go.  We came to this location because some friends of ours love this place and they wanted us to meet them here.  <br&gt;<br&gt;I thought it was going to be a long wait but it was a small 5 minute wait to seat our party of 4.  The hostess was nice and our waitress was friendly, patient and she had some nice recommendations for us.  <br&gt;<br&gt;The food was really good.   None of us had any complaints about our food orders.  I enjoyed the shrimp scampi for my dinner.  For dessert I had the Very Cherry Chocolate Cheesecake.  It was incredible!  <br&gt;<br&gt;If you get a chance be sure to stop by this location for good service and great food.", "rating": 4, "date": "6/17/2019"}, {"text": "I went here yesterday just for a happy hour and to enjoy the weather since it was my day off. I was able to sit outside on the terrace and enjoy the sun and breeze. I ordered a glass of Riesling! And had a lunch special of the Four Cheese Pasta which was pretty good. I was off and in no rush to go anywhere so I was there for about 2 hours. Enjoyed my time and the waiters were nice! And attentive", "rating": 4, "date": "8/10/2019"}, {"text": "My favorite restaurant. Large portions, great prices, great food. The chicken sliders are my favorite. Their mozzarella sticks are great too. Too many great cheesecake options to list. Salivating as I write this.", "rating": 5, "date": "5/14/2020"}, {"text": "No surprises here!<br&gt;My wife and I have been to this location for for years but I must say tonight&amp;#39;s experience was by far the best.My wife ordered the chicken piccata, I had the grilled pork chop with mashed potatoes and green beans, we both shared the calamari as an appetizer, and two slices of cheesecake to go to wrap up our meal. All were excellent. This review and 5 stars are for our waiter Joseph B. We sat at table 53 around 5:30 pm. Joseph was on point all night, friendly, knowledgeable with the menu and our questions and always seemed to be right there at our table whenever we needed something even though the restaurant was busy. It made our usual good visit an exceptional one and we thought he should be recognized for his outstanding service.", "rating": 5, "date": "11/1/2018"}, {"text": "The Cheesecake Factory is a place to go when you are throwing all caution to the wind about your diet ... or so I thought! I didn&amp;#39;t want an insanely thick dinner+dessert so I opted to pick from their low-calorie menu for dinner, known as the Skinnylicious menu. I&amp;#39;m not going to lie, I really dislike that name - I felt really silly ordering the Skinnylicious shrimp tacos. But I was surprised at the plate when it came out, I was expecting dinky little taco shells with maybe a single shrimp in each to help keep the calories low But I was pleasantly surprised at the portion size. <br&gt;<br&gt;Generally, the food itself was fine. Nothing bad, just nothing to write home about. The tacos were a little bland. And I&amp;#39;ve noticed that as well with other meals I&amp;#39;ve had at various Cheesecake Factory locations too, not necessarily specific to this location. I&amp;#39;ve never had a bad meal there, I just feel like in a restaurant where most everything is on its A-game, the entrees are just okay. <br&gt;<br&gt;I got the low carb Cheesecake with strawberries. This more than makes any meal there worth it, and is what keeps us going back. It was unbelievably tasty and rich. My wife got the celebration cheesecake which had some birthday cake baked into it. We of course shared, and both were top notch. <br&gt;<br&gt;Also, top marks go to our server Lexi. She was great. She handled her job well, but was definitely keeping us laughing and smiling every time she stopped by to check in on us. She should be commended for her great attitude and sense of humor. Whenever we go back, we will hope to be served by her every time we go. <br&gt;<br&gt;A fun little observation: some of the decor in there reminds me of the Eye Of Sauron from the Lord Of The Rings movies. I always enjoy that each time I go.", "rating": 4, "date": "10/3/2017"}, {"text": "This place is great! A little over priced for my liking, but it was worth it! <br&gt;Our waitress was amazing and as well as the food. A couple other people and I just shared a appetizer and a meal. We got the chicken pot stickers which were amazing! I never had them before, so I was glad that it was very tasteful. We also got the fish tacos which were fried and they were great as well! A little bite to them but nothing too bad. <br&gt;We sadly did not get any dessert because of being full from what we all had ate. But, I did grab the raspberry cheesecake for the way home and it was creamy and delightful! <br&gt;I would definitely come back! And I definitely recommend this place! <br&gt;Thank you Cheesecake Factory", "rating": 5, "date": "5/25/2019"}, {"text": "Umm.... For take out I was under impressed. I asked for a medium burger and got well done. It is almost burned.... As you can see so much char...I don&amp;#39;t know how I feel about the deconstructed burger or the fact that the cheese in the Mac and cheese came separate....", "rating": 3, "date": "6/13/2019"}, {"text": "Lol I used to love this place , went 3x but my last visit trumped the 1st two. Food was disgusting, me &amp;amp; my gf normally order the same thing because it never fails but they managed to fail. Noodles were over cooked, tasted bland, well done steak for our friends was rare, drinks were watery &amp;amp; the manager on staff was a jerk, we sent the food back to give them another chance to fix it &amp;amp; he brought the same food back out, we sent it back &amp;amp; vowed to never support there business again. Very very poor customer service.", "rating": 1, "date": "8/25/2020"}, {"text": "My experience at The Cheesecake Factory was far less than satisfactory.  I had placed an order for Pick-Up on 4/4/20.  My family and I were looking forward to a good meal, as that is our usual experience with The Cheesecake Factory. We ordered a few cold items as well as a few hot items.  We had specified and called to make sure the cold items stayed separate from the hot items ( this should be standard practice).  When <br&gt; I arrived for pick-up, the hot and cold items were in the same bag.  Essentially that ruined my salad (greens were all wilted and cheese was melted). Another disappointment was the chicken and pasta entree.  While the chicken was very good and was a decent portion, the pasta was almost non-existent. For an almost $20 entree this was extremely disappointing.  It was almost like the ran out of pasta and just gave us what was left.  All in all for the money spent which was near $100 the quality and quantity was extremely disappointing.  To be fair, I do realize they may have been overwhelmed with the influx of take out and delivery orders - I just wish they kept up with their quality and consumer expectations.", "rating": 1, "date": "4/6/2020"}, {"text": "I come here for lunch maybe twice a month by myself and I have a great experience each time. I have a different server each time and they are always prompt and attentive. I never have to wait long for anything! Granted I go during the day in the middle of the week but some restaurants can&amp;#39;t even handle a slow day! Also a big plus, the bathrooms are pretty tidy!", "rating": 5, "date": "11/13/2019"}, {"text": "This location need to close or obtain new management.  I&amp;#39;ve ordered food twice in two months from this location and the food has been cold on both occasions.  It&amp;#39;s overall poor service here.  Don&amp;#39;t waste your time, spend your money elsewhere.", "rating": 1, "date": "6/15/2020"}, {"text": "I was very disappointed this trip to the Cheesecake Factory. I called the night before and they said I had to make reservations on Yelp. I did this and wrote we need to be outside because we have elderly high risk individuals coming and I thanked them for this. We arrived and no one was outside- it was a Saturday at lunch time. They told us they were not doing outside seating. They said they were no tables in the hallway of mall either. Then they said we would have to wait for a table despite our reservation. Another older lady came in and asked why she couldn&amp;#39;t sit outside and was upset. Long story short we took our 87 year old grandmother on oxygen to the restaurant across the hall where they quickly accommodated our situation. If you have outside seating during COVID can we please use it? And if there are not going to be tables please be courteous enough to call us so we can go somewhere else and not make our grandmother walk all around for an open restaurant. I was highly disappointed and the hostess was not empathetic or helpful. We won&amp;#39;t be coming back anytime soon!", "rating": 1, "date": "10/25/2020"}, {"text": "Feeling pretty annoyed and let down. I know everything sucks at the moment. This is a &amp;#34;first world problem&amp;#34;... i promised my kids a nice dinner after being stuck in the house/doing all their chores and online homework. We ordered $129 worth of takeout. The takeout people on the phone were great. The food was gross. Half asked portions (iv ordered these dishes before multiple times).. the salad/tomatoes/vegetables were inedible. All the food tasted old! Perhaps they should have just said  they couldn&amp;#39;t make the dishes instead? Iv worked in restaurants my entire life. I&amp;#39;m sure the managers are getting pressure to sell what&amp;#39;s left In stock from corporate.. but what a waste of my money! I would have made out better going to Wawa, and saved $90. Never ordering there again.", "rating": 1, "date": "3/17/2020"}, {"text": "Great food, love their cakes. Awesome atmosphere, great for any one in any occasion. Would definitely recommend and is now one of my favorite restaurant to dine in. Thanks", "rating": 5, "date": "7/19/2020"}, {"text": "For the second time in a month I get home to see they forgot something. I asked if everything was in there they said yes. I asked on a few specific things told yes everything. Stamped at the top of the recipient it says &amp;#34; DONT FORGET DESSERT &amp;#34; what did they forget? It&amp;#39;s Father&amp;#39;s Day, you don&amp;#39;t want to not have dessert. I call wait 14 minutes on the phone to be told I can come back. I live in Horsham, not around the corner. The manager was no help. NOT GOING BACK!!", "rating": 1, "date": "6/21/2020"}, {"text": "Another chain serving sub par low quality food at outrageous prices !  <br&gt;<br&gt;Asked for the small crab cakes was told they don&amp;#39;t have such an item on menu.   Opened menu and there they were called crab bites !   Hmm crab meat mayo dipped in panko and fried sounds like crab cakes go me!!<br&gt;<br&gt;Incinerated pork chop completely inedible !  Rare steak served so over cooked and grey there was no juice! Broccoli served with mold still on the florets!<br&gt;<br&gt;Bathroom floor covered in urine !   Final insult presented a bill for $48.54 for food sent back and not eaten  and waiting more than ten minutes for them to take my card!  <br&gt;<br&gt;After being disgusted beyond comprehension I asked a waitress if she could take my bill and card and process payment was met with the comment do I look like I was your waitress ?   I was not your server you&amp;#39;ll have to wait for her to come back !<br&gt;<br&gt;Are you out of your mind?  WTF ??? Really you refuse to take my payment and want me to wait for my server to return !!! <br&gt;<br&gt;Never again!  Just say no to the chains and subpar mediocrity !<br&gt;<br&gt;As you can see folks by their reply it&amp;#39;s a total who gives a crap attitude !", "rating": 1, "date": "5/28/2018"}, {"text": "Top selections and generous portions. Love the Cuban sandwich and the Louisiana Chicken pasta, good burgers too", "rating": 5, "date": "11/13/2019"}, {"text": "Came to the Cheesecake Factory for lunch after shopping around in the Willow Grove Mall to mini celebrate my boyfriends birthday. <br&gt;We ordered the appetizers- Ahi tuna and Thai lettuce wraps for starters. The waiter was super nice to explain the difference between the regular size Thai lettuce wraps and the appetizer sizes, very useful since I only wanted a small portion. The service around us was super friendly, the busboy offered new knives every time we dropped ours ( happened about twice). <br&gt;The wait for our food took about 30 minutes which we didn&amp;#39;t mind since it was lunch time and we were full from the 2 rounds of bread. (The bread is my favorite part about the Cheesecake Factory, the whole grain bread is nowhere to be found outside of this restaurant !)<br&gt;<br&gt;To add to this review - the bathrooms were incredibly disgusting. Each stall were dirty with paper everywhere and had no toilet paper. Usually I wouldn&amp;#39;t comment on this aspect, but this is pretty unsanitary for a restaurant in which servers, chiefs, and employees utilize.", "rating": 3, "date": "2/19/2018"}, {"text": "I&amp;#39;m not why they bother to include a empty fucking box with crumbs in it next to my burger. 16$ burger to go and i immediately realized that I should have gone to burger king and got a whopper meal at least if im missing shit i didnt pay $16 for a cold ass burger and i guess this is just the normal amount of fries that cheesecake gives out. Funny thing is i opened them and didnt even eat 1 fucking frie because I lost my appetite, because if I want some fucking crumbs Ill go through my fucking carpet and lick the floor, but dont put that shit on a plate and pretend thats a fucking meal what an insult. I am never ordering from this fucking place again and they slipping with their food all watered down and tasteless. guess there is a reason theres all those parked cars in front of cheese cake but the only resturaunt full is Yard House LOL. go fuck yourself you fuckers who need to learn to how to cook I am never eating here again this place is a fucking disgrace as an american resturaunt its just simply trash...", "rating": 1, "date": "5/9/2020"}, {"text": "Before I write this review, I just wanted to say that I tried to address this matter over the Cheesecake factory website but they never responded or addressed a major concern I had over my experience.<br&gt;<br&gt;I went to the Cheesecake factory on Tuesday, December 5th around 7pm. Even though it was busy, we were promptly seated at a table, no complaints there. We ordered the appetizer and it was pretty delicious (chicken samosas). Service was very slow and eventually my entree (fish and chips) finally came out. It tasted pretty good but in one of the bites I took of the battered fish, I thought I had a &amp;#34;bone&amp;#34; in my mouth. It was very hard and impossible to chew, and upon removing the &amp;#34;bone&amp;#34; from my mouth I actually saw that it was a shiny piece of metal *drum roll here*.. A STAPLE. That is right, somehow a staple ended up in my fish.<br&gt;<br&gt;I promptly told the waitress that I wouldn&amp;#39;t be eating this any further because of my concern that possibly another staple could be in my food. I really wish I was making up this story because literally my whole night was ruined. The waitress took it away and said that my meal and any dessert I chose would be on the house. She also offered me another meal, however I declined. She said it could have been a piece of metal from the frying bin? LIKE WHY IS THE FRYING BIN FALLING APART? HOW IS THAT OK?<br&gt;<br&gt;SO there we have it, my awful experience at the Cheesecake factory. If you go, be careful and weary. <br&gt;<br&gt;This definitely raised a huge red flag for me. I don&amp;#39;t like to question the integrity and safety of my food so I most likely won&amp;#39;t be returning to any of the locations.  <br&gt;<br&gt;On a side note, I had a friend that was served glass in his water at another location. <br&gt;<br&gt;Cheers.", "rating": 1, "date": "12/12/2017"}, {"text": "3.5 stars Chain restaurants are my least favorite places to dine. This particular chain however does offer a lot of variety so for that, I like it. The menu, as many of you know is absolutely huge and extensive. There is something for everyone... the health-conscious and the ones who want to splurge on big giant piece of nine dollar cheesecake alike. There are also gluten-free and dairy free items clearly marked. I do love Ana greatly appreciate that all menu items are listed with their calorie content and have been way before it was trendy. I also like the option to get a lunch sized portion of any of their dinner entrees. <br&gt;<br&gt;I&amp;#39;ve been to three different locations, center city, KOP and this one. This location is OK. They all pretty much look the same with that somewhat Tuscan decor and all locations are pretty large. I have personally never had to wait here, but I usually come during the day, during the week. <br&gt;<br&gt;This spot makes for a good stop mid shopping spree and I think that the area and the mall alike needed something like. This Cheesecake Factory is a good option if you&amp;#39;re looking for a sit-down meal rather than takeout from the food court while here at Willow Grove. I wouldn&amp;#39;t go out of my way to come here, but for a mall day, it&amp;#39;s a good option. <br&gt;<br&gt;I&amp;#39;ve never had a bad meal here. My go to lately is the vegan Cobb. It&amp;#39;s huge and tasty. It can easily be made into two meals or split amongst the entire table. Try it! Crispy and crunchy!<br&gt;<br&gt;Prices are fair, portions are hearty and service here has been pretty good each time we have visited. If you&amp;#39;re starving fear not, they start you with delicious warm bread and creamy house butter right away! <br&gt;<br&gt;Be a good wife and grab a slice of decadent, rich cheesecake for hubs so he won&amp;#39;t mind how much you spent that day :)", "rating": 4, "date": "9/21/2016"}, {"text": "We just had the worst experience. Everything came out late! We ordered an appetizer which took forever and it was just nachos (soggy) and then our entree took a decade to come out and my order was a salad which didn&amp;#39;t need much cooking. And then to top it off they kept saying 3 more mins for my husbands entree to to come out because something happened in the kitchen. It was just not a good experience overall. The only thing that was ok was the waiter he was very nice and apoplectic about the whole situation <br&gt;<br&gt;The manager was the one that came to us and told us it would be 3 more mins btw! he should know there was a problem if he had to come to us and say that himself.", "rating": 3, "date": "7/24/2019"}, {"text": "Long wait times, but the food is worth it.they do accept reservations, you simply have to make sure that you are there on time.", "rating": 5, "date": "2/23/2020"}, {"text": "Shrimp scampi for me,<br&gt;Fried Mac &amp;amp; Cheese Balls for my youngest,<br&gt;And Oreo cheesecake for me babe!<br&gt;Soooooooooooooo goooooooood! Everybody loved what they got. This is one of my top places I love to go to in the area.", "rating": 5, "date": "5/15/2019"}, {"text": "The woman who takes my togo order today doesnt have any service mind at all. Poor!!!!!!!!!!!!!!!!!<br&gt;Update: and it takes 30 mins to get 2 slices of chessecake!!!!!!", "rating": 1, "date": "1/27/2019"}, {"text": "I went to The Cheesecake Factory with my hubby and got the usual!! Fettuccine Alfredo. Delicious! My hubby got chicken costoletta!! And we had the sweetest most helpful waitress Keira! She we never had an empty glass! AMAZING service. The food is always great but Keira really made our date night enjoyable with her great service.", "rating": 5, "date": "1/15/2020"}, {"text": "The Cheesecake Factory, as thorough as it&amp;#39;s menu is (there&amp;#39;s like a hundred items!) seems to always be packed and people, for the most part, look happy. <br&gt;<br&gt;I went on a Saturday afternoon with my girlfriend and sister, expecting to be welcomed with tons of people and a fairly decent wait - I was not let down. <br&gt;<br&gt;We ordered the &amp;#34;Buffalo Blast&amp;#34; as an app, and ordered the &amp;#34;Truffle Honey Chicken,&amp;#34; &amp;#34;Pasta Da Vinci,&amp;#34; and &amp;#34;Chicken, Mango, and Avocado Salad.&amp;#34; The latter two were based on previous favorites of ours, we highly recommend them. The Truffle Honey Chicken was a new try, and enjoyed our chicken, though it was a bit boring. <br&gt;<br&gt;The waitress was very helpful and ready to help, though she was stretched thin based on the sheer volume of people there. I&amp;#39;d recommend it for a people ready to hang up their shopping goals for a several long break.<br&gt;<br&gt;Overall, the Cheesecake Factory is consistently decent food at a slightly shy of modest price point. It&amp;#39;s regularly packed and I expect that, though it won&amp;#39;t be anyone&amp;#39;s favorite place, it&amp;#39;s consistency is commendable. <br&gt;<br&gt;-----------------------------------------------<br&gt;<br&gt;Update 5/31/18:<br&gt;<br&gt;Bumping my previous 3 star rating to 4 star because of the helpfulness of the management staff. I came here for a cheesecake with my girlfriend, and had forgotten an empty shopping bag with an important receipt in it. It turns out that, thinking it was just trash, they threw it out. Justine, the manager, spent ton of time looking for it for me and ultimately found it. I have to commend the helpfulness of the staff, thank you so much!", "rating": 4, "date": "2/27/2018"}, {"text": "I don&amp;#39;t think I will return to this location. My table was dirty and so was the plate. Clearly no one bothered to clean the table between customers. I ordered the chicken Madeira / herb salmon combo. After waiting about 40 minutes it arrived, Tiny portion with very little sauces, The salmon tasted good but was dry. The sad, lightly sauced chicken breast was not cooked through. I asked the waitress to take it back. She wanted to take away the salmon too and I said no, I waited way too long already and i was hungry. <br&gt;About 25 minutes later the new chicken arrived, exactly as before except the edges were lightly browned. I asked for a manager who proceeded to tell me I was wrong and the chicken was cooked through. <br&gt;It was futile to argue so I asked that he take a few dollars off the check, which he agreed to do. I then ordered a slice of plain cheesecake and it was great. The meal was so expensive, even with a few dollars off for my trouble. I should have just gotten the cheesecake to go. It was made elsewhere most likely so they couldn&amp;#39;t ruin it. Ironically it says chicken Madeira is the most popular dish. Hey, even I can cook a chicken breast and I am not a great cook, lol!", "rating": 2, "date": "2/2/2020"}, {"text": "I love going to this particular Cheesecake Factory because it&amp;#39;s close, it&amp;#39;s next to the mall, and the food is usually very well prepared. However, I was rather disheartened to find a piece of plastic in my chicken Parmesan when I went this weekend. The manager and the waiter were more then willing to make my visit better and to help fix the situation. My girlfriend both ordered cheesecake for dessert, which we both found to be very delicious. I would still recommend this particular Cheesecake Factory.", "rating": 3, "date": "10/19/2019"}, {"text": "The only thing i can say is that they have a great brunch! But sadly,  i am done! I will no longer eat here after 6 pm! Your food rushed, poor waiter service forgetting things. I come to the conclusion  that they place you in darkness so you don&amp;#39;t see the horrible display of your food! Over rated! 2020 no longer giving my money to any restaurants  that have nasty, i dont care food, we just want the money! They charge 20 for a  chicken club (burnt bacon)  sandwich thats really a tomato sandwich! My sister cold fries! Squeeze you at a table to the point that the couple sitting next to you has to place their behind in your  plate to get up! This place is a disgrace!", "rating": 1, "date": "1/19/2020"}, {"text": "Dirty plates (there was literally a piece of old food stuck to my plate and fork), no napkins, cold bread and slow service (took 25 mins to check out). Very disappointing experience on 1/1/2020.", "rating": 1, "date": "1/1/2020"}, {"text": "My husband and I ate at The Cheesecake Factory in Fort Lauderdale over a decade ago and it was such a great meal! We&amp;#39;ve wanted to go back to a location near us, but the closest one is this one in Willow Grove which is almost an hour away. We finally had the opportunity to go there as we happened to be in the area this Sunday. What a difference from Florida. First off, it is way too DARK in there!! Tables are WAY too close together, the couple next to us felt as if they were WITH us. The bread was good. My drink was very good, but our food arrived after a very long wait. My truffle-honey chicken had no honey or truffle anything, it was plain fried chicken with no additional flavorings of any kind. The asparagus was tough and under-cooked. The mashed potatoes were delicious. My husband&amp;#39;s pasta with vegetables was so very very bland, even after adding salt and much pepper from containers that were clogged up. Yes, the cheesecake was great. Traveling to another Cheesecake Factory is now off our &amp;#34;bucket list&amp;#34; and we will not return. I&amp;#39;m just glad we didn&amp;#39;t make a special trip just to go there. I can get a better, cheaper, more flavorful meal at a diner.", "rating": 2, "date": "11/12/2019"}, {"text": "This place is sucks, I understand you could having a bad day but that is not give you the right to try people bad if the girl who was attending doesn&amp;#39;t like her work just quit your job sweet, I bought a cake three cakes actually she was mad because no body was helping her and everyone we had to see who she complained about it. And the end she jus gave two cakes", "rating": 1, "date": "3/12/2020"}, {"text": "We went to this restaurant on a Friday night. Of course busy. We waited for about an hour before we were seated.  We met our waitress and she introduced herself. We ordered our appetizers , food and drinks at that time we were starving.  Our buffalo blast did not arrive until about an 1 hr.    And when they did arrive - the waitress immediately  came over to apologize.  She said she spoke with her manager and mentioned that we waited a long time for our appetizers. She came and sat beside me which i did appreciate. Since we waited so long, the manager said we could take the appetizers off the bill or 2 cheese cake desserts.   We chose the desserts. Our dinner did arrived shortly after.  Presentation of our food was good and the food tasted delicious.  I did order a margarita. The taste was good but sadly the glass was small and with the ice- there was not much to drink. <br&gt;Once we were done - we asked for the check- and our waitress said ther the buffalo blast were taken off the bill. <br&gt; It was a win win for us. Thank you cheese cake factory for being aware of your customers <br&gt;I will cont to go to this restaurant. <br&gt;I gave it 4 stars- we waited 1 hr  before being seated and 1 hr for our appetizers.", "rating": 4, "date": "11/20/2017"}, {"text": "Came for a birthday brunch for my dad. We all had their lunch specials. The lunch specials are until 5pm everyday which is awesome. You get to save a couple bucks from their regular prices. The portion of the food are the same as regular price. Food was amazing and they had good service.", "rating": 4, "date": "11/16/2017"}, {"text": "Customer service was great. However, after getting my food not so much. I order the burger stuff with cheese. I had a burger with cheese oozed out before I had a chance to bite into it. And the burger/patty is burnt, all I tasted was charcoal. I will attach a photo. Really disappointed! Why serve a burnt burger, just make a new one. Really sad.", "rating": 2, "date": "7/2/2018"}, {"text": "Usually this location is extremely crowded, but my fiance and I went at a time where it was RIGHT before Dinner on Sunday night. We were seated within five minutes which was great! Only downside, we got those really small tables that are RIGHT within earshot of other tables that are RIGHT next to you, so I could hear the couple next to me&amp;#39;s entire conversation, and I had couples on either side of me. The table is also a little small to accommodate bread, an appetizer, and an entree, so plates need to be cleared first (which our waitress was pretty good about). I loved the honey wheat bread, I could devour the entire thing (which I did, because my fiance only likes the white bread haha!) We got the fried macaroni and cheese bites as an appetizer which was delicious! It said it came with marinara sauce, but it was more so a vodka sauce, and just lightly on the bottom of the plate, not like an actual dipping sauce like I thought it would be. I got the Parmesan crusted chicken with green beans and mashed potatoes and my meal was so delicious! It comes with 3 small breasts and I could only eat one. I saved the rest for Lunch the next day (and gave my Mom one of the breasts) and I was STILL full the next day! I wish I had room for cheesecake, they have sooo many cheesecake flavors to choose from!!! The cheesecake slices are expensive, but worth it if you&amp;#39;re sharing with someone, or eating it in multiple sittings.", "rating": 4, "date": "5/9/2019"}, {"text": "I&amp;#39;ve only been to TCF twice in all my life, the first time was at the KOP location and the second time was at the Willow Grove location. <br&gt;<br&gt;The hostess was friendly but seemed confused and disorganized. We were sat within ten minutes of arriving. Our server was polite, funny, patient, and knew his stuff. Our drinks were always filled and our appetizers and main course arrived in a timely manner. <br&gt;<br&gt;The food was average, very large quantity - enough for lunch, dinner, and tomorrow&amp;#39;s lunch, but not high quality for the price.", "rating": 4, "date": "8/22/2017"}, {"text": "Food was amazing! We went yesterday for Valentine&amp;#39;s Day. This tall server offered to pack up my pasta when I got home I found not one but a BUNCH of white hairs in it which I&amp;#39;m confused because I didn&amp;#39;t have hairs in it before and my server was a tall kind slim African American guy I&amp;#39;m so turned off by the hairs I won&amp;#39;t return ever again! Sad because that&amp;#39;s my favorite spot and go to for holidays or celebrations I&amp;#39;m so disgusted  and disappointed !i should&amp;#39;ve known better because my menu had a lot of food and sticky stuff on it which I did mention to him when he first took our order", "rating": 3, "date": "2/15/2020"}, {"text": "Service was slow and my main course was over cooked rubber shrimp and over cooked pasta is never good. Frist time here at a cheesecake factory and have to say not impressed.", "rating": 2, "date": "11/17/2019"}, {"text": "Wow......our experience here was pretty dreadful.  Where do I begin?  Well, let&amp;#39;s start with a positive or two; the tex-mex eggrolls appetizer was really good.  My wife said that the Chicken and biscuits dinner was pretty good.  The Chicken Teriyaki I had was okay at best, pretty dry and not much in terms of teriyaki sauce.<br&gt;<br&gt;Now for the other side.....we had to wait a LONG time for our dinners.  How long?  A family of four on one side of us, who came in 20 minutes after us, had received their appetizer and entrees before us.  We were fine with the wait until we saw that.  The waitress gave a lot of attention to the two tables on either side of us, but we must have been on the &amp;#34;pay-no-mind list&amp;#34; (thanks to Joe Pesci for that one!).  The noise level was unacceptable and the music obnoxious.<br&gt;<br&gt;What bothered me most of all was that this was where my wife wanted to go for her birthday dinner and I feel like she was cheated out of what should have been a better experience.<br&gt;<br&gt;From what I&amp;#39;ve seen from other critical reviews here, the management will give some lame, insincere reply -- so please save that.  It will only make me physically ill.  Do me at least that favor.", "rating": 1, "date": "8/26/2018"}, {"text": "I&amp;#39;m only giving it 3 stars because you really have to know the menu to order something you enjoy. Don&amp;#39;t get me wrong, I come here pretty often. I came here for brunch just today in fact. I always order something I never had from the menu but I&amp;#39;m usually disappointed. It seems I have to stick with only what I already know. I&amp;#39;ve had so much on the menu too. My favorite entrees are the miso salmon and filet mignon. As for appetizers, I love the stuffed mushrooms, I like some of the egg rolls and a few of their salads. The cheesecakes are obviously DELICIOUS. My favorite is the original. I tried probably 15 different varieties by now. I personally think the burgers and fries are sub par. Nothing special. But like I mentioned, they have an extensive menu and I&amp;#39;m sure if you go here you&amp;#39;ll find something you like, it just might take a while.", "rating": 3, "date": "5/12/2019"}, {"text": "Absolutely terrible tonight! We arrived around 4:30 after doing some shopping. We waited about 10-15 minutes which isn&amp;#39;t bad for this place. It tends to get very crowded. We were sat just outside the main restaurant. When we being sat the table was still dirty from the previous guests. It was also very loud and very cold in that section.<br&gt;<br&gt;We ordered drinks and dinner at the same time. We waited a bit for the server to greet us. This was by far the worst service we&amp;#39;ve had in a long time. The girl didn&amp;#39;t tell us her name, she was very flat and unenthusiastic to say the least. Our daughter ordered an orange juice, literally took 25 minutes to get it. We had to ask twice, we were told it&amp;#39;s fresh squeezed so it takes a while. We had TJ ask for bread, didn&amp;#39;t receive lemons in water or tea (we did ask). Worst of all was the wait time for food. With no exaggeration it took an hour for our food. Tables that were sat after us were eating before us. I understand a restaurant can get busy and things happen. The main issue is the server made no attempt to inform us as to what was going on. She was honestly one of the worst servers we&amp;#39;ve ever had. She didn&amp;#39;t seem to care a bit.<br&gt;<br&gt;The manager did bring our food out personally and apologized. She then came over again after the meal and asked how everything was. The food was good but there is no reason for 2 entrees to take an hour. She offered us free dessert and we declined. She then took of one of our meals. It was a nice gesture but it was too late. We left very unhappy. Not sure if we will return. 1 star", "rating": 1, "date": "4/13/2017"}, {"text": "I had the Ahi Tuna Tartare. Fantastic. If it&amp;#39;s too crowded, grab a seat at the bar. Kristin is an awesome bar waitress.", "rating": 5, "date": "6/16/2019"}, {"text": "Have to say for the amount of money I paid for dinner tonight I&amp;#39;m beyond fed up, quality of food has seriously degraded here! I ordered the steak diane rare with mash potatoes, and was thoroughly disgusted with the meal. Steak was overcooked, dry, and like chewing on boot leather, the potatoes seriously nastier then the steak. They were so dry, crumbly, and cold like they were a few days old. I wish I was one of those people who complained and got  my money back,  but I didn&amp;#39;t I&amp;#39;ll just take my business elsewhere. My server Javier was definitely the only 5 star in that place!", "rating": 1, "date": "5/3/2019"}, {"text": "I honestly want to know WTF WAS OUR WAITRESS&amp;#39; PROBLEM?! <br&gt;<br&gt;Before I begin, I just want to say that I remember our waitress&amp;#39; name very well, but I have chosen to omit it from this post because she clearly has enough issues. <br&gt;<br&gt;My mom and I went to the Cheesecake Factory in Willow Grove. We&amp;#39;ve frequented this specific location many times and never had an issue. Our waitress wasn&amp;#39;t particularly friendly from the start, just lackluster. <br&gt;<br&gt;First, there was A HAIR in our appetizer. The manager came over, apologized, and brought us another appetizer to go. Our waitress did not apologize. Fine. Whatever. <br&gt;<br&gt;We got our entrees. I asked for bacon on my sandwich twice while ordering. Did I get bacon? No. Our waitress claimed she didn&amp;#39;t hear me. Fine. I told her it was ok, I just didn&amp;#39;t want to be charged for something I didn&amp;#39;t receive. <br&gt;<br&gt;During her down time, our waitress sat two tables away from us wrapping silverware in cloth napkins as we ate. I could clearly see her. I felt like she was glaring over at us with a pissy look on her face. Or maybe she had a severe case of RBF. ‍<br&gt;<br&gt;We weren&amp;#39;t even halfway done eating when our waitress SLAMMED our check on the table, said nothing and sprinted away. No &amp;#34;would you like anything else?&amp;#34; &amp;#34;Would you like dessert?&amp;#34; Not even &amp;#34;I&amp;#39;ll leave this here and take it when you&amp;#39;re ready.&amp;#34; Her actions said &amp;#34;pay and get out.&amp;#34; My mom and I were looking at each other like &amp;#34;did that just happen?&amp;#34; <br&gt;<br&gt;A few minutes later, she SNATCHED one of our empty bowls off the table. She yanked it with such force that she actually startled my mom.<br&gt;<br&gt;At this point, I lost my appetite and my mom lost her patience. We asked a different waiter to get the manager. The manager came over and my mom explained what happened. Suddenly our waitress appeared with one of our to-go orders and my mom, being an OG, flat out asked her IN FRONT OF HER MANAGER &amp;#34;why did you slam this check down?&amp;#34; Visually shocked and annoyed, she darted away in a huff. The manager said &amp;#34;that&amp;#39;s ok, I wanted her to walk away. You don&amp;#39;t have to have that conversation with her, I will.&amp;#34; And the manager finished waiting on us for the brief remainder of our time there. <br&gt;<br&gt;Also our waitress continued rolling silverware and peering pissily at us. <br&gt;<br&gt;Out of our appetizer, two entrees, two to-go entrees, and two cheesecakes, the only thing that was taken off our bill was the appetizer.<br&gt;<br&gt;I felt very uncomfortable and wanted to leave. I understand working for the public is difficult. There could have been some misunderstanding or something taken the wrong way. Or any number of things could have happened before she got to us or in her personal life, but you CAN NOT take your anger out on other people. She ruined an otherwise great evening.<br&gt;<br&gt;In any other instance this situation would have received 1 star, but I&amp;#39;ve been here so many times in the past and had great service that I couldn&amp;#39;t do it. I was actually apprehensive about posting this for the same reason, but it was such an unpleasant experience that I had to post it. The (hairless) food was still really good. And while this one waitress was a sour apple, she did not spoil the whole bunch. I&amp;#39;ll more than likely return, but I hope I never get her as a waitress again.", "rating": 3, "date": "3/3/2018"}, {"text": "Food quality has gone down, prices have gone up. Skip this place. Very noisy , tables crowded against each other.  You hear every word of the conversation of the table next to you.<br&gt;Not enjoyable. <br&gt;Just say no.", "rating": 1, "date": "6/11/2019"}, {"text": "Great experience yesterday! Delicious food and our waitress was on point. I reviewed this as a 4 because it was entirely to dark, patrons were using the phone flashlights to read things on the menu and check. Just brighten it up a tad more. Also, would you consider having a sampler cheesecake plate of the consumers choice? Would be great when wanting to try a few flavors.", "rating": 4, "date": "1/5/2020"}, {"text": "I tried the Cheesecake Factory one more time, same dish, Chicken Madeira, and it was worse than the first time. The dish is called Chicken Madeira for a reason. Because the mushrooms are sautéed with the Madeira wine sauce and poured over the chicken. NOT ONE TASTE OF MADEIRA SAUCE.  The mashed potatoes were so dry I couldn&amp;#39;t eat them. Another $25 down the drain. I&amp;#39;m so disappointed. I called the kitchen and spoke to the manager and he said &amp;#34;call DoorDash and tell them, we don&amp;#39;t deal with complaints. I was floored. I think I&amp;#39;m done.", "rating": 1, "date": "4/26/2018"}, {"text": "Food was a little blah this time. The section we sat in was extremely warm and the floor was really slippery.", "rating": 3, "date": "7/2/2019"}, {"text": "went here tonight and had the best waiter! i think his name was brandon and he was so pleasant and friendly. great food and cheesecake as usual!", "rating": 5, "date": "12/28/2019"}, {"text": "Excellent service. The food amazing. Management was very active. My plate took a little longer and when the waitress came the manager was as a back up that was not needed since I am not a drama lol. But overall 5 stars for my first visit at the place. Will come back !!!!", "rating": 5, "date": "3/31/2019"}, {"text": "Dined in Sunday night 2/10/19<br&gt;Seated around 7 PM and didn&amp;#39;t leave until 8:52 PM<br&gt;Server: Geraldine <br&gt;Manager: Bryan or Ryan (didn&amp;#39;t hear what he said clearly)<br&gt;<br&gt;*Skip to the last paragraph for the best part of this all*<br&gt;<br&gt;I want to start out by saying that I LOVE The Cheesecake Factory. This wasn&amp;#39;t our first time, so we know the drill here. I have also been a server for three different restaurants, so again, I know the drill. <br&gt;<br&gt;We waited about 35 mins to be seated, but that&amp;#39;s expected here. Once we were seated, our server, Geraldine, came to say she&amp;#39;ll be right back. 20 minutes later she finally came back, didn&amp;#39;t introduce herself and then took our order. We got 3 apps, the first came after 20 minutes. 15 minutes later we were still waiting for our two other apps. They finally came and we&amp;#39;re good. We finished our apps around 8 (at this point I was paying close attention to the time. <br&gt;<br&gt;8:30 our food finally comes. My cheese was crusty on the burger, the onions were shriveled and there were two random sauces on the burger. There should have only been one sauce. I ordered sweet potato fries and got regular, AND they were cold. We sat for about 10 minutes waiting for Geraldine to come check on us. Meanwhile my boyfriends burger was getting cold. By the way, his was missing sauce and he didn&amp;#39;t get a sauce on the side he asked for. She finally came and I asked for the manager. He came, and handled the situation really well. Although I wish I could say he saved the night, after 2 hours there, our night was disappointing. His name was Bryan or Ryan (not 100% sure what he said). So he brings us the check and we wait for Geraldine to come grab it. Once again we were waiting for 10 minutes and finally just got up to YET AGAIN find the manager to complete our payment. We could have just not paid and left. It didn&amp;#39;t seem like Geraldine would have even known.<br&gt;<br&gt;I want to add that both tables surrounding us had a problem with their service as well. Table to our left hadn&amp;#39;t gotten drinks for a good 30 minutes and the table to the right didn&amp;#39;t get their cheesecakes for at least 35 minutes. I don&amp;#39;t know if Geraldine was having a bad night or what, but I wasn&amp;#39;t paying $100.00+ for this kind of service. I really got the impression that she was newer and was getting flustered and overwhelmed. Although it was 7:30 on a Sunday.. <br&gt;<br&gt;All in all, service was terrible and it seemed the kitchen was off too with all the odd sauces or lack thereof I should say. I would definitely prefer to go to the KOP location next time.<br&gt;<br&gt;After we finished our first appetizer, we wanted to make room on the table for the next two apps. When Geraldine came to drop off the two plates I asked her if she could take the empty plate (which was sitting there. Ever heard of pre-bussing?) from the first appetizer to make room. She took the tray and started walking away, then turned around and I kid you not she said to my boyfriend &amp;#34;Wait actually can you hold this while I get something for them?&amp;#34;. I promise you she handed the plate BACK to my boyfriend and she walked to another table to give them &amp;#34;something&amp;#34;. The kicker? SHE NEVER CAME BACK FOR THAT PLATE! My boyfriend sat there holding the plate and just looked at me in shock. I was also speechless. I still am!", "rating": 1, "date": "2/10/2019"}, {"text": "Zero stars. If I could give this zero stars I would. First time here at this location and it will be our last! We arrived around 10:30am today (Sunday). They opened at 10. There were people dining. My husband and l got seated in a section that was outside in the mall. Separated from the mall by fake plants. (We were the only people sitting in this area). We waited for 10 minutes and no one came to our table. Other people/groups were getting seated inside after us, were waited on etc and we were never acknowledged. The people dining at your restaurant should never have to get up and find a server. Unacceptable. We got up and left.", "rating": 1, "date": "2/10/2019"}, {"text": "ATTN WILLOW GROVE CHEESECAKE MGMT:<br&gt;<br&gt;Take Marisa F.&amp;#39;s recent review with several grains of salt. She has a history of credibility issues regarding her reviews. The prevalence of one-star evaluations in her profile greatly attests to that.<br&gt;<br&gt;If you don&amp;#39;t believe me, check out her review of Isaac Newton&amp;#39;s in Newtown. She was called out--and rightly so--for basing her review on false information.<br&gt;<br&gt;Also, to Marisa herself:  You do realize, that a lemon garlic or white wine sauce can ALSO be a cream sauce? Yes?<br&gt;<br&gt;I&amp;#39;ve been following this development since early January. My findings are iron-clad. <br&gt;<br&gt;Yours,<br&gt;<br&gt;Det. Mitch Cumstein", "rating": 5, "date": "3/17/2018"}, {"text": "Why do I get sick every time I eat here?<br&gt;They are putting something extra in the food.<br&gt;I went last weekend and sat at the Bar and had the Jamacain Jumbolia or whatever its called.  <br&gt;<br&gt;I wonder if i&amp;#39;m the only one getting sick because this place stays packed.<br&gt;I was lucky to find bar seats.  The entire time people were standing behind us like it was a fkn club.  This is the last time i go to CCF.", "rating": 1, "date": "3/9/2018"}, {"text": "This dinner was spectacular, Ian C was such a great server. He helped me and my husband out a lot when it came to what meal we should get. He suggested the truffle fried chicken, It was so delicious. Definitely going there next time and Ian is our guy", "rating": 5, "date": "5/28/2019"}, {"text": "Went to Cheesecake Factory for a Saturday Birthday brunch in February. Ordered cheese quesadilla which came with brown guacamole. Notified the manager and Cheesecake Factory customers service on Facebook messenger and no one did anything. <br&gt;<br&gt;All I got was an excuse staying that guacamole oxidized. Mind you the meal was served at 11:30ish in the AM. The general manager of the store said &amp;#34;sorry&amp;#34; on the phone and stayed silent for the rest of the time.<br&gt;<br&gt;I have been a customer for years and the way the willow grove location treated this situation is unacceptable. I gave them a chance to make this right and no one made an effort. Should of posted this the same day. <br&gt;<br&gt;If you want a good fresh meal Cheesecake Factory in willow grove is not the place for that.", "rating": 1, "date": "3/13/2018"}, {"text": "Love this place. Always crowded. Salads and chicken parm are top choices. For being a chain spot. Prices are a bit high. It is not fancy but it very nice.", "rating": 4, "date": "3/2/2019"}, {"text": "So came to the Philly location a few weeks back. found hair fried into the calamari. The rice in my food and my friends food was old and or undercooked. Was sick for two days and they send me 50$? How about you try and pay for the whole meal not a portion? Cheap asses...  No respect for the food they serve their customers...", "rating": 1, "date": "1/8/2018"}, {"text": "Cheese cake was really good! They have a wide variety of options and they have a skinny licious menu as well. I love the buffalo blasts and almost any dessert! I would definitely recommend it to a friend.", "rating": 4, "date": "1/8/2018"}, {"text": "The food was decent, however we had 6 people at our table each of us received our food separately. Not a minute or two more like 4-5 minutes apart. The portions don&amp;#39;t really match their prices. The curry platter was unusually sweet.", "rating": 3, "date": "7/6/2018"}, {"text": "Time and time again, I have come out to this Cheesecake Factory. I have also been to the one in center city, but the service and food here is unbeatable. I have never once had bad service nor received anything less than great food. My favorite dish is the Louisiana chicken pasta. Next to that would be the chicken lettuce wraps. Any chocolate cheesecake does well for dessert, but my favorite is the Godiva chocolate cheesecake. The price is a bit high, but portions are large, so it is worth the price you pay. I never tried the drinks, but may do so in the future.", "rating": 5, "date": "1/2/2019"}, {"text": "Not bad<br&gt;<br&gt;I took my wife out early to beat the mother&amp;#39;s day rush next weekend. Well we didn&amp;#39;t know what to expect as far as their menu since we only have been getting over the years cheesecake from this place. <br&gt;<br&gt;Anyway we had a great server named Rachael. She was attentive, helpful, and had a great attitude. <br&gt;<br&gt;I ordered the lemon-herb roasted chicken and it was delicious, moist, flavorful and the carrots that came with it were good. The mashed potatoes was the only let down for me. They were dry and crumbly which was a disappointment to be honest. <br&gt;<br&gt;My wife ordered the Thai-coconut lime chicken and she loved it and had enough for later on at home. <br&gt;<br&gt;All in all a great experience and we are looking forward to coming back.", "rating": 4, "date": "5/4/2019"}, {"text": "This Cheesecake Factory in specific is my go-to whenever I have no idea what I want to eat because this place has everything! It has yet to fail me. <br&gt;<br&gt;My favorite is the Cajun Jambalaya Pasta. Amazing! The portions are huge, but I still finish it. I usually don&amp;#39;t have room for cheesecake, but... I get it anyways. There&amp;#39;s always room for dessert because dessert doesn&amp;#39;t go to the stomach, it goes to the heart.", "rating": 5, "date": "9/10/2016"}, {"text": "The Cheesecake Factory has always been a great family restaurant and I haven&amp;#39;t really ever had a bad experience at this chain. So most Cheesecake Factory restaurants all have pretty much the same decor and the menu is pretty standard. So my wife and I decided to come in this past weekend and as usual the service and food was excellent. We ended up ordering off the skinny menu for my wife and I are both trying to watch what we eat and ended up getting the filet steak and the chicken pasta which were both great and shared the artichoke crab dip which I must say was good but a lot smaller than I remembered. Anyhow we also ended up getting the Godiva chocolate brownie sundae which was great as well. Overall this location is usually packed, however it&amp;#39;s service and food is the classic Cheesecake Factory signature service and quality. I had no complaints and look forward to coming back.", "rating": 4, "date": "9/26/2017"}, {"text": "Came in Sunday around 3:15, seated by 3:39. Lemon water didn&amp;#39;t have lemon. Water glasses could use some detailed cleaning. Milk cup for my coffee wasn&amp;#39;t washed out of some caramel that was in there before. Food came out within reasonable time, food was okay. The menu has plenty meals to choose from. Hibachi steak ordered medium rare was cooked to order. Overall the experience was okay but not the best.", "rating": 3, "date": "4/15/2018"}, {"text": "My family I went to the Willow Grove location for brunch and arrived a little after opening. We had a vety attentive waiter, Lexi (I believe her full name on the receipt was Alexis).<br&gt;<br&gt;Lexi was very attentive and accommodating to my mother who&amp;#39;s English isn&amp;#39;t that great and can want things last minute. She was always at our table with a smile on her face.<br&gt;<br&gt;The food was great. I ordered the Macaroni and Cheese burger. My mom ordered the Steak Diane, and my brother ordered the fish tacos.<br&gt;<br&gt;We always underestimate the portion size of the food. You will never leave this place hungry even if you just order a regular entrée.<br&gt;<br&gt;We had a wonderful time and Lexi definitely made it special.", "rating": 5, "date": "3/19/2017"}, {"text": "The decor is fun, the place is large (and loud), and the food is decent for a chain restaurant. I do not like how they pack you in like sardines at the 2 and 4 top tables. The menu is huge and somewhat overwhelming. There is a separate &amp;#34;skinnylicious&amp;#34; menu if you are looking for the healthier options. <br&gt;<br&gt;There are some fabulous looking salads and, of course, an insane dessert selection, but I opted for the grilled fish tacos this time. The corn tortillas were nicely grilled and filled with slaw, grilled fish, pico de gallo and fresh avocado. The dish was accompanied by lime cilantro rice and black beans. The rice and beans were both tasty, but the rice was a bit greasy.<br&gt;<br&gt;My daughter got a chicken Caesar salad and shrimp scampi minus tomatoes. The salad was good. The dressing is garlicky but not bad for bottled Caesar. The shrimp in the scampi dish was breaded and the sauce creamy, which are atypical of traditional scampi. It was also very garlicky. Portions are huge!!<br&gt;<br&gt;I liked that the server asked if there were any food allergies (apparently they change gloves if so). I also enjoyed watching the screen with all the photos of the dishes, so I could narrow it down for next time :)", "rating": 3, "date": "7/22/2016"}, {"text": "Worst experiences I&amp;#39;ve ever had at a cheesecake factory. I was with my husband and my one year-old son and it took over an hour and a half for me to get my entrée. My husband and my son had to leave because he&amp;#39;s one and can&amp;#39;t sit through an hour and a half dinner. This was in between the The lunch and dinner hours so it should not of been that busy. In addition to that my appetizer which was a beat and go cheese salad was very small and the arugula was completely wilted and in edible. I ended up having to get my entrée to go and was not even offered to be compensated for the long wait. I am not going back to this cheesecake factory anytime soon.", "rating": 1, "date": "11/11/2018"}, {"text": "TCF is usually my favorite chain restaurant. But my recent experience at TCF Willow Grove was a bit...lacking. The wait wasn&amp;#39;t as bad as I was expecting. I think their whole refusal to take reservations is a bit ridiculous, mostly because it really inhibits the ability to plan a nice evening out. Anyway, it was a bit dirty inside. We had to request the table to be wiped down. There was an odd stale smell in the air too. <br&gt;<br&gt;Usually the bread just comes, but we were asked if we wanted it - which I thought was odd. I&amp;#39;m used to it just being there. We order a couple of appetizers and our meals. Then I ordered an apple cider. I got an apple juice and i was like hey I wanted a cider and our waiter was like ok that&amp;#39;s what we call our apple juice. Nice try. Is this my first time ordering an apple cider? Am I an 8 year old?<br&gt;<br&gt;We eat the rest of the meal. It was delicious. The kitchen never disappoints. My MIL (who has quite discerning taste) was impressed. <br&gt;<br&gt;Then the bill came and the apple juice was on it. Note it was called &amp;#34;juice&amp;#34; on the bill not &amp;#34;cider&amp;#34;. Oh and speaking of the bill, they put misleading tip percentages on the bill. They are supposed to base the tip on the pre-tax amount, but they base it on the post tax amount. Shady. They took off the juice and claimed it was an accident that it was still on it in the first place. Shady. I had the celebration cheesecake. I wouldn&amp;#39;t get it again. Should have went with the 30th anniversary one instead. Oh and they need to bring back the Navajo and the apple pie cheescake.", "rating": 2, "date": "9/18/2017"}, {"text": "When you first come in, the atmosphere is great. Nice and vibrant. However, when I sat down I learned never to judge a book by its cover.<br&gt;<br&gt;I ordered the factory burger, and had to wait a decent amount of time to get it. When it arrived, I was disappointed.<br&gt;<br&gt;I ordered it medium rare, and it was like a piece of charcoal, look and taste-wise. Overcooked and no flavor whatsoever. The fries were DELICIOUS though so that&amp;#39;s why I&amp;#39;m giving it 2 stars.", "rating": 2, "date": "11/23/2018"}, {"text": "For once I hear report that these are professional people with excellent customer service friendly atmosphere and very very good steak and potatoes and nothing mention the cheesecake ohmygod it&amp;#39;s actually went the waiters are very very nice and friendly people persons and this is an excellent model as to what to be like a restaurant because I&amp;#39;ve had share had nightmares and others very clean restaurant service is fast and friendly", "rating": 5, "date": "10/4/2019"}, {"text": "Besides the 40 min wait to be seated the food was good I was stuffed , I went with the Steak tips , Shrimp scampi the bill came to but $100 bucks I also had 2 drinks with 2kids meal and another adult meal , not bad !!", "rating": 5, "date": "1/27/2018"}, {"text": "Always great service and extensive menu. Menu is labeled if an item has gluten in it. I love their Cobb salad! Very accommodating of my gluten allergy but they do not have gluten free bread but serve regular bread on the table before food comes - this has happened to me about 3 times now. This is frustrating for someone who has a gluten allergy!", "rating": 3, "date": "11/24/2017"}, {"text": "The food is always pretty good, and I especially like the bread that they give you. Today, my chicken maidera was awesome.  My waitress was also really nice, but It did take her quite a long time to take our orders, bring our drinks out, bring bread out, bring the check, etc. I feel like they need more waitstaff there because there always seems to be hold ups. Other than that, the food and ambiance is good.", "rating": 3, "date": "9/1/2019"}, {"text": "This is my &amp;#34;pre-review&amp;#34; before I go for dinner tonight to treat my friend for her birthday.   The recent reviews here concern me, and what seems worse is the somewhat nonchalant canned reply from management &amp;#34;we&amp;#39;re sorry and hope you will give us another chance&amp;#34;, when the response should be to contact the manager directly to get a better resolution.  Some of these experiences and pictures of the food posted, as well as descriptions of poor treatment that were specific enough to believe, have me worried about my visit.   <br&gt;<br&gt;In anticipation of a good meal tonight, I have put five stars and plan to come back and update my review after our dinner tonight.   Five stars is because that&amp;#39;s been my experience previously.  We come to this location a couple times a year when we meet for dinner, and we have loved the food and have had great service.  We get there early on a weeknight (5:30), and it&amp;#39;s not overly crowded, and everything has always been great.  The chicken maderia that we usually split is our favorite and is absolutely amazing.  We have not experienced overdone, underdone, rude behavior, or long waits for food or our check.   <br&gt;<br&gt;I sure hope that things haven&amp;#39;t changed since I was there a few months ago.   The reviews I am reading are very detrimental and worrisome.  I don&amp;#39;t run to Yelp and write a bad review over one small disappointment, but the bad reviews here certainly seem to have some merit.   My optimistic switch is &amp;#34;on&amp;#34;, and I look forward to treating my friend to a lovely, stress-free birthday dinner tonight.   Cheesecake Factory, I have faith in you.....don&amp;#39;t make me come back and change my review!!!", "rating": 5, "date": "2/28/2019"}, {"text": "Love the happy hour menu.  The pork belly sliders and southern fried chicken sliders are one of the best. The server Joe was very pleasant and very helpful.", "rating": 4, "date": "7/1/2018"}, {"text": "Before we left I decided to buy some cheesecake slices to bring home for my family. I had decided that I wanted the Fresh Strawberry Cheesecake and the Godiva Chocolate Cheesecake. I checked the pricing for them on the price board before I got to the register and it was : $7.50 for the Strawberry and $8.50 for the Godiva. I added it up and totaled it to be $16, so I took out $17 thinking it would be more than enough. I was waiting for quite a bit but didn&amp;#39;t really mind because there was a group before me being served. However, when the WHITE lady was done helping the group she walked to the register and said &amp;#34;what do you want?&amp;#34; No smile, no hello, no friendly voice. I responded very politely and friendly asking for those two flavors. She said &amp;#34;your total is $18.50.&amp;#34; So I had to pull two more dollars out thinking how was it this much for two pieces of cheesecake... fast forward I&amp;#39;m waiting and then FINALLY she just hands me my order and says &amp;#34;here you go.&amp;#34; At this point I was like wow I get overcharged for two cheesecakes and crappy service. ALSO I did NOT get a receipt from her so I&amp;#39;m still trying to figure out how it costed that much!!! After having such a good dinner service, I did not expect to leave this unhappy.", "rating": 1, "date": "1/5/2019"}, {"text": "The cheesecake is good, but everything else tastes so processed. I&amp;#39;m not into chains in general, but this used to be an exception. No longer, even the salad tasted chemical/processed. I will still get my daughter a piece of cheesecake for her birthday once a year, but we are done with it otherwise.", "rating": 2, "date": "6/23/2018"}, {"text": "I love how there are so many options to choose from! The menu offers such a variety of dishes! I personally love the Thai lettuce wraps, fried macaroni balls and of course the desserts!", "rating": 4, "date": "4/9/2018"}, {"text": "CF is always the same to me. There has never been a time that I went and disliked anything. The ambiance is always nice and the smell is pleasant.<br&gt;<br&gt;I ordered the Jamaican black pepper shrimp. I at every single bit the flavor was amazing. I did not like the black beans so much but the shrimp,chicken and that tasty mango salsa  all disappeared lol. <br&gt;<br&gt;The Georgia peach is my favorite drink there. It&amp;#39;s a pretty fruity frozen drink. Very tasty if I must say so myself. <br&gt;<br&gt;I&amp;#39;ve been to the Cheesecake Factory on many occasions and I think I&amp;#39;ve actually had a cheesecake twice. They are good and really big. Two people could share one. There are so many to choose from. <br&gt;<br&gt;Takeaways: the wait for a table is always super long. The bar area is open seating but it is usually always full but you can order the full menu there. The menu is way to long. It such a large variety of food and the menu is about 10 pages it sometimes takes me a while to order. <br&gt;<br&gt;In my opinion the wait is worth it and the large menu gives you different things to try each time. So check it out.", "rating": 4, "date": "11/28/2015"}, {"text": "I came here with family. We all ordered from the regular menu. The portions are huge. The food was fresh and did not take that long. The server was very nice. The music was kind of loud but I guess that may be because it is not that crowded. My sandwich was okay but may have been a little better if the shrimp were not slightly over cooked. I also got the banana cream cheese cake. It was very good and not overly sweet.", "rating": 4, "date": "7/2/2016"}, {"text": "Ordered the Louisiana Chicken Pasta, which is what I usually get. It is a little spicy but this time it was so spicy I had to send it back. I then ordered the Margherita Pizza and this came out way overdone. Luckily they did not charge us for either. Poor service and quality of food.", "rating": 1, "date": "10/3/2017"}, {"text": "Terrible service I came here for my 27th birthday and multiple  parties were sat before us. Not to mention the host at the front was very rude and had a complete  attitude.  Sad thing was this was on a Wednesday. Very disappointed because I like the cheesecake  factory in general", "rating": 1, "date": "8/22/2018"}, {"text": "EDIT: took a star off after our last experience. Saturday is understandingly busy but tonight was outrageous. The people who run this location need more training. My date and I were escorted to a table that was already full of people and we just stood there like deer in headlights.. went back to the hostess desk and no one knew what was going on or what table was actually clear or not. Eventually they found a table for us. But that&amp;#39;s where hell began. Why would anyone seat a quiet couple shoved in a corner next to the most obnoxious group of college freshmen laughing screaming the entire time...  <br&gt;can&amp;#39;t speak for the food because I packed it to go to finish it at home in peace and quiet. And then lost my appetite all together... awful experience. No apology from the server. <br&gt;<br&gt;I have &amp;#34;Duchess&amp;#34; status at this particular location so I&amp;#39;ve been here MANY times and for the most part the food is excellent. Tonight&amp;#39;s experience This time we were seated in the area outside the restaurant, and I don&amp;#39;t mean the outdoor seating. But the tables that line the entrance to the mall. Yes, we were seated by the mall doors. To say this was insulting does not even begin to describe it. If I wanted to sit in a food court while listen to screaming children and other people running out of the mall shaking the ground I would have went there to eat. Instead I came to the Cheesecake Factory on a Saturday night for a restaurant experience. There is no music in this section, and the servers even seem to forget there are people that need to be waited on out here.", "rating": 2, "date": "4/15/2017"}, {"text": "BEWARE, do not pay with a credit card at this restaurant. Twice now I did not get my credit card back. The last time I told the waitress I didn&amp;#39;t get it back. She swore she gave it to me. So I emptied the contents of my wallet and pockets numerous times while my family members searched under the table. The waitress came back with it and told me the manager had it. Next day my phone goes crazy with credit alerts. I called the credit company and found that my address was changed. There was a $500 purchase at Nordstrom and a $1,500 laptop purchased. I called Cheesecake Factory and was told all the managers were in a meeting and could not talk. I left my number but no one called back. I then went on the Cheescake website and went through the &amp;#39;contact us&amp;#39; link. I left a detailed description of my experience and never received a reply. So now I warn everyone about this place. Shame because this was a regular go-to place for us. Not anymore!", "rating": 1, "date": "4/21/2019"}, {"text": "The service is subpar, and equally the food. I have visited numerous times and each time the experience has been substandard (not insane, just have been invited for gatherings). The waiters are not equally attentive and the food is overcooked with little flavor. The prices aren&amp;#39;t justified considering quality of food. I will staunchly avoid going to this restaurant and will not suggest others to dine here. Not only had I had bad experiences but others had grievances as well.", "rating": 1, "date": "4/9/2016"}, {"text": "Food is great. They&amp;#39;re usually really busy so service can be a little slow, but the staff is always friendly. I had the romano crusted chicken for dinner and it was amazing. My bf had the orange chicken and he loved it. Our servings were huge so we ended up taking our meals home. Our apps, fried mac and cheese balls and fried mozzarella were delicious. Of course we each got a slice of cheesecake. I had the chocolate tuxedo cheesecake and my bf had the lemon raspberry cheesecake. Both were so good. Prices can be a little high but it&amp;#39;s worth it.", "rating": 4, "date": "8/13/2017"}, {"text": "Really bad. After being seated quickly at an outside table some 15 minutes passed to be noticed and have a waiter assigned. Once we ordered it was nearly an hour before, and after being assured by the polite waiter that our entrees were in production. We  then complained to a passing manager.  The manager returned to report nacho chips were the hold up. He then disagreed that our wait was extraordinarily long. Then three of four items arrived, the chips were down and came even later. Sadly, the entrees wilted under a heat lamp and arrived tired.<br&gt;<br&gt;$ 86,00 later the manager ducked away from me in the restroom. We voiced our complaint with both the waiter and manager. As we were preparing to leave the same waiter was apologizing to another table of customers for the long wait.  We did enjoy watching the sunset over the bread we requested twice.  A really bad night at the Willow Grove Cheesecake Factory. Two hours and forty minutes peppered by rude treatment from the managing staff.  Not the Redondo Beach Cheesecake Factory by any means.<br&gt;<br&gt;I too am in customer service. The manager had an opportunity to address such poor service when he responded to my complaint. His response was to disagree and let us know the kitchen was out of chips. He had a second opportunity when I was leaving, rather slowly using a walker. He had a third chance when my daughter returned to retrieve her lost purse. It&amp;#39;s nice you will talk to staff, you had a chance to talk to our table of four. Your manager needs retraining and using my didactic review is a bargain for you.  <br&gt;<br&gt;I see lots of guest services replies on YELP, I also see lots of disappointed customers.", "rating": 1, "date": "6/26/2018"}, {"text": "Food was good, the rest was not. We were seated at a very dirty table. We asked to be moved. Service was slow. Our food arrived at different times. Our server was nice but clueless. They sat another family at the first, dirty table we were seated at without cleaning. We looked for management so we could bring this to someone&amp;#39;s attention, but none could be found. We will not be returning.", "rating": 2, "date": "7/13/2019"}, {"text": "I&amp;#39;m not one to generally write a review of my experiences and will over look many discomforts and poor service.  However my experience at the Willow Grove, Pa location can not go unmentioned.  The manager on duty was by far the most disrespectful individual I&amp;#39;ve ever met.  My family and I decided to have an evening out together and visited this location.  During our meal a storm developed and the roof leaked right on top of our table and the table behind us.  After reporting this the manager made every attempt to avoid making any contact with us and gave the impression of so what.  Water dripping on our food and bodies and ruin a family night out.  Date of incident 7/11/19.  This manager needs sensitivity training.  Willing to provide it.", "rating": 1, "date": "7/12/2019"}, {"text": "I recently went to the Cheesecake Factory yesterday night for take out. I wasn&amp;#39;t sure what I wanted but the person taking my order named Carmela was so patient and sweet. I asked what her favorites were, which she suggested a few dishes. I know it can be a pain handling a customer who doesn&amp;#39;t know what they want but she made my short experience very enjoyable. Thank you Carmela!", "rating": 5, "date": "7/7/2019"}, {"text": "Ordered through Door Dash and had my food delivered. The door dash driver was great and on time. The take out food from Cheesecake Factory sucked. I have eaten many times in the restaurant without complaint. Ordered the Thai Lettuce Wraps and there was barley any chicken and it was packaged poorly. The margarita flat bread pizza was just awful. Looked and tasted like it was thrown in a microwave. Also got a coke and dr. pepper.  Must have been poured an hour ago it was watered down. Not happy.", "rating": 1, "date": "7/6/2019"}, {"text": "Go to another location . I had a bug in my cheesecake and when I called to complain the Manager Lakeisha I think she said her  name was had a cavalier attitude about it <br&gt;<br&gt;Update... 1/12/18 (late update) <br&gt;1. I did get in contact with a representative from corporate after they read my review He was very helpful and even compensated me for my trouble  with a $25 gift card I was able to get into more detail about my experience . I hope the manager has since received more training  or has found a new job that is not in the hospitality/customer service field", "rating": 1, "date": "1/12/2018"}, {"text": "Wow. This place sure knows how to disappoint. The food is so bland. My boyfriend and I ordered 2 apps, 1 entree each, a root beer, and a mai tai. <br&gt;<br&gt;The apps were decent, I guess. We got the calamari and the portabella mushroom, avocado and zucchini fries. Both were breaded in the same fashion and both of them has a rather smoky (not in a good way but like they re-used the oil a few times too many) flavor. <br&gt;<br&gt;My boyfriend got a kobe burger and it was big but bland. No flavor. He asked for a medium rare and it came out rare. He would&amp;#39;ve ordered a steak if he wanted rare. The fries were also terrible. How do you mess up on french fries? I got a dish that is supposedly &amp;#34;shepherd&amp;#39;s pie&amp;#34; but it was definitely not. It was just patty meat chopped up in gravy with mash on top. Disappointing. <br&gt;<br&gt;The only reason why I even gave a star was because the waitress was so sweet. But I came here for food not to make a friend. <br&gt;<br&gt;I will not be coming back unless if I&amp;#39;m there to pick up some dessert. You&amp;#39;ll probably find me at the food court because at least I know what I&amp;#39;m getting and that it&amp;#39;ll actually have some flavor.", "rating": 1, "date": "2/23/2015"}, {"text": "Service was horrible, we came in at 5:29 and was not greeted by our server Kaleena until 5:45. Everything took forever to come out, EVEN WATER! She was not attentive to the point the ice melted in our cups. She&amp;#39;s at a five top next to us just talking and walks past us and and a 2 top that was just sat. Spoke to the manager and he never offered anything to console us, he just said okay! We come here often and this is by far the worst experience and has changed my view on the restaurant", "rating": 1, "date": "6/6/2018"}, {"text": "Unfortunately  upon arrival we sat for quite a while. Many servers passed us and looked at us but no one stopped to ask if we were being helped. Finally we had to stop someone and ask for our server.  When he came over he stated that no one told him we were there, which I don&amp;#39;t doubt,  and he was VERY apologetic. We were very disappointed because we were there to celebrate my daughter&amp;#39;s graduation and family came from across town to join us.", "rating": 3, "date": "6/19/2018"}, {"text": "The wait is long. The staff hardly pays attention to their tables. And make sure you get your credit card back and you d ok not have additional charges the days after your visit.", "rating": 1, "date": "6/20/2019"}, {"text": "This place keep getting trashier. I took my dad out for dinner the server was extremely rude he did not even give his name and the food was complete trash we ordered avocado egg roll it never tastes as shitty as we got. Cold. Oily. Bugs were flying on it. So disgusting. the mushroom soup we ordered it was also cold and salty and as well as the filet mignon my dad couldn&amp;#39;t eat his food and as soon as we get home he threw up everything he ate. <br&gt; just to get the table was like 45 minutes and it wasn&amp;#39;t even that crowded and another hour to get the filet mignon.. this place wasn&amp;#39;t like this before. I will never go back to that place again it&amp;#39;s complete trash !", "rating": 1, "date": "3/23/2018"}, {"text": "Usually I love the Cheesecake Factory but today the service was awful and unhelpful. I ordered the wrong cheesecake to go and asked if I could exchange it because I can&amp;#39;t eat the slice I received and the lady told me I couldn&amp;#39;t because they were different prices, but the prices on the sign were the same and I even pointed that out but still would not help me. Very unhappy.", "rating": 1, "date": "6/10/2019"}, {"text": "Went for a quick early dinner with my husband and our son. Waitress was nice and attentive. Space was very clean and well kept. We ordered drinks.. my husbands orange crush was delicious.. my blood orange frozen margarita was more like an orange slushy.. a waste if $13.00. Our buffalo blast app were delicious and very filling despite a few burnt pieces which we were given a piece a cheesecake for the trouble.. once our entrees came we were stuff but I took a couple bites of my crispy pineapple chicken and shrimp. It was great, and the same price as my drink .  Very huge portion!. My husband 4 cheese pasta was pretty mediocre but edible. Overall, our food was cooked properly and we were treated well!", "rating": 4, "date": "2/28/2017"}, {"text": "This place rarely disappoints. They have a huge menu that varies from Chinese to Thai to Italian to American cuisine. Everything under one roof. You pretty much can point to anything on their menu and it will come out very delicious.<br&gt;Highly recommend; (apps) Avocado Eggrolls, Thai Chicken lettuce wraps, Ceasar Salad, BBQ Chicken Ranch Salad. For main dish, can&amp;#39;t go wrong with; Chicken Madeira, Orange Chicken, Chicken Marsala and Hibachi Steak (one of my favs).<br&gt;<br&gt;Their portion size is a bit intimidating, we always end up having leftovers the next day. <br&gt;<br&gt;Only one tip, definitely come here before the dinner crowd or you&amp;#39;&amp;#39;l be waiting from 45 minutes to over an hour for a table. And save room for dessert, they have some amazing assortments of cheesecakes.", "rating": 4, "date": "2/12/2015"}, {"text": "The food is amazing. The biggest menu I&amp;#39;ve ever seen. My only complaint is that it&amp;#39;s soooooo crowded here. You feel like you&amp;#39;re sitting next to the person at the other table because you are. That&amp;#39;s not a reflection on the staff or the restaurant because I will come here for my wedding and baby shower and marriage and funeral. This place is great.", "rating": 4, "date": "3/25/2018"}, {"text": "Extremely unimpressed with who ever created the menu. Every single pasta or meat dish that said &amp;#34;white wine&amp;#34; or &amp;#34;lemon garlic&amp;#34; sauce actually had cream/dairy in it. That&amp;#39;s not white wine or lemon garlic guys!!! That&amp;#39;s a CREAM SAUCE!!! Kitchen would not even cater to my dairy allergy. If something had dairy in it the server would just come back and say sorry And thaneeded to pick something else. <br&gt;I prefer to go someplace that does not have their food pre-made for god knows how long, and don&amp;#39;t even care for people with allergies. <br&gt;<br&gt;Update: They ask for you to contact them about your experience, then ignore you for almost two weeks!! <br&gt;Such a shame I USED TO like it, now this has taken the cake. Never again will I go there.", "rating": 1, "date": "3/25/2018"}, {"text": "I dont know how this place is always packed even on weekdays because every time I visit here, everything is below avg. This time we were there 8pm on Tuesday but still had to wait 30minutes. We finally got seated and server came after about 5 minutes. She gave us pre meal bread and took our drink order. After two minute or so, she came back with no drinks asking if we were ready to order. We were ready since we waited for so long. She took the order, didn&amp;#39;t repeat back which caused her to make mistake. She forgot one of our two appetizer and when we asked her, she said &amp;#34;oh i checked and it wasn&amp;#39;t in. I don&amp;#39;t know if i didn&amp;#39;t hear you say it or if you forgot to say it. Sorry. You guys want it now?&amp;#34;  It sounded like she was blaming us for not ordering it and we weren&amp;#39;t unhappy because the food already took long time to come out and wasn&amp;#39;t tasty. <br&gt;I don&amp;#39;t know why I keep go back to this place when I can get better pasta and service at other places.", "rating": 2, "date": "8/18/2016"}, {"text": "I like the Cheesecake Factory because it has a selection of main courses and desserts.", "rating": 5, "date": "9/30/2017"}, {"text": "One of my favorite chain restaurants , I had great food and good service .I ordered Creole shrimp and andouile sausage . It was good nice alternative cause I always get jambalaya and it&amp;#39;s alot less calories 600 . Only complaint I have is the waitress didn&amp;#39;t ask how my food was so I gave her 15%tip instead of 20%.", "rating": 5, "date": "3/2/2019"}, {"text": "I like the Cheesecake Factory - large menu, big space, and pretty big portions. Growing up, I used to think it was the best restaurant ever.  2 hour wait? Sure ill stand by.<br&gt;<br&gt;But those times have changed.  The above are all still true, but man, it is pricey.  Now that I&amp;#39;ve gone out and tasted the world, I recognized that the Cheesecake Factory is a chain restaurant that is trying to charge fine dining prices.  $13 for a burrito?? No thanks. <br&gt;<br&gt;I still thoroughly enjoy their Cobb salad, my go to entree.  Portion is huge and the dispersement of dressing is perfect.  Their lunch specials are a pretty good deal as well and a decent size.  <br&gt;<br&gt;My wife got a vegetable pasta for $15 and wow. It&amp;#39;s literally just thin spaghetti, creamy garlic sauce, and a few vegetables.  Pretty overpriced.  She ordered it without Parmesan, but it was brought out with it.  She already took a bite. Waitress said she&amp;#39;ll have another sent out and we kept the cheesy one.  We ultimately were charged for both, but it doesn&amp;#39;t matter - we did eat them both (shared amongst table).<br&gt;<br&gt;As for appetizers, the avocado eggs rolls are a must -  I have never seen this anywhere else.  6 halves for $12 is a bit steep, but worth it.<br&gt;<br&gt;The wait staff was extremely friendly and attentive.  Came back numerous times to check on the table.  So that is definitely a plus.<br&gt;<br&gt;I go here regularly because I really do enjoy the salad, staff and convenience.  But forget about a Friday/Saturday night - the wait can be long.  I&amp;#39;d recommend this place for casual or even group dining, which is the only time I really go.  Decent food, but not spectacular. If looking for an authentic and romantic atmosphere, seek else wh", "rating": 3, "date": "9/23/2014"}, {"text": "Excellent entree options and even better desserts. The only downside is extensive wait times. Almost always a minimum of a 30 minute wait for a table. Prices are also a little on the high side. All worth it though.", "rating": 4, "date": "7/4/2018"}, {"text": "This was my first visit to a Cheesecake Factory location. Very convenient for shopping at the Willow Grove Mall, but if I were in the Mall, I&amp;#39;d probably opt for one of the other places in the food court. Our server, Amanda, was great. Very attentive and friendly. Arriving in the early afternoon, we were seated immediately in the patio, at our request. Because of the brutal Mall landscaping (&amp;#34;keep it visible, and they will come&amp;#34;), there are of course no trees around the Mall. Ironic, given the history of Willow Grove Park. So the table umbrellas provide limited shade, and the metal table top - oh my, they can get hot in the sun. We had to move to another table where some shade was available, and Amanda nicely facilitated that. But my complaint is with the restaurant&amp;#39;s pricing. For example, I thought the $3.00 coffee was not a good value for the quality, not that it was bad - but it wasn&amp;#39;t really great either. The same applies to the other items we ordered. The Caesar Salad with chicken ($17) was very large, but reportedly had really dry chicken. The kids Mac n Cheese ($7) gives you a sense of the pricing range. Pricey - about 25% above comparable dining experiences, but without any distinguishing qualities justifying the pricing. There is an extensive menu, and the interior decoration of the restaurant itself looked spectacular, in a kind of touristy way, if you go for that sort of thing.", "rating": 2, "date": "7/1/2016"}, {"text": "The Ed W review was so accurate as I was in the same party.   Have been there many times and couldn&amp;#39;t believe that it was that bad this time.", "rating": 1, "date": "6/27/2018"}, {"text": "I have been here many times with my family and they have always fresh foods. We ordered grilled ribeye steak and avocado egg rolls  it was delicious as everytime.  Highly recommended this place to everyone.", "rating": 4, "date": "6/23/2018"}, {"text": "I like this place, for a chain restaurant it is really quite nice. The menu is extensive but if I had to pick a favorite item it would be the avocado egg rolls. They are dynamite. Also happy hour is a good time! Definitely hit them up for that if you get the chance.", "rating": 4, "date": "6/9/2018"}, {"text": "I love this place and at one time I probably would have given it a 5 but the quality has decreased slightly in food prep. Cheesecake Factory is always one of my go tos because of their extensive and varietal menu as well as their awesome drinks and well - cheesecake- duh! I tend to always get the same thing though - stick to the favorites - which means that I can tell that the quality of a particular dish is decreasing. For example the past few times I&amp;#39;ve gone and ordered the Louisiana Chicken the sauce has been super oily and not at all creamy and there&amp;#39;s been less and less chicken. Overall the taste is good, the value isn&amp;#39;t bad, and the service is great. Don&amp;#39;t sit outside outside of the restaurant inside of the mall, if you get seated there just wait until a table opens up inside. The outside tables are creaky and don&amp;#39;t get cleaned well. I sat out there once on a particularly busy day and although I get why those tables are offered - it expands their seating - you just feel like the unwanted cousins at Thanksgiving dinner banished to the makeshift tables in the other room. But in this case - it&amp;#39;s the mall, who wants to eat inside the mall entrance? Certainly not me. The staff is always really nice though and the food still is good, just not the same standard it used to be.", "rating": 4, "date": "1/31/2018"}, {"text": "Ok, I&amp;#39;ve never really been a fan of Cheesecake Factory (food is too salty while at the same time too bland, too greasy, etc.) and yet their cheesecake is not bad. Not amazing, but not bad either. Service is just ok.<br&gt;<br&gt;If you&amp;#39;re looking to come here, you&amp;#39;re either in high school looking for a nicer atmosphered place to take your date other than your local McD&amp;#39;s or a family that wants to take their high school kids to someplace &amp;#34;nice&amp;#34; and keep the bill smaller based on how much they eat because the food servings here are healthy at best.<br&gt;<br&gt;I came here since my cousin (who&amp;#39;s in high school) begged me to take him here so that he could try it out. I warned him about getting diarrhea and the food quality but he still wanted to go.<br&gt;<br&gt;After $50 (I didn&amp;#39;t eat anything) and not finishing the food I paid for, he got diarrhea on the way home. Served him right for not listening to me.<br&gt;<br&gt;So, in short, unless your stomach is made out of steel, your taste buds are numb to salt and your heart can take an extra hard beating of fat, then by all means, come here. Otherwise, you might want to spend that money on something healthier or homemade.<br&gt;<br&gt;Parking: Large shared lot with mall<br&gt;Wait: Best to make reservations even though I don&amp;#39;t know why people come here<br&gt;Price: $20+ per person", "rating": 2, "date": "3/11/2016"}, {"text": "Very loud and tables are very close together.  We went on a Sunday at 1 pm. We were seated within 10 minutes but took at least 10 minutes for our order to be taken. The booth we sat in had a large piece of the material missing from it. Food was good but for a lunch item, smaller than other plates, it&amp;#39;s not worth the price.  On a positive note, our waitress was very pleasant and our order was correct. I dont think we will be back.", "rating": 3, "date": "12/2/2018"}, {"text": "Went here with my best friend on a sunday night. We waited almost one hour to be seated, and people that came in before us were seated first, mind you we were only a party of two. When I asked the hostess about it, she told me I was wrong and that we would be called when its our turn. The service was very unprofessional and the prices were outrageous for the portion size and the quality of food. You can tell everything is pre made, nothing fresh and probably nothing prepared on premise. The cheesecake was a small portion, and especially for almost 8 dollars, I want my money&amp;#39;s worth. <br&gt;<br&gt;The drink menu was  overpriced, and there were no prices on the actual cocktail section I actually had to ask my server, who didn&amp;#39;t even have a clue. The food was soggy and had way too much sodium in it. The bread that was served to us was hard as a rock, and I actually CUT the top of my mouths&amp;#39; gum open trying to eat it, it was that hard. And the bread was tasteless. Overall, my best friend and I agreed, there are better places around in Willow Grove to go to. This was not worth the price, and I would not go back.", "rating": 2, "date": "3/19/2016"}, {"text": "Got a waitress that decided that she could remember our order without writing it down. Waited over an hour for tacos and when they came they were all wrong anyway. Ended up returning them and going to Taco Bell. Thanks for ruining our valentines dinner", "rating": 1, "date": "2/16/2019"}, {"text": "Nice people, great food. Highly recommended ahi tartar, really exceptional.  Actually everything what we&amp;#39;ve tried there was excellent.<br&gt;We are used to go to TGI Friday at the same mall, but now only here. This is the best place in Willow Grove mall.", "rating": 5, "date": "2/4/2017"}, {"text": "If I could give zero stars I would. I haven&amp;#39;t been to this location in awhile because I prefer the King of Prussia location but tonight was the worse service I ever had. I took my family out for some dinner we tonight and our server got one of my orders incorrect which was ok no biggie that&amp;#39;s fixable but after that she completely ignored us. She kept servicing the table next to us instead. Seems a little racist to me especially since she seemed extra friendly to the table next to us and walked past us a couple times completely ignoring us and didn&amp;#39;t even acknowledge us at all. I grew tired of it and asked for another server for refills and more napkins instead. Server again walks by and ignores us. So then I ask another server if she could grab her manager so I could speak with. 5-7 minutes go by... still no manager. Annoyed I go up to the hostess desk and ask to speak with a manager and told him what was going on. Ironically he too seems racists of Asians because he didn&amp;#39;t seem apologetically at all. I asked him why is that the table right next to us who are African American getting serviced and she&amp;#39;s giving them attention but pays no attention to us at all. All the manager kept did was apologize. I never will here to this location ever again. This was absolutely by far the worse service I have ever received.", "rating": 1, "date": "2/10/2019"}, {"text": "Food is good but when ordering take out they don&amp;#39;t include the complimentary bread and butter which is honestly ridiculous. Used to order 3-4 times a week from them. Won&amp;#39;t be anymore.", "rating": 1, "date": "3/17/2019"}, {"text": "It&amp;#39;s been a few years since I&amp;#39;ve been to a Cheesecake Factory, and I&amp;#39;m very disappointed.  The portions shrunk in size -- I had a fettuccine alfredo, and my local pizza place makes a bigger and better tasting version.  We were seated quickly, and initially service was great, but as I write this, we&amp;#39;ve been waiting on dessert for at least ten minutes.<br&gt;<br&gt;They&amp;#39;re fast on the free refills.", "rating": 3, "date": "9/24/2016"}, {"text": "The food was amazing but the service was average. Wish they could have given us better service but overall a good experience. I wouldnt go back on a weekend.", "rating": 3, "date": "11/19/2017"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory 3 times. The  first 2 times were ok, but the last visit did not turn out very well.<br&gt;<br&gt;My Family took me there for my B.D. in January. <br&gt;<br&gt;My sister and my grandson both ordered a crab  dish. My sister noticed a sour taste, right away, and sent the dish back. My grandson didn&amp;#39;t notice a foul taste, but did get sick with diarrhea later that night.  He didn&amp;#39;t put up a fuss since he felt fine the next morning. <br&gt;<br&gt;Me and my son both ordered steak ,mashed potatoes and asparagus. To be kind, The mashed potatoes were under cooked.  there were literally raw lumps of potatoes on my plate.  The asparagus was no better. Pretty much raw as well.<br&gt;I know what rustic mashed potatoes and aldenta vegetables taste like. This was far from it. This was raw food.  You could tell that it had potential if cooked a little more, so I took it home and did just that, and it was much better. <br&gt;Question, should I really have to do that. I think the answer is a resounding Hell No.<br&gt;<br&gt;I&amp;#39;m being lenient giving a review of 2 stars because I really hope this was a one off ( maybe they were having a bad night in the kitchen )<br&gt;<br&gt;I will go again, because I have a gift card,  and hope for a better outcome.", "rating": 2, "date": "3/18/2018"}, {"text": "Delicious filet mignon  one problem they make these unbelievable glazed carrots with Pecans and then they get rid of them and they&amp;#39;re the best thing on the menu and every time we come in we ask the waitresses yes no problem and then the chef gives her a problem and he yells at her they need to just bring it back on The menu<br&gt;I get rid of stuff that actually the people like how hard is it to make<br&gt;<br&gt;They make you wait for a drink for ever.  Not happy", "rating": 1, "date": "12/10/2017"}, {"text": "I&amp;#39;d always been wary of the Cheesecake Factory, mostly due to their insanely priced cheesecakes themselves. Before my visit here, I&amp;#39;d only ever got cake to go from the KoP location, and despite the good quality, $8 for a slice of cheesecake seems steep.<br&gt;<br&gt;Anyway, I ended up at the Willow Grove location last night because a friend wanted to have her birthday party there. I&amp;#39;ll start with the good; the food was (mostly) delicious. I had their loaded nachos (don&amp;#39;t remember the menu name), which consisted of thick nachos that seemed to be fried on premises. I also had the chicken samosas, which were awesome, and while not completely authentic, they had a nice curry flavor that was palatable for American taste buds but still distinctly tasted like an Indian masala. Also, their cheesecake is obviously quite good. I had some of their new s&amp;#39;more edition and it lived up to the hype. Also, I tend to like the decor inside, even if it is quite dark.<br&gt;<br&gt;So here&amp;#39;s the cons. My house salad was disgusting - the salad itself was wilted and the vinaigrette they put on it only served to make the aging leaves even more bitter. Luckily, this was the only bad item anyone got and the rest of our food was edible. Worse than this, is that the staff, particularly hostesses, are very rude. They seemed angry we had a large group, and gave us poor accommodations so that one person had to sit on a rickety chair in the middle of the aisle. Also our waitress seemed over worked and barely checked on us, so sadly I personally will refrain from ever going there on a Saturday again, as the attitude was too much.<br&gt;<br&gt;For being a chain, it&amp;#39;s not bad. I&amp;#39;ll come again on a week day and do an update, and see if any of my issues are resolved.", "rating": 3, "date": "9/29/2013"}, {"text": "My date and I recently (5/30/17)  ate at this restaurant. We both were fans of there Shepherd&amp;#39;s Pie - were, being the operative word. This meal was floating in grease/fat and very salty. It was a huge disappointment.<br&gt;<br&gt;Now for the service! It was equally as disappointing. Our waitress was rude - tossing dishes on the table and not once did she come back to our table, during the course of the meal to check on us. When she brought our bill she never asked if we were satisfied or enjoyed our food. <br&gt;<br&gt;No return trips for us!!!", "rating": 1, "date": "6/1/2017"}, {"text": "Our party of 15 arrived at this location and were seated within an hour. Our server Rebecca was amazing. She was prompt, courteous and polite. We had drinks refilled and everyone&amp;#39;s order met expectations. We celebrated my husband&amp;#39;s 35th Birthday, and the other servers came out and sang to him and comped his Snickers Cheesecake. The proverbial icing on the cake (no pun intended) was that Rebecca actually let us split the check. My husband I were there with 6 other couples and a single person. each married couple had their own check. Don&amp;#39;t ask how she did it...but she did! Amazing! We&amp;#39;ll be back.", "rating": 4, "date": "11/2/2017"}, {"text": "Tonight they had a huge wait. This was ok because it was a Saturday night, however, the bathrooms had paper towels over flowing the trash and the waitress did not greet us for over 10 minutes after we sat down. We did not get bread until requested. Food was good and hot but the management and service was not up to par at all.", "rating": 3, "date": "1/27/2018"}, {"text": "Food is always fantastic. Today was an 1 and 30 minute wait. I don&amp;#39;t understand why since there were empty tables. <br&gt;Waitress took over 10 minutes to greet us. <br&gt;Seems to be understaffed tonight.<br&gt;Bathrooms were disgusting. No paper towel and over flowing waste baskets and the over flowing trash was being tracked out into the main dining area. <br&gt;This is a case on very poor managerial skills.", "rating": 3, "date": "1/27/2018"}, {"text": "This review pertains to the takeout ONLY.<br&gt;<br&gt;My avocado eggrolls looked like an experiment gone wrong. In addition, they were soggy, not crispy. The bed of rice noodles were extra stale.<br&gt;<br&gt;I feel like I got the reject batch that the cook screwed up on and couldn&amp;#39;t serve to the guests because they could actually see their food and complain about it before paying for it, whereas I could not.<br&gt;<br&gt;Typically the food does not disappoint.....but whoever was responsible for cooking tonight (around 8pm) needs to be re-evaluated.<br&gt;<br&gt;Currently not too thrilled to re-order.", "rating": 2, "date": "8/8/2015"}, {"text": "The best thing to mark this place is the variety.  Had the Ahi tuna plate.  Tasty. My husband had the meatloaf. Ordinary was the way he described it.", "rating": 3, "date": "11/10/2017"}, {"text": "I stopped by for lunch on a weekday. They weren&amp;#39;t very busy, and we were quickly seated. Our server was nice, and the service was timely.<br&gt;<br&gt;We were served bread first, and it was delicious. Warm and soft, it tasted like it was fresh out of the oven. There were two kinds, one brown and one white. Both were good, but I liked the brown better. It was a little sweet. I did enjoy the crisper crust of the white bread, though.<br&gt;<br&gt;I ordered the Thai lettuce wraps. My sister had a kale and quinoa salad, and my mom ordered a turkey sandwich off the &amp;#34;skinny menu.&amp;#34; I was pretty happy with my choice; as a shareable appetizer, it was actually a lot for one person. The three sauces were delicious and so flavorful. The vegetables were fresh, and the red cabbage was particularly delicious since it&amp;#39;s usually so tough in texture. Unfortunately, the texture of the noodles was not good--they weren&amp;#39;t chewy at all. It tasted like they&amp;#39;d been refrigerated to cool down quickly.<br&gt;<br&gt;The salad was good, but the dressing made it a little too salty. My mom enjoyed her burger, but I guess there was a caloric price to pay because it looked really small and sad on a large plate. I don&amp;#39;t think she was full, either. So bottom line for the entrées of the day is, yummy with some drawbacks.<br&gt;<br&gt;And of course we had to get dessert. This is the only restaurant we ever get dessert. And on those rare occasions in other restaurants when we get dessert, we always get one to share. But at the Cheesecake Factory, each person gets his or her own cheesecake slice. My sister got the strawberry, my mom got caramel du leche, and I ordered the 30th anniversary one, which is cheesecake layered with chocolate cake. The crust is made of chocolate in various forms. It was so rich, I couldn&amp;#39;t get in more than a few bites. But for the next few days, I had a delicious treat in the fridge! Everyone else enjoyed their cheesecake, too.<br&gt;<br&gt;Can&amp;#39;t wait to go back and try some of the other cheesecakes! The rest of the meal seems only a formality for me.", "rating": 3, "date": "9/15/2015"}, {"text": "I&amp;#39;ve been here twice and my biggest complaint is the noise. It&amp;#39;s so hard to hear the other guests you&amp;#39;re with. You have to lean across the table to hear each other. Also the tables are so small. It&amp;#39;s like playing a game of Jenga to be able to put plates and cups on one table. Also because we knew the tables were small we asked for a booth but were told there were none. Clearly there were at least two open booths. It was a late lunch so it wasn&amp;#39;t during a rush service time. I&amp;#39;ve been to three different locations and this is by far the loudest. Not a staff problem but an acoustics.", "rating": 3, "date": "10/21/2018"}, {"text": "Their lunch menu includes a wide variety of food to choose from. My to-go to meal is Spicy Chicken Chipotle pasta. It is always delicious.<br&gt;<br&gt;The problem with this restaurant is that your experience really depends on which waitor/waitress you end up with. You can end up with one who doesn&amp;#39;t care about you and whether or not you enjoy your food or not. There is no consistency with the staff members.<br&gt;<br&gt;The other problem is that they got me cold, hard bread before. I complained and they told me that it will take me 20 minutes to give me fresh bread. I was disappointed with my meal that day.", "rating": 3, "date": "5/14/2016"}, {"text": "Never going back to this location again. The silverware on our table was dirty, so I reached over to the table to the right of me and the silverware was also dirty for that table. Then I went to the left of me and again, the silverware was dirty. When asked to speak to a manager, the server said he would be right out. When the manager was informed, all he said was &amp;#34;Oh.&amp;#34; We told him we were going to leave and nothing else was said besides &amp;#34;Okay. &amp;#34; no apologies or even offer a new set of silverware. We will never return to this location.", "rating": 1, "date": "7/2/2018"}, {"text": "Well.. the first thing is - for whatever rhyme or reasons, this turns out to be a hangout spot whenever my friends come visiting in to my place. And so far, it has not been a disappointing experience any time.<br&gt;<br&gt;This place is pretty crowded for the most part of the time - regardless of the day of the week you walk into. And the not so nice part is that they don&amp;#39;t take in reservations. So, you are definitely getting a raw deal if you are not able to plan much for a free form dining.<br&gt;<br&gt;The ambience of the place in itself is pretty good - and also, appears to be kind of standardized all over. I have not seen a different ambience at different Cheesecake factory outlets so far.<br&gt;<br&gt;As for the parking - you definitely get the parking space from the mall :) You do have a deal of outdoor dining in an explicit fashion for the summers and there is also an &amp;#34;outdoosy&amp;#34; feel from the mini out door setup within the mall side of the area that is OUTSIDE of the restaurant area itself :D<br&gt; <br&gt;Moving out to the food portion of it - I must admit that though I have been here multiple times with multiple people, I haven&amp;#39;t quite tried a lot of stuff myself. So, some of the review here should be a combination of what I have eaten plus what my friends had along with me.<br&gt;<br&gt;The freshly squeezed orange juice - it is a class apart. You don&amp;#39;t get to have automatic refills. But I can safely bet you would only be asking for more when you have a sip of it.<br&gt;<br&gt;Chicken di pana - thin slices of breaded chicken cooked to perfection in a white wine sauce. The serving size is pretty generous and therefore, you might even be left wondering how you would be able to complete the accompanying broccoli and mashed potatoes<br&gt;<br&gt;Veggie Burger - This is par excellence. Neatly done patties that seem to be quite freshly made from a combination of rice and beans. Brought in with sliced onions, lettuce, tomatoes and jalapenos. The patty is topped with a cheese - and I believe you can let them know your choice of it. <br&gt;<br&gt;They have a very extensive menu and I am not hoping to try out everything even with all combinations of folks eating out with me! However, I promise to edit and repost as and when I keep trying newer items", "rating": 4, "date": "5/15/2016"}, {"text": "I went here with my mother in law for lunch a few weeks ago. The first thing I noticed was the beautiful high ceilings. It really makes the restaurant look bigger. We were seated at a table fairly quickly as they were not busy at all. I didn&amp;#39;t like how close together the tables were. It didn&amp;#39;t allow for any personal space. The other downside is that they placed people on either side of us making us feel cramped. This was unnecessary as like I said the place wasn&amp;#39;t busy and there was empty tables all over the restaurant. Other than that it was pleasant. Our waiter was phenomenal. I had my daughter with me and he stopped and talked to her and asked me questions about her. The food was great. I was very happy with everything I got and the food was brought out quick.", "rating": 4, "date": "8/7/2015"}, {"text": "I pop in to get a slice of cheesecake every month or so. My last visit was so strange...the &amp;#39;server&amp;#39; (she said her name was Melissa&amp;#39;) totally ignored me even though I&amp;#39;d waited a bit and had asked to be served twice. She seemed to want to serve the couple ahead of me even though they had assured her (twice) that they were still deciding and weren&amp;#39;t ready to order. When I did order, she cut me off. Twice. I asked for her name, paid then left. Then noticed she got my order wrong. I won&amp;#39;t be back. <br&gt;<br&gt;Maybe it was my Afro.", "rating": 1, "date": "4/3/2016"}, {"text": "What do they put in their food that makes you so full?! Food comes out great depending on what you get. Staff is amazing. Wait is FOREVER!", "rating": 4, "date": "6/6/2015"}, {"text": "The service is terrible! The takeout/counter service is absolutely horrendous. They are rude and cheesecake is hardly ever fresh. It&amp;#39;s a shame that the service at this location has increasing become worse over the years instead of improving.", "rating": 1, "date": "11/19/2018"}, {"text": "We were very disappointed with the service. <br&gt;<br&gt;When our pager went off, we waited by the hostess stand with 4 other parties who were waiting to be seated as well. The hostesses were scrambling around trying to decide which tables were bussed and who was to be seated next...it was very unorganized<br&gt;<br&gt;At that point we were pretty hungry! My husband ordered steak and it came without a steak knife. So he had to wait for the waitress to come back with a knife. We had to ask for bread which is normally brought out automatically.<br&gt;<br&gt;I give the Cheesecake Factory 2 stars for service but 4 stars for taste because the food was very good!", "rating": 3, "date": "11/15/2017"}, {"text": "I went here with some friends after an assembly and was very disappointed in how the portion sizes changed. I usually have enough food to take home but this time the portions were so small you could finish them in one setting. I got the shrimp scampi and it was about $20 so for that price to not have left overs I was really disappointed. I hope this is not the norm for all the cf. my friends first reaction was similar. The food was good but just know you will be paying more for less food.", "rating": 3, "date": "4/23/2017"}, {"text": "Maybe it&amp;#39;s just because I moved from hicksville and we didn&amp;#39;t have anywhere to eat except for the Olive Garden, but I love Cheesecake Factory. Huge menu and nice, attentive waitstaff. Especially love the mac and cheese burger + sweet potato fries. We always take a slice of cheesecake to go and split at home because we leave way too stuffed.", "rating": 4, "date": "2/16/2015"}, {"text": "I LOVE LOVE this place,,,,<br&gt;<br&gt;cheesecake selection  OMG ,,,,, this place has the best cheesecake EVER!!!!!! I have been to many different different locations but this one is my favorite.", "rating": 5, "date": "4/30/2016"}, {"text": "Wasn&amp;#39;t that thrilled with last nights dinner. The service was ok but nothing special. Hostess staff was very friendly upon arrival and also when we left. <br&gt;<br&gt;This dinner was just bleh. The kids pasta was dry and really lacking sauce as was my wife&amp;#39;s chicken Romano dinner. She liked the chicken but really didn&amp;#39;t touch the noodles. We took them with us so we could add sauce at home for leftovers. My burger topped with fontina cheese and Caramelized onions and mushrooms was cooked medium as requested but it was dry too. No burger juice! The side salad was fresh and properly dressed. My moms spicy chili salmon was good all around, maybe a bit too much cabbage on the side but otherwise very good. <br&gt;<br&gt;We didn&amp;#39;t do dessert as our little boy needed to get home to sleep but boy did all of those choices look good! With so many options to try we will be back but we will stay away from the pasta and burger dishes.", "rating": 2, "date": "12/2/2015"}, {"text": "There aren&amp;#39;t that many decent brunch place in the suburbs so cheesecake factory is my spot on sunday! It has the BEST sunday brunch menu!! I highly recommend the Monte Cristo.... enough said (fyu brunch is only served on Sundays)", "rating": 5, "date": "10/2/2015"}, {"text": "Its the Cheesecake factory, what could I really say? I love it and I will continue to go here every chance I get. I pretty much had everything on the menu here as well as the drinks. The service for the most part is pretty good even when its busy.", "rating": 5, "date": "6/9/2015"}, {"text": "My wife and I go to cheesecake factory at least 2 times a month. It was quite disappointing after our last experience there. My wife and I ordered the nachos as an appetizer. As we were finishing them up, we then ordered our entrées. Unfortunately my wife started getting a little queasy and sick and requested our meals to go. When we got home we both felt very sick to the point where we spent the remainder if the night in the bathroom. The two meals we brought home (Chicken Bellagio) went to waste since we didnt want to take any chances the next day eating them. I called and spoke to the manager Allie and explained what had happened. Unfortunately she did nothing to rectify the situation.<br&gt;Over all, we are quite dissatisfied and will never return again to any Cheesecake Factory establishment.", "rating": 1, "date": "4/11/2015"}, {"text": "Sat us outside in the freezing cold with an infant. Service was slow and staff was rude and unfriendly. Horrible expierence. Only giving one star for the food.", "rating": 1, "date": "4/29/2018"}, {"text": "Cheesecake Factory is our go to restaurant when shopping at the Willow Grove Mall.<br&gt;<br&gt;My mom and I like to go on Sundays when they offer the extended breakfast/brunch menu.  Recently we went in and they offered a free cheesecake slice gift card for purchasing a $25+ gift card.  We ran into this deal a few times in the past holiday seasons so I bought a gift card and was able to use the gift card right away, but the cheesecake voucher cannot be used the same day.  Which is fine with me, I can wait till later to use it!<br&gt;<br&gt;My favorites from the &amp;#34;Brunch&amp;#34; menu which is offered only on Sundays until 3pm are the Bruleed French Toast, Lemon-Ricotta Pancake, and the Baja Chicken Hash.<br&gt;<br&gt;The Bruleed French Toast is humongous... well, most of their dishes are, but I&amp;#39;ve never finished the french toast in one sitting.  It&amp;#39;s not an overpowering creme brulee flavor, but just the right amount.  <br&gt;<br&gt;Same goes for the Lemon-Ricotta Pancakes.  It has a faint lemon and ricotta taste.  I love lemon flavors in pastries and breakfast items so this is definitely one of my favorites!  It&amp;#39;s usually topped with sliced strawberries but I&amp;#39;ve seen people ask for different fruit toppings and they weren&amp;#39;t charged extra for the replacement.<br&gt;<br&gt;For both the sweet brunch dishes, you don&amp;#39;t get any savory sides with them, but you can order meat or a breakfast side if you&amp;#39;d like.  I think the french toast actually does apprear again on the menu with a side included, but I&amp;#39;ve never ordered it that way.<br&gt;<br&gt;If I&amp;#39;m not in the mood for something sweet, I always get the Baja Chicken Hash for brunch.  It&amp;#39;s a generous portion with two large crisp tortillas topped with veggies, chicken, beans, and poached eggs.  So delicious!<br&gt;<br&gt;Aside from the brunch menu, Cheesecake Factory has so many different options on their menu... it&amp;#39;ll take you a while to look through everything if it&amp;#39;s your first time, but everything is really pretty tasty :) <br&gt;<br&gt;My favorites on regular menu:<br&gt;<br&gt;Miso Salmon<br&gt;Spicy Chicken Chipotle Pasta<br&gt;Chicken Bellagio<br&gt;Grilled Shrimp and Bacon Club Sandwich<br&gt;<br&gt;Enjoy!", "rating": 4, "date": "12/2/2014"}, {"text": "Its as good as any other Cheesecake Factory is! I love cheesecake factory. Large portions, good prices, great food. I mean its nothing spectacular or amazing, just decent food. Especially for lunch or a large party. This one is no exception.", "rating": 4, "date": "12/4/2014"}, {"text": "We don&amp;#39;t typically visit many chain restaurants, but my in-laws like this place so we went with them. The food was fine, definitely nothing outstanding but fine. <br&gt;<br&gt;We were in a party of 11, and either the restaurant or our specific server didn&amp;#39;t use seating numbers when entering in the order, so that they had to &amp;#34;raffle off&amp;#34; the food when it came. Seeing as Cheesecake Factory is such a large company, I would have thought they&amp;#39;d use seating numbers to distribute the food instead of interrupting everyone to ask who had ordered what. So much more enjoyable for the patrons and much easier for their staff.<br&gt;<br&gt;I did like that they had a decent selection of gluten-free options, which was appreciated. The atmosphere is enjoyable, and everyone in the family seemed to have a nice time.", "rating": 4, "date": "8/22/2016"}, {"text": "Cheesecake Factory is one of my favorite chain restaurants, plain and simple. Actually, one of my favorite restaurants period.<br&gt;<br&gt;First off, Cheesecake Factory has literally the biggest menu I&amp;#39;ve ever seen. To get to the salads, you have to go to somewhere around page 15! Normally, I&amp;#39;d see too menu menu options as a restaurant not knowing what it is, and just throwing everything on a page with a total disregard for quality of the product, not here. Everything I have had here has been nothing less than great. My usual order is the Crispy Chicken Costoletta which is basically a lightly breaded chicken in a lemon sauce, served with mashed potatoes and asparagus. The chicken is divine, and the lemon sauce makes it perfect. Portion size is also huge, I am either beyond full if I finish it, or usually have another meal to take home. The mashed potatoes are good, but nothing to go crazy over. Recently, I&amp;#39;ve been splitting a bunch of appetizers with my friends, tapas style. For appetizers, I&amp;#39;d highly recommend the Tex Mex Eggrolls, Fried Macaroni and Cheese, and the Crispy Taquitos. All are phenomenal. The ones I am not the biggest fan of it the Spinach and Cheese dip (the spinach is flavorless and the cheese is just put on top), and the Quesadilla (chicken just tastes bland and processed). <br&gt;<br&gt;The cheesecake deserves its own little section for just how good it is. Caution, the cheesecake is on the pricy side, I&amp;#39;d be much happier if it was a little bit cheaper. Nevertheless, they are all phenomenal. My favorite is Adam&amp;#39;s Peanut Butter Cup Fudge Ripple, but most of the other ones I&amp;#39;ve had are equally as great. My only recommendation to Cheesecake Factory would be to setup a dessert to sample a bunch of different cheesecakes, instead of paying the price to buy a bunch of them. If this exists already, shame on me for not finding it, but if it doesn&amp;#39;t it needs to in order to taste the bliss of all these cheesecakes at once!<br&gt;<br&gt;Atmosphere here is always very nice, and plenty of room in the booths. Service wise, it really can be a bit of hit or miss. Most times my servers have been excellent, but I&amp;#39;ve had a few that were a little slow with things like getting us water, etc. Pricing is also pretty decent, it&amp;#39;s a little bit on the more expensive side, but still worth it for what you are getting. Chain restaurants usually have a stigma attached to them, but Cheesecake Factory delivers on every aspect. This is basically my go to place anytime I&amp;#39;m hungry and want great food.", "rating": 4, "date": "8/14/2013"}, {"text": "Came here with my boyfriend on a whim because we couldn&amp;#39;t figure out what we wanted to eat.  I normally dislike chain restaurants but this place is the exception.  We had appetizers for dinner and it was the perfect choice.  We got the fried mozzerlla, tex mex spring rolls and fried chicken sliders.  All were great.  Service was fast and friendly, food came out quickly and everything was flavorful. <br&gt;<br&gt;Unfortunately when we left, about 15 staff members decided it was more important to gather behind the restaurant near the dumpsters and fight WWE style (all while recording video on their phones) instead of do dishes/cook food/or serve patrons.  Um what? Yes. 15 of them, all dressed in white, out back, during a work shift, rolling around on the ground - fighting. <br&gt;<br&gt;The only reason this is getting 2 stars is because the chicken sliders were the bomb and our server was great. The highschool fightclub going on out back? &amp;#34;Eek! Methinks not.&amp;#34; Honestly, had it not been for wrestlemania, this place would get 3 stars.", "rating": 2, "date": "7/24/2014"}, {"text": "Went there for a b&amp;#39;day with family. Garlic bread, omlette, avocado toast was pretty good. Also, margarita and pina colada were above average. But the dessert let us down big time. <br&gt;Mango key lime cheescake &amp;amp; lemon raspberry cheescake were disaster. It seemed they were in freeze for a months and it tasted sour. The service was pretty good.", "rating": 3, "date": "8/16/2017"}, {"text": "Cheesecake Factory is a chain - and honestly, feels like one to the core.  This particular one doesn&amp;#39;t stand out for me - lacks the &amp;#34;feel&amp;#34; of the one I grew most familiar with in Miami - and has a certain &amp;#34;roughness&amp;#34; around the edges.  Sitting us outside the restaurant not in &amp;#34;outside seating&amp;#34; but actually &amp;#34;in the mall&amp;#34; didn&amp;#39;t really do it for me.<br&gt;<br&gt;The food is &amp;#34;okay&amp;#34;.  Cheesecake standard stuff - honestly, the menu is pretty much &amp;#34;to large&amp;#34; for many groups.  And I&amp;#39;ve had inconsistent results.  Nothing that stood out as especially &amp;#39;bad&amp;#39;, but likewise - nothing that makes it a memorable visit either.  <br&gt;<br&gt;i go here mostly for folks that are visiting and have never been to a Cheesecake Factory.  Most of them really seem to love the Cheesecake, so I guess that is a good thing with the name.<br&gt;<br&gt;I think overall - my tone of dissatisfaction is with the Price vs. value.  They attempt to market themselves as something .. elegant, etc. But while the environment is generally nice, the food just isn&amp;#39;t worth it.  <br&gt;<br&gt;And perhaps I&amp;#39;m not the standard customer - but atmosphere without taste and food isn&amp;#39;t going to win me over.  Not for a restaurant.", "rating": 3, "date": "9/1/2014"}, {"text": "Love Cheesecake Factory. Not only is their cheesecake awesome (duh) but the food is really good. Zucchini fries are a favorite of mine. I am also a big fan of the Chicken Romano, aka parm. The menu is huge so there is something for everyone. <br&gt;<br&gt;And I was even able to shop in the mall at a nearby store or two while waiting on more than one occasion. Just had to run in and grab something but 2 birds 1 stone. That makes it all the more better!", "rating": 5, "date": "8/22/2013"}, {"text": "I love this place! No matter what CCF I go to the staff is always nice and friendly. Plus, I am addicted the Chris Outrageous Cheese cake", "rating": 4, "date": "7/4/2015"}, {"text": "Still at the restaurant here for dinner on a Sunday night. This review is not relevant to the quality of the food, but the quality of the service.<br&gt;<br&gt;We arrived at 7pm with a party of 8 and were told that our wait would be 20 minutes. We checked in with the hostess about 2-3 times over the next half hour, and was told each time that our table was almost ready. It wasn&amp;#39;t until 8pm that we were finally seated.<br&gt;<br&gt;Service was fine getting our drinks out in a timely manner. However, when the bread and butter was brought out, we still had no silverware at our table. After waiting a few minutes unnoticed, we pulled a waitress aside and asked for silverware/table settings. No one had even noticed that we were without table settings.<br&gt;<br&gt;5 minutes later, a waiter/busboy(?), came out and plopped two napkins full of silverware at one end of the table and left. No settings were placed, an no one followed up with us. <br&gt;<br&gt;I have never felt so disrespected at a restaurant. Honestly, Chick Fil-A gives me better service than this.<br&gt;<br&gt;It is now 8:42pm and our entrees have just come out. Maybe if the service through the rest of the night improves I will consider changing this review or writing a new review.", "rating": 1, "date": "3/22/2015"}, {"text": "Awful. Waiter was horrible and slow. We had the onion soup and it came out cold not to mention there was a hair in mine. Bad experience in general. The floor was filthy as well. Not at all what I expected. Don&amp;#39;t waste your time or money.", "rating": 1, "date": "1/1/2018"}, {"text": "Awesome menu. Been going there so many times. One major flaw? They don&amp;#39;t take reservations. No matter how good you are as a customer. I wish they would accept reservations.", "rating": 3, "date": "3/19/2017"}, {"text": "So I visited this Cheesecake Factory numerous times, but yesterday was the best visit I had by far. <br&gt;<br&gt;I went with my friend who just loves eating. We got seated quickly and our waitress was highly attentitive. Not only that, my friend accidently poured the entire bottle of ground black pepper into her dish! I&amp;#39;m assuming the lid was not screwed on tight.<br&gt;<br&gt;Our waitress offered to ask the chef to make a new dish for my friend, she was so nice! She even brought over a new pepper shaker! <br&gt;<br&gt;Overall, we had such an amazing experience, all because of exceptional customer service!<br&gt;<br&gt;Although, I do recommend dining during hours that are not as busy.", "rating": 4, "date": "7/23/2014"}, {"text": "The food was ok today. I wasn&amp;#39;t wowed. The service was very slow. My favorite thing to eat here today was the fried mac and cheese balls. The cheesecakes were very good though as usual. Marshmallow meringue cheesecake and caramel apple streusel cheesecake. Very good.", "rating": 3, "date": "3/28/2015"}, {"text": "Went on Friday at 3<br&gt;Seated right away, Drink;s right away, <br&gt;Wife wanted a few more minutes to order, and the waitress was by a few times.<br&gt;Sheperds pie was real good, and the wife&amp;#39;s Beef Medalions  were excellent in her word&amp;#39;s<br&gt;The waitress was a doll.<br&gt;Haven&amp;#39;t been to a cheesecake factory in quite a few year;s, as we used to go to the Inner Harbour one in Baltimore, which was always good.<br&gt;Still consistently good food, and good service", "rating": 4, "date": "7/9/2015"}, {"text": "The bartenders rock. Kevin and Kristen in particular. Every drink is made to perfection, just as your order it. The food is always amazing and comes out very quickly! We love it there! The avocado eggs rolls are our favorite, any pasta dish, or the BBQ chicken salad are my go to&amp;#39;s. And of course the cheesecake is delish!", "rating": 5, "date": "3/23/2017"}, {"text": "The cheesecake that I have tasted which was the banana cream was amazing!<br&gt;I had my first slice almost 3 summers ago and still remember it.<br&gt;I go back everyone few months and recently I have only had meals and a few drinks. <br&gt;The drinks they serve are amazing and dinner was good.<br&gt;<br&gt;On holidays like today they are incredibly busy which put a damper on the experience. The woman upfront at the cheesecake part of the restaurant was unfriendly and had very few words.<br&gt;Maybe it&amp;#39;s because it was so busy but shouldn&amp;#39;t she have expected that on a holiday?", "rating": 3, "date": "5/14/2015"}, {"text": "Moral of the story: Haters gonna hate<br&gt;<br&gt;Story: My lovely mother decided to finally eat at a place that does not serve Vietnamese food for once in celebration of her birthday. Excitedly, I asked which cuisine she had decided on for me to take her to. In her cute Vietnamese accent, &amp;#34;CHEESECAKE!,&amp;#34; she announced. In my head, I cringed. Aside from their cheesecakes, I have not eaten here for a long time. So I then silently chanted these thoughts during our car ride:<br&gt;<br&gt;+Ridiculous long lines<br&gt;+Horrible service<br&gt;+Fusion food gone wrong<br&gt;+Uneatable humongous portions <br&gt;<br&gt;On this particular night, all of my preconceived notions about CF were defied. We arrived on a weekday&amp;#39;s night and were seated immediately much to my amazement. We avoided the usual hordes of hungry patrons holding their buzzers standing around the entrance and exit on any given weekend&amp;#39;s night. <br&gt;<br&gt;The quality of food was well-executed. I ordered the bang-bang chicken and shrimp served with brown rice, chile, curry, coconut, and sautéed vegetables. It was very flavorful. I finished it all! Also ordered the vegetarian burger and salads and enjoyed every bite. Washed it all down with a glass of delicious red wine sangria. We then finished off with a heavenly slice of dulce de leche caramel cheesecake. <br&gt;<br&gt;Our server, Olena, was extraordinary. Her genuine friendliness and helpfulness was truly appreciated. She paid attention to the small details of our dining experience. It was truly exceptional service for any restaurant, especially a chain. <br&gt;<br&gt;Lesson learned- so whatever mom wants she gets. And moms are usually right.", "rating": 4, "date": "1/27/2014"}, {"text": "Probably deserves a 2.5 because the food was pretty good, but no 1/2 stars on Yelp. Anyway, had a few problems with this visit. 1st the check in hostess seemed a bit short. Sort of odd to assign a person not all that friendly to that position. Aside from that, we experienced multiple errors with our order &amp;amp; if felt like the wait staff is over worked. (Too many tables per waiter/waitress) This is the 2nd time we&amp;#39;ve had a less than ideal experience at this location. If you are dead set on eating at the CF ... I&amp;#39;d suggest hopping the bridge and going to the Cherry Hill NJ location.", "rating": 2, "date": "1/2/2017"}, {"text": "Although it&amp;#39;s a chain, I wanted to comment on this. The wait is always very long but that is so be expected. However, when you are seated you will not be disappointed. The menu is huge and the food is amazing! We had a great waitress on our latest visit. <br&gt;<br&gt;Being such a high volume restaurant, they really do accommodate guests!", "rating": 4, "date": "11/22/2015"}, {"text": "If you believe in equal treatment for all persons, do not go here! They haphazardly sit all minorities in the outside terrace in the mall area behind the bushes.", "rating": 1, "date": "12/6/2014"}, {"text": "this place is okay, we got in on a Monday which was great because we had no line etc. The food is kind of expensive for what it is, and the desert ins&amp;#39;t that great at all. i think i enjoyed the food more then the desert.", "rating": 3, "date": "8/4/2016"}, {"text": "The cheesecake factory is good at cheesecake, and worth it. However, It is unlikely that a 25 page menu is all made with fresh ingredients. Like an average diner  restaurant, it has a wide menu with cake behind glass in the front.", "rating": 3, "date": "11/28/2014"}, {"text": "I went here with my mom last month and I am so disappointed. I wasn&amp;#39;t expecting Michelin Star food but something decent and flavorful... I got the Jambalaya which is my go to... This time food was awful service was questionable and when I made mention of it to the server he(Hugo) didn&amp;#39;t care and the manager was &amp;#34;unavailable&amp;#34;. Definitely will not go back to this location. Oh and the drinks were watered down.<br&gt;<br&gt;If the food is going to suck at least make me a little tipsy so I won&amp;#39;t care as much :/", "rating": 1, "date": "5/2/2017"}, {"text": "They deal with their customers perfectly. <br&gt;The food may be on the expensive side but it is well above worth it. <br&gt;Although it&amp;#39;s called &amp;#34;The Cheesecake Factory&amp;#34; their deserts consist too much of the normal desert items on the menu or any other resteraunt of it&amp;#39;s type. <br&gt;I believe if they add more specialty desert and dinner items, they will bring in more customers as well as myself more often.", "rating": 4, "date": "10/28/2015"}, {"text": "I like the Cheesecake Factory because it has a large menu for different tastes and huge portions, however, I do not like this particular location.<br&gt;<br&gt;Me and the boyfriend go to the Cheesecake Factory strictly because we love the avocado egg rolls. The two visits we had at this location, we ordered them and then the server would come back saying that they were all out. I would understand them running out of something one time, but BOTH visits? It just leads me to believe they are doing something wrong if they can&amp;#39;t keep a very popular item &amp;#34;in stock.&amp;#34; <br&gt;<br&gt;Probably won&amp;#39;t go out of my way to return to this location since both visits were disappointing.", "rating": 3, "date": "3/7/2015"}, {"text": "I enjoy one thing at the reataurant and that&amp;#39;s the red velvet cheesecake however once I saw the calorie and fat count I don&amp;#39;t bother going there at all", "rating": 1, "date": "10/9/2016"}, {"text": "Let me keep this short. At the risk of sounding like a dick, it&amp;#39;s a popular suburban restaurant with all of the issues that might suggest.<br&gt;<br&gt;We had a 1 hour wait before we were seated, which was much longer than promised. But, ok, it was a Friday night. Apparently 5 large tables had been there for over 2 hours. So not really their fault. But we were all very, very hungry.<br&gt;<br&gt;Bland food, sans the fried macaroni and cheese. That was awesome. The guacamole needed salt, and my eggplant sandwich was pretty gross.  The cheesecake slices (cookie dough and s&amp;#39;mores) that my table of 7 split were good. <br&gt;<br&gt;I have eaten at a few of these locations, and it was all pretty normal, but the reason I&amp;#39;m bothering to review this one is because my friend got food poisoning from her orange chicken and found a large shard of glass in her leftovers. So 2 stars it is.", "rating": 2, "date": "2/1/2014"}, {"text": "My review on The Cheesecake Factory would get an A++ when it came to the service I received while dining last night.  The waitress was extremely nice and attentive.  But, alas, my review is 2 stars because of the food.<br&gt;<br&gt;Before I was a vegetarian, I really enjoyed the CF.  The chicken and dumplings were de-licious.  Last night my friend and I were meeting at a local Vietnamese restaurant, but they happened to be closed for the Chinese New Year (sad face).  So we opted to go here instead.  I thought to myself &amp;#39;I just saw someone on youtube raving about their veggie burger - I have to try it!!&amp;#39;<br&gt;<br&gt;No.  No, no, no.  It was not de-licious.  It was probably the worst veggie burger I&amp;#39;ve had.  I&amp;#39;m not sure why restaurants feel like people who don&amp;#39;t eat meat want a mushed together patty of rice and some other vegetables I couldn&amp;#39;t even tell you were in their based on taste.  That doesn&amp;#39;t replicate a burger at all.  I sadly would have been happier going to Red Robin.  So there&amp;#39;s the lesson you can take away from this review - if you are a veghead and want a burger you are going to enjoy - skip the Cheesecake Factory and head directly to the nearest Red Robin and order their Boca burger!", "rating": 2, "date": "1/28/2017"}, {"text": "We&amp;#39;ve been here enough times as it is local to have tried a good variety of their menu. <br&gt;First, the menu is huge and should accommodate anyone. <br&gt;Food prices are fair but the beer is too expensive. I believe they charged $7 for a bottle of yeungling lager. I rarely drink but the Diet Coke I ordered was no good (tasted old) so I decided to send it back and get the beer. <br&gt;Like most people, we eat quickly so we can get to the dessert. The cakes are all amazing. I would usually get the &amp;#34;low carb&amp;#34; cheesecake and it is always good. We came for our sons bday recently and shared the &amp;#34;tuxedo&amp;#34; cheesecake. It was phenomenal.", "rating": 3, "date": "10/25/2016"}, {"text": "The Cheesecake Factory is one of my favorite places to eat. The menu is enormous - I don&amp;#39;t think I&amp;#39;ve ever seen a bigger one - so you have a lot to choose from. The food is all delicious, and of course there are about a hundred different desserts. They also have a full bar and lots of specialty cocktails. I like the outdoor seating, and the place is open really late! They don&amp;#39;t close until 12:30 am on weekends and 11 pm on Sundays and during the week!", "rating": 5, "date": "8/25/2014"}, {"text": "The fish and chips  I have to  be honest very nasty and greasy i could not eat them!!!  Manager was very very nice and refunded the money .", "rating": 1, "date": "3/10/2018"}, {"text": "Usually love the food. But the service was a turn off. A half hour wait turned into over an hour wait. One would think when the buzzer rings your good but no we turned that in just to wait some more because the tables weren&amp;#39;t cleared or someone wanted to change their seats. A help wanted sign would surely help that. Food was okay but when dining at The Cheesecake Factory dessert is usually a big part of the meal right? The waitress asks do you want a dessert menu then immediately walks away before we can respond. And returns minutes later with the bill. Not good service at all!", "rating": 2, "date": "1/19/2018"}, {"text": "Now that they have every item calorically rate it spoils the whole experience! And who would eat the cheesecake st a whopping 1400 calories?  Terrible.", "rating": 3, "date": "3/1/2017"}, {"text": "I just had one of my worst dining experiences at this restaurant. My boyfriend and I had a table outside and waited for almost an hour for our food. I ordered the tomato basil pasta and he had the Steak Diane and salmon. When the food finally arrived, both our dishes were slightly cold and his steak was over-cooked. We told the waitress who took his dish back to the kitchen. The pasta wasn&amp;#39;t too bad so we kept it. Until I noticed there was a stray spaghetti noodle in the penne. We called the waitress over who had a long explanation of how it &amp;#34;happens all the time.&amp;#34; Finally, my boyfriend&amp;#39;s dish was replaced. The steak was not flavorful at all and not worth the money we paid for it. We finished our meals and left incredibly dissatisfied. We forgot about the whole experience until, a few hours later, my boyfriend began to experience a stomach ache and eventually developed nausea. Over the course of the next 10 hours, he has had intense stomach pain and threw up five times. He didn&amp;#39;t eat anything the entire day besides the steak dish which led to one conclusion: he got food poisoning from the Cheesecake Factory.<br&gt;<br&gt;If you&amp;#39;re in the market for food poisoning and a horrible dining experience, then I&amp;#39;d recommend this location. Meanwhile, I am in the process of filing a report with the local health department.", "rating": 1, "date": "8/11/2015"}, {"text": "Came here for Mother&amp;#39;s Day brunch. The wait wasn&amp;#39;t too long, appx 10 minutes. I would&amp;#39;ve rather waited longer at a better restaurant. I usually have a good experience here but this time, something was not quite right with the food. I ordered a brunch special- chicken and waffles with eggs Benedict. Sounds delicious right? Nope! The waffles were ok. The chicken was moist but was smothered in the hollandaise sauce so I couldn&amp;#39;t taste the flavor of the chicken. I don&amp;#39;t understand the little potatoes they give you as a side  why not regular size potatoes or hash browns? Anyway, my husband ordered a breakfast combo, pancakes, eggs and bacon. Nothing spectacular. The best part of my meal was the carrot cake I ordered to go. Despite the less than mediocre food, I&amp;#39;d still go back b/c their menu is so extensive that I could try something different each time and hope it tastes good. *the waitress was very nice and attentive.", "rating": 3, "date": "5/9/2016"}, {"text": "Did not enjoy it at all.  We went for our anniversary dinner and they sat us in the mall seating?  Who does that?  They did move us when i complained.  If I wanted to eat in a food court I would not have gone to a restaurant.  Had the appetizers and they were good then ordered the steak medium.  Steak came out rare and was very tough. Could not cut it at all. I mean you would have needed a saw to cut through this thing.  I was really looking forward to having dinner here paid over the top money for dinner and did not enjoy it at all.  They did not charge me for my steak dinner and did comp my desert, which ended up upsetting my stomach.  Needless to say  I would never ever go there again.  I&amp;#39;ve had better steak at Applebee&amp;#39;s in Bensalem for much less money and much better seating and have never left feeling sick.", "rating": 1, "date": "6/2/2016"}, {"text": "Cheesecake factory is extremely consistent as far as I&amp;#39;m concered. They also make a great burger for a reasonable price . Solid all around. Great service too.", "rating": 3, "date": "8/11/2015"}, {"text": "Very diversified menu. Excellent service. Leave room for dessert. Margot was our waitress and she treated us extra special as we were celebrating our 25th wedding anniversary.", "rating": 5, "date": "8/11/2015"}, {"text": "Didn&amp;#39;t even come here for an actual meal, just for cheesecake and while the cheesecake itself is fine, the speed of the service was a little much. It was difficult to tell where the line to order was with the crowd of people around the counter and after we ordered, it took 20 minutes just to receive a single slice of cheesecake (after also watching several people who ordered after us get their order before us). Wouldn&amp;#39;t recommend if you&amp;#39;re in a rush.", "rating": 1, "date": "3/18/2018"}, {"text": "Everytime I come here with great expectation! I love pasta and hibachi steak :) they also have great salted caramel cheesecake !!", "rating": 4, "date": "1/16/2017"}, {"text": "Not that great at all!   The place was not full at all and we were seated next to a wall!   Our food was only mediocre, but the worst part was the cheesecake counter!!!   Could not even get a slice of cheesecake in a reasonable amount of time!   Left without it and bought it somewhere else that was even better than I can get there!    This was my 3rd attempt to eat at this &amp;#39;upscale&amp;#39; place hoping to love it and disappointed every time.   The service was not good other times.    There are too many good places around to even consider going back!", "rating": 1, "date": "8/4/2017"}, {"text": "Dined here July 21. Around 6:30pm. Had salmon Alfredo. The chef used pure garlic no other seasoning. Very bland!!! Had to ask for seasoning. My friend had shrimp with the thin pasta and his noodles were stuck together!!! Clumps on his plate!!! He doesn&amp;#39;t believe in sending back. Shaking my head service was slow. Server never really checked on us. CCF falling off. Had to take my meal home to season it up. Then I believe it gave me the bubble guts!!!!  My cheesecake was good!!!! Shaking my head. Break time. Off to Bonefish I go.", "rating": 2, "date": "7/22/2015"}, {"text": "Great food nice sandwiches with changeable side options great pasta tacos enchilladas I love the shrimp scampi and steak Madeira nice drinks the appetizers are the best egg rolls crab cakes and fire cracker salmon", "rating": 5, "date": "4/24/2014"}, {"text": "Ok, Been here many times before. Must of ordered the HIbatchi Steak a dozen times. Usually pretty awesome. This time was Terrible. First of all it was missing the sauce that it usually comes with which I believe makes the whole dish. Second the meat was t uff and didn&amp;#39;t have any flavor to it. The dish was over loaded with to many Onions. Needless to say we were very disappointed.", "rating": 1, "date": "1/7/2018"}, {"text": "We enjoy our meals every visit! Most of the time I go with the eggroll sampler, which I have cravings for often. Another fave is the miso salmon, sauce is incredible! Hubby tries something different almost every visit, and is always satisfied with his food. Warm buttered wheat bread is also great!.. We never eat the white bread, just ask to substitute for extra wheat. <br&gt;<br&gt;Cheesecake is good, I have tried others here, but classic strawberry is my fave. Generous size, after dinner one slice is enough to share.. I was a bit disappointed to find out from a worker that the cheesecake is not made fresh there, it is delivered frozen. Considering it is the &amp;#34;Cheesecake Factory&amp;#34;.. But I guess that&amp;#39;s expected considering they are a chain. <br&gt;<br&gt;Ambience is nice, soft lighting and nice music. Although always super noisy and packed whenever we go. Our first visit we were seated at one of those tightly packed tables, very uncomfortable sitting so close to people on both sides, too intimate. We could hear the whole conversation of both parties. Now we always wait for booth seating even if it takes an extra few minutes. And if it&amp;#39;s a nice day out, outdoor seating is also much quieter, and you rarely have to wait to be seated. <br&gt;<br&gt;Food is reasonably priced and portions are generous.", "rating": 5, "date": "8/27/2016"}, {"text": "I had the worst experience here. The server was great, but my order came out completely wrong. The manager Jennifer was very rude, gave me an attitude and acted like it was my fault. Will never dine here again. Especially with the current manager on staff.", "rating": 1, "date": "12/28/2017"}, {"text": "Cheesecake choices galore. Their portions are big enough for a family of four. That wasn&amp;#39;t supposed to rhyme. <br&gt;<br&gt;Yummy treat and even an impressive dinner menu, but too many choices for someone who is easily overwhelmed (me).", "rating": 3, "date": "12/18/2013"}, {"text": "This place sucks. I really wanted to like this CKF but it sucks. I have come here 5-6 times and every time I am disappointed. We go to the King of Prussia. KOP CKF is better. It might be the chef. The Chicken Madera is terrible here.  This is my favorite dish. I wish a new owner took over.", "rating": 1, "date": "9/1/2015"}, {"text": "Nice place, service was very good too. Food was good although we just had burgers. Had 1 adult beverage and it was well made, daughter had the strawberry lemonade for $5 which was too sweet for me. All in all I liked the place but dinged it for the prices. In my opinion $110 for a family of 5 (3 adults, 2 kids) was a bit much.", "rating": 3, "date": "6/26/2016"}, {"text": "Friday night 945. Pretty busy but not jammed. 10 min wait. Taken to a table. Under the table someone had spilled a plate of saucy pasta and salad. It had been partially cleaned up. But there was still plenty on the floor to soil your shoes. An area a foot in diameter with a constellation of romaine pieces. We told the hostess. A guy came by with a broom and dust pan, which would not have cleaned up Pasta sauce. We told the multiple hostesses. Who had no comprehension or concern. We were willing to stay and asked for another table. The hostesses ignored that request. They were much more interested in their own social interactions. We spoke to the manger, who would have given us a different table, but by that time we just wanted to leave.  Sad. It&amp;#39;s usually pretty nice there and the food is generally excellent. Unfortunately, many of their staff--at least the 3 hostesses, a waiter and a waitress lack basic public service skills and accept mediocrity.", "rating": 2, "date": "1/11/2019"}, {"text": "Went to cheesecake Factory last night the host was very pleasant. After being seated our waiter came over to take our order he was alittle impatient with our decision to order our food we had a party of 7. We ordered appetizers we were told by our waiter that the buffalo wings were mild hot so my mother which is 91 yrs old could not eat them because they weretoo hot &amp;amp; my son ordered crab dip which was cold should been at least warm so my son asked our waiter to heat the dip up well when it came back out it looked like half of it was missing strike 2 my son &amp;amp; his lady informed our waiter that it appeared to be less now well our waiter got a attitude and snatched it off the table. Well we noticed his attitude. He never gave us his name. When my son food came out it had a long strand of hair on his plate we informed our waiter about the hair &amp;amp; asked to speak with the manager. We saw the manager speaking to the waiter &amp;amp; then they left well my son got upset that the manager took a while before addressing the problem at our table. The manager apologized to my son &amp;amp; offered to make him another dinner on the house. We also asked the manager to send us another waiter in which he did her name was Sharon much better service . Needless to say my son didnt enjoy his birthday dinner. Also my grilled salmon was dry &amp;amp; overcooked. Will not be going back to that one.", "rating": 2, "date": "11/28/2017"}, {"text": "Friday nite dinner celebration birthday with 12 people. They only said they could split party and couldn&amp;#39;t seat everyone together, but saw them set up to tables for 12....I had the lemon butter chicken..with asparagus and mashed potatoes...very delicious - asked for a generous amount of the lemon butter sauce...table said BBQ salmon and herbed salmon was good.  Pasta with shrimp was dry and shrimp overcooked. Tablemate didn&amp;#39;t enjoy it.", "rating": 4, "date": "12/22/2013"}, {"text": "I&amp;#39;m giving this location 4 stars because of its location.<br&gt;Afterall, everything is about location, location, location.<br&gt;Plus, it&amp;#39;s new. <br&gt;<br&gt;It&amp;#39;s new - It&amp;#39;s spacious for the most part. The &amp;#34;feng shui&amp;#34; of it is a little off. It&amp;#39;s like some weird geometric shape - you feel like you are in huge corridors (kinda like a V shape) instead of one big room.<br&gt;<br&gt;The service is okay. They seem a little bit flustered when taking your order - and I&amp;#39;ve gone more than a handful of times.  <br&gt;<br&gt;Bring a coat - it&amp;#39;s freeeezing. I went in the fall &amp;amp; winter of 2007. They apparently don&amp;#39;t turn on their heat - I was shivering every single time I went. <br&gt;<br&gt;Parking is great. <br&gt;<br&gt;Whenever I go to Cheesecake Factory - I always order the Corncake Tamales appetizer. This location&amp;#39;s presentation was ehhh..and the cakes were loose (still yummers though).<br&gt;<br&gt;Peep the pix.", "rating": 4, "date": "4/8/2008"}, {"text": "Went here today after church hoping for a delicious meal that Cheesecake Factory usually provides. I recently visited Cheesecake Factory in lawrenceville NJ and it was a very bad experience. I decided to go to the one in cherry hill nj and it was worse. First the meals took very long to come out and it was only chicken and shrimp that me and my family ordered. Second there were flies all over the restaurant constantly landing on my food and on our drinks. The floors,table and silverware were extremely dirty. I&amp;#39;m totally giving up on a great dining experience because these restaurants just don&amp;#39;t care anymore.", "rating": 1, "date": "8/23/2015"}, {"text": "Seated within 5 minutes on Sunday evening. Waitress came by several times until we were ready to order. Drinks within 5 minutes of order with free refills done without us asking. Food generous portions with prices in line with similar establishments.", "rating": 4, "date": "9/17/2017"}, {"text": "What can be said about Cheesecake Factory that isn&amp;#39;t already known. The food is overpriced and bland. The service is slow and terrible. The wait is obscene. Waited for an hour at 12:30 on a Sunday afternoon despite originally being told there would be little to no wait. How does this place even stay in business?", "rating": 1, "date": "5/1/2016"}, {"text": "The address showed on yelp is wrong but good taste! So enjoy! I order the old fashion burger, taste so gooood（＾＾）", "rating": 5, "date": "7/18/2015"}, {"text": "I don&amp;#39;t know what happen here but food has gone down the tubes. Salad was old and looked tasteless.  Kids fruit side was laced with sugar.  I plan to stop coming here and try other restaurants around here.  I love the brand but this location is sub par.", "rating": 1, "date": "1/18/2016"}, {"text": "Wow, this is way better than the KOP location.<br&gt;<br&gt;We came here last night for dinner (and granted it was like 4) and there was no wait. The whole restaurant has a really nice ambiance with the details on the ceiling and dim lighting.<br&gt;<br&gt;Our waitress was pretty cool too. We got everything in a timely manner and she was pretty good with refills on our drinks too.<br&gt;<br&gt;Plus the portions were very generous. I had the lunch menu portion of the margherita pizza and salad and wasn&amp;#39;t able to finish it!", "rating": 5, "date": "4/9/2011"}, {"text": "I been going to Cheesecake Factory for years, so I took few friends who never been there before the experience this time was definitely not 4 stars it was More like 2. First of all, our waiter was so in rush he didn&amp;#39;t show much interest until it was check time, very disappointed with service today. First 20 minutes we waited for bread and butter to show up!! Even that I had to ask him:( he was stopping at the table for split second and run to the next one!! He became all nice and sweet at the end, my friends were not amazed with either service or food. Cheesecake Factory used to be really good not sure what happened. I won&amp;#39;t be going to Cheesecake Factory near future.", "rating": 3, "date": "6/25/2016"}, {"text": "Service - bad service, took 30 min to get our bread, had to reach for another plate at a different table, waitress spilled steak plate sauce on my white ultraboost shoes and didn&amp;#39;t even notice.  <br&gt;<br&gt;Food -  It was good but it was not what I asked for.  I Ordered the steak Diane medium rare but received it medium well. It took 1 hour to receive our meals for a table of 5.  By the time the food came,  my dad had already fallen asleep. <br&gt;<br&gt;Experience - I didn&amp;#39;t have a good time eating at this cheese cake factory.", "rating": 2, "date": "6/20/2016"}, {"text": "Chicken Fettuccini Alfredo - creamy goodness mhmm. I love it soo much. I&amp;#39;ve only gotten that. The last time I was able to order a smaller portion. I love having that option! <br&gt;<br&gt;My friend got a pomegranate martini - she seemed to love it. And we both got a piece of red velvet cheesecake. OMG! Why does it have to be so good! I wish there was a location closer to my hometown of Bethlehem. I gotta try something different the next time but I just love the chicken Alfredo so much. I&amp;#39;m hesitant to try something new!<br&gt;<br&gt;We spent $30 each - only b/c I was being greedy and bough an EXTRA piece of cheesecake to take home.", "rating": 4, "date": "10/16/2011"}, {"text": "Aside from all the fancy dishes I just always get a ribeye steak medium well... it&amp;#39;s awsum and then Linda&amp;#39;s fudge cake just fyi your not gonna find a better steak and cake in the same place ever  service could be better but come in its always a full house there", "rating": 5, "date": "7/8/2015"}, {"text": "The hostess on Saturday night, 9/23/17, was atrocious. My husband and I stood there for a good 30 minutes observing how she treated the customers approaching the podium. She never once greeted them. She stated &amp;#34;name?&amp;#34; And then proceeded to hand them a buzzer. She looked as if she just woke up- hair was everywhere- just a complete mess. After one polite man walked away she mumbled &amp;#34;I should have went to church tonight.&amp;#34; Maybe if the owner would work on hiring professional and polite front staff, their ratings on Yelp would improve. I was embarrassed for her to be completely honest.", "rating": 2, "date": "9/26/2017"}, {"text": "This is our favorite go to restaurant for the abundance of great food and, of course, the cheesecake. But this review is about Betsy, our server today. She was excellent! On one of the busiest of days, it&amp;#39;s National Cheesecake Day, she took the time to explain some Factory business (Happy Hour!) which saved us a few dollars that we promptly spent on food and tip. The service is usually good, but today was exceptional and we will be back more often.", "rating": 5, "date": "7/30/2015"}, {"text": "Very disappointing overall experience. The server, Christine, took our order and we never saw her again after that until she brought over the check. <br&gt;<br&gt;I ordered the famous factory meatloaf which was okay but overly salty. I needed 3 glasses of water after eating it. (My water, since the server never came by to refill our glasses).<br&gt;<br&gt;I can&amp;#39;t understand how a place like this stays in business with such horrible service when the restaurant business is so competitive, When we complained to the manager, she stated that &amp;#34;we don&amp;#39;t get too many complaints here&amp;#34;. What kind of an answer is that? I don&amp;#39;t care about what happened in the past, the bad service is happening now.<br&gt;<br&gt;I&amp;#39;d pass on this one. Visit one of the better locally owned establishments instead.", "rating": 1, "date": "11/27/2014"}, {"text": "Beyond disappointing!! If I could give no stars...I would. It was the worst expensive lunch we ever had. The service was horrblie...we were forgotten and ignored. Food took over 45 minutes to come out and they were not even busy. <br&gt;<br&gt;I highly suggest that you ask the price of their alcoholic drinks before ordering. A 5 oz. daquiri should not cost $8.95 and could not taste any alcohol in it. And my watered-down-all- ice (even though I specifically told the waitress very little ice) sangria was $10.25!!!  I think I may have gotten about 3 oz.of drink, if that .And the six small pieces of cheese bread costs no where near to $8.95 - and charging $3 for seltzer water with lemon is outrageous. <br&gt;<br&gt;The portions were average to very little. The Asian Lettuce Wraps was bascially lettuce filled with rice noodles - the piece of chicken was literally 2 bites. The Chicken &amp;amp; Biscuits was served with burnt bottoms (biscuits). <br&gt;<br&gt;I know we could have complained to the wiatress but she was no where and I mean no where to be found the entire time we were eating.  We had to wave her down as she passed by to get our check.  She never came back for payment so I went to the hostess to pay - was informed she can not take payment and must pay the waitress. I explained we had been waiting for her to come back to our table for over 10 minutes. The hostess did not ask who our waitress was or offer to get her for us.  I took the opprotunity to air all of my complaints to the hostess. And, all we got was &amp;#34;Oh, I&amp;#39;m sorry.&amp;#34;  Really??  The manager was standing behind her as I voiced my complaints and did not say or do anything just ignored me - not even help with finding our waitress to pay our bill.   So, I actually had to track our waitress down in  the restaurant to pay the check. <br&gt;<br&gt;Definitely not ever going back!!!!!", "rating": 1, "date": "7/22/2016"}, {"text": "I tend to be fairly anti-Cheesecake Factory.  The portions tend to be big, caloric, and very mediocre.  I was pleasantly surprised when I stopped in for lunch the last time though -- they seem to have made some changes.<br&gt;<br&gt;You certainly can still get the &amp;#34;big as your face&amp;#34; type platters and their cheesecake, but if you&amp;#39;re just in for a regular lunch and not wanting to break your diet bank for the week, they have the SkinnyLiscious menu.  I ended up getting the shrimp tacos and was very satisfied.  They were very fresh and tasty -- filled with shrimp, avocado, and slaw among other things and you get three.  I was pleasantly full at the end of the meal but felt as if I had made a healthy choice.  I opted not to eat the huge side of rice.  I had one bite, but it wasn&amp;#39;t really good enough to be worth it.<br&gt;<br&gt;I also loved their mint iced tea.  I think I drank three when all was said and done.  Unsweetened but perfectly brewed and flavorful.  <br&gt;<br&gt;Our waitress was outstanding as well -- friendly and attentive.  I&amp;#39;d definitely think about going back now that they&amp;#39;ve add this menu!", "rating": 3, "date": "2/24/2013"}, {"text": "Place is empty.....waiting now 30 mins for breakfast.  Manager was very accommodating and made good on the services", "rating": 4, "date": "1/10/2016"}, {"text": "Honestly, it&amp;#39;s never my first choice... It&amp;#39;s always just so so and the service is hit or miss. I only go again because my 10 year old loves the strawberry shortcake dessert they offer. I did however have bad service the last time I was there which is unfortunate because now I don&amp;#39;t think I&amp;#39;ll return:(", "rating": 2, "date": "3/10/2015"}, {"text": "I love this place, the steaks are always perfect, every time I ask for a different meal I never get dissapointed, the service is amazing always and also the cheescakes of course. Also the prices are good. The only reason about the 4 stars it&amp;#39;s because they didn&amp;#39;t have spanish menu like in other restaurants and because the sangrias are kind of bad.", "rating": 4, "date": "12/28/2015"}, {"text": "When we first walked in, i fell in love with the high ceilings and architecture.  The dim lighting and beautiful colors were perfect.   The 45 minute wait, however, was not.  But, I am glad we did.  The food was amazing.  <br&gt;When the hostess sat us, i automatically wanted to leave- they cram you in there so close to other people that you can literally hear every word of the other peoples conversation.  (The couple next to us was fighting because she didnt want to go there and he should have known that!). But again, we dealt with it.  We ordered the chicken and mushroom lettuce wraps which were delicious an a great portion for $5.95.  After ordering our meals, the waitress came over to say she had a family emergency and she needed to leave but someone else would be taking over.  It was a nice and smooth transition.  Nothing went wrong.  <br&gt;I got the Steak Diane and Herb crusted salmon combination and dear lord, it was amazing.  That salmon was mouth watering.  My boyfriend got the pasta an chicken carbonara and loved it.  We were so full and wound up taking alot home.<br&gt;We still got dessert though!   I just got a bowl of chocolate ice cream- cant really mess that up.  My boyfriend got red velvet cheesecake and said the red velvet cake overpowered the cheesecake s bit but it was still good.<br&gt;I cant wait to go back.", "rating": 4, "date": "1/26/2013"}, {"text": "Definitely overrated, waited 40 min. to be seated in a dark dinning area ordered fried shrimp they were not real shrimp some processed version of shrimp fried extra hard so basically it was like eating crust no shrimp insight salty cocktail sauce and warm fries never ever going back not a fan of cheesecake but that must be the only reason  why ppl go.", "rating": 1, "date": "3/5/2016"}, {"text": "Food was awesome. I placed a an order for pickup. It ended up sitting for a while due to traffic. It was well over 30mins by the time i got home. I was too hungry to reheat it and it was still great. I would bet it would be even better fresh and hot. The strawberry cheesecake was great! Most places serve dry crumbly new york style, which i hate, theirs is the direct opposite", "rating": 5, "date": "8/9/2017"}, {"text": "Calamari and crab wontons were very delicious and remains consistent. My husband had grilled fish tacos, beans and rice. The beans and fish were well seasoned,  but the rice had too much cilantro. I had the teriyaki chicken with brown rice. Chicken was very dry. Our drinks hisbiscus martini and Long Island tea was well made and very refreshing.", "rating": 3, "date": "11/4/2015"}, {"text": "- wife received nuts in Greek salad and is severely allergic. <br&gt;- service slow <br&gt;- food downhill <br&gt;- hostesses are miserable <br&gt;Manager spoke with us about nuts in salad.  You&amp;#39;d think however that They would do more than just take salad of check when my wife could have died from their mistake.  The experience at willow grove has worsened over the years and attention to detail is not good.  Lost my love for Cheesecake Factory.", "rating": 1, "date": "4/26/2015"}, {"text": "Doesn&amp;#39;t matter lunch or dinner, we always get great food here.<br&gt;<br&gt;Knowledgable, friendly service in a clean environment.<br&gt;<br&gt;It is a bit loud, and there can be a long wait for a table, but it&amp;#39;s worth it for the consistent pleasure of dining there.  Substitutions don&amp;#39;t bother them.  We have ordered from all over the menu.  Great appetizers, burgers, pasta and chicken dishes.  Large portions.  Amazing desserts as to be expected.  <br&gt;<br&gt;Only gripe is that the children&amp;#39;s menu food is pretty bad.  The chicken tenders are too peppery, the mac-n-cheese is too salty.", "rating": 4, "date": "7/21/2013"}, {"text": "We went on a quiet Tuesday afternoon. The hostess didn&amp;#39;t say one word just grabbed the menus and started walking. We said thank you and nothing.  At our table there was food and silver wear all over the the ground. I wanted to leave but I was hoping for better wait service. Waitress was nice enough but nothing special. She screamed everything and rolled her eyes at every word we said. Also a group got sat right next to us when there was a 100 free tables. It made no sense. The food was the only saving grace, everything was delicious. Next time I&amp;#39;ll just do takeout so I don&amp;#39;t have to tip rude people.", "rating": 3, "date": "1/7/2016"}, {"text": "Most bartenders here are awesome.. Some however are not!!!!! Love the Mai tais and got two from a female bartender who filled it completely with juices! 10.75 a drink... Waste of money!!!! So upset because we always come here for the mai tais and can only drink 2-3 tops!! Had two she made and felt like I drank no alcohol! Ordered two more from another bartender and they rocked !!", "rating": 4, "date": "6/1/2015"}, {"text": "I was very pleased with my waitress. She was so friendly and came often to see if everything was okay. The food was delicious! We shared the avocado egg roll which was 3 nice sized rolls cut in half so total of 6 pieces. It was very tasty and warm. I got the bang bang chicken and shrimp which was also very delicious but there was not enough &amp;#34;sauce&amp;#34; to go with the gigantic scoop of white rice. And my sister ordered the bistro shrimp pasta which was soooo flavorful!!!! I kept eating hers!! I think next time I will just order carryout because there was about 1 hour wait and it was very crowded. And it&amp;#39;s always too loud in there for me. But other than that, everything was great!", "rating": 4, "date": "11/12/2014"}, {"text": "Cheesecake Factory has a large menu, I have barely scratched the surface.  I can&amp;#39;t say anything bad about this place. Obviously, their cheesecakes are great too!", "rating": 4, "date": "8/9/2015"}, {"text": "I love the location, but it was toooooo dark. I didn&amp;#39;t realize that  an awful waitress could mess up the whole ambience of a great meal. I am just sorry I tipped her. She had an aweful attitude. The bang bang shrimp &amp;amp; chicken was great. I also enjoyed my Morrocon mint tea.", "rating": 1, "date": "5/5/2014"}, {"text": "Let&amp;#39;s be honest, you only ever go here with cheesecake in mind.<br&gt;<br&gt;That said, I had a burger which was good, not great but not terrible. It&amp;#39;s pretty loud and cramped because they try to put as many tables as humanly possible (plus about 12 more) in the space, probably to account for the huge demand. Speaking of, we waited 1.5 hours to get a table for two. Not really worth it.<br&gt;<br&gt;What is worth it is the cheesecake menu. The slices are huge, though, so if you can agree on one flavor, just get one and share. Alternatively, take some home to eat while watching wedding shows on TLC on Friday nights. Or whatever it is you do--I don&amp;#39;t judge.", "rating": 3, "date": "7/16/2012"}, {"text": "I have been going to this restaurant since the 90&amp;#39;s (starting with the one in DC/Maryland area when I was in college). It has always been a favorite, BUT I just recently went to the one in Willow Grove Mall on 10/2/12 around 1pm so not too busy and had the calamari appetizer and a seared ahi tuna salad. <br&gt;<br&gt;The calamari had two onion rings and a piece of chicken all fried in the same batter in the order. It&amp;#39;s like some onions and chicken from another order fell into the batter and they just threw it all on the same plate. Disgusting?<br&gt;<br&gt;Then (and I can&amp;#39;t make this stuff up) my salad had a piece of thin turkey meat in it that the waitress said that they use for a different order.  Disgusting!<br&gt;<br&gt;I had the manager come over both times and he took both the calamari and the salad off of my bill. He was very pleasant about it and apologetic, but having said that I don&amp;#39;t think I will be going back because there is clearly something very wrong in their kitchen. <br&gt;<br&gt;No attention to detail.<br&gt;Reckless plating. <br&gt;Perhaps too busy<br&gt;<br&gt;Maybe I&amp;#39;ll try the new restaurant Bravo! next door.", "rating": 1, "date": "10/3/2012"}, {"text": "Only go here for dessert.  The Lemoncello cream cake is amazing!!!  However...... <br&gt;<br&gt;When this place first opened it was very good. I&amp;#39;ve had some awesome food here.  But a few years have gone by and now the place is terrible.<br&gt;<br&gt;  I was here a few weeks ago with my parents and items we had ordered before were simply bad this time. <br&gt;<br&gt; I got chicken tacos and I have to say they were the most tasteless things I&amp;#39;ve ever ordered at a restaurant.  No flavor whatsoever, not even salt! <br&gt;<br&gt;My mom got the southwest eggrolls which looked like someone hopped over to the nearest grocery store and picked up a pack of TGI Fridays frozen ones and popped them in the micro for a few minutes too long.  They were dried out, greasy little things and so spicy hot we couldn&amp;#39;t even eat them.  <br&gt;<br&gt;Not a good experience.  I probably won&amp;#39;t be back", "rating": 2, "date": "6/27/2012"}, {"text": "We ordered:<br&gt;THE LUAU SALAD: not so good. really lacked flavor. The wontons part was a little undercooked.<br&gt;THE JAMAICAN SHRIMP: this was actually pretty good<br&gt;SEAFOOD GUMBO: this was just ok.. was a little too creamy", "rating": 3, "date": "1/4/2013"}, {"text": "As much as I like their cakes and especially the strawberry shortcake, I don&amp;#39;t think I will ever be going back there. After having lunch one day, my husband and I decided to get some cake to go on the way out. Well, there was a man behind the counter and he was cleaning up and then tying a trash bag. He had gloves on--great! Except then, after another person took our order, the first man took out a to go box with the same gloves that he used to clean and tie the trash bag and picked up a slice of cake, (with those same gloves!) and put it in that box. Personally, I think that is unacceptable. <br&gt;<br&gt;Several months later, we came back hoping things have changed for the better. Did they? Only in my dreams, unfortunately. My husband came to pick up a to-go order of strawberry shortcake. The lady behind the counter didn&amp;#39;t know how to make it so she asked her co-worker; fine. However, there was about 1tbsp of strawberries left in their container so she poured it all out into the little box. My husband mentioned that it probably won&amp;#39;t be enough. She said, &amp;#34;this is how much we give everyone&amp;#34; after just minutes earlier saying that she didn&amp;#39;t know how to make it. AND, we&amp;#39;ve gotten strawberry shortcake before and it certainly comes with more than just 1 cut-up strawberry! The manager happened to walk by; she whispered something into his ear, he gave my husband a dirty look and walked off. Another man, who was cleaning the counters,  chopped up 2 more strawberries (without changing gloves or washing his hands) and added them to what was already in the container. Yuck. Then, he went, took orders, came back and with the same gloves, continued to put cakes for people; obviously he touched the cakes. <br&gt;<br&gt;I don&amp;#39;t know about anyone else, but personally, I don&amp;#39;t find it very sanitary to ties garbage bags, wash counters and then use the same gloves to touch people&amp;#39;s food. I mean, they&amp;#39;re gloves! You&amp;#39;re not even washing your hands, just changing them! Is it really that big of a deal?! <br&gt;<br&gt;I know some of you may think I&amp;#39;m making more of this than I should and maybe I&amp;#39;m a little too much of a germaphobe, but personally, when I see hygiene complaints on reviews, I avoid places because really, it&amp;#39;s unacceptable.", "rating": 1, "date": "8/6/2016"}, {"text": "I came here with my sister a couple weeks ago for dinner on Friday night. We had to wait 55 minutes for a table. When we got to the table it was those tables where everyone sitting next right next to each other like a lunch room table in grade school. This type of set-up gives you no privacy and you can hear everything the person beside you is saying. When having a conversation with my sister I had to scream because it&amp;#39;s so noisy. The waitresses never came by to see how we were doing or if we wanted something else. The person beside me got up to leave an knocked his drink all over me and  my jacket. We literally had to run down the waitress for the check. The food is not as great as it use to be but I really enjoyed the dulce de leche cheesecake. For the time, annoyance, and being placed with complete strangers while eating a meal I won&amp;#39;t be returning to the cheesecake factory. I really use to like coming here at this location 5 years but this place has lowered it&amp;#39;s standards. There many restaurants in the area that offer better customer service and food then this place.", "rating": 1, "date": "3/22/2018"}, {"text": "About a 20 minute wait at about 2pm. The fried shrimp with fries dish was good (kind of hard to mess that up) with Crunchy, well seasoned shrimp. The Cajun chicken over pasta was tasty, but the &amp;#34;Thai&amp;#34;bang bang chicken and shrimp was not good at all. It lacked seasoning..and was sweet, not spicy at all as I expected. The sauce had carrots, eggplant and squash and a ton of something which I think was toasted shaved coconut was all over the top...just don&amp;#39;t order this dish. The greeters were very pleasant and professional, even though the place was packed and some of the guests were annoying everyone else with their nonsense &amp;#34;you mean no one left since we&amp;#39;ve been here? I can&amp;#39;t believe we still don&amp;#39;t have a table..oh you texted us? We don&amp;#39;t have a text, we didn&amp;#39;t know you were going to text us&amp;#34; OH K...so you provided your phone number, they no longer provide pagers and you thought they&amp;#39;d inform you when your table was ready how?? Anyway...back to the review ..the waitress was fine in terms of bringing everything we asked for, but we only knew her name because we overheard her telling the customers next to us..and she&amp;#39;d ask one of our party if they wanted water or wanted a take away container and then dash away before the others could ask for water or a container too..The drinks were very good. Especially the passion fruit magaritas.", "rating": 3, "date": "11/1/2014"}, {"text": "I mean its the Cheesecake Factory! Delicious food! Huge Portions! Great Prices! Enough said!", "rating": 5, "date": "12/10/2011"}, {"text": "My boyfriend and I went here for dinner last night. It was good and I enjoyed that they had a large menu. One thing that really disappointed us was how close the tables were together. If you want to go here don&amp;#39;t bring a date cause you can&amp;#39;t really talk; you are not even 2 feet from another table. The food was good but not excellent. The only thing that was excellent was the waitress and the cheesecake.", "rating": 3, "date": "5/21/2015"}, {"text": "Beware! The Cheesecake Factory in Willow Grove PA has HORRENDOUS customer service. I ordered our meal to go. The server took the order properly, but the kitchen skipped one of the meals. When I picked up the order, the clerk at the register said it was never given and that I could order it then and pay for it so that I wouldn&amp;#39;t have to wait in line again. When I pointed out that the meal was written on the order, she did nothing to rectify the situation other than to want me to pay for it now so I could leave sooner when it was ready. I asked for the manager and explained the situation to him, and he was just as apathetic. Since I already had the other meals, why would I want to wait while they cooked the missing meal and have the other meals get cold? His reply was a shrug of the shoulders. The manager didn&amp;#39;t care that I would end up with either 3 hot meals and a missing meal, or three cold meals and one hot meal. He made no offer to alleviate the situation by offering a gift certificate for a later use to try to keep my business. I will not be back, as this isn&amp;#39;t the first time we have run into problems at this location.", "rating": 1, "date": "5/8/2016"}, {"text": "Gigantic establishment. Despite how busy they are - you still get a decent family friendly meal. And the cheesecake is swanky. Anne got the chicken and biscuits - it was awesome. Maura didn&amp;#39;t care for the corn dogs; not sweet enough for a youngling.", "rating": 4, "date": "9/8/2014"}, {"text": "Amazing food, amazing drinks, friendly and helpful staff what more can you ask for. Best lemon drop martinis.", "rating": 5, "date": "1/6/2015"}, {"text": "Love the Cheesecake Factory! Everything on the menu is delicious, I got the chicken Bellagio and I loved every bit of it. I usually get Chicken Fettuccine with sun dried tomatoes. Awesome service and even better cheesecakes!", "rating": 5, "date": "1/6/2014"}, {"text": "I don&amp;#39;t know why I look at the menu; I always order the chicken and shrimp spicy jambalaya.  It&amp;#39;s fantastic.  Of course the cheesecakes are all amazing.  The lemon torte is also just too delicious.  I&amp;#39;m not usually a huge fan of chains, but I do like this one.  The only downside is that some of the tables are placed way too close together.", "rating": 4, "date": "3/11/2015"}, {"text": "Food was good. Portions were large and flavor was good. Consistent with most Cheesecake Factory restaurants. It is a chain restaurant so you know what you get and you get what you pay for.<br&gt;<br&gt;Service was below par hence the two stars. Didn&amp;#39;t have any dessert since the waiter seemed like he wanted to rush us out. It was early evening on a weekday with plenty of tables so not sure what his rush was. Better for me since I missed the 1500 calorie slice of carrot cake.<br&gt;<br&gt;Based on other reviews and my experience, seems like poor service is a theme at this restaurant.", "rating": 2, "date": "10/15/2012"}, {"text": "This restaurant is very well managed! We went on a very busy Saturday night. Waitress was excellent, great selection, food came out promptly and was very hot and delicious! Desserts were the best!", "rating": 5, "date": "3/26/2017"}, {"text": "Always a plus when we finish our day at The Cheesecake! The menu is very accommodating to the whole family&amp;#39;s taste buds. Don&amp;#39;t come often; quite expensive! Nice for birthdays, especially when they sing to the little ones!", "rating": 4, "date": "2/19/2015"}, {"text": "Our large party was excited to sit outside on a perfect fall day, but we had to move inside due to the stench of the sewer nearby. However, the staff quickly moved us inside. The food was delicious, except for the over-priced and tasteless grilled artichoke. $11.50 for perhaps a tablespoon of artichoke!  Our server was quite cocky and gave us our desserts in takeout containers since he said we&amp;#39;d probably only eat half. This was true, but it felt like a picnic, eating our desserts out of to-go containers WITH PLASTIC FORKS.", "rating": 3, "date": "9/25/2016"}, {"text": "Went here for dinner on a Wednesday night (9/12/2012).  <br&gt;<br&gt;Wasn&amp;#39;t terribly busy, but my waitress was obviously very busy.  <br&gt;<br&gt;Went simple and had a Cobb salad and an iced tea.  The salad was probably the biggest I&amp;#39;ve seen in my life - absolutely huge, easily serves 3 people for a meal.  Seriously.  Taste was alright - nothing to rave about, nothing specific to complain about.  <br&gt;<br&gt;Picked up a slice of Oreo cheesecake to go - definitely tasty.", "rating": 3, "date": "9/13/2012"}, {"text": "I use to love this place, and I haven&amp;#39;t been in a while. We decided to go for my daughters birthday, her choice. It was 9 of us, in the party plus 2 babies.  It took them almost  20 minutes just to bring our drinks out, and most of the beverages ordered were water, and coffee.  I ordered an appetizer and a salad with the dressing on the side.  After waiting almost 40 minutes for our food, it finally comes out and my appetizer came out with my entrée, and my salad came out fully dressed.  My sons kids meal which was just chicken fingers and fries came out maybe 10 minutes after mine with no fries.  I had to call the waitress over, and tell her about my food coming incorrectly, and the fries, and her attitude was basically oh well.  She went to get the fries for my son, and than we never saw her again until it was time for the check.  She never even asked if we wanted dessert, I mean it is the cheesecake factory! We had to ask her.  The service was so bad, the food wasn&amp;#39;t good, the only thing that saved the day was the cheesecake.  I will not be returning at all!!", "rating": 1, "date": "8/21/2016"}, {"text": "i got the fried macaroni and cheese balls...and they were COLD in the middle. i mean like ICE COLD!!!!!!!!!!!!! EW!!!!!!!!!!!!!!!! this place used to be amazing...it has gone DOWN HILL. go to carrabas...so much better....", "rating": 1, "date": "11/23/2016"}, {"text": "Worst omelette ever.  Food is bland and overpriced.  Go to the west ave grill in jenkintown if you want a good omelette.  $3.95 for a glass of lemonade.", "rating": 1, "date": "12/18/2015"}, {"text": "Worst service and experience ever, manager didn&amp;#39;t care server either, we are 5 people they bring the food one by one, said have a mix up in the kitchen, waitress very slow. When we got the food my steak was red I guess they rushed. We called for the manager and sounded like he didn&amp;#39;t care .", "rating": 1, "date": "8/29/2015"}, {"text": "Wow, what a great time and awesome food. The staff was really top notch. They were friendly and helpful. They made suggestions so that my wife could choose her meal. The food was to die for. I would totally recommend this place to anyone. We will be back.", "rating": 5, "date": "8/12/2015"}, {"text": "Ahh the cheesecake factory...whats not to like about the expansive menu to choose from... there is something for everyone...the key is to either order something to share with another member of your party or order from the small plates and snacks section which is like tapa style dishes... planning ahead my friend, will allow for adequate space in your belly for some yummy dessert.<br&gt;<br&gt;These are my absolute favorites... <br&gt;1. Reeses Peanut Butter Chocolate Cake Cheesecake<br&gt;2. Chocolate Coconut Cream Cheesecake<br&gt;3. White Chocolate Caramel Macadamia Nut Cheesecake<br&gt;<br&gt;I&amp;#39;m a huge fan of left overs... so the larger portions are not an issue for me :)", "rating": 4, "date": "7/9/2011"}, {"text": "Let me first say that the food was tasty and prepared as we ordered it;  however that is where it ends.  <br&gt;<br&gt;The table was cramped, we might as well have been seated with the 4-top next to us.  It was so tight that orders had to be passed to my date that was sitting in the booth part of the 2 person table.  The server had to take our order from behind me because she couldn&amp;#39;t get between the tables to properly speak to us, which lead to the major issue.  Since the server couldn&amp;#39;t get between the tables to properly deliver the food to the table, she had to hand a extremely hot plate to my date, which was so hot it burned her fingers.  In an instance the plate was dropped onto the table breaking the drink glass, and spiling all over her and the table.  What a mess! <br&gt;<br&gt;Now I understand accidents happen, but to barely get an apology was a little disappointing.  The way it was nonchalantly handled I was actually surprised they even took the cost of the replacement drink from the bill.  It was like nothing happened.  I highly doubt that I will be back there, because no matter the quality of the food, service is paramount and that was severely lacking.", "rating": 1, "date": "3/29/2011"}, {"text": "My friends would probably disown me for only giving TCF 2 stars.  This tends to be our destination for birthday and celebratory dinners when the group of us is 10+ and includes people who aren&amp;#39;t legal drinking age.  <br&gt;<br&gt;It&amp;#39;s probably because every one likes cheesecake.  <br&gt;<br&gt;It is NOT because:<br&gt;You get sat right away.  (you don&amp;#39;t.  ever.  expect to wait, it&amp;#39;s unavoidable.)<br&gt;Their drinks are cheap.  (they&amp;#39;re not, but it&amp;#39;s to be expected at a chain.)<br&gt;The service is great. (i&amp;#39;ve only had one okay server here.)<br&gt;Everything on the menu is good.  (some things are delicious, but the &amp;#34;hit&amp;#34; percentage is really low when you take into account all of the items on their menu.)<br&gt;Seating is comfortable. (seating sucks.  especially for big groups.  the whole booth side/chair side thing really sucks.  especially because no one has been able to master the whole &amp;#34;equal height&amp;#34; thing with chairs and booths yet in the restaurant industry.)<br&gt;<br&gt;i don&amp;#39;t hate it here, i just wouldn&amp;#39;t choose it for myself.  i still go every time my friends do.  if you go and dare to get anything OTHER than cheesecake, i highly recommend the carrot cake.  it&amp;#39;s probably the best thing i&amp;#39;ve had off of their menu.<br&gt;<br&gt;they don&amp;#39;t do reservations or call ahead.  if you&amp;#39;re planning on eating with a group of 6 or more, it&amp;#39;s usually best to get one loser--er, volunteer--to head over at least an hour early to put your name in.", "rating": 2, "date": "3/11/2009"}, {"text": "In high school, my school had an exchange program with a school in England. We decided to take our British exchange students here. We thought they&amp;#39;d genuinely enjoy the food here. Instead, they spent the entire time taking pictures of everything like the portions at the Cheesecake Factory were some sort of American landmark like the Liberty Bell or the Statue of Liberty. They didn&amp;#39;t actually realize that Americans genuinely eat at the Cheesecake Factory, accept that the portions are ridiculous,  and it&amp;#39;s not really a novelty. <br&gt;<br&gt;But really, if you want gigantic portions of reheated, bland food that&amp;#39;s about 4,000 calories a serving, without having to wait 45 minutes for a table, maybe try sticking a few sticks of butter in the microwave for a few seconds. It&amp;#39;s basically the equivalent of the food at the Cheesecake Factory.", "rating": 1, "date": "12/4/2011"}, {"text": "A 90-minute wait on a Saturday night. They give you a plastic device that vibrates when your table is ready.<br&gt;<br&gt;Luckily, or unfortunately, the joint is attached to the mall, allowing you to wander to Sbarro&amp;#39;s for a quick slice to hold you over on your wait. Or, you could go to Circuit City and check out some liquidation sales. The choice is yours.<br&gt;<br&gt;We went to Ruby Tuesday&amp;#39;s for some drinks. <br&gt;<br&gt;The lobby outside of the Cheesecake Factory is kind&amp;#39;ve like the airport when there&amp;#39;s a delayed flight. Bodies lying on the ground and looking around in despair, just hoping their plastic stick vibrates soon. <br&gt;<br&gt;Once we got our table, you are treated promptly with an excitable waitstaff. We had Kevin, or Dan, or Jimmy -- I forget his name. Helluva waiter though, especially since he had to deal with my lame jokes.<br&gt;<br&gt;I can&amp;#39;t recall the decor there, other than the lavish glass light fixtures. It&amp;#39;s quite dark in there, but the waitstaff are all dressed in white like ghosts. <br&gt;<br&gt;There is a miniscule bar, and if you&amp;#39;re fortunate enough to get a spot you can chill out and watch sports in HD. <br&gt;<br&gt;The bathrooms are delightful. Definitely try it out.<br&gt;<br&gt;They serve butter with your bread. I prefer oil, but sometimes you just have to take one for the team.<br&gt;<br&gt;I got the Thai Chicken Pasta, and even though it&amp;#39;s not a Thai restaurant, it was surprisingly averagely decent. <br&gt;<br&gt;The service is fast and the entrees arrive all at the same time and extremely hot. The portions are quite large. You may be walking around with a dainty doggy-bag aftewards, so be forewarned. <br&gt;<br&gt;Loads of Cheesecake options for dessert. If you like a Snicker&amp;#39;s bar crumpled up into a cheesecake, they got it. Oreos? No problem...Huge thick-ass slices.<br&gt;<br&gt;Long story short, if you have 3 hours to kill and like to amble about the mall aimlessly in doubt as to whether you&amp;#39;ll actually get your table, then this is the place for you. If you want a quick bite to eat, I suggest the Food Court.", "rating": 3, "date": "1/25/2009"}, {"text": "Funny... I have yet to get to the &amp;#34;cheesecake&amp;#34;.<br&gt;<br&gt;I went to the Cheesecake Factory today for brunch/lunch. The first thing that turned me off was the dirty knife at the table which had dried on spinach on it (or something green). While I must say the menu options are almost endless, that would only be impressive if the food was good.<br&gt;I ordered one of my favorite brunch items, Eggs Benedict. There is only one word to describe this... YUK!!!! The hollandaise sauce was so lemony that the &amp;#34;tang&amp;#34; of the sour sauce actually turned my stomach. The potatoes served with the eggs was a brown mush. I think there were supposed to be like hash browns, but the consistancy was more like mashed potatoes. To top it off, nothing on my plate was hot. <br&gt;<br&gt;My boyfriend ordered a &amp;#34;built your own omelette&amp;#34; which did not come with the ingredients he requested. His meal also was room temperature.<br&gt;<br&gt;What a disappointment!!! While it is hard to find good restaurants to have brunch at, I guess I will have to keep looking.", "rating": 1, "date": "3/22/2009"}, {"text": "The waitresses were very attentive and friendly, the service was speedy, and the food was great. Do not leave this place without trying one of their cheesecakes! Their Chocolate Tuxedo Cream Cheesecake really hit the spot - yum~", "rating": 4, "date": "2/5/2012"}, {"text": "The Cheesecake Factory seems to have a very... tough audience here.  The fact that there is a long wait to get seated shouldn&amp;#39;t be a surprise to anyone that has ever seen one and so, to me, is something you accept when going there.  While I have been seated quickly once or twice, it&amp;#39;s generally a half-hour to forty-five minute wait to be seated.  Given the selection they have it ends up being well worth the wait to me.<br&gt;<br&gt;The Cheesecake Factory is more like an upscale diner in my opinion.  Their menu is as varied as a diner and the atmosphere can be very entertaining and noisy.  The differences though come when you actually get your food.  Huge portions that have never failed to satisfy me along with a price point that won&amp;#39;t kill your wallet.  I can safely recommend around two dozen items on the menu but, I would say the best things I&amp;#39;ve had on there are the Chicken and Biscuits along with the Double BBQ Bacon Cheeseburger.  If you&amp;#39;re a nut that loves to indulge when it comes to eating out, grab one of those two entrées!<br&gt;<br&gt;I don&amp;#39;t think there is a need to talk about the cheesecake here.  While I&amp;#39;m a fan of their cheesecakes (the Adams Peanut Butter especially), they sometimes overdo it with alternate flavors and, to be quite honest, their plain cheesecake can&amp;#39;t top a regular slice of New York Style... and that&amp;#39;s how you judge a cheesecake.  I find that Cheesecake Factory&amp;#39;s plain cheesecake is a little too creamy and it doesn&amp;#39;t have enough solidity to it.<br&gt;<br&gt;I&amp;#39;m a big foodie and I&amp;#39;m always looking for places with great food, and the reviews here make me feel kind of main stream by giving this place a 4/5... but whatever   I&amp;#39;m not big into standard chain restaurants such as Olive Garden, Fridays or Applebee&amp;#39;s, but this place gets my vote.  <br&gt;<br&gt;The wait?  Get over it, you expected it!  The food?  Better then you&amp;#39;re giving it credit for!  The atmosphere?  It&amp;#39;s loud but its fun!  Yes, I truly love this place!", "rating": 4, "date": "3/12/2009"}, {"text": "The food was great but the portions were HUGE. Of course, the cheesecake was amazing.<br&gt;<br&gt;The place is also huge and it is crowded and loud. The ceiling are like 30 feet high and there is tons of space but they still had the tables crammed together so they could fit even more people. My fiance and I ended up getting our dessert to go because we couldn&amp;#39;t take the noise any more.", "rating": 2, "date": "11/14/2008"}, {"text": "I was fortunate to get a complimentary ticket to a private seating at the new Cheesecake Factory that is opening in the Willow Grove Mall.  <br&gt;<br&gt;My review is as follows:<br&gt;<br&gt;Cold - Service in getting food was slow - Our waitress was very nice and on top of things (acknowledged &amp;amp; apologized for the delay) - Food was EXCELLENT.<br&gt;<br&gt;So if you have to go, wear layers ... don&amp;#39;t be in a hurry to get in and get out ... enjoy the meal when it finally arrives!", "rating": 4, "date": "9/21/2007"}, {"text": "I got the grilled shrimp blt and it was really good. I think everything on the menu here is really good, tho. I think it&amp;#39;s pretty safe to say there are no bad dishes at The Cheesecake Factory. If there is something wrong, it&amp;#39;s not a problem to exchange it for something else either.", "rating": 4, "date": "12/27/2013"}, {"text": "I&amp;#39;d suggest you find somewhere else to eat. If you like crowded places and cheesecake, you might be okay. The food options were great, but the food is rather bland. (The only obvious exception is the cheesecake) While their menu was worldly, their spices and cooking style were not.  I value quality over quantity, because I&amp;#39;d rather have a few cups full of delicious pasta rather then pounds of over cooked boring pasta.<br&gt;<br&gt;During another attempt, we called for the to-go service that brings food to your car. We arrived 15 minutes earlier than the time they said it would ready. And ended up waiting more than an hour to get our food. Eventually we went in, and the service person was no where to be found, but our bag was ready, they gave it to us COLD. <br&gt;<br&gt;Eating in or out, it&amp;#39;s just not a fun experience. I&amp;#39;ve given it a few good tries, so take my advice and find somewhere better.", "rating": 2, "date": "2/24/2009"}, {"text": "Don&amp;#39;t go for brunch.  Overpriced and the quality of food was lacking.  The service was horrible, coffee luke warm and there are many other places which would be better worth your time. <br&gt;We have been there for dinner many times with a different experience.", "rating": 2, "date": "1/29/2012"}, {"text": "Great value for the money. Service is always dependable, food is always fresh, portions are plentiful, restaurant is high energy, other than the long wait (wish they did call ahead seating or reservations)...I always look forward to dining here! My favorite is the mac &amp;amp; cheese balls. (not to be confused with the fried cheese).  Variety of menu choices and prices could fit in any budget.", "rating": 5, "date": "1/30/2011"}, {"text": "Do you go here for anything other than the Cheesecake? <br&gt;<br&gt;That is why you go. I&amp;#39;ve been to this location many times. It is close and unlike a lot of Cheesecake factories, it does not always have a super long waiting list/line. <br&gt;<br&gt;The menu is way too large, including the drink selection menu. <br&gt;The food, you have to spend a lot of time reading through unless you know what you want other than cheesecake. <br&gt;The location can be loud like most cheesecake factories I&amp;#39;ve been at. So do not expect a quiet evening if you come here. <br&gt;<br&gt;The setting is contemporary and clean. <br&gt;And make sure you do not eat too much. The Cheesecake is worth it.", "rating": 3, "date": "5/17/2010"}, {"text": "When I first came to the Cheesecake Factory in willow grove mall I was very Impressed from the moment I walked in the Restaurant looked fantastic, the servers Were all smiles and polite and very nice to be around they make you want to stay longer, and the food was Superb I ordered the fried macaroni and cheese (which is my favorite Appetizer to order there I order it all the time) and I also ordered the fried macaroni and cheese burger and it all was cooked to perfection I wish I could have ordered it four or five more time it was so good. To anyone who reads my review you need to go to the Cheesecake Factory in willow grove it&amp;#39;s the best!!!!!!", "rating": 5, "date": "5/1/2013"}, {"text": "Willow Grove Cheesecake Factory was excellent. The food, service, and the atmosphere was great. <br&gt;<br&gt;I got the fried mac n cheese. And I got the Pasta Carbona it was great..<br&gt;<br&gt;Def wasnt a fan of $4.50 strawberyy lemonade which sends you into a sugar coma I had to dilute with water but it was good despite it <br&gt;<br&gt;Also carrot cake cheesecake is the BEST", "rating": 4, "date": "10/24/2010"}, {"text": "Generally like Cheesecake Factory and have been to this one and several others many times.  Came in after the crowd was thinning, around 9 PM.  Seated within a few minutes.  Having seen a friend order the fries well done, I did the same.  Ordered the cheeseburger medium rare.  When the food was delivered, the sogs were not cooked well and were soggy, so I sent them back.  As soon as the server left, I cut the burger and it was raw, so it went back.  (Meanwhile, the waiter comes over to ask how our food was and I told him both items on my plate were prepared wrong.)  My wife always has the Santa Fe Chicken Salad, but tonight it was sub-par as well -- not enough dressing, corn or avocado.  Well, the fries came back and were golden and crisp -- also nice and warm.  About 20 minutes later (and the waiter saying he had checked on it), the burger came back and it was cooked to perfection as well.  Had to ask to get a refill on my iced tea, which is very unusual for Cheesecake Factory.  <br&gt;<br&gt;No real apology from the waiter and no visit from a manager.  Not offered anything off the check or even a piece of cheesecake.  In fact, I think the waiter was ready for us to leave, since he did not even offer dessert when I asked for the check.  <br&gt;<br&gt;Next time at the mall, plan to try Bravo next door.", "rating": 2, "date": "11/2/2013"}, {"text": "Right off the bat this place is great. The staff, decorations, the vibe and the drinks are cool and inviting. My family and I (party of 10) had a dining experience here that we would never forget. We ordered a ton of food with a very friendly server who helped my nitpicky Asian family with great recommendations. All was going well until we found a dead fly in one of our pastas. These kind of things happen and we just let our server know, nicely asking for a replacement. The server told us that the pastas dish will be free of charge and put in an order for another one. The problem was that the replacement came out after we had all finished our meal (about an hour later). And when we saw our bill we were charged for TWO pasta dishes. I asked the server about it and she brought the manager. After arguing for a bit the manager took off ONE of the pasta dishes off our bill and made us pay for the other dish that came out an HOUR after, when we had already finished our meals. He seemed very rude and condescending to my parents and my sister-in-law&amp;#39;s parents who were visiting from Korea and are not good at English. I STRONGLY urge people not to dine at this place. I am truly disappointed and will never eat here again.", "rating": 1, "date": "7/14/2016"}, {"text": "I used to rave about this place back when you couldn&amp;#39;t ever find it. There was one in King of Prussia and one in South Jersey and I would be excited to go when I got the chance.<br&gt;<br&gt;Sure the cheesecake is the thing to get, but I am not the biggest cheesecake eater so it&amp;#39;s not that big of a deal to me. Besides, if you eat dinner here, sometimes it&amp;#39;s impossible to stuff anything else in your stomach once it&amp;#39;s time for dessert.<br&gt;<br&gt;When I used to go, we would get the buffalo bites...they are great. They had some cold spring rolls that were pretty good too.<br&gt;<br&gt;The last time I went to one, it was this Willow Grove Mall location. one day I went in just for cheesecake with a girlfriend and our kids during off-peak after lunch hours. It was fine.<br&gt;<br&gt;Then I went for dinner with my husband and the kids and I was disappointed with the kids&amp;#39; food. The mac &amp;amp; cheese was like macaroni noodles coated with butter...where was the cheese? The kids were being picky and didn&amp;#39;t even want the grilled chicken. What is irritating is I had to order the kids&amp;#39; chicken w/ broccoli and the macaroni separate...why can&amp;#39;t mac &amp;amp; cheese be a side? It was a HUGE bowl of oily/buttery mac &amp;amp; cheese. I guess it tasted alright but I find it disgusting to serve all of that as a meal.<br&gt;<br&gt;My fish tacos were pretty good, I was happy with them. The beans were a bit overspiced, I like heat and all, but the fish tacos were spicy as it was, then the beans but the killer was the spanish rice. I hated the rice...my mouth was already on fire and here the rice was spicy too and they put peas and carrots and corn in it. I could understand a little corn for a southwest touch but peas and carrots in spanish rice? Gross. As far as the spice goes, they could have at least put some sour cream on the plate. Even the guacamole was spicy. And I never got a refill on my water....huge pet peeve. Good thing I had a beer with my water.<br&gt;<br&gt;My husband didn&amp;#39;t really like what he ordered. I can&amp;#39;t even remember what it was now....guess it was forgettable.<br&gt;<br&gt;I don&amp;#39;t know if it&amp;#39;s related or not, but my kids got a stomach bug a day or so after we ate there and it was not pretty. I hope there wasn&amp;#39;t any bacteria from the restaurant&amp;#39;s handling or food prep, but I have no way to decipher how my kids got sick, but they don&amp;#39;t go to school and didn&amp;#39;t get out much that week.<br&gt;<br&gt;What a shame...usually I liked the place, but we didn&amp;#39;t have kids with us and we ordered appetizers before. I remember that the Italian and pasta dishes were pretty good though.", "rating": 3, "date": "5/24/2010"}, {"text": "I&amp;#39;m a big fan of the Cheesecake factory. The food is always good and I&amp;#39;ve never had a bad meal there. The con is there is always a wait, but I believe it is worth it. While we were waiting, we had tropical martinis at the bar and they are my favorite! <br&gt;<br&gt;We were a group of three and ordered the following:<br&gt;Appetizer - Sweet Corn Tamale Cakes - one of my faves! <br&gt;<br&gt;Barbeque Burger - cooked well done but was still juicy and delicious.<br&gt;<br&gt;Chicken Enchiladas - pretty good. large portion and took over half of it home. Sauce was good but rice didn&amp;#39;t taste like spanish rice to me. Tasted more like a garlic &amp;amp; herb rice mix. Not a fan of the rice. Order this dish and ask for double beans instead.<br&gt;<br&gt;Crusted Chicken Romano - chicken cooked very good and was tender. Potatoes were tasty. <br&gt;<br&gt;Dessert - Reeses Peanut Butter Chocolate Cheesecake. I usually like my cheesecake plain, but I was out-voted that night. It was really good and the chocolate cake part of the cheesecake was very moist. Everything tasted fresh.<br&gt;<br&gt;Our waiter was excellent and super attentive. Had a nice personality and had fun with us. I think his name was Andy but I&amp;#39;m not sure.<br&gt;<br&gt;The cheesecake factory is a good place if you are looking for something familiar to eat with consistency. We were traveling from out of town and happy to see that they had a Cheesecake Factory there.", "rating": 4, "date": "12/31/2010"}, {"text": "The Cheesecake Factory in the Willow Grove Mall is good for a chain restaurant. It is a solid representation of the chain. <br&gt;<br&gt;The restaurant is clean, the food is well cooked, the waitstaff is friendly. <br&gt;<br&gt;Most of the menu choices that I have tried have been pretty good, although nothing has been great. My favorites are the Cajun Chicken Pasta and the Cuban sandwich.<br&gt;<br&gt;The wait time for a table here can be rediculous however and I don&amp;#39;t think the food is necessarily worth the wait. <br&gt;<br&gt;If you&amp;#39;re looking for a decent meal, it&amp;#39;s a safe choice.", "rating": 3, "date": "12/27/2010"}, {"text": "When I was going to Arcadia U. I would frequent this location often with my girlfriend. The staff was always attentive and the food was rich and flavorful. If you are into chain restaurants, this is one of the best.", "rating": 4, "date": "8/8/2013"}, {"text": "I don&amp;#39;t ever choose to come here, but my friend wanted to celebrate her birthday here. The vegan cobb salad was pretty darn yummy. I was happy to find something filling and fairly delicious at a chain restaurant that hardly caters to vegans while celebrating a friend&amp;#39;s birthday.", "rating": 3, "date": "2/12/2016"}, {"text": "Definitely NOT worth the hour plus wait.  Food is below average.  Service is average at best.  There&amp;#39;s no atmosphere.  And the prices are high.  Save yourself and your wallet - eat dinner somewhere else, and buy a slice of cheesecake to go if you must.", "rating": 1, "date": "9/5/2015"}, {"text": "This is a highly reliable place to eat almost any meal. First time trying the brunch, the Monte Cristo is excellent. I would normally rate The Cheesecake Factory a solid 4 stars but the service was top notch, the brunch divine and it simply qualifies for the &amp;#34;upgrade&amp;#34; to 5!", "rating": 5, "date": "9/5/2011"}, {"text": "Reliable, not too-over the top (maybe on desserts...) place for dinner. Good for kids as the noise level is pretty high, decent service, and a nice bar.<br&gt;If going with a group, I&amp;#39;d recommend ordering lots of appetizers, eat that, and then decide to order dinner plates. It&amp;#39;s easy to fill up fast.", "rating": 3, "date": "5/19/2011"}, {"text": "Came here last night for my girlfriend and I&amp;#39;s anniversary. As always the Cheesecake Factory was packed, but we were seated in a timely manner. We walked in gave a name and waited for about 5 minutes. After we were seated and browsed the menu for a minute, we were greeted by our waitress who was very nice and had a good knowledge of the menu, but was a tad slow, we started off with two drinks the Georgia Peach and Caribbean Cooler. Both drinks were very appetizing, but they could have been just a little stronger. We started off with two appetizers the Spicy Ahi Tuna Roll and the Avocado Egg rolls, which were very delicious. For entrees my girlfriend had the Chicken Madeira and I had the Bang-bang  Chicken and Shrimp, we both tasted each others dishes and they were fabulous. The portions were huge, my dish tasted so amazing with the coconut and curry flavors and my girlfriends chicken was very tasty and bursting with flavor. For dessert we took home the OREO Dream Extreme Cheesecake, that was just to die for! All in all our experience was good service was good, but somewhat slow, the drinks could have been stronger, and the food was very tasty with enough for take home boxes.", "rating": 4, "date": "5/18/2013"}, {"text": "I went on a weeknight, and it might have been the first time I ever went to a Cheesecake Factory and didn&amp;#39;t have to wait for a table. The server was very attentive and the food was good and plentiful as usual.", "rating": 4, "date": "5/6/2013"}, {"text": "Delicious food and wonderful service. I had the crazy carrot cheesecake and I can&amp;#39;t wait till I go back for more.", "rating": 5, "date": "12/21/2013"}, {"text": "The food can be hit or miss sometimes, but the appetizers are usually always good.  The fried mac and cheese is the best, a must get.  The mint iced tea is very good also.  The service is usually always good, even when they are busy.", "rating": 4, "date": "7/20/2013"}, {"text": "A resounding &amp;#34;Meh.&amp;#34; The wait was crazy, but this was expected. <br&gt;<br&gt;The food was pretty good, but not anything to write home about. While our waitress was very good, she seemed overworked. The seats felt very mess-hallish and cramped together. <br&gt;<br&gt;Decent, but way overpriced for what we got and not a very comfortable dining experience.", "rating": 2, "date": "5/21/2011"}, {"text": "This was my second time to visit the Cheesecake Factory.  My first was a few years ago and I was unhappy then, but I had received a gift card now so we decided to revisit.  We were very disappointed.  From my hibiscus martini that was so sweet it was barely drinkable to our dinners of shrimp scampi, we were sorely disappointed.  The only bright spot was the shared pot sticker appetizer.  It was delicious. The shrimp in the shrimp scampi dish ( we both ordered the same entree) was breaded.  Breaded shrimp scamp?  Unheard of!  The only clue that it was shrimp is that it looked like shrimp because there was no shrimp taste.  Absolutely awful.  I&amp;#39;ve learned my lesson- don&amp;#39;t come back, ever", "rating": 1, "date": "12/26/2014"}, {"text": "This place is a zoo!  Especially last night because of the half priced cheesecake.  The reason i find this place annoying is the reservation system. They ask for a cell number and text you when your table is ready.  However, after putting in my request and standing around for 20 minutes there were couples that came in after me and gave a name.  These people were seated 10 minutes before me.  It is a bad system.  On top of that i ordered cheesecake to go.  They put the wrong cheesecake in the bag.  That was very disappointing.  How hard is it to pack up the correct cake?  I would go back but would try for an off peak time", "rating": 3, "date": "7/30/2015"}, {"text": "I usually stay clear of chains, and ate here reluctantly the first time, but really like this particular cheese cake factory.  My wife and I have eaten here about a half dozen times over the last few years and every time has been excellent.  My wife usually gets the fish and chips and I usually get a pasta dish. Today I had pasta with grilled chicken, tomato, fresh mozzarella and pesto.  wow, was it good.", "rating": 4, "date": "11/13/2010"}, {"text": "I always thought Cheesecake Factory was overrated, and I still do..but oh my GOD do they have a lot of food!!  I never saw a menu that came in a book of 10 pages+.  <br&gt;<br&gt;The selections are definately not for picky eatters.  I&amp;#39;d advise to go there if you truely want to try something different, are adventurous, or you just like &amp;amp; appreciate food in general.  They have tons of things from different pastas, to seafoods, burgers, steaks, low-cal food, &amp;#34;small dishes&amp;#34; (which are still fairly moderate sized)...Each section has it&amp;#39;s own page or two.<br&gt;<br&gt;I can see where the pricey-ness of the food comes in.  They have decent to large sized portions and the presentation of the food is quite nice.  It&amp;#39;s not just thrown on the plate like your food would be at an average family restaurant.  Unfortunately, I only voted 4 stars BECAUSE it&amp;#39;s pricey, but don&amp;#39;t rule that out as your only reason for not going.  If you got extra money to spend &amp;amp; want to try a new dining experience, go to Cheesecake Factory.  I think you&amp;#39;ll be surprised with the food &amp;amp; the service. :)  Speaking of service, there were really REALLY nice people working there from the ushers to the waiters/waitresses.  The food &amp;amp; drinks were served in a timely matter, and the entire atmosphere of the place ..well it was good!  It felt open and didn&amp;#39;t feel pinched in with the people at the next table.<br&gt;<br&gt;(FYI - I went to the one in WIllow Grove Park Mall)<br&gt;<br&gt;Oh!  And if you end up disliking the food, that&amp;#39;s fine, but NEVER say the cheesecake is aweful!!  It&amp;#39;s awesome!!!!<br&gt;<br&gt;Oh, also for the people that are talking about long wait times.  I don&amp;#39;t know what the hell time of day they went, but my family &amp;amp; I got seated right away &amp;#39;cause we went during the lunch hours (around 3pm approx.)", "rating": 4, "date": "4/14/2010"}, {"text": "The service was okay. I&amp;#39;m not a really cheesecake fan but I really liked it.  The food is in big portions and I was unsure about how the Orange Chicken would taste but it was really good.", "rating": 4, "date": "3/6/2013"}, {"text": "This place has great food and clean ambiance.  The possible problems come from how super busy it always seems to be!  It&amp;#39;s often loud (especially if you aren&amp;#39;t in a booth).  The staff try very hard to be attentive but seem really overworked.  The wait time is often close to 45minutes.  And the price is somewhat up there.  But the food is worth all of this! And that&amp;#39;s why we keep coming back.", "rating": 3, "date": "7/5/2013"}, {"text": "Great place Great service we love Fried Mac &amp;amp; Cheese my son was like the sauce more that fried mac &amp;amp; cheese ball. I order the Bistro Shrimp Pasta if you don&amp;#39;t like a small shrimp don&amp;#39;t order that because I didn&amp;#39;t know that their will give me a small size of shrimp but it was great though<br&gt;my pasta was so sour but I think that is the taste for that place. Anyway everything was great last night. Next time I&amp;#39;ll order something else to try.", "rating": 4, "date": "1/4/2011"}, {"text": "The Cheesecake Factory is very good. The portions are incredibly large but I don&amp;#39;t mind packing up the leftovers and eating them the following day. As with any restaurant some of the servers are better than others.  The Godiva brownie sundae is delicious and also huge! Great for sharing!", "rating": 4, "date": "6/16/2013"}, {"text": "Me and good friend went to Cheese Cake factory this evening , the seating time was excellent but the service and the managers response had allot to be desired. The waitress brought things to our table a little at a time, she asked us if we wanted bread rather than just bring the bread to the table as most waitresses/waiters do.. She answered about a dish my friend had had before even knowing if the dish was available. The last straw was when we both asked for cheesecake, the carmel pecan, my friend had hers brought out to the table where I opted to take to go. My friend told me that tend to give you a larger piece of cheesecake when you order it to eat in but I didn&amp;#39;t believe it. Well, she was right. When I asked the waitress about it, she said she would have to get her manager. It took about 10 minutes before the manager, Allie, appeared. When I told her what the problem was, at first she said she didn&amp;#39;t the other slice of cheese cake, my friend showed it to her, then she began to say it was pre-sliced and all were the same size, which clearly you could see that wasn&amp;#39;t true. Then to make a bad matter worst she got loud with me and said if I didn&amp;#39;t want it they would remove it from my bill which she did. Very disappointed with the service and the manager. I will NEVER return to that Cheese Cake factory in Willow Grove again.", "rating": 1, "date": "5/23/2015"}, {"text": "Eh.  I&amp;#39;m torn.  I&amp;#39;ve been here a few times, and returned just for the portobello mushroom sandwich.  Service has always been good, and I really love the Godiva cheesecake.  However, my most recent visit was pretty horrible.  To begin with, our server was really rushed and kind of snide when we asked about gluten free selections (the boyfriend is gluten intolerant to the point of breaking out) and seemed to care a lot more about the table of drinkers next to us.  Then my beloved sandwich was no longer on the menu.  I ordered a chicken sandwich instead and it came out a little pink.  I ended up eating just the fries and the complimentary bread.  My boyfriend had the Sheppard&amp;#39;s pie and reported that the sauce was &amp;#34;weird&amp;#34; and &amp;#34;tangy&amp;#34; but that it was an ok dish.  Our service throughout the meal was perfunctory, and our check was slow to arrive.  We opted to get takeout cheesecake for an event tomorrow night and the take out woman was very friendly and efficient.  <br&gt;<br&gt;Bottom line: Mediocre dinner/excellent desert for too much money.", "rating": 3, "date": "10/13/2012"}, {"text": "I would think based on their menu and the wait time that this place would have really great food but neither my boyfriend or I enjoyed our meals. The service was not good at all but our appetizer, the fried macaroni and cheese was awesome.", "rating": 1, "date": "10/28/2012"}, {"text": "Great restaurant, great service, great decor, etc. Took the four of us right away. Good time was had by all. Melissa and I have eaten at 5 of these restaurants now.", "rating": 4, "date": "4/18/2013"}, {"text": "Love this place!  The service, the food, everything.  We tend to sit at the bar - the bartenders are amazing!<br&gt;<br&gt;Favorites - Sunrise Burrito, Factory Burrito, Sweet Potato Fries, Santa Fe Salad", "rating": 5, "date": "1/5/2013"}, {"text": "I use to love the cheesecake factory years ago. Went to this particular franchise and it was not the best experience. Our appetizer was undercooked, the presentation of our main courses was sloppy and for what we actually ordered, the pricing was pretty high. I basically decided to never go back. Not worth the cash....", "rating": 2, "date": "9/1/2012"}, {"text": "This is likely more about Cheesecake Factory in general than about the one at Willow Grove Mall, but I was not impressed.<br&gt;<br&gt;Food was way too fancy and overpriced, and I wanted actual cheesecake which was not to be had.  There was Turtle Cheesecake and Red Velvet Cheesecake and this and that...and what I wanted was Cheesecake, just good old (New York Style?) Cheesecake without the bells and whistles.  <br&gt;<br&gt;Way too loud and way too dark, as well.", "rating": 2, "date": "11/24/2011"}, {"text": "Review solely based on this restaurant&amp;#39;s reservation policies. Tried to make a reservation for a group of 12 and was refused. Arrived at the restaurant and was told it was a 2 hour wait. Received a text 3 hours later that our table was now ready - after our group had ate, drank, and paid a $900 bill elsewhere. Never going back even if it was free.", "rating": 1, "date": "3/10/2015"}, {"text": "My boyfriend and I came here for dinner yesterday and the whole experience was terrible. We were told the wait would be around 20 minutes, but it ended up being closer to an hour. There is only one set of benches so we were stuck standing in the crowded lobby. Our buzzer finally went off signaling that our table was ready, but then we were told to wait in a line of 10 people and wait for the hostess to call our names. I don&amp;#39;t know why they didn&amp;#39;t wait until the hostess was ready until they buzzed us. Finally we were sat at a table, but it was not inside the restaurant. It was out in a cafe area in the mall, which I didn&amp;#39;t like. We ordered a hot cheese and spinach dip as an appetizer, but when it came out it looked like they just poured milk on top of spinach and forgot to add any type of cheese or anything to make it thick. My boyfriend ordered the mac and cheese burger and it came out all soggy because there was grease pouring out of it. The actual burger was so black that it was inedible. We left feeling very disappointed that we had to pay for a meal that we didn&amp;#39;t even eat.", "rating": 1, "date": "2/13/2017"}, {"text": "Ordered four dishes- all were overpriced. .The herb crusted salmon was a little too mild for me. The shrimp was overcooked in the Jambalaya pasta as was the chicken. The Thai pasta was very good.  Louisiana pasta was lacking ingredients I had in the dish at other restaurants- which primarily sausage- it just had chicken.  We waited for more than an hour to get seated. A &amp;#34;one and done&amp;#34; establishment for me.", "rating": 1, "date": "10/12/2011"}, {"text": "This place was amazing until the last time I went. Before, the waitresses were nice, and every dish I had in the evening was good (the thai pasta, the bang bang chicken and shrimp, the orange chicken, etc). However, the last time I was there was for lunch and the waitress was NOT friendly. barely made any eye contact. Would ask us if we wanted more stuff and then never brought them out. If it were up to me, I wouldn&amp;#39;t have tipped her, but the people I was with were just too nice. The food they ordered was tasteless, and mine didn&amp;#39;t taste as good as the first time I had it. Definitely not coming back if they&amp;#39;re this inconsistent, I&amp;#39;d expect more from a place that charges $17 a meal...", "rating": 3, "date": "8/19/2012"}, {"text": "Went for dinner, and since it is a chain, felt I would have a nice dinner with my friends.  This location was way too loud, from music to the diners yelling over it to talk. Then add the &amp;#34;wandering whispering waiters&amp;#34; and our dinner was not fun at all. The waiter came, we had to ask him to repeat several times (and no, we are not in need of hearing aides, yet); and then worried if he understood what we wanted.<br&gt;<br&gt;The food was good. It usually is. We said no to dessert, no prolonging this meal and skedaddled quickly. <br&gt;<br&gt;Sad, as we have enjoyed great meals at other locations. Doubt we will be back...", "rating": 2, "date": "8/12/2012"}, {"text": "Food is great! You get sooo much! I always have to take home some. The drinks are great as well. The staff is always friendly and fast. If you go I recommend a booth or ask to sit in their outdoor area. I don&amp;#39;t like to rub elbows with a stranger while I eat. Great place to eat!", "rating": 5, "date": "2/8/2015"}, {"text": "For the third time The Cheesecake Factory in Willow Grove got my takeout order wrong. The expensive entree my daughter ordered came without 2 items and the seasonings. I picked up the phone and reported the problem to Joe (the evening manager responsible) and after reviewing the facts and confirming the order and the fact it was the third time Joe said he would send me out a 25$ gift card. I even reminded Joe &amp;#34; to not forget me after we hang up the phone&amp;#34; He assured me he would not but guess what? Yep after 2 weeks no gift card. Again I let the other two errors go but when a third happens I expect the responsible management follows through on their commitments. Should I bother getting take-out anymore much less eat in the Resturant. Word to the wise check your take out orders closely. C&amp;#39;mon Joe follow through!", "rating": 2, "date": "11/4/2014"}, {"text": "The food is always good as is the service, but... the manager can learn a thing or two.<br&gt;<br&gt;The place is usually busy, with long waits, so I called about ten minutes before arriving and asked about the wait. The young lady on the phone said &amp;#34;No wait, come right over.&amp;#34; Upon arrival, I noticed throngs of people standing and waiting for tables.<br&gt;I waited my turn and asked about the length of the wait. I was told less than 30 minutes by the hostess at the desk. I explained about my calling earlier and how i was told that there was no wait. She insisted, it was not possible and that was mistaken. I showed her their phone number on my phone to document that I called.<br&gt;Forty-five minutes later, still no table. I asked to see the manager and explained what happened. I said that his staff should not tell people, that call, that there is no wait, when they call in advance. I also explained that I was told, upon arrival, that the wait would be thiry minutes and that it was now over forty-five minutes. The Manager applogized. That was it! He didn&amp;#39;t offer to seat us or look into it. Just an appology and a blank stare. Unacceptable! At least offer to look into what happened, offer us a glass of wine, a complimentary appetizer or a free dessert. Perhaps, the Cheesecake Factory, and its Management, should consider how it handles dissatisfied customers. There are plenty of other good restaurants in the neighborhood. I intend on taking my business to somewhere that appreciates it.<br&gt;<br&gt;Signed,<br&gt;A Miffed Customer", "rating": 2, "date": "1/30/2015"}, {"text": "Food was ok. Ordered the bang bang chicken and shrimp and wasn&amp;#39;t impressed at all. The rice was dry, and the dish barely had any sauce. It was covered with coconut and peanuts, so the little sauce it had was covered with dry toppings which made it worse. The buffalo blast appetizer was very good. And I got the red velvet cheesecake. The red velvet cake was good, didn&amp;#39;t like the cheesecake or the cream cheese frosting on it. The waitress was nice and very friendly. I&amp;#39;ll give it another try. But maybe go for the salmon or a burger.", "rating": 3, "date": "7/14/2014"}, {"text": "I went in March for my bday.., the best experience I ever had . The shrimp and chicken Alfredo was bomb  and the appetizers were great . In spite of it being really crowded the customer service was awesome... The waiters were really nice and fast ! I love it", "rating": 5, "date": "8/8/2014"}, {"text": "Went here for the first time and was very pleased. The staff was friendly and worked very hard at giving us great service. The food was very good and the deserts were wonderful. we will return again when we are in the area.", "rating": 3, "date": "9/6/2012"}, {"text": "I love this place. The the service is always good and anything I&amp;#39;ve ever ordered was really good. I&amp;#39;m very picky about where I eat.  I&amp;#39;m not big on chain restaurants but love this place", "rating": 5, "date": "8/5/2012"}, {"text": "First Impressions: <br&gt;Note this was my first and last visit to the Cheesecake Factory. <br&gt;<br&gt;When you first pull up to this Cheesecake Factory you are greeted by an enormous gold stucco building with a lot of windows. It over shadowed the Ruby Tuesday&amp;#39;s a few doors down. There is a nice sized patio with heat lamps and street lamp lighting. Upon walking through the doors you first notice the high vaulted ceilings. It took everything I had not to scream Hello, just so I could hear my echo. One reviewer said they were 30 feet high. The next claimed them to be 40 feet high. I am going to jump out on a limb and say they were 52 and 1/2 feet high. <br&gt;<br&gt;The floors are of limestone and the upholstered cherry wood high booths claim some privacy. The lighting is very contemporary with amber shades on the walls and tapestry skylights. Huge columns are scattered about with amber shades of light glowing. <br&gt;<br&gt;To the right is a massive sized, glass encased counter with more cheesecake than one could ever dream about. Straight in front of you is the hostess desk. To your left is the large open dining room and the very small, yet decorative bar. Get there early to secure a stool. The lounge area has high top tables with stools. <br&gt;<br&gt;A little Cheesecake Factory History: <br&gt;<br&gt;There are over 161 Restaurants with over 50 kinds of cheesecakes. The Grand Lux Cafe is a subsidiary of theirs. The CCF was the first restaurant chain to reach a billion dollars in revenues with fewer than 100 restaurants in operation. The first CCF was opened in Beverly Hills, Ca. in 1978. Evelyn Overton sold her first Cheesecake in 1949. She baked them in her basement for restaurants and her husband Oscar handled the sales. They then opened a small shop in their home town of Detroit, Michigan. After her children were grown and gone, she and her husband moved to Los Angeles. The rest is history. <br&gt;<br&gt;Our Experience: BYOF <br&gt;<br&gt;Our server was very friendly and informative and greeted us almost immediately. Since there are over 200 items on this menu, It was like reading a textbook. She was patient with my needing to read every item. With all to choose from, we probably ordered all wrong. I started with the Baked Potato Soup. It was loaded with veggies, cheese and bacon. It was on the brownish side and tasted old and burned. We shared Fried Zucchini as an appetizer. They were your typical frozen and fried zucchini, nothing special. The ranch dressing that was served with it was unbelievably sweet. It did not compliment the zucchini at all. Hubby had a Cheese Burger, $10.95 and said wow when he first got it. He was not thrilled once he started eating it. The patties were preformed and frozen prior to cooking. With the burger came a large amount of ice cold shoestring fries. I ordered a MR Filet.  It took so long, I knew it would be over cooked and hubby and I both think the server knew too. I cut into it and it was MW. Goofy looking Filet too, flat and almost as big as the plate?! She took it back and brought me the MR. I must say it was flavorful and tender. I opted for Mac &amp;amp; Cheese as my side. I know, I am so silly. The Mac &amp;amp; Cheese was one step up from Kraft. When she presented the check, she had taken the Filet off. Portions are large, prices are as high as their ceiling. The Filet was $34.95 and I am not at Ruths&amp;#39; Chris! We took our piece of Key Lime Cheesecake and Carrot Cake home. The desserts are very good and I would consider using take out for desserts only. They also ship Cheesecakes via Federal Express.<br&gt;<br&gt;Three managers sat together at a high top table in the Lounge.  One young attractive server entertained them the entire time of our visit.  Not once did I see a manager get up to greet or check on a table.  All three were very young and I am sure there for the easy paycheck.  <br&gt;<br&gt;If and when I ever receive $50.00 in Gift Cards for the CCF again, I will order Cheesecakes to go. That is how they started. That is what they specialize in and they do know how to do it right. <br&gt;<br&gt;As for the 200 menu items, it is a chain, what did you expect? Come on Toni, come and say &amp;#34; I told you so! &amp;#34;  ;+}<br&gt;<br&gt;My Dipping sauce for Fried Zucchini, Onion Rings, Fried Mushrooms:<br&gt;<br&gt;1 part mayo, to 1 part sour cream, to 1/2 part horse-radish.", "rating": 2, "date": "2/19/2009"}, {"text": "This place is the BEST, simply the best!!!!  I have been here with my friends, family, for birthdays, and with my grand-mom!!! I have Been coming here ever since it opened like 6 years ago and always enjoyed the food! The Place is so well decorated and food is wonderful. I always left that place saying what a good time I had and how wonderful my food was. I would recommend this place for breakfast, lunch, and dinner!  Lets not forget the Cheesecake is the best part!", "rating": 5, "date": "10/10/2012"}, {"text": "Well well well, I finally made it to the CCF in willow grove. Heard a lot of good things about this place so i decided to pick this one tonight for our outing with family and friends 8 of us and 1 infant. OK, let&amp;#39;s start with the wait! My daughter goes to the desk and tells the lady that we have a party of eight and a baby. She gave her this gadget that would notify us when our table would be available. She told us about 45 minutes and that we should venture the mall and wait on the page from them, here&amp;#39;s the problem, I came to eat tonight! Not to go shopping or browsing! I was hungry! The plan was a night out for dinner. Neither the less, my husband whine up in Macy&amp;#39;s and come out with a bag! Wow! A new jacket. Now, 2 hours later we finally get a page! Thank you! Somebody heard my stomach! So we all gather at the desk waiting to be escorted to our table. Guest what? That took another 15 minutes! Go figure! So now about the service, which I would give 3 stars to because we had to ask the waiter to remove our dishes after the appetizers. We where so crammed at our table we just didn&amp;#39;t feel comfortable, too tight. For starters we ordered hand battered onion rings, which I&amp;#39;ve had better, the buffalo chicken wings where spicy hot at first bite but, after a few more bites you become use to it.not bad though, had better wings at Bennie the bums in the northeast. The crispy crab bites where pretty good i would definitely order them again.Now for the main course my husband and I ordered the beef ribs which came with skinny crispy onion rings and French fries which was surprisingly good! The meat on those ribs where falling off the bone! Very good taste too. Our other guest ordered fettuccine Alfredo chicken which was to bland for my taste. The Kobe burger looked overcooked, dry. The barbecue salmon was ok, but I don&amp;#39;t think we would order that again. The bang bang chicken and shrimp was just as bad! I see we will have to choose from the menu more wisely. The chicken Bellagio was tolerable. But let me add this one last thing, the 35th anniversary cheese cake was to die for! Man I would ride all the way back here just for a slice of that cheesecake! Will we go back? Yes, will we order the same thing, uh, no. Except for them darn ribs! Boy they where good! <br&gt;Enough said.", "rating": 2, "date": "9/27/2009"}, {"text": "took my family to the cheesecake factory in the willow grove mall. Had heard wonderful things. But wasn&amp;#39;t totally impressed. The foot doors and the 40 foot ceilings are a way out of control. Why would you want to do this to a restaurant? This is more like a dance club. <br&gt;The service was pretty good. The place wasn&amp;#39;t crowded, but was active. The prices were pretty high, but the amount of food they give you is beyond eatable in one sitting. Not sure if eatable is a word, but I think you get my meaning. <br&gt;Seems weird, but the menus were very difficult to read. Not the print or design, but the advertisements and order. Every time you turned a page, you saw a listing of food and a full page add for something. Jewelry, cars, whatever. I found that tacky. Combined with the overdone decor, It wasn&amp;#39;t my favorite atmosphere. But no big, to food was good. Except for the burger. My daughter ordered the Fun burger, which sounded fun. Actually, it&amp;#39;s just a big mac, but looked really good. Unfortunately, they didn&amp;#39;t cook it enough, and my stomach was turning all night. Yeah, I eat off everyones plate. mmmm.<br&gt;Anyway, if you go, make sure to order your burger well, be ready for a big tab, and a big meal.", "rating": 3, "date": "4/15/2008"}, {"text": "This is not a 5 star restaurant, but it deserves 5 stars for the something-for-everyone menu.  If you can&amp;#39;t find something to eat here, then apparently you solely enjoy eating dirtballs.  What restaurant can you find nachos, pasta, pad thai and chicken dumpings all on the same menu?  Seriously...you can right here at the Factory.  It&amp;#39;s VERY busy.  Expect to get a &amp;#39;pager&amp;#39; and shop for a bit.  If you leave here without getting cheesecake, you will be sadly mistaken.", "rating": 4, "date": "9/3/2008"}, {"text": "Went there for lunch. <br&gt;The menu is insane there is about 30 things to choose from. Ended up with the biggest burger I&amp;#39;ve seen (it had steak strips and bacon on top..ridiculous) my date had the Navajo Chicken sandwich.<br&gt;My burger was great, her sandwich was ok.<br&gt;Drinks are good.<br&gt;<br&gt;Great chain not too expensive, beats Applebee&amp;#39;s  or Chili&amp;#39;s any day of the week.", "rating": 4, "date": "9/19/2009"}, {"text": "Usually decent service at this location but waited 25 minutes for someone to acknowledge/wait on us. It was 4:25 on a Sunday evening and not particularly busy. The thing that irked me was that I&amp;#39;ve yet to hear from management, even tho I wrote about my experience on their corporate website. Not planning on going back anytime soon.", "rating": 2, "date": "5/25/2014"}, {"text": "The Cheesecake Factory is a good place to go if you are meeting a group of people.  There is something on the menu for everyone.  I highly recommend the fried mac and cheese appetizer.  It was amazing.  Of course the cheesecake is always good too.  Definitely be prepared to wait for a table.  Cheesecake Factories are pretty much always busy.", "rating": 3, "date": "3/8/2011"}, {"text": "This place is always packed no matter what time of the day.  I got their carrot-cake cheesecake.  Oh well, that is so good.  $7 a slice is a lot, but it is so worth it, plus the whipped cream doesn&amp;#39;t come from a can.", "rating": 4, "date": "2/21/2011"}, {"text": "Been awhile since my last visit, so stopped in over the weekend for a mid-day lunch while shopping.   It&amp;#39;s never NOT crowded, but since there were only two of us, we were seated immediately.  The word &amp;#34;Factory&amp;#34; is exactly what this felt like -- get &amp;#39;em in feed &amp;#39;em quick, and get &amp;#39;em out so that we can turn tables over.  Our server was harried from the moment she took our drink order (took her a good 10 minutes to even acknowledge us!), there was positively no eye contact during the entire visit, and absolutely no warm and fuzzy coming from her.  I did like their expanded &amp;#34;skinny&amp;#34; menu (which is what I ordered from, as did my dining companion).  I had the chicken salad sandwich, which was OK.  My companion had a salad, which was also just OK.  Between the noise level, the hustle and bustle, the impersonalization of our server, coupled with the fact that they clearly want you in and out as quickly as possible, I think they hit it right on the nose with &amp;#34;Factory.&amp;#34;  Oh, we did not have cheesecake at this particular visit - maybe I would have left in a better state of mind??  Hmmmm.....", "rating": 2, "date": "3/11/2013"}, {"text": "Pretty good.  I went with my girlfriend and her family to this location only.  I&amp;#39;ve never been to any others.  The mushroom soup was good and the salad was Ok for me.  My sandwich was standard fare.  Our non-alcoholic drinks were fine as well.   Overall, decent experience but we were too full to eat cheesecake so we ordered a couple of slices to take home.  Could have been a little cleaner but the service was good so no complaints here.  Would go back for just the cheesecake maybe in the future.", "rating": 3, "date": "9/7/2010"}, {"text": "I was really surprised to read so many negative reviews. While this is not my favorite restaurant around, I like it a lot.<br&gt;<br&gt;I guess I&amp;#39;m not a real adventurous eater but I always get their chicken Caesar salad. The bad part of that is that it is way too large to eat in one sitting. Even their &amp;#34;small&amp;#34; is too large to eat. But it is delicious. The dressing is very tangy. I also sometimes get a side of mac &amp;#39;n&amp;#39; cheese. If I recall correctly, it is penne pasta. I like it although it&amp;#39;s not as good as the homemade baked kind. Many times I was too full for dessert but I did manage to try the dessert a couple times. I think I had the Snickers at least once. I am a cheesecake fan and a Snickers fan so it worked for me.<br&gt;<br&gt;The menu is huge and can be overwhelming. The jewelry ads and whatnot are kind of strange in the middle of the menu, but whatever. The menu is immense so there should be something for everyone.<br&gt;<br&gt;The service has always been decent for me. I love the location and that I don&amp;#39;t have to go to King of Prussia anymore. I&amp;#39;ve experienced the long wait many other reviewers referred to but I&amp;#39;ve always been in there and seated fairly promptly, at less busy times I guess.<br&gt;<br&gt;So I say give it a try.", "rating": 4, "date": "2/24/2010"}, {"text": "Went to cheesecake factory, had great lettuce raps and satisfactory nachos. Services was spotty at best, but I got to sit down at the first come first serve bar tables so I was happy. Overall pretty good.", "rating": 3, "date": "7/7/2010"}, {"text": "For a typical food chain the restaurant is very well run and clean. Service is on the ball. I like the outdoor area during the summer time.", "rating": 4, "date": "3/22/2011"}, {"text": "This rating is primarily for the service at the Willow Grove Cheesecake Factory. I was there for my aunt&amp;#39;s bday party with my  last Friday night which is typically an extremely busy night for any restaurant. The staff was extremely friendly and helpful to our party. I will start by saying that my aunt is bound to a wheel chair, they were helpful in making sure our family was seated in area with enough space for her and her wheelchair, moving tables and chairs to do so. Our party was also pretty large, about 15 ppl, and they were extremely helpful and accommodating with that as well. One of my cousins brought along her 2 toddler age children, who broke a plate halfway through dinner and made a mess. The staff cleaned the mess up quickly and with no attitude and were so nice to the kids during the process. Any requests that we made were quickly and accurately fulfilled for us! I don&amp;#39;t usually write yelp reviews but felt extremely inclined to do so after this fantastic service that helped to make my aunts birthday extra special! I have a very big and loud family that can usually find a reason to complain about any and everything but there were no complaints about the service this night. Thank you for the wonderful dining experience!", "rating": 5, "date": "3/11/2013"}, {"text": "First time at The Cheesecake Factory. Waited about an hour when we came in at 8:45 pm. Bad thing is that they don&amp;#39;t take reservations, good thing is that you can walk around the mall to pass time. For anyone who plans to eat here, do come an hour early to get your name on the list. Once seated, the fresh bread the server gives you will be heaven in your mouth. Especially the wheat bread. Now upon looking at the menu, it is a large selection and all the food choices looks good. Even for those who want a healthy/low cal meal can have enjoy this place. The size of the entrees are huge but also that the prices are higher so this is a good deal. Don&amp;#39;t order too much apps because you must save room for their delish cheesecake. You have to try one at least when you are here because this place is known for their cheesecakes. So overall, this place is good for large groups on special occusions because the wait time will be long.", "rating": 4, "date": "1/5/2015"}, {"text": "I had a horrible time today at this location. I typically got to Grand Lux in Cherry Hill but decided to take a trip here. My waitress was horrible. She didn&amp;#39;t give any suggestions when my husband asked if they served certain items. She took forever to come back to the table to check in while we were reviewing the menu. She was in the back area of the patio talking to another waitress when she could of been checking on our food. Btw was cold when I got it. My potatoes that we&amp;#39;re apart of my meal were hard as if they had been microwaved. I didn&amp;#39;t get hollandaise sauce on my food and she asked me did I want it and I told her YES! So between the food and service I had a horrible time. My husband was just ready to leave. I really feel like we wasted our hard earned money on a disgusting meal. And the server should have known we didn&amp;#39;t enjoy it with the amount of food we had left over and I told her that it was &amp;#34;trash&amp;#34;.", "rating": 1, "date": "9/6/2015"}, {"text": "my rating is solely for the cheesecake. <br&gt;****do not come here for the food*****  the food is terrible.   well not terrible but really not that good.  i would give the food a 5/10.  i get a different entree every time i go and consistently they have all been lackluster.<br&gt;<br&gt;the cheesecake however............INSANE!!!!!!!!!!!!  the best dessert to ever hit my tongue.  i try a new cheesecake everytime i come.  this is gonna be the best cheesecake of your life.   The cheesecakes ive tried according to greatness and favoriteness in decending order: caramel pecan turtle, white chocolate macadamia nut, red velvet, white chocolate raspberry truffle, 30th anniversary, cookie dough.  Even though some are at the bottom, they are all INCREDIBLE.", "rating": 5, "date": "12/6/2012"}, {"text": "So glad I don&amp;#39;t have to drive of King of Prussia to have their delicious food, 4 star cause I can&amp;#39;t say their food is outstanding but it&amp;#39;s good, otherwise than that no complaints about this place, it&amp;#39;s right next to willow grove mall, so very convenient", "rating": 4, "date": "8/14/2012"}, {"text": "The first time I ever visited a cheesecake factory was in Miami and I became an instant fan, and WWillow Grove did not disappoint.  The food was as I rememberd it excellent, and our server (Stephenie K) did not disappoint she was attentive and very friendly.   We enjoyed our time and we will return in the near future.", "rating": 4, "date": "7/21/2010"}, {"text": "The Cheesecake Factory is one of my favorite restaurant. My husband and I often come here when we decide to dine out. The food is good, my favorite is chicken and sausage gumbo, very tasty. I would recommend to direct order if you want to taste the cheesecake, which is the best place to get. At our first time, we ordered appetizer and entrees for each and ended up take out the cheesecake for dessert at home. If you come here on a warm day, don&amp;#39;t forget to order a glass of pina colada, it is wonderful. The servers are nice and helpful. The only thing is that they do not take reservation on weekend, which make us to come very early for dinner to avoid the wait. Never ever come around 7 pm or you have to wait 90 mins at the mall next door. Hope you all enjoy the place.", "rating": 4, "date": "12/12/2012"}, {"text": "This is my go to restaurant whenever i am in the surrounding area. The food is so amazing and the portions are huge. I always have trouble remembering to save room for the famous cheesecake they have. All the food is so good, and the servers are very polite and helpful with any suggestions one could have.", "rating": 5, "date": "12/4/2012"}, {"text": "I love this Cheesecake Factory!!!! I was a bit afraid since I experienced a total let down at my first Cheesecake Factory experience in Chicago- but this place was fantastic. Because my party was large we did have to wait a while but the food made it worth the wait. I also ordered a strawberry daquiri at the bar and it was nicely mixed if not a bit pricey. My mother had a couple of long islands and appeared to really enjoy them. The food was all around delicious. I stole food from all my family members plates and was very happy. The steaks sometimes aren&amp;#39;t made the way I and my father prefer them (rare to medium rare) but I can get over that if they are seasoned nicely, which they were. The mashed potatoes were scrumptious and most other sides were tasty as well. The cheesecakes were, of course, utterly delicious. Pricey but delicious non the less. This place will take a pretty penny out of your wallet but it&amp;#39;s one of the best chain restaurants to go to.", "rating": 5, "date": "2/13/2011"}, {"text": "I can&amp;#39;t believe I am writing this, but I like it.  We didn&amp;#39;t have any cheesecakes (it&amp;#39;s like 1600 calories for one slice - crazy!), but the rest of the food is very good.  Every time we go there, we get good food.  So, don&amp;#39;t snob them.  They are a chain, but at least this location is pretty decent.", "rating": 4, "date": "5/1/2011"}, {"text": "My absolute favorite restaurant! Service is always good, and staff is friendly. The food is always fresh, and their fries are to die for. Also very clean, and well taken care of.", "rating": 5, "date": "8/1/2011"}]}