{"address": ["1430 Walnut St", "Philadelphia, PA 19102"], "monthly_reviews": {"2019": [[0, 3.5], [1, 4.0], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.5], [10, 2.5], [11, 2.0]], "2017": [[0, 2.0], [1, 2.5], [2, 2.5], [3, 2.5], [4, 2.0], [5, 3.0], [6, 3.5], [7, 3.0], [8, 2.5], [9, 2.0], [10, 2.5], [11, 3.0]], "2020": [[0, 2.0], [1, 2.0], [2, 3.0], [3, 3.5], [4, 3.0], [5, 3.0], [6, 2.5], [7, 3.0], [8, 3.0], [9, 2.5], [10, 3.0], [11, 3.0]], "2018": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 2.5], [5, 2.5], [6, 3.0], [7, 3.5], [8, 3.0], [9, 2.5], [10, 2.5], [11, 2.5]], "2021": [[0, 3.0], [1, 3.5]]}, "reviews": [{"text": "My husband and I are big fans of the Cheesecake Factory in general! We have been to several locations throughout the US. This is was very disappointing! We went pretty late on a Friday, about 8:45pm. There wasn&amp;#39;t a wait, which was nice! Our waiter took forever to take our drink order, which was just water. Then took almost 10 minutes to bring out the bread. I ordered the chicken Marsala and subbed Mac and cheese (additional charge) for the asparagus and my husband ordered the enchiladas. The food took a very long time to get to the table-nearly 30 minutes, and our waiter never came back during that time to check our water or get us more bread. By the time our food arrived, we had no water. They brought out my entree, but forgot the Mac and cheese. They said it would be right out. 10 minutes pass and our waiter finally shows up and I tell him my Mac and cheese never came. He leaves and more than 5 minutes later, he cane back with my Mac and cheese. My husband and I had finished our meals by then. I was pretty disappointed! So we ask for the check. I thought for sure, they would take the charge for the Mac and cheese off the bill. Nope. They charged me for it. I wasn&amp;#39;t expecting a free meal, but I did fully expect them to take off the Mac and cheese. I was not impressed with the service we received at this Cheesecake Factory. This was the first time I have ever been to a Cheesecake Factory and left without ordering cheesecake. Our main entrees were good, but the service really left a bad taste in my mouth. I do not recommend eating here.", "rating": 2, "date": "12/20/2019"}, {"text": "This review is going to reflect my overall experience with eating at Cheesecake Factory Restaurants in Five States. <br&gt;<br&gt;I always told my daughter when I die sprinkle my ashes over the Cheesecake Factory. Particularly the one at the Sawgrass Mills Mall. After living in NYC with the many food establishments I am no longer as fond of the high priced National Chain Restaurants. One exception being The Cheesecake Factory! After all it&amp;#39;s all about the CHEESECAKE! <br&gt;<br&gt;Remember these are my overall experience. <br&gt;1. Employees are well trained and happy to work here. <br&gt;2. They have the most food selections on their enormous menu than any place except a NYC Diner. <br&gt;3. The portions are enough to take home for a second meal. <br&gt;4. The Cheesecake is just the way I like it. It&amp;#39;s lighter or heavy depending on the flavor you selected. Speaking of flavors, lots to choose between. I&amp;#39;ve got many favorites. <br&gt;5. Price remains comparable no matter what location you visit. I never felt I was overcharged for the meal. <br&gt;6. Service is always timely and food prepared correctly. One exception being newly opened locations that are going through a learning process! Naturally I had that problem in our NYC location. <br&gt;7. The atmosphere is pretty much the same at each location. I find it relaxing with mellow colors. I like the color palette. Bathrooms are always clean. There&amp;#39;s a modern trendy feel to the restaurant. A bar area in case you want to drink and meet friends. <br&gt;<br&gt;So there you have it. This visit was Cheesecake Slices to go. We ate in our hotel. Nothing out of the ordinary. Another Cheesecake Factory Visit. Thanks Philadelphia!", "rating": 5, "date": "3/29/2019"}, {"text": "Downhill and overpriced. Not consistent in recipe.this happens at every location. Cheesecake goes bad after a day.", "rating": 1, "date": "5/11/2020"}, {"text": "I ordered from the Cheesecake Factory today and the Pastas that I ordered were bland, the appetizers were A plus. However, the part that killed me is when there was a well clipped finger nail in my four year old son&amp;#39;s pepperoni flat bread pizza! What are you doing in the kitchen clipping your nails? I&amp;#39;m beyond disgusted and disappointed. During the pandemic, I believe cleanliness would be on everyone&amp;#39;s mind, but I guess not!", "rating": 1, "date": "5/19/2020"}, {"text": "DOOR DASH REVIEW:<br&gt;<br&gt;i was so disappointed last night when my order arrived. my pasta was so dried up and had barely any sauce on it. my caesar salad was dry as well and could need way more dressing.<br&gt;<br&gt; i understand that delivery compromises the quality but for the price i paid, i expected much better. wont be ordering from here anytime soon", "rating": 2, "date": "4/1/2019"}, {"text": "I think three stars is an adequate rating for the Cheesecake Factory in Philadelphia. Came with a party of 6 and waited 40 minutes for a table (that&amp;#39;s what we get for going on a Saturday night). <br&gt;<br&gt;I ordered an extra dirty martini at the bar in hopes they had their signature one with blue cheese stuffed olives, unfortunately they were all out. I settled for regular olives but my drink was very strong and not at all &amp;#34;extra&amp;#34; dirty. <br&gt;<br&gt;The waiter did not greet our table for at least 10 minutes after we were seated. The spinach and artichoke dip we ordered as an appetizer was really good! It was creamy and warm. Unfortunately, there was barely enough chips to get through half of the dish. <br&gt;<br&gt;Most of my party went with pasta dishes, including myself. I had the lasagna, which was very..flat. It was mostly noodle and very little stuffing inside. It was vegetarian, without meat, which i thought was a plus. Many lasagnas have meat only options, however where the lasagna lacked meat it lacked everything else. It was noodles piled on noodles. I was left not feeling entirely full. Others in my party had the three cheese pasta, a children&amp;#39;s pizza, and a turkey club. Given a taste of the pasta I wish I had ordered it! The sauce was tasty and the noodles were a tad al denete (which I enjoy, personally). The turkey club my sister had was said to be dry and the pizza was barely touched by the 5 year old because it was &amp;#34;too cold.&amp;#34; <br&gt;<br&gt;This would not be my first choice while visiting Philadelphia, but it was okay.", "rating": 3, "date": "6/24/2018"}, {"text": "I like the Cheesecake Factory on the simple fact alone is that they have many OPTIONS - the menu is extensive and that will usually meet everyone&amp;#39;s needs.  I am typically not a chain restaurant visitor, but when in a group or family outings - I go with the flow of the group!  In this case, if I am going to indulge - at least I can have a nice view and beautiful decor to enjoy my experience.  This location of the Cheesecake Factor has the views and decor in Spades!  <br&gt;<br&gt;I was with a few folks on this visit and we decided to dine on appetizers and drinks and of course the &amp;#34;cheesecake&amp;#34; to finish the night!  We had the Edamame, Dynamite Shrimp, Everything Pizza &amp;amp; Buffalo Wings.  We also ordered the Calamari - but it was overcooked - so we sent it back without any issue from our great waiter &amp;#34;Chris&amp;#34;.  <br&gt;<br&gt;Chris was awesome - he was attentive and made our experience enjoyable.  I feel this is a great location and if you are in the area - if nothing else - go get some darn cheese - our choice for the meal was &amp;#34;Red Velvet Cheesecake&amp;#34; and the take home choice was &amp;#34;Key Lime Cheesecake&amp;#34; - Yummy!", "rating": 4, "date": "1/24/2018"}, {"text": "I should have looked at the reviews before ordering, maybe then I wouldn&amp;#39;t have been surprised. I ordered the chicken Madeira to take to work, and by the time I was able to sit and eat my dinner I found the chicken completely raw. When I called to inform, they didn&amp;#39;t offer a replacement or anything just said &amp;#34;sorry about that you need to call the app through which you ordered for the refund&amp;#34; and hung up.", "rating": 1, "date": "4/25/2020"}, {"text": "Came here a week ago ago with a friend after going to Cheesecake Factory&amp;#39;s elsewhere. It is definitely a chain but their cheesecake is to die for in my opinion.<br&gt;<br&gt;Atmosphere: Whatever you want to make it. It is a nice venue, but families come here all the time with little children. You can go casual or go business casual and either way it&amp;#39;ll be a nice dinner! Nice and quiet, can definitely have a great conversation with your food companions here.<br&gt;<br&gt;Food: My go to is the avocado egg rolls (they&amp;#39;re vegetarian), the chicken lime penne pasta (they can put the chicken on the side if you&amp;#39;re sharing with a vegetarian!), and a different cheesecake. The avocado egg rolls are ALWAYS a hit. They&amp;#39;re obviously standard and come ready-made, but i love em. They&amp;#39;re flavorful, nice and soft avocado with a crunchy egg roll shell. They come with a lime-based dressing/dip as well. The pasta is very flavorful as well, chicken is usually dry especially if you get it on the side. ...now the best part is obviously the cheesecake lol.<br&gt;<br&gt;Cheesecake: per slide will run you about $10, which is super affordable for the giant piece they give you. Definitely share 1 piece with 2-3 people for the sake of your well-being lol. We ordered the nutella chocolate cheesecake which was BOMB!!! It was super rich, chocolatey, had nutella drizzled on top. Sweetness with every bite. Legit couldn&amp;#39;t finish it, had to take it come and eat it later haha. <br&gt;<br&gt;Drinks: Just had water! <br&gt;<br&gt;Service: Quick and helpful! <br&gt;<br&gt;Would 100% come back.<br&gt;<br&gt;Pro tip - you can easily order cheesecake to go and not sit down for a meal if that&amp;#39;s what you desire!", "rating": 4, "date": "2/25/2019"}, {"text": "Take NY Times&amp;#39; restaurant critic&amp;#39;s review of Guy Fieri&amp;#39;s American Kitchen and Bar in Times Square and substitute &amp;#34;Cheesecake Factory&amp;#34;  for &amp;#34;American Kitchen and Bar&amp;#34; and your questions are answered.<br&gt;Seriously, my margarita tasted like diabetes and off-brand antifreeze.", "rating": 2, "date": "8/7/2019"}, {"text": "Aside from the inconvenient policy of not seating guests until two or more have arrived, the service was tremendous and the food was just as great. I had requested a high-back booth in my online reservation and they honored my request. The server was also very friendly and attentive but also gave us space to enjoy our meal and our company. The Cheesecake Factory never disappoints!", "rating": 5, "date": "3/3/2020"}, {"text": "I m annoyed by people putting a review and not describing the context of their review or what they are taking in account for their notation...<br&gt;<br&gt;When I saw 3 stars for cheesecake factory, i was chocked!!! As for me the cheesecake served here are among the best I ve ever had, and not only the estetism but the taste as well is great... <br&gt;So after reading the reviews, I ve seen that 99% of bad review doesnt even talk about cheesecakes... lol...<br&gt;And the 5 6 times I ve been was only for cheesecakes^^ so again we are not talking about the same things guys... but you are doing bad overall publicity for a great place for cheesecakes.... so please try at least once to be more objective^^ and say it un your review (I be been there for the restaurant I didnt try cheesecake, I was deceived by the overall menu...) <br&gt;<br&gt;And if you want great pasta go to an italian place or I can even give you the recipe to do homemade pasta and homemade sauce^^<br&gt;<br&gt;Anyway great cheesecake here, run for this", "rating": 5, "date": "10/6/2019"}, {"text": "The building is absolutely beautiful. It&amp;#39;s just a chain but I think that this one really stands out because of the atmosphere. Unfortunately, all of the food is 1,000 calories a plate+.<br&gt;<br&gt;The meals here are typically pretty good. I like their burgers although everything off the skinny menu is ridiculously healthy. I just had a veggie burger. It was alright but it came out cold and the pickles were pretty low quality. The bread is good. Service is always really polite but sometimes a bit slow when it is busy. Of course, the cheesecake is great.<br&gt;<br&gt;I love coming here for brunch or for dinner after sleeping my entire day away. Great location. Decent food and service.", "rating": 4, "date": "1/27/2019"}, {"text": "Came back for the Jamaican chicken and shrimp. It was served without plantains or onions as requested. The manager made things right and the server accepted responsibility. I can&amp;#39;t say that mistakes are uncommon at restaurants but when you still get friendly service despite complaining it says something about the quality of your staff.", "rating": 5, "date": "1/10/2019"}, {"text": "The food was a 3, but the excellent customer service bumped it up to a 4! Shout out to our waiter, who was so incredibly attentive and nice! Go here if you have picky eaters in your party (the menu is the size of a phone book), need a family friendly place, or want to go somewhere a little fancier. Just be sure to come here during off hours, cause this location gets BUSY.  <br&gt;<br&gt;The menu is the same as any other Cheesecake Factory, and has a huge range of mostly American classics: pasta, burgers, breakfast foods, salads. The free bread basket was piping hot, and the entrees were solid. <br&gt;<br&gt;The decor is definitely more luxe than I&amp;#39;m used too--huge ceilings, mood lighting, and gold details. I noticed quite a few people in dressy clothing, so this could be a fancier occasion.", "rating": 4, "date": "1/28/2018"}, {"text": "When I rated the Cheesecake Factory local to my home, I thought rating a chain was silly.  All the food is the same, isnt it?  Well - this experience taught me, in fact, IT IS NOT.  <br&gt;<br&gt;I get individual pizzas at my local CF all the time - this one was salty and the cheese wasn&amp;#39;t great.  The tater tot appetizer wasn&amp;#39;t heated thoroughly.   The floors are slipper AF.  I asked to bring home the left overs - the tater tots had two sauces on the side - opened the left over the next day to find they didn&amp;#39;t box the sauces.  Lazy.", "rating": 3, "date": "8/27/2018"}, {"text": "The food is overpriced, but the cheesecake is wonderful and the only reason they deserve 4 stars. If you&amp;#39;re ever wonder what cheesecake to try, add the carrot cake cheesecake to your list.", "rating": 4, "date": "7/2/2019"}, {"text": "Portion sizes have decreased significantly while prices still remain the same. Paid 17 dollars for a fettuccini alfredo that I was able to finish within a few bites. Food taste good, but wish they weren&amp;#39;t as expensive", "rating": 3, "date": "8/16/2020"}, {"text": "This was my 1st time EVER trying the Cheesecake Factory in general. The one in Queens, New York is always packed and has a long wait. My friends told me that the one in Long Island, New York was the same thing. We found this place randomly while walking around looking for a place to eat for dinner. The place here is HUGE and we were seated right away. I&amp;#39;m not sure if people were away for the long July 4th weekend, but I was surprised that the place wasn&amp;#39;t crowded.<br&gt;<br&gt;Many of the entree options are 1,500+ calories! I&amp;#39;m not surprised because I have heard on the news before that entrees at Cheesecake Factory have high calorie count. We ordered our entrees from the SkinnyLicious Menu. I opted for the Lemon-Garlic Shrimp and it comes with Angel Hair pasta. It was delicious and the shrimp tasted pretty fresh. The food portions were just right and I wasn&amp;#39;t overly stuffed.<br&gt;<br&gt;Our waitress was very friendly and attentive. She was happy to fulfill our requests. Our utensils and my napkin cloth were slightly dirty in the beginning and she got replacements for us. She checked up on us often to see if we needed anything else too.<br&gt;<br&gt;We didn&amp;#39;t eat cheesecake here since we were full. Maybe next time we&amp;#39;ll leave some room for dessert.", "rating": 4, "date": "7/7/2017"}, {"text": "Go to the king of Prussia location instead. <br&gt;<br&gt;Egg roll sampler - they were out of the cheese burger sampler, which they replaced with more avocado egg rolls, which were all poorly made and falling apart when picking it up to eat.<br&gt;<br&gt;Truffle honey fried chicken - 2 small pieces of fried chicken, which I barely tasted the truffle., and a huge portion of mashed potatoes<br&gt;<br&gt;Got some other dishes but I forget the name.<br&gt;<br&gt;Pumpkin cheese cake - tasted more like pumpkin pie, needed more of the cheese part<br&gt;<br&gt;Mango key like cheese cake - good but wish it didn&amp;#39;t have the coconut flakes at the bottom.<br&gt;<br&gt;Would I go back here again? Nope", "rating": 2, "date": "11/6/2018"}, {"text": "The service was great, the food was alrighty. Theres only one concern, the cheesecake section of the menu was very hard to order from because everything sounds so delicious!! The cinnabon cinnamon swirl cheesecake was DELISH!!", "rating": 5, "date": "3/14/2020"}, {"text": "Yesterday was my Birthday and Madison the server was amazing, friendly and had a great customer services skill. My wife and I had a great time!!!", "rating": 5, "date": "3/8/2020"}, {"text": "As ya&amp;#39;ll know, I had a bad chicken casear salad from here last week, which I have to say in retrospect was an isolated incident because I went yesterday for Happy Hour and the food and drinks were AMAZING as usual! I normally only get cheesecake while i;m here but the adventurous side of me said &amp;#34;bruh, lets get some carrotcake&amp;#34;. <br&gt;And lemme tell ya...the Carrotcake was arguably the best I&amp;#39;ve had. I&amp;#39;ve had some good carrotcake in my short life, but the cheescake factory carrot cake was HUGE and very moist! Well worth the $8 value! <br&gt;<br&gt;The Nachos are really...really..really good, too. It&amp;#39;s usually all I can handle unless i&amp;#39;m sharing some with my greedy friends, i mean hungry friends. I&amp;#39;m actually going to attempt to try the chicken casear salad again because I&amp;#39;m confident it was a one-time thang. <br&gt;<br&gt;Thangs happen, yanno??", "rating": 4, "date": "5/9/2017"}, {"text": "My friends and I got a quick bite here and it was great. We got there around lunchtime so it wasn&amp;#39;t much of a crowd, for a Saturday! We were seated pretty quickly and serviced the same. <br&gt;  I normally get the appetizers because they&amp;#39;re a good portion to eat alone or share. I got the Buffalo Blasts and Avocado  Egg rolls! The egg rolls were great and about 7 came with the order. My friends ordered the salmon with rice and it looked amazing as well. <br&gt;  Overall the experience was a good one! It was my first time there and I will be returning. I enjoyed myself here!", "rating": 4, "date": "9/8/2018"}, {"text": "Horrible experience. My filet Mignon was served well done eVen though I order medium. Mashed potatoes were so dry it seemed like they were  cooked a week ago and just reheated in a microwave. Will never go back", "rating": 1, "date": "2/1/2020"}, {"text": "Sorry, I am really not a big fan of TCF, <br&gt;The steak is literally horrible taste. It&amp;#39;s really just a little bit better than fast food. Lol.", "rating": 3, "date": "6/17/2019"}, {"text": "This visit was a bust which makes me sad as we visited with out of town guests.<br&gt;We ordered apps which were good (nachos and artichoke and crab dip). <br&gt;Hubby had a kale salad<br&gt;We barely started and our food came out. <br&gt;<br&gt;Hubby was only able to finish half his salad which he held above the table since there were too many large plates (there were 5 of us).<br&gt;<br&gt;I ordered the combination ($22 approx) which had my favorite chicken merdiera with a salmon.  The chicken was so small that it was disappointing.  The salmon was drowned in a green chopped parsley (type) that I could not even tell it was salmon.  See my pic<br&gt;<br&gt;One plate didn&amp;#39;t come out for about 10 min later so we all waited and ate our food cold.  I mean if you&amp;#39;re going To bring the food out early bring it out together.<br&gt;Everyone&amp;#39;s else said the food was good <br&gt;<br&gt;Waitress was eh. I think I was more disappointed that she didn&amp;#39;t say anything when my husband was eating in the air w his bowl <br&gt;<br&gt;The others had dessert but I was so turned off by my meal that I didn&amp;#39;t bother. <br&gt;<br&gt;$200 later and I was disappointed <br&gt;<br&gt;Wish I spent a bit more and went to Delfriscos. <br&gt;<br&gt;Yes I&amp;#39;ll try again but I know to avoid the combo and wait to order my meal    I guess w most chains u get a hit or miss you waitress and you have to know the tips when ordering<br&gt;<br&gt;I should add the last few times we visited everything is great... this visit was just so disappointing.", "rating": 2, "date": "7/13/2017"}, {"text": "Our mistake was sitting down for cheesecake when we should have just gotten takeout. The service was slow (even for just a slice of cheesecake) and the cheesecake was mediocre. I thought the sour cream on top could have been slightly sweeter and the graham cracker crust could have been crisper. <br&gt;<br&gt;It&amp;#39;s true that this is historically a family restaurant and has a special grandiose feeling to it, but my Chicken Bellagio days are over. I saw another reviewer below mention that the menu doesn&amp;#39;t have prices for cocktails, which is another area for improvement that I noticed as well.", "rating": 2, "date": "5/14/2018"}, {"text": "A group of us met up for dinner, as a friend was visiting from out of town. We all ordered drinks and were unsure of how much they cost as the menu had no price; they were all about $13 which shocked us a little, so please take notice! Also, when we were flipping through the menu, it appears that the Cheesecake Factor recently added &amp;#34;sodium warnings&amp;#34; to items on the menu that had a significant amount of sodium. However, it appears that ... almost every item barring the Skinnilicious menu had warning. But! Every items that we ordered that did not have sodium warnings were still significantly salty! I had the fish tacos and only thought that they were bearable after squeezing lime on them. Even our other friends noticed the amount of salt in their dishes. I know one doesn&amp;#39;t go to the Cheesecake Factory for a necessarily ... healthy meal, but it was alarming how many of the dishes had sodium warnings and the fact that even dishes not labeled this way were salty.", "rating": 2, "date": "11/18/2019"}, {"text": "This rating is for amazing whole wheat baguette that you can buy at the restaurant to take home. I got it warm so it&amp;#39;s very crunchy on the outside but soft and warm inside. $3.50 per baguette plus tax.", "rating": 5, "date": "5/8/2018"}, {"text": "I&amp;#39;d describe my dining experience at this Cheesecake Factory branch as a &amp;#34;dining roulette&amp;#34;. For a company that is known for its consistency, this apple fell several feet away from the tree. I&amp;#39;ve been to this restaurant ever since it opened its doors in 2015. Sometimes you get great service and the food turns out spectacularly. Sometimes service is unexpectedly slow and the portion size varies. At one point, this place was dirty too with food residue from previous diners stuck on &amp;#34;clean&amp;#34; utensils and bits of food all over the tables/seats/floors. Today I came here with my date for a late dinner around 8pm, and the restaurant was probably at half its capacity, but service was on the slow side. I had the miso salmon, and compared with the miso salmon I had here over a year ago, it lacked flavor. This time, the salmon was slightly overdone, and the miso taste hardly came through. My date was happy with the salad, so that was a plus. The cakes have so far been the only consistent thing about this place. Thank God they haven&amp;#39;t messed up with the cakes yet, otherwise Cheesecake shouldn&amp;#39;t be in its name. I still find myself coming back to this place because I think they are showing some improvement in certain ways (I.e. the place isn&amp;#39;t as dirty as it was a few years ago). That goes to show you that the people you hire can make or break your business.", "rating": 3, "date": "10/24/2019"}, {"text": "At our last visit, my friend&amp;#39;s food came back looking like a plate of vomit (too much cheese and sauce, which overpowered the little amount of pasta on the plate) when she reordered the same dish since the first one was not made right -- parsley stems instead of leaves. We decided to try this location again. During that visit, i have experienced the same issue when i ordered the Lasagne Verde, which did not looked or tasted appetizing... it looked like someone threw all the ingredients together on the plate in a rush; TBH, it looked like another bowl of puke. I had to order another dish since pasta dishes may not be their expertise. While paying for our checks, I noticed a roach walking to the corner of our table. That is DISGUSTING. The service wasnt great either, and needed a lot of improvement.", "rating": 1, "date": "11/10/2019"}, {"text": "FYI: Their portion sizes are HUGE and the calorie count definitely matches what you get so you might be eating a full days worth of calories in a single meal. <br&gt;<br&gt;The fiancé and I were in center city on a date night sorta type thing and came here before checking out some DIY wedding supplies at the AC Moore nearby. Let&amp;#39;s just say....it&amp;#39;s been a while.<br&gt;<br&gt;WHAT I GOT: Grilled fish tacos<br&gt;<br&gt;PROS: First of all, I gotta give it up to our waiter. He was legit the sweetest person ever with the way he talked to us and served us during the meal that it made up for the lack of flavor in our food. And I also appreciate the fact that the Cheesecake Factory lists the calorie count of their food. I mean, for how big their portions are, you can kinda guess how much you&amp;#39;re taking in but it&amp;#39;s also good to have a set number. The food was cooked pretty well: nice moist chicken and flaky fish. All the ingredients tasted fresh and there were some good flavor combinations in my taco. The ambiance of this place is also pretty cozy and definitely family friendly.<br&gt;<br&gt;CONS: Where to start...well for starters, my taco shells were uhhh...limp and cold. And the fish on the inside joined them within minutes of hitting the table. The cilantro rice they serve with it tasted ok but that&amp;#39;s about it. Just ok. They also gave me a little bowl of beans but I took two bites and left it alone. My fiancé&amp;#39;s truffle honey chicken was incredibly bland though. The skin didn&amp;#39;t taste like much, neither did the meat on the inside. Most of the flavor came from the sauce on the plate. His mashed potatoes were peppery af but with the chicken, it wasn&amp;#39;t terrible. I&amp;#39;m not sure if the quality of the food decreased since the last time I had it but it definitely wasn&amp;#39;t really something I&amp;#39;d be like &amp;#34;dying to try&amp;#34;.", "rating": 3, "date": "5/26/2017"}, {"text": "I particularly enjoy the fact that I can get breakfast all day. Cheesecake factory has a nice selection of breakfast style meals you can get all the time. I&amp;#39;m a big fan of poached eggs and they always make my.l Breakfast just right. The breakfast tacos and very handy and tasty. Coffee is always good.", "rating": 4, "date": "8/13/2019"}, {"text": "Not the best chicken salad sandwich, very salty wings. Pretty horrible the more I think about it.", "rating": 2, "date": "9/30/2019"}, {"text": "Starving, we stopped at the Cheescake Factory for lunch.  The Cheescake Factory isn&amp;#39;t anything special--typical North American kind of dishes, such as pastas, burgers, etc, the type of food that hits the spot when you&amp;#39;re hungry.<br&gt;<br&gt;There were plenty of tasty options, but looking through the menu, I was horrified.  I knew the Cheesecake Factory isn&amp;#39;t the best place to go if you&amp;#39;re health conscious, but my god, the calorie content was absolutely horrific; most of their dishes were between 1500 to 2000 calories each, an entire day&amp;#39;s worth of calories.  Ugh.  Thank goodness they had a &amp;#34;skinny&amp;#34; menu which offered lower calorie dishes, around 600 calories each.<br&gt;<br&gt;Off the skinny menu, I ordered the enchiladas (I just couldn&amp;#39;t order from the regular menu, knowing that I would be consuming 1800 calories in one sitting).  I still don&amp;#39;t quite believe that they were &amp;#34;only&amp;#34; 590 calories, as they were a full portion and extremely filling.<br&gt;<br&gt;Overall I am rating The Cheescake Factory only two stars because the food is just average, the calorie content horrifying, and the waiter was a bit condescending.<br&gt;<br&gt;[Yelp collections: East Coast 2016]", "rating": 2, "date": "11/23/2016"}, {"text": "Do not go for a late night bite- servers DO NOT CARE and the chefs are mentally checked out. Also, our server was acting as if he was under the influence of a stimulant. The food was NOT EDIBLE, we asked for our nachos to be re-done three times and then finally gave up. Never had a problem at another Cheesecake Factory and I would typically recommend but this experience has made me not want to return to any Cheesecake Factory.", "rating": 1, "date": "3/21/2019"}, {"text": "Not happy with the portion size. Ordered the Steak Diane, Herb Crusted Salmon combo. Ordered medium rare but they burnt the stake. Also stake was size of chicken nugget. It was a joke! Also overall, terrible service by the staff and waiter. Below average food. Expensive food. Been coming to Cheesecake Factory for almost 15 years not. Mostly with group of friends. Never gain! :(", "rating": 2, "date": "1/20/2019"}, {"text": "Disappointment is the first thing i must say<br&gt;<br&gt;They are very disorganized, <br&gt;Ran out of silverware, 30 mins for water and<br&gt;Unfriendly service <br&gt;<br&gt;There are better places to eat while visiting Philly", "rating": 2, "date": "12/25/2018"}, {"text": "This restaurant is quite famous for its cheese cake and we had finally got the chance to try it out. Had the original one and red velvet one, respectively. The red velvet one looked much larger than the original one. Both of these two cheese cakes tasted yummy! Perfect dessert!", "rating": 5, "date": "12/28/2017"}, {"text": "Take-out only review.<br&gt;<br&gt;One of my friends was in from out of town and was craving cheesecake. We walked a couple blocks over, took the elevator upstairs and were greeted by a hangry mob.<br&gt;<br&gt;Well, basically. It was midday on a Saturday and this place was bursting at the seams with people waiting for tables. Originally we planned to eat-in until we heard about the crazy wait time. No thanks.<br&gt;<br&gt;Fortunately, they do have a to-go counter. While the process of ordering was a bit unorganized and the staff unfriendly, we were able to snag our cheesecake slices and leave within about 10 minutes.<br&gt;<br&gt;I ordered the chocolate chip cookie dough, and it was pretty darn good. I don&amp;#39;t want to consider the calorie count on that thing...but if you&amp;#39;re in the mood for an extra sweet snack, you could very well visit this accessible spot.<br&gt;<br&gt;Of course, there&amp;#39;s also the option of stopping in one of the local haunts, where you&amp;#39;re likely to find stellar fare at better prices. But that&amp;#39;s just the anti-chain snob in me speaking!", "rating": 3, "date": "3/7/2016"}, {"text": "We had a great time at the CCFactory. Traveling from out of town our group was looking for something familiar but able to handle different palates/dietary restrictions.<br&gt;<br&gt;Service was great and the food was better than ever. I was shocked that we were able to get a table so quickly but the food would have been worth the typical 45-60 minute wait (bonus was we didn&amp;#39;t have to wait)", "rating": 5, "date": "2/2/2019"}, {"text": "A chain restaraunt favorite. This location is very convenient for those visiting the city. However, it&amp;#39;s gets VERY busy, and without the ability to make a reservation, you could be waiting 30-60 min for a table. When you do get to sit down for your meal, the rest is magic. Avocado Egg Rolls are a must order. Tried the Upside Down Pineapple cheesecake, amazing. Stop by, and request the outside terrace room area for a great view of the city.", "rating": 4, "date": "8/18/2019"}, {"text": "I get great solid food everything I&amp;#39;m here. It&amp;#39;s not a diner and not fine dining but right smack in the middle.<br&gt;The servings are enough for a ravenous appetite plus lunch for the next day. Service is a lil slow, but it&amp;#39;s a<br&gt;Packed place always, and theropod comes out so perfect. <br&gt;My go to dish is bang bang chicken but today I chose chicken and fries (pic posted) <br&gt;<br&gt;From the servers to the hostess to the managers, everyone is so friendly. <br&gt;The cheesecake selection is EXTENSIVE but don&amp;#39;t leave without getting one to go- I get the caramel pecan.<br&gt;<br&gt;Nathan is the best server!!", "rating": 5, "date": "1/24/2016"}, {"text": "Started off on a good note, was seated right away. Wasn&amp;#39;t too crowded for a Sunday. The waitress was nice but not attentive. Waited for over half an hour for our food (which we know wasn&amp;#39;t her fault) but haven&amp;#39;t checked on us if we needed a glass of water or anything else. We did noticed she was really attentive to the table behind us. After we got all our food, we noticed that the food was warm, after waiting for so long. But to this point we were really hungry so we didn&amp;#39;t care. Towards the end my friend ordered a mojito, which was really disappointing. It tasted like lemon water, mint leaves and no taste of the alcohol. <br&gt;The food wasn&amp;#39;t bad, just wished the service was better.", "rating": 2, "date": "2/11/2019"}, {"text": "Okay, so we went to Philly for the weekend with the intention of a cultural immersion but were starving when we got there mid-morning and thought we&amp;#39;d just go to the nearby Cheesecake Factory for a quick, small (lol yeah right) bite for fuel for our exploration. We were greeted warmly and staff were clean and well presented (everything was clean) and we were seated by the window in a booth without having to ask. <br&gt;<br&gt;We ordered the avocado toast to share and not only was it massively generous (like at least 2 avos on that thing), but was fresh and beautifully prepared. We couldn&amp;#39;t have found a more generous helping for close to this price and it really was delicious. My cold vanilla latte was super sweet and divine too. We contemplated going back there for dinner...and we probably should have :(", "rating": 5, "date": "3/14/2019"}, {"text": "Whenever I think of the Cheesecake Factory, Vince Young always comes to mind. As his dumpster fire of an NFL career was coming to an end circa 2012, reports began to surface that the former Eagles QB and third overall pick of the 2006 NFL draft was known to spend upwards of $5,000 per week at the Cheesecake Factory.<br&gt;<br&gt;I know NFL players enjoy the lavish lifestyle, but come on, $5,000 per week at the CHEESECAKE FACTORY? You&amp;#39;re a millionaire. Treat yourself. That&amp;#39;s like if I went out tonight and spent $200 at Taco Bell (I&amp;#39;ve come close). <br&gt;<br&gt;Sources now say Vince Young is now working at an undisclosed Cheesecake Factory location as a short order line cook. Get &amp;#39;em, Vince!<br&gt;<br&gt;This was my first visit to a Cheesecake Factory. Not sure how I was able to avoid them for this long. You know, there&amp;#39;s a lot to like about this place. The dining room is pretty darn impressive. Lots of head room. <br&gt;<br&gt;Pressed for time, my buddies and I opted to sit at the bar rather than wait for a table. Service was friendly, though not the most attentive. As a fairly outgoing group, we were able to get the attention of the bartenders. But I noticed a lot of quiet couples around us being completely neglected. This was actually making ME feel a little awkward, so I made it a point to tell the bartender not to focus solely on my group and to help the other people standing around. Not sure why this was necessary ... you&amp;#39;d think they would do this on their own.<br&gt;<br&gt;Food portions are HUGE! Has anyone else ever ordered the chicken fingers here? You seriously get like two pounds of chicken and another half pound of mashed potatoes. Seriously. It&amp;#39;s obscene. In a good way, of course.<br&gt;<br&gt;Would I come back? Sure. I love riding escalators to the main dining room. I don&amp;#39;t get to do that much here in Reading. Weeeeee!", "rating": 3, "date": "11/5/2015"}, {"text": "In general, Cheesecake Factory is one of my favorite places to eat. However, the quality of this particular branch leaves much to be desired. A group of my residents and I decided last minute to grab dinner to celebrate the near completion of the semester. Some ordered cheesecake while others ordered appetizers while others ordered large dishes. <br&gt;<br&gt;The cheesecake itself was solid as expected and the waitress guided us through the menu, which helped us decided which slices to get. However, while the cheesecake was good, the entrees and appetizers were disappointing. I got the steak and shrimp combo, which is a classic. However, my steak tasted watery and had a dull metallic taste instead of the rich meaty taste that I&amp;#39;m accustomed to. The artichoke dip was also missing the cheesiness of the usual dip. If the food was on par with the cheesecake, perhaps the dining experience would have been better.", "rating": 2, "date": "12/26/2018"}, {"text": "We love the Cheesecake Factory in general and have been to multiple locations. This one is filthy dirty. We were sat at a booth that had crumbs all over it, crumbs and hairs on the table, and even hair on our plates. This filth was consistent for the empty tables next to us as well or else we would&amp;#39;ve just asked to be moved. Needless to say, we just walked out. Disappointed as the restaurant was not busy at all so it seems like there could be time to at least wipe tables/booths down between guests.", "rating": 1, "date": "3/8/2020"}, {"text": "Great staff awesome food great venue and lightning  fit for all type of functions also kids friendly. Love my first experience. Thanks", "rating": 5, "date": "3/1/2020"}, {"text": "I came during a peak time on a Saturday evening to dine alone while on a business trip. I was seated within about 15 minutes of arriving. After receiving my appetizer, my order was put in but I did not receive my entree until an hour and 10 minutes later. My frustration is when I&amp;#39;m sitting next to other tables who arrived and placed their orders after me but received their dishes before me, there&amp;#39;s a failure in service somewhere. My entree was the truffle honey chicken which was okay. The potatoes seemed darker in color as if they sat in the steam table too long and were way too salty to consume.", "rating": 2, "date": "10/30/2018"}, {"text": "This isn&amp;#39;t my first time attending the Cheesecake Factory however this experience was one of the best. I&amp;#39;ve had some not so happy experiences here before. Our waitress was quick and attentive. Very polite. I didn&amp;#39;t get a drink but she made sure my water was refilled. Our wings were great and hot as if they just were made which was awesome and the Louisiana Pasta that you see in the photos was delicious! Hopefully I can continue to have experiences like this when I return.", "rating": 3, "date": "7/30/2018"}, {"text": "Last night I made reservations for my daughter&amp;#39;s birthday and it was only her and I. The hostess down to the waiters were very polite and welcoming. The food was very good as well as my drinks. My daughter had a free complementary sundae along with them singing to her and she was very excited. I will be going again and I would recommend to others as well. Prices are reasonable too. Establishment is for date nights, family and friends to have a great time the classy way.", "rating": 5, "date": "2/22/2020"}, {"text": "My entire dinner party and I received food poisoning from this location on 2/12/2020. Please review how your workers handle the food. If your food is making customers sick even with the standardized safety built into running a chain restaurant, something is deeply amiss. You are putting your customers health at risk", "rating": 1, "date": "2/13/2020"}, {"text": "This Cheesecake Factory is two stories. Unexpected 30 minute wait on a Sunday night for a table for four. Please turn the dimmer up so there&amp;#39;s some lighting. I like ambiance but there&amp;#39;s a problem when you can barely see the food in front of you. Table and silverware was unkempt. For some reason, there were still cloth napkins from the previous party before us on the ground.<br&gt;<br&gt;Server was solid. Seemed like they were understaffed this night because he did not appear until we were 10 minutes into looking at the menu. Hostess did not set up smaller plates to share. <br&gt;<br&gt;Food portions were huge and everything came out hot and delicious. 6 beers on tap and over 280 menu items.", "rating": 2, "date": "5/29/2017"}, {"text": "My first time experience at Cheesecake Factory will always be unforgettable. I had a long stressful day at work so I went to the location on 15th and walnut to sit at the bar for a quick meal. The fried calamari was exceptionally good . I also ordered the bbq ranch chicken salad which was also delicious. What stood out to me the most was the bartender Savannah. She was not only polite yet hospitable .. she never let any need of mine go unnoticed. I&amp;#39;ll be back to see her specifically, but in hopes that the full staff is on the same page as her. Thank you savannah for making your guests feel as family. You have made my experience unforgettable and I&amp;#39;ll be looking for you every time I step foot in.", "rating": 5, "date": "8/12/2019"}, {"text": "This is probably one of my favorite big chain restaurants, and the Philly location did not let me down. It has a great spot with views of the city which makes it a step above the average Cheesecake Factory at the mall.<br&gt;<br&gt;Overall the food is great. The menu can be overwhelming for some since it literally is a 20 page book, but it is filled with a great variety. There is literally something for everyone. There were plenty of vegetarians options, and portions are huge! Don&amp;#39;t forget to save room for cheesecake though. Having tried at least 10 different cheesecakes they have, I have never been disappointed.<br&gt;<br&gt;Strangely they seated our party of 5 on a table for 4 and then seated a party of 2 in a large booth for 5/6 people. Maybe they are still working out things since they are still relatively new, but this was really inconvenient. Also, service can be slow since the waiters have lots of tables and literally have to run around to keep up. <br&gt;<br&gt;Overall, the food was great, and there is so much more to try so I will be going back.", "rating": 4, "date": "9/7/2015"}, {"text": "This location opened on Tuesday... As in they haven&amp;#39;t even been opened for a week and you can tell!!! The wait staff is in a frenzy, everything is slow as hell to come out of the kitchen and bar. But in all fairness, I&amp;#39;m used to dining at the Cheesecake Factory in Waikiki (which is the second busiest location behind Vegas) and they have everything down to a science. <br&gt;<br&gt;The reason why I didn&amp;#39;t rate Cheesecake Factory Philly 4 stars is because there is a learning curve that&amp;#39;s happening right now and the presentation of the food was completely impressive. Like I said, I go to Cheesecake Factory often and I&amp;#39;m very familiar with the presentation, but now I know what it&amp;#39;s supposed to look like! <br&gt;<br&gt;This is the absolute best place to go in a group! There is something for everyone!!!", "rating": 5, "date": "6/29/2015"}, {"text": "Let&amp;#39;s be clear, I only gave 3 stars mainly for ambiance. I love the setup of this Cheesecake. My first time here, me and a group of friends dined for a birthday. We sat in the grand room upstairs and felt like celebs lol. It was so clean and pretty. Our server was nice and accommodating too. She wasn&amp;#39;t intimidated by our large party. She had glasses and braids. I ordered the calamari and a glass of Proseco. My calamari was fried really bad and had chicken on the plate; I assume they fry chicken in the same fryer. Which is ok, but I&amp;#39;m a vegetarian. I unknowingly bit into it, disturbed. I told our server though, and she had no problem taking it back. I didn&amp;#39;t get anything else. <br&gt;<br&gt;My second time here I ordered the fettuccine alfredo and had the same server. Sweet, still. This meal was way better though! No complaints for this one. It was so good I couldn&amp;#39;t even finish it all. I&amp;#39;d probably return.", "rating": 3, "date": "7/18/2018"}, {"text": "Used to be my favorite restaurant but the service went downhill over the last year. I usually order buffalo blasts but it&amp;#39;s almost feels as if they&amp;#39;re not enjoyable no longer.  Now i leave with a upset stomach. I don&amp;#39;t think the cooking deep fry oil has been changed in months.", "rating": 2, "date": "7/31/2019"}, {"text": "Great service , food galore! Love the skinnylicious menu!!  Get the chicken lettuce wrap", "rating": 5, "date": "4/17/2018"}, {"text": "I may be biased but Cheesecake Factory is always just ok to me. I ordered the shrimp with angel hair with no tomatoes. The sauce was a little tangy in a strange way, but it wasn&amp;#39;t bad just alright. The shrimp seemed to be just slightly breaded but it could&amp;#39;ve been better if it wasn&amp;#39;t breaded. My boyfriend ordered the grilled chicken and avocado club which he said was good and felt that it was very fresh. I would say the one thing you must ordered when coming here is the fried Mac and cheese which I think is very very good and worth 4 or 5 stars", "rating": 3, "date": "7/7/2018"}, {"text": "Whenever I&amp;#39;m in an unfamiliar town the Cheesecake Factory is typically my go- to, especially as a vegan. They have a good amount of vegan options and my favorite is the vegan Cobb salad (with no dressing cause it is flavorful enough without it). Staff has always been friendly no matter what location I&amp;#39;m at. My only complaint is the price, which is a bit much for my liking :(", "rating": 4, "date": "7/14/2019"}, {"text": "I came in here just to pick up cheesecake. The young lady at the counter was rude and never even made eye contact with me. It felt as if she didn&amp;#39;t want to be there. If she&amp;#39;s not happy with her job she should find another one. I went in on 02/03/17 around 10:00pm. I hope management reads this and fires her. The gentlemen who made the cake was nicer and was doing his job to the best of his ability.<br&gt;<br&gt;I&amp;#39;m spending $8.75 on a slice of cheesecake I would think I would get a thank you and have a good evening. The inside is nice and I&amp;#39;m sure other employees their are nice. The dessert area looked messy and the girl behind the counter just wasn&amp;#39;t professional at all. I won&amp;#39;t be returning to this location. The location in cherry hill is a lot nicer and also a free parking lot and a lot nicer group of employees.", "rating": 1, "date": "2/3/2017"}, {"text": "This place was my go to after work. We even began  to plan a company gathering there this summer, however, I started to have bad experiences about a month ago. I ordered takeout twice. Food is scarce, reheated or freezer burned. My first takeout order was through post mates. The food was freezer burned and looked very old. We made two complaints over the phone and another via corporate Facebook. We were denied a refund or gift card three times. Cheesecake repeatedly stated that we should contact Postmates, which is ridiculous given the delivery service has nothing to do with the quality of food.<br&gt;This weekend, we decided to give this location another try, thinking it was just a goof. I went down to the location and picked up the food. I had three orders of fish and chips. I opened the first box of fish/fries and tasted them. They seemed to be okay so I took the food home. When I got home, I quickly realized why the takeout section is so dark. The fish were tiny, some as small as your pinky finger and about an inch thick. We each got one scoop of cold slaw, put very sloppily into the bottoms of small containers. We had a small amount of fries which were put into paper bags instead of inside the container with the fish. This looked like it was done purposefully to appear fuller in quantity. My guests complained of the taste and reheated fries. This Cheesecake Factory does not respect or honor its customers so I didn&amp;#39;t even call to complain. We wasted 60 dollars and went to the supermarket to buy our own fish. Don&amp;#39;t go here. Very disappointed because this location was pretty good until now. See pictures of food in the photo section, if you care to look. The first photo was via Post-mates on 5/5 (old and or freezer burned food). The second picture shows CF&amp;#39;s response when I requested a refund for that meal. The third was from this past weekend 5/19. I only touched the tartar sauce slightly. The fish and cold slaw were received as it appears in the photo. It&amp;#39;s so sloppy and scarce it looks like leftovers.", "rating": 1, "date": "5/22/2018"}, {"text": "Visited this location this passed Thursday, I love this restaurant but unfortunately had a bad experience all because of a bad server. Was here for my sisters graduation dinner a party of 6. 2 guests had to leave a bit early so our server split our checks and handed them to everyone. Some people were still eating and never asked for their checks. I asked him to see a dessert menu and he told me he could not add anything to my check once the bill was split. He told me to take a look at the dressert case on my way out. I found this very rude. He could of easily brought me a menu to take a look and start a new check. Why would I want to take my dessert home? I wanted to eat there and enjoy my cheesecake afterwards without being rushed. It is called the Cheesecake Factory after all. You don&amp;#39;t think to ask if I want dessert?!", "rating": 1, "date": "12/21/2019"}, {"text": "Just paid $17 for a nothing entree! This is ridiculous! Got the shrimp pasta and there is maybe 1/8 a cup of pasta. This is ridiculous. I called to complain and the lady just put me on hold. <br&gt;<br&gt;Update - management contacted me back, so hopefully they do something about this.", "rating": 1, "date": "3/4/2017"}, {"text": "Always a pleasure to come and eat there. The service is great, the food is amazing. I always love to come there and eat.", "rating": 5, "date": "5/19/2019"}, {"text": "This place is a waste for its prime location. No prices on cocktail or draft beers, cheesecake menu.. ok so should we all be pretentious and pay for things we don&amp;#39;t know the prices of? <br&gt;Therefore I asked how much the PASSIONFRUIT mojito is, she said &amp;#34;I believe it&amp;#39;s around $11&amp;#34;... <br&gt;im sorry... I believe? That could mean a lot of things. I don&amp;#39;t want to order a drink and get a check of a cocktail for $14. If I wanted that I could go to Rumor. <br&gt;After I asked for the cocktail price.. the waitress gave me a disdained look and never came back! Didn&amp;#39;t even look at my friend and I again. Ok so I guess she assumed that we were poor cuz we asked the price of a mojito. After literally 15  minutes of no service, no water (cricket).. we LEFT. So I don&amp;#39;t do this a lot, reviewing without trying the food. But here it is! My first and last Cheesecake Factory visit.", "rating": 1, "date": "12/21/2017"}, {"text": "Giving this place a one star due to what I found in my food. My brother order some food to take out for me and as I&amp;#39;m eating what I found was a peace of metal that I was about to cut my month with. What kind of restaurant doesn&amp;#39;t clean it pans and check to make sure theirs nothing left on them. If I had choke or had cut my month or throat they would be hearing a lawsuit from me", "rating": 1, "date": "8/20/2018"}, {"text": "Came here last night for a late dinner! After a bad experience at The Cheesecake Factory at a different location, we still had the tastes buds for this food so we ended up at the one in the Philly. Food was way better! We got the farfalle with chicken and roasted garlic and tomato basil pasta. Both delicious and came out perfect! This is more of a 3.5/5 stars because our waiter never came to check up on us when our food came out so we couldn&amp;#39;t ask for refills on our drinks, he never gave us our bread, and because the women&amp;#39;s bathrooms were a mess - toilet paper on the floors, no toilet paper in the holders. Regardless, this dinner hit our food cravings!", "rating": 4, "date": "2/24/2019"}, {"text": "Came here with 4 other people and we were seated within a few minutes.<br&gt;<br&gt;We were given a menu and then asked about drinks, I got the Peach Smoothie and my friends got water with lemon(the waiter was really chill about it; some waiters might get irritated with extra work of lemon). <br&gt;<br&gt;We started with appetizers which was nachos, cheese covered with something(sorry forgot) and BBQ chicken. <br&gt;<br&gt;The nachos was BIG that 4 of us could not even finish. ONLY get the nachos if you&amp;#39;re super hungry and have a big group of people. The cheese cover was very rich and cheesy. The BBQ chicken was cooked just right and my friend finished that all!<br&gt;<br&gt;The meals came and I got the lunch special of sausage and shrimp pasta. The sausage and shrimp was AMAZING and pasta sauce tasted so fresh!!<br&gt;<br&gt;The peach drink tasted organic and very fresh but I still prefer their Mango Iced Tea but I&amp;#39;m trying to taste all their drinks.<br&gt;<br&gt;My friend got a burger and he asked for cheese on it, in which was not given to us at first but the waiter remembered as she brought it over and went back into the kitchen which shows she has great instinct and memorization, I guess... but the waiter was really good with coming to us regularly and not too much, refilling our bread, and even enjoying some laughs with us.", "rating": 5, "date": "6/25/2017"}, {"text": "Horrible service in the bar area couldn&amp;#39;t get our order correct. I think the poor service was intentional. Requested my money back due to the horrible service. The cook and the servers need to be taught how to discuss orders but again the poor service was intentionally done. Please take classes on race and deal with your discrimination policies because it really showed last night.", "rating": 1, "date": "6/2/2018"}, {"text": "It was in my bucket list to go to the cheese cake factory and have their best cheese cake. I ended up ordering a spicy chicken chipotle pasta for dinner and then ended my night with their recommended Godiva chocolate cheesecake. The pasta was delicious and comes with a huge plate so if you are ordering for just yourself then you might need a takeaway box at the end. The cheesecake was super tasty, but I think this wasn&amp;#39;t the best they have. I will surely try other cheesecakes first and then comment something on it. Btw our server John was very polite and sweet. He recommended both pasta and cheesecake which I appreciate.", "rating": 4, "date": "9/20/2018"}, {"text": "Ever since I was little, Cheesecake was the place to go to bond with family over amazing food. Every person you bring can find something they&amp;#39;ll love on the menu. ALWAYS consistent with their food. ALWAYS amazing ambiance. This location is HUGE for the center city location. I loveeeeeee you Cheesecake Factory.", "rating": 5, "date": "11/5/2016"}, {"text": "I went here once while visiting philly and never again. I literally got up to fill my own water because the server went ghost on us for a half an hour. Eat at home or even at McDonald&amp;#39;s. I promise you&amp;#39;ll enjoy it more :)", "rating": 1, "date": "11/22/2019"}, {"text": "Came here with my boyfriend last night as we were deciding between iHOP and the CF since we were both really hungry and just wanted filling food. <br&gt;<br&gt;The first thing I noticed was that when our waiter brought over our water there were lemon slices floating in it. I&amp;#39;m not a health freak but I always prefer my lemon wedges on the side of the glass because who knows if they even washed them? Anyway it was just a passing thought and I didn&amp;#39;t think anything of it. <br&gt;<br&gt;I ordered the pasta carbonara and immediately I knew there was something wrong. The sauce tasted so bland, except where the waitress grated Parmesan cheese over. I added salt and pepper and there was barely any difference. Regardless, I finished about half of it before my boyfriend and I decided to take the rest of our food to go. <br&gt;<br&gt;I got home and I felt really sick all of a sudden. I went to bed early and when I got up for work the next morning I had an upset stomach. I called out from work and thank God that I did because a half hour later I threw up all the fluids I drank that morning. I threw up two more times afterwards and had an upset stomach two more times later in the day. <br&gt;<br&gt;I didn&amp;#39;t associate this with anything until I called my boyfriend at work and he said it sounded like I had food poisoning. I read up on the symptoms of it and he was right. I was shaking, feeling feverish, and my hands and feet were tingling. I had lost so much fluids that every time I stood up I started seeing black and white and had to hold onto something. <br&gt;<br&gt;My boyfriend has been in the industry for more than 20 years, owned restaurants, been a partner, and been a general manager. He said that when sauces are left out too long, they lose their taste, and that was probably why I got so sick. He said he noticed me seasoning my dish with salt and was surprised as places like the Cheesecake Factory have dishes with high calorie counts and are already so flavorful to the point of being unhealthy. <br&gt;<br&gt;I called the restaurant and told Anthony the GM what I had experienced and he offered to give me a gift card. I said no thank you and would prefer a partial refund for at least my portion of the meal. He said that it was not possible. I even offered to bring in the food we had taken home for him to inspect but he said it was not necessary. <br&gt;<br&gt;Due to his lack of assistance, I called the guest services line in California and they were much more kind even though they still refused to offer a refund, though they did offer to look into the issue. They offered a gift card as well and I was thinking to myself, &amp;#34;are these people serious? They think I want to get food poisoning again for free this time.&amp;#34; I said even if they can&amp;#39;t offer me a refund I don&amp;#39;t need a gift card as I would never return. <br&gt;<br&gt;Clearly TCF Is only interested in money and not winning their customers back or making sure their health inspection standards are on par. Thanks for nothing!!!!", "rating": 1, "date": "11/30/2017"}, {"text": "So this was my second experience with The Cheesecake Factory in Philadelphia and honestly might be my last. My first time going was wonderful. Food and service was great and well worth the price, but this time was nothing compared to my first visit. My waiter was so rude. I tried to give him a break because he seemed tired and it was 9pm but the times after that was a no go. <br&gt;<br&gt;Examples : made me feel rushed to order, very passive aggressive, took my appetizer away even though I wasn&amp;#39;t done with it, asked if the tip was &amp;#34;all of it&amp;#34;. <br&gt;<br&gt;And it honestly just wasn&amp;#39;t the waiter/service, the food has noticeably gone down in size since my first visit. The food was very bland. Just the worst dinner ever.", "rating": 1, "date": "9/2/2018"}, {"text": "The place is well design in the center city location. But the service from the cook is horrible. I ask for a well cook stuffed burger &amp;#34;burnt&amp;#34;. They brought me a rare cook burger. So i let the waitress know. So she said sorry for the mistake. Long story short, the second time around smh. The burger was bloody like hell. I&amp;#39;m glad that i didnt bite into the mess. But all i left out of that place with is sweet potatoes and a free damn red velvet cheese cake.", "rating": 2, "date": "5/9/2019"}, {"text": "This place is so good! They have nice staff! Amazing small plates! I was really impressed about their small plates because it&amp;#39;s not a known tapas place. Who would of known??!! This is not my first visit and definitely won&amp;#39;t be my last..", "rating": 5, "date": "8/7/2018"}, {"text": "The Cheesecake Factory never fails to disappoint. It is for sure my favorite chain restaurant. This time I tried the Chocolate Hazelnut Crunch Cheesecake topped with Nutella that just debuted on July 29th. It was incredible! I hope it&amp;#39;s here to stay. <br&gt;<br&gt;In regards to this location in particular, the building and atmosphere is stunning!!!", "rating": 5, "date": "8/2/2016"}, {"text": "This was probably the worst Cheesecake Factory I have ever been to. The service was terrible, they brought us the wrong dish and then argued with us when we tried to explain why it&amp;#39;s the wrong dish and whah ingredients were missing. The salad had chunks of bad romaine in it which was disappointing. That being said, the food was still good but definitely not up to Cheesecake Factory standards. It&amp;#39;s a shame because the location is ideal and the decor and layout are very pretty.", "rating": 2, "date": "6/5/2016"}, {"text": "This is just steps from my apartment so I enjoy ordering food to go and going to pick it up. Because of this, my food is always hot and delicious. The chicken quesadillas are great, shrimp and angel hair is great, the chicken fingers are delicious, and of course the cheesecake is yummy. So much fat though!", "rating": 5, "date": "1/22/2019"}, {"text": "So I&amp;#39;m a picky eater. I hate it, and no matter how much I try foods or try to force myself to like whatever, I can&amp;#39;t rearrange my tastebuds. I&amp;#39;ll usually order something simple, sometimes I&amp;#39;ll just munch on bread. The rude comments and judgement, sneers, and just plain hatred I&amp;#39;ve received from waitstaff at place I&amp;#39;ve dined has made me almost afraid to go out to eat. <br&gt;THIS LOCATION IS WONDERFUL. My boyfriend and I went here for my birthday and our waitress was friendly, brought extra extra bread to our table without even a second thought, didn&amp;#39;t judge, didn&amp;#39;t make rude comments at my weird eating habits. If I could&amp;#39;ve flagged down a manager I&amp;#39;d have given her a 10 Star review. Service was fast, everything was delicious, we had a lovely dinner, and I&amp;#39;m a little less self conscious about eating at restaurants. Will be eating here again.", "rating": 5, "date": "1/18/2018"}, {"text": "I came here on a Saturday afternoon with a fairly big party of mainly teenage girls. They were done rehearsals and gearing up for a performance in a few hours. Cheesecake Factory with their large menu and portions is a good pick because everyone can find something they like... Since it was lunch time we could order the lunch portions and go easy on the pockets. <br&gt;I&amp;#39;d never been to this location.. So one thing I will say is coming in and seeing the hostess stand on the first floor with no one standing there threw us off a bit, sent one of the girls up on the elevator and she ushered us to come up... As we rode up, we saw the hustle a bustle that is Cheesecake Factory. They didn&amp;#39;t at all seem annoyed or flustered when we told them party of 10... Within about 10 minutes we were seated. We had one waitress that took care of us.. I like that a lot better than having 2 for either side of the table, and she did an awesome job keeping everything straight. We all pretty much knew what we wanted since we needed time for food to digest and settle prior to show time that was one of the requirements, lol know what u want and no dessert. I hated the no dessert rule after all it was Cheesecake Factory, but hey the food was filling. <br&gt;<br&gt;I ordered the salmon off of the gluten free menu, swapped the broccoli for asparagus, so glad I made that choice, I must say some of the best asparagus I&amp;#39;ve had in a long time. The meal as a whole was considerably better than any of the cheesecake factory&amp;#39;s I have been to. There is one 5 minutes from me that I usually end up at, but this one put them to shame. I&amp;#39;m definitely a fan, I usually end up here for convenience rather than choice, but this location is awesome. There was a slight mishap where when two of the girls ordered pasta with red sauce they were asked if they wanted tomatoes, so given the choice they said no, but it came out with tomatoes, when they questioned it, our waitress took it back but then came back saying that&amp;#39;s just how it comes.. She apologized, knowing she had asked them, the girls were fine, pushed them to the side and still enjoyed the meal, overall it was a great meal, everyone enjoyed, it wasn&amp;#39;t dragged out or we weren&amp;#39;t rushed, it was a success!", "rating": 4, "date": "3/21/2016"}, {"text": "I always have a good meal at any Cheesecake Factory but we were on vacation in philly and decided to stop, this was one of the best experiences we&amp;#39;ve had at a restaurant. I wish I could remember our waitresses name but she was amazing and super nice. If we were ever in the area again we would definitely come back.", "rating": 5, "date": "11/6/2017"}, {"text": "Overall, great experience at The Cheesecake Factory . I usually enjoy their seafood and most of their pasta dishes. The one thing that I&amp;#39;ve found disappointing, along with my friends, is their burger. I think the meat just doesn&amp;#39;t taste good. The bread they serve, never disappoints. I love snacking on it while my appetizers and entrees come out. If you visit, do NOT leave without trying one of their cheesecakes! My favorite is the tiramisu cheesecake ! If you love chocolate, their Godiva one is rich in chocolate !", "rating": 4, "date": "10/2/2018"}, {"text": "It&amp;#39;s always good here. The food is consistently good. A big menu so there is something for everyone. I&amp;#39;ve been here several times and the staff has always been helpful and had good opinions about the menu items if you&amp;#39;ve narrowed down your choices to two or three and need help making a final decision.", "rating": 4, "date": "1/26/2019"}, {"text": "Great place too my grandson and my friend with me for the first time in years and loved it my grandson turned 6 they sang him happy birthday and everything and were wonderful our server was great and our food was out at the table before 20 minutes and tasted great and the cheesecake amazing. I wish I could remember the servers name she was amazing", "rating": 5, "date": "4/9/2019"}, {"text": "I can into Cheesecake Factory downtowns Philadelphia location and this is the SECOND day in a row I was not served! I&amp;#39;m highly upset. I wanted to sit at the bar but  whole bar was dirty and there were only 2 costumers sitting at the bar. I asked if the bar be cleaned off and they escorted me to another seat where I didn&amp;#39;t want to sit. Then the server did not give me a menu untill 15mins later I bearly got a chance to ask her for water before she walked away and I still had to wait 20 mins to get water. I was sitting there another 30 mins then finally I left. IM GOING TO MAKE THIS CLEAR it was not that busy especially for diner time the people sitting next to me were finished eating and waiting for a check and also looked very upset.", "rating": 1, "date": "3/15/2019"}, {"text": "We would love to go back there again. The food was very tasty especially the avocado roll The waitress was pleasant", "rating": 5, "date": "9/6/2019"}, {"text": "As for me this is the best place to go for a cheesecake. And the other food is always great and fresh, however I heard a lot of complains from my friend. But I love the place", "rating": 5, "date": "1/28/2019"}, {"text": "My friend, Naomi (also known as BB or Birthday Bitch), invited a group of around 10 friends to the Cheesecake Factory for a celebration of her being born.  I had been to the King of Prussia CF but never to the downtown location.  The CF is always a bit of an odyssey into another world, where people have expendable cash and suburban hairstyles and where decadence is supremely exalted, in both garish displays of décor and overall gluttony.  In this way, the Cheesecake Factory is a quite viscerally American experience.<br&gt;<br&gt;While waiting at the bar I chatted with my buddy, Hawkeye, and spent $10 on a bottled Angry Orchard.  Cocktails were in the double digit range, and seeing how I was a poor social worker masquerading as a person who can afford to eat at fancy restaurants, I opted to not get any more alcoholic drinks throughout my stay.<br&gt;<br&gt;Eventually we were moved to a large table that could accommodate our group.  Our server was polite and attentive and tolerant of our low class requests, such as bringing me hot sauce to pair with the free bread they serve.  Speaking of the free bread, it was delicious and regrettably I ate quite a lot of it despite having given up gluten recently.<br&gt;<br&gt;Communing with the other indigent social workers, Hawkeye and I decided to split some nachos with our friend Brenda.  The calorie content was well over your overall daily allowance so it seemed that splitting it three ways would be wise.  Getting swept up in the gluttony of this establishment, I impulsively decided to also order their &amp;#34;Nashville Hot&amp;#34; chicken nuggets which were only $5.  They claimed to be quite hot, which I considered dubious but figured it was worth a try.<br&gt;<br&gt;When the nachos arrived, they were as enormous as we had hoped and had generous portions of good toppings including spicy chicken, cheese, sour cream, guacamole, and salsa.  I wouldn&amp;#39;t say that there was anything particularly &amp;#34;special&amp;#34; about these nachos, but they were large, filling, and tasty so I was very happy with this decision.  They were also more than enough for three people and frankly I did not need my impulsive chicken nuggets.  Speaking of the chicken nuggets, I found them very underwhelming.  Only one chicken nugget out of ten was sufficiently saucy and the overall heat level was practically imperceptible.<br&gt;<br&gt;BB&amp;#39;s new man friend, Landon (who worked hard all night to prove to us that he wasn&amp;#39;t a Blandon) got the fried mac and cheese balls and generously shared with the table in what I can only imagine was a ploy to win good favor in the group.  These were cheese-filled pillows of heaven and you could only hope to be so lucky as to get to experience them for free at some point in your lifetime.  He also got a very mysterious dish which was a pizza made with chicken-parmesan crust and pasta on top.  I didn&amp;#39;t get to taste it but I can only imagine that it was quite indulgent.<br&gt;<br&gt;At the conclusion of the meal, a handful of the brave ordered cheesecake.  Thanks to the plentiful free bread I was bloated up like a hot air balloon and had no money or appetite left for dessert but I admired those that were able to go &amp;#34;all the way.&amp;#34;  I have had CF Cheesecake before and it&amp;#39;s incredibly delicious, probably as a result of each slice including over three quarters of your daily calorie content.<br&gt;<br&gt;In the end, what could be more wholesomely American than group of ten 20-something-year-olds (okay fine, I&amp;#39;m 30...) caucusing in the soft glow of ornate chandeliers of ostentation, eating a week&amp;#39;s worth of calories in food they will have to buy on credit to afford, surrounded by suburban families ignoring everything but their iphones.  BB seemed happy to usher in a new year of life in this manner and frankly I enjoyed myself and the food very much.", "rating": 4, "date": "6/19/2017"}, {"text": "I Love this place! The atmosphere, the drinks, the food,all of it... Well except maybe one small matter. The wait staff. That and that alone is what this place lacks in all of their restaurants. They hire these very young immature kids that just don&amp;#39;t have any class and do not give this great establishment the props it deserves. These kids are not the most intelligent young people this world has to offer. ( Please don&amp;#39;t ask them to do math) but with that said, I still LOVE THIS PLACE!", "rating": 3, "date": "12/20/2018"}, {"text": "Wow this was a perfect place for my 17 year old son and I to have a nice dinner and enjoy ourselves. Tiera was our server - she is absolutely amazing!!! The best!!! She has a great personality and was always checking in on us, we loved her! The food was perfect, tasty, yum!!! We were so happy, thanks for a great meal in Phily!", "rating": 5, "date": "7/11/2018"}, {"text": "This is a cheesecake factory review for their dessert because imo that&amp;#39;s what sets them apart!! <br&gt;<br&gt;Although cheesecake is in the name, I would say the sundaes are a slightly better dessert option on the menu! I have never been disappointed in a cheesecake from here but I have also never been stuffed. If you want to have a large dessert to share, I would suggest the hot fudge or rocky road sundae. It&amp;#39;s large enough for 2-3 people and if you ask for no whipped cream I&amp;#39;m almost positive you get more ice cream haha.", "rating": 4, "date": "8/13/2016"}, {"text": "At Cheesecake Factory...<br&gt;<br&gt;And I keep asking myself, why I&amp;#39;m here? and why anyone would want to come here. <br&gt;<br&gt;If you are planning on going, I&amp;#39;ve got you covered:<br&gt;- Grumpy, unsmiling staff, including the host!<br&gt;- inattentive , slow, and totally uninformed waitress. P.s: she was friendly thou.<br&gt;- No prices on cocktail menu. <br&gt;- Dirty silverware!!!<br&gt;- Mediocre mango key lime cheesecake.<br&gt;- I don&amp;#39;t understand why it was so difficult to split the check. <br&gt;<br&gt;One and half Yelps is two generous!", "rating": 2, "date": "8/6/2015"}, {"text": "Overall I love the Cheesecake Factory and it many locations but this one is pretty amazing. You get to go up these escalators just to get to the restaurant which is pretty fancy, not to mention the awesome views of the city. Food and service excellent.", "rating": 4, "date": "12/6/2017"}, {"text": "We waited at our table for 15-20 minutes and never received any service. After asking several waiters about our waiter we were rudely ignored.", "rating": 1, "date": "8/17/2019"}, {"text": "The place is so great. The atmosphere is really nice. I order same food almost every time I am there, and it is always perfect. And cheesecakes, salted caramel cheesecake is absolutely the best. Servers are always friendly and nice. All in all one of the best places to go for a romantic dinner or a night out with friends.", "rating": 5, "date": "2/7/2019"}, {"text": "Great lunch out! I had the fried zucchini appetizer and the carbonara with added chicken. They do lunches until 5pm and happy hour from 4pm. Sat at the bar, service was great, very friendly.", "rating": 5, "date": "12/5/2017"}, {"text": "This location just recently opened so I think they&amp;#39;re still sorting out everything. I got the chicken pasta carbonara and my friend got the santa fe salad. She asked for her salad dressing to be on the side but they mixed it in. The waitress was really nice about it and got her another one but it took awhile. From the time we sat down to the time we left it was a good 2.5-3 hours. <br&gt;<br&gt;Location- 5/5 Excellent decor and location is right in the middle of center city on 15th and Walnut<br&gt;Food- 3/5 Average cheesecake factory food<br&gt;Service- 3/5 They&amp;#39;re super busy and the food took awhile to come out<br&gt;<br&gt;If you come here just remember to factor in time....", "rating": 3, "date": "7/13/2015"}, {"text": "Service was extremely slow. Food was nothing special - i could easily make them in my own kitchen faster than our 1 hour wait to get our food. Due to the long wait my boyfriend ordered 2 beers and they refused to let him have more than 1 at a time.... Now that is just cruel. Waitress was sweet and professional, but this location seems to be understaffed and unorganized. Will not be coming back until i get a gift card.", "rating": 2, "date": "7/24/2019"}, {"text": "Very fancy decor. Food was okay. We got the oreo cheesecake, which was great. I&amp;#39;m not a big fan of cheesecakes, but the oreo was pretty good compared to the others I&amp;#39;ve had. <br&gt;<br&gt;Extravagant, dim-lit restaurants (or cheesecakes) are just not for me though. It&amp;#39;d be a good spot for special occasions or dates, but i think it&amp;#39;s rather overrated.", "rating": 3, "date": "2/19/2016"}, {"text": "One thing dont expert same what we expert from other chesse cake factory <br&gt;Moo was our surver he is good , food was assume like always we had stuff mushroom .chickrn blast , tax max egg roll but I will tell u secret why I always love chese cake factory is ? Only standered ,I usually go at king of pusria they always have same dress for everyone and how they talk ,how they present everything ,still love this place but could be little bit more ,I will come back again ,thanks to be have this location in city .", "rating": 4, "date": "9/7/2015"}, {"text": "Pretty basic. I liked our appetizers: Chicken samosas and shrimp rolls (Vietnamese style). You know, Cheesecake Factory has their standard items. My rating is pretty much for the service here. It was just slow. It appeared our waiter was stretched too thin, there were some times he was overattentive, but for a large portion of the meal (we were there for lunch), he was MIA. There were swaths of time where all of our dishes were on the table without being taken away for room, where we wanted more water, where we waited to order the food, waited for the check. It just was inconsistently timed the whole lunch. It&amp;#39;s a nice location, but I have yet to be wowed at this Cheesecake Factory&amp;#39;s service.", "rating": 3, "date": "8/1/2017"}, {"text": "The Cheesecake Factory was AMAZING, but pricey. Not everything was good, but if you order the right things, it&amp;#39;d be a perfect meal.<br&gt;The portions were huge as well. If you&amp;#39;re an average eater, one entree is good enough for two. <br&gt;<br&gt;Four of us had 1 appetizer and 3 entrées, 2 cheesecakes and 1 ice cream. The bill came up to 100. Just to let you know. Service was great, though food came a little slow. Still. Food was food. No complaints. <br&gt;<br&gt;Orders: <br&gt;Calamari - was salty, though with a nice crisp. Still not worth it<br&gt;Bang Bang chicken and shrimp - distinct Thai flavor with pineapple. Great great dish if you love Thai. <br&gt;Steak Diane - amazing. Very well done. Had a medium rare. Mushrooms were perfect. <br&gt;Some sort of deep fried chicken pasta - very average, even possibly below average. <br&gt;Smores cheesecake - Fantastic, if you love Smores or chocolate.<br&gt;Red velvet - average, nothing outstanding<br&gt;Hot fudge sundae - below average, was meh.", "rating": 4, "date": "10/29/2016"}, {"text": "This was probably the worst experience I&amp;#39;ve ever had at a Cheesecake Factory. Got there at 11 am with a party of six. Our party ordered a mix of lunch specials. <br&gt;<br&gt;My meal, the Chicken salad sandwich, was almost 100% mayo. Just pure mayo. Not even sure if there was chicken in it. My friend got the Orange chicken lunch special and it came out cold. The texture was extremely mushy, it almost disintegrated in your mouth. A burger at the table tasted and looked like they found it in the dumpster. Buffalo chicken sandwich had no buffalo sauce on it. Fries and nachos were good but not sure how you can screw those up. Some things in our table were almost inedible. <br&gt;<br&gt;Service was good and attentive but the restaurant was completely empty so can&amp;#39;t speak to the quality when they are busier. <br&gt;<br&gt;To be fair, we didn&amp;#39;t bring these negative comments up to our server or management as we just really wanted to get of out there but this location NEEDS to shape up and immediately.", "rating": 1, "date": "9/16/2018"}, {"text": "Walk in and notice it&amp;#39;s a 2 story restaurant and I stand at the hostess stand for 3 min. After waiting I decide to walk up stairs to try and find someone, to no avail. So, I walk back down stairs and wait another 5 min with 2 other parties. Eventually I decide to call the place and with no apology they say come up stairs. I&amp;#39;m greater by a manager being told someone made a mess of the bathroom so the hostess had to clean it up. There is so much wrong with this situation! <br&gt;<br&gt;After being sat I waited and waited for service ...<br&gt;<br&gt;By far my worst experience at a Cheesecake Factory.<br&gt;<br&gt;On a good note once I received service he was very professional and had great service.", "rating": 1, "date": "5/23/2017"}, {"text": "Love the cheesecake which is really amazing and the interior of the restaurant looks so fancy. The only thing that I complained about just the service. The food came out way too long which took about 40 minutes. Overall is okay.", "rating": 3, "date": "11/14/2017"}, {"text": "In philly for a conference and are at many a cheesecake factory - always good.  Ordered the edamame appetizer and steak diane shrimp scampi combo.  The scampi was cold.  I don&amp;#39;t mean it was only warm.  It was less than room temperature.  Waiter took it to heat it up.  In the microwave...   there&amp;#39;s a reason microwaved shrimp isn&amp;#39;t on the menu it turns rubbery.  And the medium steak becomes well once nuked...  but not to fear, as the waiter went to heat up the plate, the edamame arrived.  Yup 5 minutes after the main was served.  Yup that be backwards.  So I though I&amp;#39;d salvage the mean with a nice ice cream Sunday.  Ordered it and a few minutes later comes back and says they are out.  He nicely rattled off all the deserts they were out of (at 6:15 PM- not 11:00 mind you when you would expect that).  So that&amp;#39;s 0 stars for the food.  Waiter was a nice guy though.", "rating": 1, "date": "4/16/2019"}, {"text": "On busy nights, it can be very loud and feel crowded because the tables are close together, along with long wait times. If you&amp;#39;re able to get a seat in the patio, it is unbelievably quiet and like you&amp;#39;re in a whole different restaurant. I do wish reservations were accepted on the weekend. With that said, the food is amazing (especially the mac and cheeseburger), the service is amazing, and my husband and I request the patio and just spend the wait time enjoying each other on our night out, so this is definitely one of my favorite restaurants", "rating": 5, "date": "3/14/2019"}, {"text": "I am a sweet-tooth, so I like desserts. And cheesecake factory offers a great deal of it. My first time was a definite &amp;#34;Yehey!&amp;#34;. I like the setting and I remember I enjoyed my food, serving was huge, i like their complimentary wheat bread, plus I have Godiva cheesecake too. I would recommend this place for first time visitors in Philadelphia or in the US. Try it!<br&gt;<br&gt;However, I feel i got used to it and later on I feel that there&amp;#39;s really nothing &amp;#39;wow&amp;#39; on the menu if ever you will have lunch or dinner there, save for the cakes of course.", "rating": 3, "date": "7/23/2017"}, {"text": "Beautiful place for a lavish dinner. The menu is cheese cake factory, the feeling you get when you come here really accentuates the dining experience.<br&gt;<br&gt;The menu has been updated with newer items I have never seen before. My favorite go to of all time is Thai lettuce wrap, you can&amp;#39;t go wrong with a plate of healthy veggies along with some chicken.<br&gt;<br&gt;Service is overall friendly and the view when given at certain seating locations is amazing. One of the best places for birthdays or anniversaries.<br&gt;<br&gt;Highly recommended", "rating": 4, "date": "9/5/2015"}, {"text": "This was my first time here it was four of us I liked that it was not very crowded but it was very dark could not read the menu without my phone flashlight my server was all over the place we got water after our beverages and we waited a whole for him to come back n take my son&amp;#39;s order since they say we serve breakfast all day but they don&amp;#39;t only certain things but the food was good I thought for the price I did not get enough shrimp n I think for the amount of people there our server was just not available when we needed him I will return saw something on the lunch menu I would like to try but drinks are beyond pricey 14.00 for a margarita that was not good", "rating": 4, "date": "10/12/2017"}, {"text": "This was our second time at this location the first time was great. This time sucked so bad. The bread cold ask for it to be heated twice came back then burnt but hot.... then the tempura shrimp was disgusting and cold and shriveled up. Never had such a bad experience. Then my salad had cold chicken on it. Awful awful", "rating": 1, "date": "4/23/2019"}, {"text": "Cheesecake factory has been around for the longest but we decided to dine in tonight because the waiting line at max brenner was just too crazy . I first had cheesecake factory when it was opened years ago back at home in Boston. I never really liked the food there . 5 stars goes towards their cheesecakes though. So we decided to give cheesecake factory a second chance. <br&gt;<br&gt;When we first walked in hostess greeted us but gave us a weird look instead of a smile . Points off there . And then told us there&amp;#39;s about 15 to 20 mins wait and we said okay that&amp;#39;s fine. She didn&amp;#39;t lock us in the computer at first until another  group came in after us and see us just standing there. We then was given a number beeper and told we could go right ahead upstairs . Surprising the wait wasn&amp;#39;t long . So that was good .<br&gt;<br&gt;Took us a bit to look over the menu because there was a variety to choose from. So our waitress came and took our orders for drinks and apps . We decided to get buffalo Blast and dynamite shrimp for appetizers (as pictured) . The Buffalo blast was good . The dynamite shrimp was okay. It could use a little more flavor . For entrée I decided to go with the chicken marsala and my boyfriend got the meatloaf. When the drink came she only brought my boyfriend drink and told me my drink will be out shortly. I thoughts all the drinks supposed to come out at the same time and not just one and while the other wait for theirs . But okay. The first appetizer came out which was the Buffalo blast half way eating it my drink still hasn&amp;#39;t come yet and I was thirsty after a few bites . My drink didn&amp;#39;t come out until my entrée came out which was probably 20 mins after . Sign of bad service because the couple next to us ordered drinks and all their drinks came out right away by a different waitress . After a few bites of our food we was ready to leave because my boyfriend didn&amp;#39;t like how his food taste and my chicken marsala was sweet and the sauce tasted burnt while I was eating it . I didn&amp;#39;t want to make a big deal out of it so we just asked the waitress to packed the food to go . I should of just stick to my instance and went elsewhere because the food hasn&amp;#39;t meet our expectations . I won&amp;#39;t return to dine in but definitely for the cheesecakes.", "rating": 2, "date": "12/26/2016"}, {"text": "Ate here yesterday.  Within 1.5-2 hours of finishing my meal full blown food poisoning symptoms began.  As of the next day I&amp;#39;m still home sick.  Will not return, ever.<br&gt;<br&gt;(I ordered tuna tartare, spicy Caesar, and a slice of classic cheesecake with strawberries)", "rating": 1, "date": "11/29/2018"}, {"text": "First time eating at this particular Cheesecake Factory. I would say it&amp;#39;s consistent with my expectations for Cheesecake Factory restaurants in general. The server was very nice and responsive. The food was also good. We had a couple of apps: chicken tacquitos and the buffalo chicken nuggets. Both were good but if I had to pick I&amp;#39;d go with the tacquitos. <br&gt;<br&gt;For my main course I had the Thai chicken with mango. As always with CKF the portion was big and I am now busting at the seams. I thought the chicken and the sauce were good. <br&gt;<br&gt;Surprisingly enough I did not have any Cheesecake! But I have had it before and they are all delicious.", "rating": 4, "date": "5/12/2017"}, {"text": "Date night. Normally we love cheesecake factory but everything that could go wrong with this trip did. <br&gt;<br&gt;It starts with not being brought water for the longest, then we didn&amp;#39;t get our order taken for a very long time. <br&gt;<br&gt;We started our order with the Buffalo Blast appetizer, which NEVER came. The drink my partner ordered took about 20 minutes to show up. <br&gt;<br&gt;Our main dishes were the truffle honey chicken which had good flavor but was 90% breading and the bang bang chicken and shrimp for which my partner asked for extra sauce and received only when his dish was half gone, and then it was the wrong sauce. <br&gt;<br&gt;Our waiter (Daveanghn) made little attempt to explain or correct any of the wait times or errors. While they were busy, he only had 4 or 5 tables in our section, so we were baffled by the lack of service. <br&gt;<br&gt;This coupled with a few questionable lunch experiences (my office is right near the walnut st location) probably means we won&amp;#39;t be returning to this location.<br&gt;<br&gt;We were too dissappinted to even stick around for cheesecake this time around! :(", "rating": 1, "date": "2/24/2017"}, {"text": "Been here twice. Make sure you get here on an empty stomach if you plan on eating a slice of cheesecake on your own. Second time me and a friend decided to share a slice. No problem, they split it in half on two plates. Both times I have experienced really god customer service. The waiters are awesome. Only downside is that some of the seating area are kind of busy and feels like a school cafeteria.. But love their cheesecakes!", "rating": 4, "date": "6/13/2018"}, {"text": "We walked into this restaurant super excited for Cheesecake Factory. The downstairs receptionist station was unmanned and no sign to say proceed upstairs. After waiting for several minutes we decided to go upstairs to see if that&amp;#39;s where we needed to go after a group of 8 passed us proceeding upstairs. We were seated in an area with a nice view. The waiter didn&amp;#39;t come to our table for about 20 minutes. By that time we were annoyed. He asked us if we were ready to order and when we said yes, he walked away. He walked by our table 3 times before we finally got his attention to place our order. The food came out faster than it took our waiter to first make an appearance at our table. (Another waitress brought it out to us.) I ordered the Miso Salmon. It was beautifully plated. The salmon was really good on the edges but a bit dry in the middle. My rice was over cooked. My mom ordered a salad which she really enjoyed. We both got cheesecakes to go. I&amp;#39;ve never had this bad of service at a restaurant before.", "rating": 2, "date": "5/23/2019"}, {"text": "As someone who has been to Cheesecake Factories around the country, this by far is the worst location I have ever visited. Everything was fine until I found two to three long hairs in my pasta. Our waitress wasn&amp;#39;t attentive and after sitting there for a while we ended up flagging down another waitress. I was asked if I wanted a new dish, but the pasta itself was so bland it wasn&amp;#39;t worth the wait. I ordered chicken carbonara, which is supposed to contain a creamy sauce. There was barely any sauce on the pasta and the chicken was very bland. The food was also extremely salty. My dads dish was so salty it was almost inedible. After my pasta was taken away our waitress avoided the table completely. Mind you when she apologized about the hair I told her it was okay and in no way showed signs of frustration. I do have to say I&amp;#39;m surprised no manager was sent over, but they did take the dish off the bill. We did have to give our bill to another waitress after sitting there for awhile with the check. Our waitress did not return. Overall, bad food and bad service.", "rating": 1, "date": "11/17/2019"}, {"text": "As much as I hated to lower the rating, last night was the last time I am going to this location.  We got there around 5:45, and it wasn&amp;#39;t terribly busy.  We got seated, and 10 minutes later, no one came by.  Then a table was seated to our left and one to our right.  They got their drinks, and we never were even greeted yet.  A server came by, asked if anyone helped us yet, and said that it wasn&amp;#39;t her table but she would take our order.  I asked for the Renee&amp;#39;s half sandwich and soup because the soup sounded really good, and even thought it was hot out, I wanted to try it.  Ten minutes later, the server came back and said that the Renee&amp;#39;s special was only for lunch.  I looked at the menu again, and while it said served until 5:00, the special was also on their regular menu of sandwiches.  I showed it to our server, who said &amp;#34;The computer wouldn&amp;#39;t let me enter it, I&amp;#39;ll try again.&amp;#34;  We finally got our waters, and I assumed all was fine.  FIFTEEN minutes later, the server comes by to tell me that the soup is completely different.  I looked at my husband and said, lets just get the check.  The server said ok, and walked away without trying to fix the situation.  After watching her give the checks to 3 other tables, my husband and I got up to leave, but stopped to speak to the manager.  <br&gt;45 minutes sitting there and walked out because no one seemed to know what food they served (twice) and how to get us drinks and our check.  NEVER AGAIN.", "rating": 1, "date": "5/10/2018"}, {"text": "I DESPISE chain restaurants. It&amp;#39;s definitely not my first choice but on a pouring rainy day semi tired from work we settled on something quick and easy...so we thought. <br&gt;Shrimp Alfredo- shrimp was dry and chewy, Alfredo pasta was season less, it&amp;#39;s really hard to mess up a dish that&amp;#39;s typically good if you just dump sauce on it but Cheesecake Factory center city found a way to make it bland and not very enjoyable.<br&gt;Filet mignon and cheese balls-wanted to swap out one of the sides that came w/ the steak for the cheese balls and simply add the extra cost <br&gt;(if necessary) since cheese balls are $10 and the sides are $5. They made such a huge deal about it. I even suggested they comp the cheese balls just to accommodate us as paying customers and that was empathically denied. Our waiter Christian was kinda cool but had NO power or willingness. The manager Manny was incompetent and rigid. I even said to him, &amp;#34;Manny you aren&amp;#39;t very good at your job are you?&amp;#34; Lol <br&gt;They didn&amp;#39;t bring a steak knife for my friend to eat the steak with. They ran out of Riesling and the their Mojito was gross, had to send it back and just got Gingerale which was $3.00 and NO refills. <br&gt;<br&gt;The entire experience was blah and reminded me why I&amp;#39;m so picky about the places I choose to dine. Never again will I allow anyone to make me feel guilty for being a dining snob. I&amp;#39;ll simply remind them of this experience and hopefully they get it...if not...ill be far away at Devon or Parc and I won&amp;#39;t hear their judging.", "rating": 1, "date": "6/23/2016"}, {"text": "Take the escalators up to the lively and spacious Cheesecake Factory located in the heart of Center City Philadelphia.  This place is known for their inviting ambiance, and more importantly,  the extensive variety of delicious cheesecakes they provide.<br&gt;<br&gt;Food: 3.5/5 - The cheesecakes are without a doubt their signature desserts.  Rich, sweet, and absolutely fulfilling, these pieces (running from 6-8 dollars a piece) will have you wondering what flavor you should get on your next visit.  Their main dishes are not as impressionable and tend to be over-seasoned.  Many of their dishes consist of pasta, sandwiches, and other familiar American favorites (roasted chicken, tacos, etc).  The cheesecake alone gets a 4.5/5 rating in my book; however, the other options do not measure up.<br&gt;<br&gt;Service: 3/5 - The waiters and waitresses are friendly but tend to get lost during peak dining hours.  No matter what request you have, they are extremely happy and willing to fulfill your request.... it may just take some time to get your check or that extra straw you needed five minutes ago.<br&gt;<br&gt;Ambiance: 3.5/5 - Like any other Cheesecake Factory, this location is spacious and has a high-ceiling providing a nice break from the usual Philadelphian restaurant scene.  The warm colored interior invites birthday parties to the casual diners.  <br&gt;<br&gt;Value: 4/5 - For a restaurant chain, the prices tend to be on the higher end.  However, these prices are justified by their huge portions.  They are much greater than your typical restaurants (especially in for being in the city).  More often then not, you will be coming out quite full and taking home the leftovers.<br&gt;<br&gt;OVERALL RATING: 3.5/5<br&gt;<br&gt;Personal Recommendation: For the best Cheesecake Factory experience, I recommend coming here just for the cheesecakes.  Expecting or looking for more will probably leave you a bit unsatisfied.", "rating": 4, "date": "7/31/2017"}, {"text": "Cheesecake Factory? Pfffffttttt .... More like Macaroni House! Am i rite??? Dont like it fight me", "rating": 3, "date": "7/25/2018"}, {"text": "I tried calling for a to-go order and was placed on hold 8 different calling times and no one ever picks up. Finally told someone who answered I kept being put on hold to no answer, and her response was just &amp;#34;please hold.&amp;#34; TERRIBLE customer service.", "rating": 1, "date": "4/26/2018"}, {"text": "First time at this location and I was impressed! The service was excellent (our server&amp;#39;s name was Steven). He was very attentive. We had a party of 4, celebrating a birthday. I ordered jambalaya which was great and plentiful. The other ladies had sandwiches which they enjoyed. Crab balls and calamari for apps, sweet potato cheesecake to go. Will definitely return!", "rating": 5, "date": "11/7/2017"}, {"text": "Our server was friendly. That&amp;#39;s the best thing i can say about our experience tonight.  We waited an extremely long time to be served dinner salads and when the salads were finally delivered only 4 of the 5 were correct.  So the 5th one was sent back and our friend was told that waited (she didn&amp;#39;t even have an appetite anymore) <br&gt; hers to finally be served, after the rest of us were basically finished ours.  The table next to us arrived after we did, were served their hot dinners and were eating by the time we had called over the manager to complain on the missing salad. The kitchen was unable to create a simple timely salad There were just 5 of us dining tonight. Manager comped the completed5th salad. Nothing else was done by the manager to leave us satisfied with this dining experience.  Don&amp;#39;t waste your TIME and $.", "rating": 1, "date": "10/12/2016"}, {"text": "Gross. I&amp;#39;m not a germaphobe but they need a new dish washer. My first glass of water was sticky and had food flake off and then I ordered some and it came with big red lipstick marks. The service was terrible and then annoying. We&amp;#39;d ask for a menu or a side of dressing and it&amp;#39;d take 20 min but while my friend were clearly in conversation catching up our server kept budding in awkwardly. The cheesecake was good but that&amp;#39;s about it.", "rating": 1, "date": "9/20/2016"}, {"text": "I love the complimentary warm bread served at the beginning.<br&gt;<br&gt;The greek salad is good! I also liked the white chicken chili off the Skinnylicious menu.<br&gt;<br&gt;Original and smores cheesecake are A+", "rating": 4, "date": "10/22/2016"}, {"text": "Had a no calorie count kinda day today and I enjoyed it by having the delicious cheesecakes (while chocolate raspberry truffle being my fav of all). <br&gt;Starters: Avocado egg rolls was yum specially the dip that comes with it just makes it perfect. I loved it. Nachos was alright. <br&gt;Main course: bang bang chicken and shrimp. Was too sweet for me. I am not sure if it always supposed to take like that but I did not enjoy it at all due to the sweetness. <br&gt;Dessert: Plain cheesecake and raspberry truffle. <br&gt;Great place to go when you are a big group and everyone has a different cuisine in mind as this place serves almost everything right from eggs to desserts!! Low calorie and full of calorie!! <br&gt;I took off 2 stars only because the service seemed slow even on a empty afternoon lunch hour. We were a big group (16) no doubt but I think we needed 2 people to take care than just 1. The server was really good no complains but taking care of so many people was too time consuming and there was a long break between the appetizers and main course. <br&gt;The quantity of food is huge. Definitely value for money!!", "rating": 3, "date": "1/26/2017"}, {"text": "Great restaurant, but bad experience at this location: <br&gt;<br&gt;Overall, typically: great food, especially drinks and cheesecake, at relatively more expensive prices. Nice atmosphere. <br&gt;<br&gt;Bad experience tonight: Went here for half off cheesecakes. Sat at a table by the bar around 8:30pm and ordered our three slices of cheesecake. After about ten minutes, the waiter came to us and told us they were backed up in the bakery so it would be longer. We waited a total of ~40minutes until our cheesecakes arrived, and this was after having our nice waiter check in on them twice. A quick bite for cheesecake turned into an hour and a half meal... Do not recommend coming in for half off cheesecakes, unless you are willing to really wait.", "rating": 3, "date": "7/31/2017"}, {"text": "Good for crowds.....<br&gt;<br&gt;It&amp;#39;s nice to have a family chain restaurant in the middle of the city.  Nice design as expected.  Huge place with large dining area.<br&gt;<br&gt;It was crowded on a busy Saturday afternoon.  Didn&amp;#39;t seem under staffed but service was at a crawl.  Although our server was really nice.  They placed us in an extended room (probably the private dining space).  <br&gt;<br&gt;Weird that there was no music and we can hear all the other tables around us.  Asked to turn on some music to drown out some of the awkward silence and that never happened.  Oh well.  I just figured a good manager would know how to set the ambience though the establishment.  Where we were seated was probably an after thought.<br&gt;<br&gt;Food.....it was ok.  Probably over priced for the entree that we ordered (some pasta, burger and appetizers).<br&gt;<br&gt;Overall I still love this Chain because I feel comfortable enough to bring my kids here and not worry too much about their fussiness.", "rating": 2, "date": "2/14/2018"}, {"text": "I have written other reviews regarding the regular dining menu at TCF. this review is strictly about the happy hour menu offered between 4 and 6PM Monday thru Friday.<br&gt;I have gone once by myself around Five PM and it was very busy but my experience was very good. had to wait a bit for drinks sometimes but considering thre rush the delay was understandable. This time i went with a friend and we showed up right after Four PM. Big difference in the room. Not nearly as busy or loud.<br&gt;I&amp;#39;ll just list the items that we ordered along with their happy hour price-Chicken Pot Stickers ($5.50), Crispy Crab Bites ($7.50,real crab meat), The Warm Crab &amp;amp; Artichoke Dip ($5.50-had two orders in house and my friend ordered one to go, that&amp;#39;s how great the dip is. Intoxicating and addictive!), Dynamite Tempura Shrimp ($6.95-not as spicy as I had been led to think they would be but good flavor nonetheless. If you order the house wine, be it white, red, or zinfandel, (I had my usual Merlot) the price is $5.50. Name brand wines will cost more (Like my friend&amp;#39;s Moscato @ $9.50). You can get beer for $3-4 and drinks such as Long Island Iced teas, mojitos, and margaritas for $5.50! There are so many appetizers that we didn&amp;#39;t get to try this time nut are looking forward to on our next trip. The price is right and the earlier you come the better the service will be. After five it can get busy so things will take longer. Wanted to also mention our server Craig M. who answered our questions and, if didn&amp;#39;t know the answer, he would go and find out. He was friendly and patient, even bringing us fresh, warm bread when the first basket came out cold and hard. Thanks Craig! <br&gt;So, if you are looking to try The Cheesecake Menu without paying the regular prices, try their happy hour. You will probably be tempted into going back to try the regular menu at some point in the future.", "rating": 5, "date": "8/26/2016"}, {"text": "As someone who is part of the industry and has been to Cheesecake multiple times, my friends and I were especially disappointed. The food was fine, you always know what to expect. <br&gt;<br&gt;The service: To our server James, I guess he was having an especially bad day (we know bc he complained to us and our surrounding tables multiple times how he&amp;#39;s been here all day). His banter with other tables as well as ours was EXTREMELY uncomfortable and inappropriate!!! Things were said that should NEVER be said as a server or by anyone in the service industry. <br&gt;<br&gt;We waited an absurd amount for literally every part of our meal. We didn&amp;#39;t get water or greeted for a good 10 minutes, in an empty restaurant. After we paid the check (which when we corrected him he told us to just give him $** amount bc I guess he didn&amp;#39;t feel like changing it in the computer) and tipped him we waited around for our to go cheesecakes patiently even after everything, he finally came up to our table and said &amp;#34;you can stay as long as you like I&amp;#39;m just gonna get this out of your way&amp;#34; and took my friends tipped check and the menus, but ignored the empty dishes in front of us. Then we told him we&amp;#39;re sitting here waiting for our cheesecakes, which he so obviously forgot. Even after very clearly letting him know how to separate them for the 3 of us he brought it over in one bag... I am extremely forgiving of service where ever I go, and never leave this long of a review, unless it is this bad and a place where I expect a higher standard.", "rating": 1, "date": "10/23/2017"}, {"text": "Been here twice, once for happy and once for lunch. My waitress was efficient and friendly. The food was soooooo good. My mother and I had the buffalo blasts as an appetizer. They are so good, highly recommended. Tastes like they were made from scratch. For the main course I had the chicken and shrimp gumbo while my mother had some type of chicken Alfredo. I ordered a passion fruit mojito, a little too fruity, it made my stomach hurt. Then finally for desert I had the snickers cheesecake. Omg it was so good. Everything was so good. Although it was crowded when we went, we didn&amp;#39;t wait that long for food. Their menu is a little price so expect to spend at least $75-100.  Can&amp;#39;t wait to go back", "rating": 5, "date": "3/1/2016"}, {"text": "We came here for lunch today. The lettus wraps were served with wilted brown lettus, after we asked for fresh lettus we were brought a mix of fresh and wilted. The chicken it came with had skin on pieces which wasn&amp;#39;t appealing. The chicken was also difficult to cut. The fresh vegetable salad was mostly lettus. We&amp;#39;ve ordered both dishes at other franchises and had much better experiences. The waiter was nice but we are currently still waiting to overpay for our rather disappointing lunch.<br&gt;<br&gt;We will not return to this location.", "rating": 2, "date": "5/12/2016"}, {"text": "This evening I visited the Center City location of the Cheesecake Factory. My review is more about the amazingly kind service we received from the managers and the waitstaff after a very unpleasant incident. My two toddler sons and I were seated in a both behind a family that appeared to be recently seated as well. As I was placing our order with Priyanka our server, the woman behind us yelled that my 3 year old son had spit at her and on her. I immediately apologized and insisted he apologize, misunderstanding what the woman was insinuating. What she did not realize is that my son has struggled with speech in the course of his development and it appeared he drooled while chewing on his fingers on the marble surface between the booths as he was excited and trying to speak. The woman then berated my parenting and screamed at me in front of a crowded restaurant. Despite this unpleasantness, Brie and Brian the managers comforted and reassured me that no one saw my son spit on a stranger. They handled the situation beautifully and I am forever grateful.", "rating": 5, "date": "6/19/2019"}, {"text": "Food is great  staff are kind also place is big and nice  so  i will visit again soooon", "rating": 4, "date": "6/27/2017"}, {"text": "It&amp;#39;s a shame, I love the food here. But this past weekend makes my 3rd trip to this location and the service is just fecal. Waited for an insane amount of time for a drink AT THE BAR while we waited for our table.<br&gt;<br&gt;Our eventual server this time was actually terrific, I wish I remembered his name. But the rest of the experience was at best mediocre. And the food just took for fargling ever to come out. And it&amp;#39;s never even busy enough to justify the slow service. <br&gt;<br&gt;Also it&amp;#39;s always super warm in there, maybe turn your AC on? It&amp;#39;s Rittenhouse Square for Pete&amp;#39;s sake, pick your game up a little.", "rating": 2, "date": "3/1/2017"}, {"text": "Just walked out of there after standing in the entrance while the greeter with the long messy blonde hair was on the phone gossiping. My party and I were confused about whether we wait for her to finish or go up the giant broken escalator. So I kindly asked if we go up because we were unattended and she was clearly trying to avoid us. Then she held her hand up and said one minute please in an aggravated tone. So after going in circles for 30 minutes trying to find parking we dont even get acknowledged when we walk in to the place. I said screw it and we walked over to Pietro&amp;#39;s Pizza and are now enjoying an amazing personalized pizza! To the woman with the dry ends please learn some people skills.", "rating": 1, "date": "11/22/2015"}, {"text": "Justain, our waiter, was really nice. It was my birthday and my girlfriend was all like &amp;#34;it&amp;#39;s her birthday &amp;#34; trying to get those annoying singers to come sing to me and bring all the attention to me. So I was like &amp;#34;naw forreal don&amp;#39;t do that. It ain&amp;#39;t my birthday&amp;#34;. And Justain gonna tell my girl &amp;#34;I gotchu&amp;#34; and give her a wink. So I was mad on the low cuz I really didn&amp;#39;t want that. So when Justain comes back, I think he has all those ppl behind him but he came withour cake and lit a candle for me and whispered &amp;#34;happy birthday &amp;#34;. That made me happy. It&amp;#39;s like my mans read me and knew I didn&amp;#39;t want all those ppl in my face . So yeah great experience,I&amp;#39;d highly recommend just based on that.Good lighting, nice intimate environment, great bathrooms and view outside the bathroom. I had a turtle cheesecake it was EVERYTHING along with the pina colada. Food was alright but the macaroni bites were different and I liked them", "rating": 5, "date": "3/6/2019"}, {"text": "I was very disappointed with this particular restaurant because it&amp;#39;s one my favorite restaurant chains. The manager (a female) was not attentive to us when 4 out 8 people at our table was served and 2 happened to be children. She heard our compliant and never returned to let us know what was going on or to even apologized or ask us how our food turned out. By the time the food came out, the other 4 people were almost finished and the kids had to eat bread because they were so hungry. I was never treated so poorly at any other cheesecake factory before in my life. When getting the check, the manager did take off the 2 kids entrees. but I had to let our waiter know that my dad and I didn&amp;#39;t get our burgers until everyone else was done eating. How long does it take to cook a burger??????? Like really.<br&gt;<br&gt;One positive thing, was the view. Hell, I&amp;#39;ll take good service over view any day.<br&gt;<br&gt;Valet was pretty pricey @ $22.00 a car. I would rather stick to Cherry hill, KOP, or Willow grove&amp;#39;s cheesecake factory. I will NEVER visit this cheesecake factory location again.<br&gt;<br&gt;My visit took place on 11-31-15", "rating": 1, "date": "11/2/2015"}, {"text": "Is hair the new topping for your Calamari? Cheesecake Factory Philly this is disgusting", "rating": 1, "date": "12/27/2017"}, {"text": "WORST BRUNCH EVER! If only zero stars were an option. My wife and I decided to give CCF a try for brunch today. As we came in the door there was no one greeting at the bottom of the escalator. So we ventured up to the restaurant and we were seated right away on the patio. The server was just straight preoccupied. As it took so long that we gave our drink order and food order at the same time. When he returned with our drinks my wife&amp;#39;s tea cup was filthy. When the server returned he immediately said &amp;#34;oh I forgot to tell you, we&amp;#39;re out of French toast.&amp;#34;  The restaurant serves so much bread how are they out of toast. Maybe they are out of eggs? We ordered the lemon ricotta pancakes as a replacement.  <br&gt;<br&gt;While waiting for our food we noticed our server serving bread to other tables. So we asked can we have some bread.  &amp;#34;Oh ya I forgot&amp;#34;.  Our food came out before he returned with the bread. My dish was supposed to come with toasted bread. &amp;#34;Oh sorry they burned it I will bring some out.&amp;#34;<br&gt;<br&gt;My crab Benedict was fine one of the eggs was over cooked. My wife&amp;#39;s pancakes that we&amp;#39;re supposed to be lemon ricotta were just plain pancakes.  When I complained to the server. He said the lemon ricotta was inside.   Well folks I cut a bite out of the center of each pancake and the lemon ricotta was lie, none found. I complained again. &amp;#34;I&amp;#39;ll let my manager know&amp;#34;.  When he returned he told me his manager took our drinks off the bill.  I know this trick, he didn&amp;#39;t talk to anyone he just hadn&amp;#39;t added our drinks to the bill yet. Fine, I&amp;#39;m not looking for a free meal. I just want it to be done and served correctly. So we asked for some syrup for our plain pancakes. We were told they don&amp;#39;t have any except for the melted butter they served with the pancakes....  Thus my wife&amp;#39;s pancakes were now non edible.  <br&gt;<br&gt;Our server then told us that the Cheesecake Factory doesn&amp;#39;t do brunch well at all and that we should have come for lunch or dinner instead. Way to talk about your own restaurant! Why even offering a brunch menu if you aren&amp;#39;t going to offer it correctly?<br&gt;<br&gt;Safe to say this will be my first and last visit to the tourist factory there are way to many good restaurants in Philly to waste your time in a non-customer oriented atmosphere.<br&gt;<br&gt;I HATE writing bad reviews! But, I will when a service provider shows me they don&amp;#39;t care!", "rating": 1, "date": "10/4/2015"}, {"text": "Ok, this is weird! I had pretty good food and fantastic service at the bar. The food wasn&amp;#39;t quite as good as King of Prussia but they&amp;#39;re new so I was willing to write that off because they&amp;#39;re still new.  So I got five star service and four star food,  so why a three star review? <br&gt;<br&gt;I&amp;#39;ve been going out to dinner for over three decades and have never experienced anything like this.  I also have a pretty good sense of humor and am generally hard to offend.  All that being said,  onto the story. <br&gt;<br&gt;While eating at the bar a server came up and asked me,  who won the superbowl three years ago.  I told her I didn&amp;#39;t know but I could Google it, she then began to berate me for not knowing and walked away. I just shrugged and went back to eating. <br&gt;<br&gt;Three minutes later,  she asked and I quote &amp;#34;Where would you most likely wake up with a finger in your ass&amp;#34;. I had absolutely nothing,  wasn&amp;#39;t even sure how to reply to that. Then I was treated to stories about how she came to work high everyday and what drugs she uses etc... AND SHE KEPT COMING BACK!!!!!<br&gt;<br&gt;I don&amp;#39;t know if she was high then or if she thought she was funny,  but I hurried up to finish my food and get out because it was just uncomfortable.  Worse part, they don&amp;#39;t wear name tags so I can&amp;#39;t tell you who she was. If the powers that be are reading this: she was the VERY obnoxious server working 8/25/15 @ 9pm. And if by any chance you&amp;#39;re reading this maam, you&amp;#39;re not funny but disrespectful to a patron who was just trying to enjoy a dinner", "rating": 3, "date": "9/1/2015"}, {"text": "Ordered online and i only get a few mins for eating so im waiting extra time related to my order not being ready despite there is no one in here currently. Please dont order here online bc obviously it is not efficient and is pointless. im so annoyed especially since im pregnant and if i cant eat my lunch due to this slow service is a huge disappointment. I order at 10:30 for a 12:15 pickup and still here at 12:27p which leaves me less than 15 mins to eat so pissed", "rating": 2, "date": "1/9/2019"}, {"text": "Avoid. This is unfortunately the poorest rendition of the cheesecake factory that I&amp;#39;ve ever been to. Seeing as how they are the best restaurant in the world normally, I even tried this particular location twice, but each time was just as awful. As an avid cheesecake factory enthusiast, I have to give this location 0 stars, even the pre-made, frozen cheesecake could not be prepared properly by the staff. <br&gt;<br&gt;The first time I ate here, my entree came with the wrong type of chicken, which I didnt&amp;#39; care about but it was just mistake number 1 of what, ten? I lost count.<br&gt;<br&gt;The waiters here disappear. You can even get up and go look for them but unless you know where the secret time warp portal is located you&amp;#39;ll have zero luck entering their dimension to ask for something.<br&gt;<br&gt;I disliked that I had to ask for a refill, ask for a napkin, ask for a straw, ask for a box, ask for an actual box, ask for a normal sized box rather than the 10&amp;#39;&amp;#39; by 10&amp;#39;&amp;#39; box for my leftover cheesecake, and then also have to ask for a bag. <br&gt;<br&gt;I didn&amp;#39;t like how the cheesecake was served warm and melting, without whipped creme, and without any acknowledgement. <br&gt;<br&gt;I didn&amp;#39;t like waiting for over 45 minutes for my food.<br&gt;<br&gt;Will not be back, the KoP will have to do.", "rating": 1, "date": "9/17/2015"}, {"text": "This is our second times in here this time me and my friend choose specialty fillet mignon, its a disappointment cause the more we eat it the more we feel the salt, they put too much salt on our steak. The beef is tender, it just too salty.", "rating": 1, "date": "3/4/2017"}, {"text": "I&amp;#39;ve been to another location before but this was my daughter&amp;#39;s first visit to any location. I was in the area for educational training and she wanted the experience as I&amp;#39;ve raved about the food (all of the food to include dessert) so she wanted to try. It was still light outside so it wasn&amp;#39;t late but it was definitely dinner hours. It wasn&amp;#39;t overly packed but a good amount of people coming and going. The flatbread we wanted - we were told there was no more so we had to find an alternative. She is a huge fan of margarita pizza. We did make another selection. The options we went with were good. However when it came to dessert we wanted strawberry cheesecake. We opted to get it to go as we were full from dinner but the take out cashier advised there was no more available. I would have thought to have an item that is so popular or in high demand there would be maybe a back up supply available. I don&amp;#39;t work in the industry so I am not sure how that works but I felt the need to share the disappointment we experienced as there wasn&amp;#39;t any other cheesecake option we really wanted but the strawberry. Original is good, don&amp;#39;t get me wrong, but for her first time at the restaurant that everyone around her talks so highly about her experience was not as good as I was hoping it would be. I&amp;#39;ve never been to a location where they were out of almost everything I asked for. Overall the staff was pleasant, just a bit disappointing she didn&amp;#39;t have a good first experience.", "rating": 3, "date": "8/20/2019"}, {"text": "There are MANY better dining options in Center City. This place looks great, I&amp;#39;ll give it that. But the food was just OK and the cocktails are super pricey. <br&gt;<br&gt;I don&amp;#39;t typically go for the big chain restaurants, but I gamely went along today for a CF holiday work lunch for 12. I ordered a grilled chicken sandwich and was served way more bread than chicken. The fries on the side weren&amp;#39;t very good. My friend ordered the soup and salad combo and they only had one soup on the menu, which was clam chowder. It was too peppery for her and the waitress offered to substitute fries for the soup, but there was no apology or flexibility on the substitution. (My friend declined the fries.) <br&gt;<br&gt;When we got the check, I realized that my sangria was $11.50, almost the same as my entree. Whaaaat? It wasn&amp;#39;t even very good. I checked out other Yelpers&amp;#39; reviews and read that they don&amp;#39;t put the cocktail prices on the menu. Not cool!", "rating": 2, "date": "12/18/2015"}, {"text": "The Cheesecake Factory has always had solid food. I&amp;#39;ve never been disappointed in the quality or taste of my food. But at all of the other locations, the delicious food came with efficient service, knowledgeable servers, and overall great experience. This has not been the case in the Center City location.<br&gt;<br&gt;I have been there a few times, and always been disappointed and stressed by the length of the wait. Today&amp;#39;s instance was particularly obnoxious. I went with a group of 15 for a work lunch. We did expect it to take more than an hour, but we certainly weren&amp;#39;t expecting it to take almost two and a half hours.  Food orders weren&amp;#39;t taken until we had been waiting for 30 minutes. We weren&amp;#39;t all served for another 45. Then onto dessert, which didn&amp;#39;t fully come out until about 30 minutes after they had cleared our entrees. <br&gt;<br&gt;I would definitely recommend this place unless you have an absurd amount of time to spend here.", "rating": 2, "date": "9/14/2016"}, {"text": "I have been a huge fan favorite of the Cheesecake Factory since they opened few ago in Philadelphia. But since their portions of their cheesecake have gotten very small about six months ago. My visits to the restaurant have shortened..", "rating": 2, "date": "2/10/2019"}, {"text": "This place is the good, the bad, and the ugly. The good of course was the cheesecake, I had some kind of caramel pecan cheesecake that was 5 stars for sure. The food was bad, my salad was wilted and extra chewy, my shrimp was medium well and I believe that shrimp and seafood should be thoroughly cooked. The ugly was our waiter, I forgot his name but he was awful each course came to the table at least 20 minutes apart, I even had to look for him to get silverware to eat our salads with because there was none on the table when we sat down and he did not bringing any out with our food. We requested them and after 20 minutes of waiting I had to go and find him, geez.", "rating": 3, "date": "10/28/2017"}, {"text": "Food n service was ok, great ambiance, l really like the red velvet cheese cake n crab cake but rest of the food r not really as we expect even they not season properly.", "rating": 3, "date": "3/28/2016"}, {"text": "Service was very quick. I sat by the bar to watch the TV. The bartender Paul was great and pleasant. The bathrooms were clean! Seems like a very busy restaurant on a regular basis but it wasn&amp;#39;t that busy on a Sunday. Trying to find parking is a nightmare unless you planned to be out and about all day and found a good spot or paid for the garage. Overall, food, cheesecake and drinks were great. Service was on Q and no waiting around. I am not sure how busy this place is on a Friday or Saturday but then again most places are mobbed on weekends regardless. Recommend it!", "rating": 5, "date": "8/17/2015"}, {"text": "I&amp;#39;ve been to this Cheesecake Factory three times so far and have good good experiences each time.  Good food, nice sized portions, fairly friendly and attentive service.  Best of all, shockingly, both times I came for lunch it wasn&amp;#39;t crowded at all.  At many Cheesecake Factory restaurants, it&amp;#39;s packed to the gills no matter what day or time you go and often there is a long wait.  Not at this location - at least not the 3 times I went so far.  I guess there are many more options in the city to choose from.  Either that, or Cheesecake Factory appeals more to suburbanites than city folk.  At any rate, I&amp;#39;ve been happy each time I have gone and the food and service are comparable to my hometown CF in Cherry Hill, NJ.<br&gt;<br&gt;BTW, my favorite things to order are the fried mac &amp;amp; cheese, the avocado egg rolls, the Bistro Shrimp pasta and for dessert, the strawberry shortcake, which is a biscuit-type shortcake with vanilla ice cream, strawberries and whipped cream.  Note:  it&amp;#39;s HUGE and feeds 3 people easily.", "rating": 4, "date": "5/26/2016"}, {"text": "Went for lunch. I got the chicken carbonara lunch size, which was delicious. The waitress was very prompt and nice. The hosts were also great. Only complaint is that I got a cheesecake to go. I waited for my uber and went home (about 25-30 minutes). I go to eat my cheesecake and it was still rock solid frozen. :(", "rating": 3, "date": "10/31/2017"}, {"text": "Food is not as good as the one in New Jersey. Pork chop so hard to chew. And the angel hair is too soggy.", "rating": 2, "date": "11/26/2018"}, {"text": "Went to Cheesecake Factory on Tuesday with my husband, brother, and friend. When you&amp;#39;re going to the cheesecake factory you know what you&amp;#39;re going to get - it&amp;#39;s a chain restaurant with a menu that has pages and pages of options! We didn&amp;#39;t have any sort of wait and were seated right away. This Cheesecake Factory looks like any normal Cheesecake Factory, however, what I did like was they have a seating area where the windows are open which is really nice.<br&gt;<br&gt;We put in a drink order and an order of the Hot Spinage and Cheese Dip.  The drinks and appetizer came promptly. Our waitress was pretty knowledgeable..  apparently during the training they had to learn the whole menu and got to try most of the food for 2 whole weeks! For our entrees we went with the Cajun Jambalaya Pasta, Herb Crusted Filet of Salmon, and Farfalle with Chicken and Roasted Garlic. The Farfalle with Chicken and Roasted Garlic was the best dish out of them all and we&amp;#39;ll definitely be going back for that dish!  The only complaint was that we wanted the Snickers Cheesecake, however, they were out of the ingredients so we ended up going with the Tiramisu Cheesecake and S&amp;#39;mores Cheesecake - both equally yummy!", "rating": 4, "date": "7/16/2015"}, {"text": "I rarely ever complain about a restaurants service and kitchen staff; however, the dining experience at this specific Cheesecake Factory was absolutely awful. For starters, the waiter listened to our orders, didn&amp;#39;t write them down and then proceeded to come back to the table and ask us for our orders again. The three of us dining all made modifications to our orders. When he brought out orders over, he did not take note of the modifications, resulting in us having to wait even longer for our food. Once our &amp;#34;correct&amp;#34; food came over, there was still food missing and the quality was not good. My mom ordered the grilled chicken tostado salad. The tostado was limp and soaked instead of crispy, and there was no chicken on the salad. I ordered the Tuscan chicken subbed with salmon which comes with artichokes but there were no artichokes, and the salmon portion was so small. I had gone to the King of Prussia location the night before which had a salmon filet double the size served at the Philadelphia location. The manager was nice enough to give me another portion of salmon but the overall quality of service and food was sub-par at best. Will not be coming to this location again.", "rating": 2, "date": "6/18/2017"}, {"text": "It is so lame but this was chain restaurant I really wanted to try haha. I just heard about this place a lot- huge portion, good dessert etc however I&amp;#39;ve  never seen this place anywhere in city. Now I finally went! <br&gt;<br&gt;Stopped by for lunch, got Alfredo fettuccini ( lunch portion) with chicken and classic burger with fries. We thought that would be safe choice since it was our first visit. Pasta was very thick, creamy like other chain restaurant. Chicken breast was moist and tender. My hubby enjoyed his burger and couldn&amp;#39;t finish his fries. We were full so had original cheese cake piece to go. <br&gt;<br&gt;Our server was very friendly and had full of smile on her face whenever we sees her. <br&gt;Food was nothing ordinary but service was nice and I like to have this restaurant in the city.", "rating": 3, "date": "8/14/2015"}, {"text": "Will not eat at this location again. Started with them telling us an hour wait. So we put in our name and came back 55mins later. At that point they said we were one of the next tables. Well 30 mins later we will were not called. We went up to complain and were told they were cleaning our table. 15 mins later we finally got seated. Total wait time was 1 HR 40 mins which is pretty ridiculous considering that when we got seated there were 4 large clean empty tables around us. <br&gt;<br&gt;The server was prompt and polite. I had no problems with him. We put our order in immediately with our drink orders. We got our bread and it was not warm and was very hard on the outside. When the runners brought out our entrees they only brought 2 of the 5 out. 5 mins later (yes I actually monitored the time) the other 3 entrees came out. 2 of the entrees were wrong. My husband ordered spaghetti and received a sandwich and I ordered a burger and received a piece of meat on hard bread, nothing else was on the burger. I told the waiter and he apologized. I told the waiter to take back my incorrect food and that I did not want my food replaced so just take it off the bill which he did. They brought my husbands correct entree, but at that point everyone else at the table was already done. <br&gt;<br&gt;By the end we were annoyed and just ordered the strawberry shortcake to share. The ice cream was good but the biscuit was very hard and inedible. <br&gt;<br&gt;Definitely will not be returning!!", "rating": 1, "date": "12/20/2015"}, {"text": "This place is always good. Service was great, food was great. If you stop by here ask for a window seat and you can enjoy some city views.", "rating": 5, "date": "11/10/2018"}, {"text": "Great Location it&amp;#39;s spacious, and offers a nice view of Center City Philly, depending on where you are seated. The atmosphere is pretty nice as well, and so is the staff. Also the menu is pretty solid, I love their salmon, brown rice, and broccoli, and Cheesecake for desert is very rich and tasty. I normally go for happy hour because I never experience a long wait during those hours.", "rating": 4, "date": "1/6/2018"}, {"text": "This was my 1st time at this location.  The building and atmosphere is gorgeous.  Thankfully they have an elevator in addition to the escalators and steps.  I was with a rather large group of people, and we were able to be seated in a private room with a wonderful view of Philadelphia.  This was good and bad.  Why?  As it got darker outside, the dimmer the lights became on the inside, to the point where we were all pulling out our cellphones to use the lights to read our menus! <br&gt;<br&gt;For my drink, I ordered a glass of Moscato.  Unfortunately they were out of it. :(  So, I ordered a glass of Riesling.  It was pretty good.  The only thing i didn&amp;#39;t like was the fact that the wine glasses were so large, yet they only filled it up halfway!  I guess that&amp;#39;s to make you order another glass.  Who knows.  Needless to say, for $9.50, that was my only glass of wine for the night.  Grade: B<br&gt;<br&gt;My appetizer was the Fried Zucchini.  I asked for mine without cheese and marinara sauce instead of ranch dressing.  I was looking forward to it, since this is one of my favorite appetizers in the world, and everywhere I have gone either took it off of their menus or it has been absolutely horrendous!  Well...The Cheesecake factory made me happy!  Thick pieces of Zucchini sticks, light and crispy breading and wasn&amp;#39;t served as a greasy mess!  The people I shared them with agreed that they were very good.  The portion was very large.  I ended up ordering more to go with my main course.  Grade: A+<br&gt;<br&gt;My main course for dinner was Fish and Chips.  Well.  I can honestly say that I&amp;#39;ve had better in less-costing restaurants.  The flsh was fried nice and crispy, but it was very bland.  The fries were good.  Grade: C<br&gt;<br&gt;Dessert:  I ordered the Oreo Cookie Cheesecake for myself and the Godiva Cheesecake for my friend.  Both were awesome, like always!  Grade: A+<br&gt;<br&gt;The only thing that I can completely say that I was truly upset about was the salad that I ordered to-go.  It was the French Country Salad with mixed greens, grilled asparagus, fresh beets, goat cheese, candied pecans and vinaigrette.  I was very disappointed when I got home and opened up the salad.  Extremely wilted lettuce.  There were only a couple pieces of beets and they looked dried out.  We won&amp;#39;t even talk about the asparagus.  About 2 goat cheese crumbles.  All I can say is that this was a major disappointment for the amount that it cost. Grade:D<br&gt;<br&gt;Overall, my experience with the food was ok.  Our server, Anna, did a good job with serving a large group.  The only issue I had was sending my check back for corrections.  <br&gt;<br&gt;Will I go back to this particular location?  Not sure.  We shall see.   <br&gt;<br&gt;Overall Grade:  C", "rating": 2, "date": "7/26/2016"}, {"text": "My third or fourth time here. Haven&amp;#39;t loved a meal yet. The food is just ok to me. I&amp;#39;m always let down. The lighting is kept so low that it&amp;#39;s difficult to read the menus. The A/C is always too cold for my liking. No more cheesecake factory for me.", "rating": 2, "date": "10/28/2017"}, {"text": "Visited this location for the first time during my lunch hour and I was surprised that it was not crowded!  Food was delicious and the service was fast. I purchased a slice of cheesecake to go. Considering the small size of the slice, I think that the cheesecake is overpriced, but it is so darn yummy that I did mind spending almost $9 on the 1590 calorie desert :)", "rating": 4, "date": "8/14/2017"}, {"text": "This was a typical Cheesecake Factory of which I am a big fan of. My wife and I looked up this one because we were starving and it was the closest and about the last restaurant open around midnight( they closed at 1230). We called ahead to see if it would be an issue with us coming at midnight and the person whom we spoke to said that it was no problem. Once we got seated our server immediately started rushing us to order our food. He also told us that he had been there all day and they were so busy that they didn&amp;#39;t have anymore bread( that was ok). Throughout the entire experience we were rushed and the server was trying to get us out of there so quickly he forget a few things that we asked for. As I mentioned in the beginning of this review, I am a fan of TCF( The Cheesecake Factory) but don&amp;#39;t go to this one 30 mins before they close even if they say it&amp;#39;s ok when you call lol.", "rating": 3, "date": "9/17/2017"}, {"text": "first time visiting Philly for business. Decided to check it out this place with my colleagues. Great atmosphere, nice decorations but quite dimmed light inside. <br&gt;<br&gt;Now, we had an awful awful server that night. She was extremely rude, first I thought she was joking cause I thought it cant be this bad. I think she must be mad at management or something. I didn&amp;#39;t have one of these servers for long time. My food didn&amp;#39;t show up for maybe 20 minutes after everyone elses arrived. I had to wait to get our servers attention to let her know about the situation cause she didn&amp;#39;t even come back to check on my colleagues food after she dropped it. She didn&amp;#39;t even apologise, she didn&amp;#39;t even offer discount. I guess this must be lack of management supervision. cause she was not caring anything all night long. It must be hard not to notice that by floor manager. Anyways, such a terrific experience.", "rating": 1, "date": "10/28/2016"}, {"text": "It&amp;#39;s gorgeous. A+ on the renovations of the building. Which also lends to big pluses on atmosphere. They are accommodating of all group sizes also another positive. They food there I have had has been solid and they are pretty accommodating with patrons amending their order. The service is average not terrible but nothing to note. My only hiccup is that everything on their menu gigantic and very high calorie. Even the &amp;#34;skinilicious&amp;#34; menu I question. Tough place for someone trying to eat healthy and not for anyone not looking for lots of food. That&amp;#39;s just a personal preference though take from it what you will.", "rating": 3, "date": "1/5/2016"}, {"text": "terrible food....ordered a med burger came well done and one hour later from eating it got sick...my son and wife hated there food as well .<br&gt;...", "rating": 1, "date": "12/4/2018"}, {"text": "This Cheesecake Factory is not my favorite one. The food was so so. The service was slow. I guess it is in center city. But will like to go other ones.", "rating": 3, "date": "12/3/2018"}, {"text": "Went here two days in a row and each time entire experience was tremendous. Food was great. Service spot <a href=\"/redir?url=http%3A%2F%2Fon.menu&amp;amp;s=84bc4b2659e0e1a6586716b0572a3372d2acbb629d26c3ef64b8b395d382ce9a\" target=\"_blank\" rel=\"nofollow\"&gt;on.menu</a&gt; huge &amp;amp; very busy with the other patrons food all looking  great and all seemingly enjoying themselves. servings are huge ..I&amp;#39;m not a big fan of cheese cake and never order it.however since I was there I felt obligated to try..it was delectable &amp;amp; a huge piece enough to share ..<br&gt;An army of staff all with a outstanding attitude and friendly professionalism thats unfortunately not all that common anymore .<br&gt;Big fan and i would highly recommend !", "rating": 5, "date": "6/25/2015"}, {"text": "Amazing cheesecake, just too bad they don&amp;#39;t have smaller size since it comes in a huge size and it gets hard to finish in the end. Good enough for a dinner tough. The personnel isn&amp;#39;t very kind I must admit", "rating": 4, "date": "8/29/2015"}, {"text": "The Cheesecake Factory had great food when I went there with my father! But the service was not that great. Our server made some snarky comments and was in a rush to have us order. Continuing, the service was very slow. Our food took about 30 minutes to come out! That is too long. Also, the cleanliness was a problem. Our menus were sticky and gross.", "rating": 2, "date": "11/24/2018"}, {"text": "First of all, brunch starts at 10.. we arrived at 10 and the doors were still locked. Finally the manager came down to unlock them and also sat us at a table since the hostess was MIA. As we walked through the restaurant to our seats I noticed that every single chair was THITHY. Covered in crumbs and food smears. I cleaned my chair with a napkin before sitting because it was so dirty. Our water had chunks of food or something in it. Dirty tables, dirty walls, dirty seats. Food was awful. Bread chewy like it had been frozen. Salt at the table was stuck together because it had gone bad.", "rating": 2, "date": "1/14/2018"}, {"text": "Came here on opening day for lunch with friends and it was crowded within just 7 mins after opening. The place is definitely nice looking, fancy. The service was good and friendly. I ordered miso salmon. It took awhile to get here but it was good. Fish was cooked right. The miso sauce is a sweet creamy and soy base. It&amp;#39;s not quite my thing sweet and savory. My friend said her food was a bit salty. Usually at the Cheesecake Factory is a hit or miss. Overall a good experience minus the manager guy not letting people upstairs because it is crowded or overwhelming.", "rating": 3, "date": "6/23/2015"}, {"text": "Went there for lunch with my husband &amp;amp; my newborn. I loved the food, ambience is pretty nice...we sat on the patio. Would definitely go back again!", "rating": 5, "date": "7/2/2015"}, {"text": "When my coworker suggested we go here for lunch, I couldn&amp;#39;t believe it was built already! We stopped in for lunch with only an hour to spare and I was a little worried we would make it back in time. However, I was pleasantly surprised! The staff was very friendly and our server made her present known but didn&amp;#39;t hover. I ordered the Beets &amp;amp; Goat Cheese and Edamame. Both dishes were good. My friend got the Turkey Burger, which she enjoyed. For a chain restaurant, this was a good experience. I would definitely return for lunch!", "rating": 4, "date": "7/1/2015"}, {"text": "It was a bit crowded and the service at this location was slow and not very outgoing. Our server was unfriendly, slow, and took forever just to get our order right and delivered. The food was ok but I like that they had so many choices to choose from. And the cheesecakes are amazing! The best!", "rating": 3, "date": "12/19/2015"}, {"text": "I&amp;#39;ve been going to Cheesecake Factory since I was a young girl and this is the first time I can remember having a bad experience. My husband and I went for our anniversary dinner. We both had drinks, fish, and dessert. The service was excellent, as usual, but my tuna was so dry I couldn&amp;#39;t eat it. His steak, which had been ordered medium rare, actually came out well done. How does that even happen??! We skipped our dinner and went straight to dessert. Definitely going to give this place a wide berth for the foreseeable future. Complete waste of $140! 2 stars for the service and cheesecake.", "rating": 2, "date": "11/5/2018"}, {"text": "Omg !!! The best place for a nice dinner in Philadelphia, as always Cheesecake factory!!", "rating": 5, "date": "7/11/2015"}, {"text": "The food was okay nothing to hype about. The service was slow I waited about 45mins until my food arrived. The staff there are very friendly &amp;amp; opening....The best part was dessert which they are known for Cheesecake.", "rating": 3, "date": "7/2/2015"}, {"text": "I love this place! I came here with a few co workers for lunch and knew that I was leaving with a slice of cheesecake. Absolutely sinful!!", "rating": 5, "date": "10/13/2015"}, {"text": "My first visit to a CF, had a great experience. Had steak with mashed potatoes with Asian influences. Was amazing. Had a piece of salted caramel cheesecake for desert, we were three people sharing it but could not finish it. Very full tummy!<br&gt;<br&gt;Nice staff but tables were a bit .. Unprivate. Close to the next table.", "rating": 4, "date": "11/19/2015"}, {"text": "The food was the best! <br&gt;Fort time trying their food because it was always so far. I&amp;#39;m glad they opened one in the city and it would be great for them to be in restaurant week in the future ! !", "rating": 5, "date": "8/7/2015"}, {"text": "My boyfriend and I went here and he left his phone. He called and they said they had it. He has two phones so he wasn&amp;#39;t in a rush to go back and get it since he&amp;#39;s so busy it was impossible to go all the way back when living far. Anyways when he went back yesterday they no longer had his phone. The manager brought out a couple of phones that was not his and said there was nothing they could do about it. I guess the phone had legs and walked out the restaurant. How about you have a safe place to your customer belongings if left  horrible customer service and I will never come back to a restaurant that steals.", "rating": 1, "date": "10/6/2018"}, {"text": "We came very early in order to beat the crowd and wait. Happy hour had just started and we pretty much had the place to ourselves. We sat in the bar area and ordered fried mac n cheese and the avocado spring rolls. Both were absolutely amazing. We got the spring rolls with honey mustard instead. The service was fast. The only thing was the tomato sauce for the mac n cheese was slightly cold. They must have put that on the plate first while waiting for the mac n cheese to cook.", "rating": 4, "date": "7/22/2017"}, {"text": "Came in at a not busy time 4:45 on a Monday, not only did no one come over after ten minutes but after saying something to the hostess I was still left sitting. I got up and left only to find the escalator now broken going down. I wanted my friend who had never been to try and no I doubt he ever will.", "rating": 1, "date": "1/17/2017"}, {"text": "This place is a nightmare. It took us 43 minutes to order our entrees. An hour later - still no food. R u trying to kill me? Once the food comes out our waitress is nowhere to be seen meanwhile I&amp;#39;m choking down spicy hot pasta with 0 liquids. The entire process took about 2 hours and 40 minutes. I&amp;#39;m very upset.", "rating": 1, "date": "1/1/2017"}, {"text": "The service here was HORRIBLE I wouldn&amp;#39;t recommend anybody to go there, our waiter named ceyanni was rude and messed up our check twice, she didn&amp;#39;t check on our table &amp;amp; also walked away from us while we were talking to her. Overall the food was dry and burnt and the display of the food was sloppy. Don&amp;#39;t eat here.", "rating": 1, "date": "9/14/2017"}, {"text": "I often frequent the Center City location on Walnut St. My girls and I usually hang out after a long week at work. Well wouln&amp;#39;t you know it the time my I bring my children with me our experience is the worst. I CAN&amp;#39;T stand an establishment that changes up week to week. Well DON&amp;#39;T need to go on. Definitely, won&amp;#39;t be coming back.", "rating": 1, "date": "10/27/2017"}, {"text": "The Cheesecake Factory is a decent place because you can get pretty much anything you want. From orange chicken to salmon. I would say that there salmon is amazing and is great quality. My only downside of this place is the health factor, but they do have a skinny menu. As Drake says, it is a good place for families.", "rating": 3, "date": "4/6/2017"}, {"text": "If you&amp;#39;re looking for a calorie dump straight to the midsection, go here. I LOVE the food, and the dessert is obviously great.", "rating": 3, "date": "6/1/2017"}, {"text": "This location sucks. So I ordered to go after walking half a mile from where I&amp;#39;m staying so I wouldn&amp;#39;t lose my parking spot. I ordered the shrimp and angel hair, one of my favorite dishes. So when I walk all the way back and get to my food, it had no marinara sauce, about a quarter of the tomatoes that it&amp;#39;s supposed to have, and only 4 shrimp. WTF?! I paid 20 bucks for this dish and it pretty much was only plain noodles with olive oil. I don&amp;#39;t feel like walking another mile there and back to return this bland  joke of a meal. If you like cheesecake factory, avoid this one. It&amp;#39;s obvious the cook here doesn&amp;#39;t know or give a crap about putting the correct amount of ingredients in their recipes.", "rating": 1, "date": "7/1/2016"}, {"text": "Lived up to its reputation! Outstanding food....and the cheesecake. Thank goodness I don&amp;#39;t live that close!", "rating": 5, "date": "1/8/2016"}, {"text": "&amp;#34;TERRIBLE SERVICE!!!!!!!!!!!&amp;#34;<br&gt;<br&gt;I went there twice once with my b.f and once with my sister. When I went to with my bf, it was around 5pm and there was almost no ppl but it took at least 20 mins to order the food. <br&gt;And last weekend, I went there with my sister around 3pm. And we waited 20 mins to get sits and it took 10 mins to order. And the server told us to bring the bread and she didn&amp;#39;t bring us anything and I asked her again for bread and she ignored us and she was just chatting with her co-workers.<br&gt;So eventually, we didn&amp;#39;t get anything to eat for 50 mins once we got there. When I left there without eating anything, she did say one thing &amp;#34;Sorry&amp;#34;. I will never go back to that place again. It  really messed up my day.", "rating": 1, "date": "12/13/2016"}, {"text": "This was the worst CF experience ever. Everywhere I go, I order the same item. Ordered it here and the chicken was dry and overcooked. They offered to remake it which was a mistake, as it took an eternity. Second round showed up better but still not up to CF standard. The waitress and manager were very gracious, but neither went out of their way to make it right. Bottom line is I walked out paying $28 (including full tip) for a mediocre meal that took forever. Not even an offer to comp my iced tea. Seriously? #1 rule of restaurant management: if at all possible, MAKE IT RIGHT!", "rating": 2, "date": "6/10/2018"}, {"text": "After our third visit here, we will not be returning. Promptly seated, we waited 13 minutes for any server to take our drink order. A party (seated after) next to us had their drinks before we met our server. After waiting another 15 minutes 2 of 3 of our drinks arrived. Because &amp;#34;the bar was running behind&amp;#34;.  Our server also insisted there were no more kids cups. The same table across from us had one though. I ordered the Bang Bang Chicken wich had no Bang at all. Not a hint of spice. Wife ordered the Jamaican chicken which was just as lack luster. My daughter had spaghetti and marinara and surprise.. She likes it from our neighborhood diner more. I would only recomend cheesecake to go, if that.", "rating": 1, "date": "6/7/2017"}, {"text": "The food is very good and consistent. Friendly table service. Portions are large even at Happy hour  - a great deal. Nice pours. However I&amp;#39;m rating the service at the bar horrible. I&amp;#39;ve been numerous times and I swear the bar tenders are trained NOT to acknowledge customers, Not to ask if they would like water or drink refills. Bummed out because I like the CCF.", "rating": 2, "date": "10/27/2016"}, {"text": "The service here is great! I only discovered this place was a full out restaurant a couple years ago lol and I was pleasantly surprised at how upscale it was, while also keeping it casual. I love the complementary warm bread and butter, can&amp;#39;t go wrong with that. The portions are very large and I believe well worth the hefty prices of some. I would say most of the entrees are shareable for two light eaters. I love the chicken Madeira. The cheesecakes are unsurprisingly delicious as well. Overall, with my numerous visits here, this Cheesecake Factory delivers with quality food and quality service.", "rating": 4, "date": "8/8/2016"}, {"text": "Not a happy camper right now. I called in over a half hour ago to make a reservation and was told that a reservation was not needed for our party of 8... That a table would be available. Guess who&amp;#39;s still waiting? They&amp;#39;re only getting two stars because the food was good during my last visit.", "rating": 2, "date": "12/22/2016"}, {"text": "Not sure this place needs a review. Amazing selection, huge portions, great service. I can&amp;#39;t think of any negative thing to say.", "rating": 5, "date": "2/18/2017"}, {"text": "My hubby and I enjoyed a wonderful dinner on Saturday night prior to a show, which was a short walk away, at the Merriam Theater.  We arrived around 5:45pm and were seated about 20 minutes later, which was the anticipated wait time according to the front desk.  Our waiter, Logan, was very personable and attentive.  The caesar salad was very fresh and tasty.  My husband really enjoyed his Jamaican Black Pepper Chicken and Shrimp.  The original cheesecake with glazed strawberries and whipped cream was delicious!", "rating": 4, "date": "4/30/2018"}, {"text": "The Cheesecake Factory. If you been to one then you literally been to them all.  I mean you&amp;#39;re here for cheesecake right? Oh, you actually like the food. The food is ok. Although, I had the Jamaican dish and the was worth wild to mention. So, the next time you&amp;#39;re there order the dish and tell your server Wise recommended that meal. Btw, I left without getting cheesecake.", "rating": 4, "date": "11/7/2016"}, {"text": "The servers work very hard here and are extremely friendly. I came one day with family and I really wanted to order the Filet Mignon steak they were sold out instead I ordered the pasta dish and it was amazing!", "rating": 5, "date": "2/27/2017"}, {"text": "Worst place long wait for a meal, then came uncooked wet chicken. Turned it back waited an other 30 min for the check. Disappointed ! And it was at 3:30 pm not even rush hour yet", "rating": 1, "date": "4/27/2018"}, {"text": "This place is awesome! If you just want a casual but sort of classy night out or lunch eat here! I went here for happy hour last week which was my first time! I love their happy hour i never even knew it existed until my friend told me! The cocktails are 5$ and beers are 4$ and their starters and small plates are 5$ and original sized. It was totally worth it! My friend and I had 3 drinks each and 2 small plates, paid 20$ for a great time! Their drinks are strong and the waiter was amazing. I hate how this place doesnt have proper reservation timings and its more of a wait. It gets a bit chaotic but totally worth it!", "rating": 4, "date": "4/8/2016"}, {"text": "I called to make a reservation tonight  was told &amp;#34; we do not take reservations for 2 people&amp;#34; I replied a bit confused and the girl on the phone hung up on me. She didn&amp;#39;t try to accommodate  me or ensure that we would be able to get a table if we just walked in. As a manager of a restaurant I would be furious if I heard my employee interact with a potential customer this way. Needless to say I will not be going there tonight. Management: if you&amp;#39;re not going to take reservations for 2 at least teach your employees to be a little more welcoming.", "rating": 1, "date": "11/28/2015"}, {"text": "Some of the worst food I&amp;#39;ve ever tasted. The waitstaff is great but their poor excuse for maple syrup is awful and runny and the breakfast food is just sad.", "rating": 2, "date": "2/11/2018"}, {"text": "I am not the kind of person that is against chain restaurants and will gladly eat at a cheesecake factory even when there are other non-chain restaurants to choose from. So I&amp;#39;ve been to probably 4 other cheesecake factories in different cities and this one was definitely the worst. The shrimp in my pasta was very overcooked and the dish itself was underseasoned. I ended up taking home about 2/3rds and hooking it up myself for lunch/dinner the next day. The cheesecake was good as always though. But I am not in any hurry to come back to this location.", "rating": 2, "date": "10/24/2016"}, {"text": "This review is only for Happy Hour. Monday - Friday 4p-6p. 5.50 for all drinks, a BROAD selection of appetizers, and the Happy Hour burger. This is seriously one of the BEST happy hours in Center City. The drinks actually taste like alcohol and almost everything is served in a regular glass (the kind you&amp;#39;d get for a regular soft drink). The bartenders are also very nice and friendly overall. I can&amp;#39;t speak to anything other than happy hour and the delicious cheesecakes which I love. I personally think 7.95 for a cheesecake is great.", "rating": 5, "date": "12/23/2015"}, {"text": "The food was good, but the service was extremely bad! I asked for ONE minute to decide and the waitress comes back TEN minutes later. Not to mention she glanced my way a few times and noticed that I was ready to order. Extremely disappointed that the service sucked since the food was good. Not saying I haven&amp;#39;t had good experiences before but this is was pretty bad. The table was not thoroughly cleaned and the wait time for a seat (when the restaurant was nearly empty) was way too long.", "rating": 3, "date": "3/18/2016"}, {"text": "I have always enjoyed Cheesecake Factory for their large serving sizes and delicious food. Tonight I was underwhelmed. My portion of pasta carbonara was very small and the pasta was underdone and chewy. The smoked bacon was burnt and almost in recognizable. The service was extremely slow. Overall I am extremely disappointed.", "rating": 1, "date": "5/15/2016"}, {"text": "First star is for the decoration. This location is for young people who cannot drive to other locations. Second star is for the service. Nice and friendly. Third star is for cheese cake. Should try the mango key lime one. Beautiful cake comes with multiple layer of flavors, tastes, and textures.<br&gt;<br&gt;Minus 2 stars because the grilled food was horrible. I ordered KOBE Style burger with Medium cook. They handed me a burned well done and dried meat. I called the server to request a new one. My friends already finished their meals and I had to wait for my burger in 20 mins. Second time was less burn but still complete well done and dried. They use gas grill and you can smell the gas on every bite. I wanted throw up after a first bite. The sever was so nice so I just let it go and pack it home. Of course, I will throw it away. Cannot eat it. My friend&amp;#39;s pork chop dish was $23 and it was burned as well. The burn layer was like 1/8 inches. She had to cut it out and eat it without requesting to change her dish.<br&gt;<br&gt;In general, it was overpriced for the quality of food. It looks nice but not recommended for a date because people bring their kids and it may get lousy sometime.", "rating": 3, "date": "12/5/2016"}, {"text": "I have no idea why this place doesn&amp;#39;t have high ratings because i&amp;#39;ve been almost all of the cheesecake factory in USA and this is one of the best. To be hones after Las Vegas, this is the best. Foods are good especially fried calamari is amazing, i know it&amp;#39;s appetizer but it&amp;#39;s really tasty. For main course fillet mignon is my favorite. I&amp;#39;ve been writing as everything is perfect but i put 4 stars because of service. They should improve their service that&amp;#39;s the reason why i choose the 4 stars instead of 5... But definitely i&amp;#39;ll be back...", "rating": 4, "date": "11/22/2015"}, {"text": "One star and only for the interior appearance. I got the garlic shrimp pasta with a basil lemon sauce and it was bland and doused in a ridiculous amount of oil. What a wasted $18. About $14 for a Ketel One martini, didn&amp;#39;t realize I should expect Franklin Mortgage prices for a simple vodka martini. I was so turned off by my food that I didn&amp;#39;t even get cheesecake for dessert (in hindsight, I should have just gone with dessert and skipped dinner there altogether). <br&gt;<br&gt;The service was terrible, the hostesses were unfriendly and downright incompetent. Our server wasn&amp;#39;t rude but definitely not very friendly and took forever to get us our round of drinks when it was mostly empty in the rest of the restaurant. Some of our table resorted to going up to the bar for their drinks, it was just so ridiculous. The general attitude is come in, spend a ridiculous amount of money for subpar food and it&amp;#39;s ok because it&amp;#39;s Cheesecake Factory. It shows a serious lack of management and the struggling waitstaff is indicative of poor training. I actually felt bad for our server that she was struggling with simple orders. I mean honestly how hard is it to make sure everyone has water refills? AVOID.", "rating": 1, "date": "11/16/2015"}, {"text": "Horrible, horrible, horrible place. The food is amazing, but the service is incredibly poor. I always sit at the bar and I constantly get bad service. They inattentive and they have bad attitudes.", "rating": 1, "date": "3/1/2017"}, {"text": "I came here with a group of seven and we chose it to accommodate the large party and for a wide menu.  Both of those aspects were great, otherwise it was a disappointing experience. <br&gt;<br&gt;We were seated instantly but then waited at least a half an hour for a sever to walk by.  Once they noticed us we finally got some water.  Three different servers came over and bickered to us about whose fault it was for the long wait.  There was then confusion as to who should take the order.  We asked for seven separate checks which one waitress said was okay and confused another.  Everyone apologized for the confusion but blamed each other and other factors instead of just apologizing.  Our waitress was somewhat curt and not particularly friendly.  <br&gt;<br&gt;Once we finally ordered, it took an unreasonable amount of time for our food to come (it was not crowded that night!).  The food was decent, about what was to be expected.  However, our waitress never asked if we wanted more drinks or really paid us much attention.  <br&gt;<br&gt;Once the meal was done, she brought us checks without asking if we wanted dessert!  Some of us wanted cheesecake (It is the Cheesecake Factory after all!) but since the whole process was so painful no one ordered anything.  She messed up three checks which took forever to sort out.  <br&gt;<br&gt;The food was fine but the service was extremely lacking.  All seven of us are extremely patient and understanding, yet everyone said they wouldn&amp;#39;t be going back.", "rating": 2, "date": "3/14/2016"}, {"text": "The worst service ever! Got there at 4:20, the booth we were put into was too small for the baby seat, and when we asked hostess about it she just walked away. Then we took it upon ourselves to move. Then after we ordered they brought it the wrong order to 2 out of the 3 of us. So while one is us was eating for 20 minutes the rest were just waiting for their correct order. The. Our waitress couldn&amp;#39;t remember anything we were asking for and had to repeat everything to her. Then she left in the middle of purser vice and we got a second server. This server was nice and then we asked if we could split the bill. She was accommodating until she gave us the checks, we gave her out cards and then when we got the receipts the amount had changed on out of our checks from originally 35 to 42!! How the hell does that happen? Please explain how you randomly add 2 sodas to a check that was already correct before we gave you out cards. Then she wanted to know If that extra was ok or does she need to get her manager... Um yes get your manager.. Then she returned with 6$ in cash  without the manager... Mind you the overcharge was 7$ . At this point we were so frustrated we just took our tip back and left. <br&gt;<br&gt;This was supposed to be a nice night out for me and my cousins but ended up being a night where our patience was tried. Will not be returning back here anytime soon: most likely will go to Max Brenner&amp;#39;s around the corner... Very disappointed", "rating": 1, "date": "1/5/2016"}, {"text": "Just had the plain cheesecake it was wonderful I can&amp;#39;t wait to go back to enjoy some of the other great things they offer . The place is beautiful and the staff is GREAT !!! Can&amp;#39;t wait to go back", "rating": 5, "date": "7/9/2016"}, {"text": "overly phony wait staff, ridiculous menu....<br&gt;good veggie burgers and a few other items , salads average...good coffee ...<br&gt;been here to this location several times..", "rating": 2, "date": "10/11/2016"}, {"text": "I went here tonight with friends based on one of their recommendations and my inkling to want to try it out. We ate a table near the bar and had very friendly waitstaff who were quite accommodating but a little bit slow, the restaurant/bar area wasn&amp;#39;t very crowded.  We each had a beverage and a skinny-liscious appetizer.  It took awhile for the food to arrive, I had a trio of lettuce wrapped tacos which were messy but very good. One friend enjoyed his flatbread pizza which sounded and looked delish, my other friend enjoyed her app but part of it wasn&amp;#39;t great, I tried it and wasn&amp;#39;t impressed.  All in all it was a fun evening, the music and ambiance was nice. $49 for 3 apps, 1 drink, 1 soft drink seems a little steep to me.  We were all hoping for a light, skinny- licious desserts which they don&amp;#39;t offer. I will probably still come again but I was hoping for more.", "rating": 4, "date": "12/7/2015"}, {"text": "I have been to many Cheesecake Factories, and this one was subpar. All the food was extremely salty and the zucchini appetizers looked like 8 French fries on the plate. The service was slow and the portions were smaller than I have expected from CF. The chicken was dry, I don&amp;#39;t know what they are doing at this place.", "rating": 2, "date": "12/6/2015"}, {"text": "Came here with my coworker tonight and the food was badly prepared. There was 5 of us and 4 of us ordered the ribeye. We asked for one well done, one medium rare, and 2 medium. The well done one came out burnt my coworker kept saying it taste bitter because of the burnt charcoal on the steak. My husband medium and other coworker was both well done. My coworker didn&amp;#39;t mind but we had to send my husband steak back. There is no way I&amp;#39;m paying $30 for a steak not done the way I want it. My medium rare, came medium, no pink at all. It was late, around 12am, if it was any other time I would definitely send all four plates back to the kitchen. They need to hire new cooks or train their staff better on how to prepare steak. And my husband didn&amp;#39;t even get his second steak because the manager came over and said it was the last piece of steak in the house. He didn&amp;#39;t even seem apologetic or anything. And when we decide to change my husband entree to a pasta dish. When I asked the manager if he could not charge us for the steak and charge us for the pasta instead he seemed annoyed. As if we were in the wrong. I won&amp;#39;t be returning to this location any time soon after tonight&amp;#39;s experience, $200 on crappy food.", "rating": 1, "date": "9/29/2017"}, {"text": "I really hate to give such a low rating to a restaurant I usually always enjoy going to but that&amp;#39;s as generous as I can get from my dining experience here.<br&gt;Before anything, I&amp;#39;m a huge fan of The Cheesecake Factory. I probably dine in my local location once every month or two so i thought i might give this new location a try.<br&gt;There were four of us seated and were eager to order. The inside of this Cheesecake factory is truly beautiful and has a great ambiance.<br&gt;Our server then brought out three waters when it was clear that there was one more person in our table. Everyone makes mistakes so we weren&amp;#39;t so bothered by this. Time passed and we noticed that we didn&amp;#39;t receive our breadsticks yet and our food was almost ready. We asked our server and all he could say was &amp;#34;Oh, you want breadsticks?&amp;#34;...<br&gt;Our food came out and nothing to say about that, it was still as delicious as the other locations!<br&gt;However, our server didn&amp;#39;t bring out cheese or serving spoons and we, once more had to ask our server for this.<br&gt;Come for the food but don&amp;#39;t expect great service.", "rating": 2, "date": "7/21/2015"}, {"text": "Yuck, Yuck and Yuck!!<br&gt;This is not the normal cheesecake factory. Usually I really like Cheesecake factory, but not this one. <br&gt;The hostess was great. That was all. <br&gt;Sat at a high top bar table; the waiter seemed as if we were a bother being there and making him work. <br&gt;The fettuccini alfredo was gross, the noodles were soggy, and clumped together. <br&gt;When the busser was setting a table across from us, he touched the fork tines, the eating part of the spoon and the knives. Leaned over the clean plates to set the far settings.<br&gt;Used a dirty napkin to wipe the table. <br&gt;Don&amp;#39;t waste your time...find a better place.", "rating": 1, "date": "9/20/2016"}, {"text": "I usually Love going to Cheescake Factory and was very excited when they opened a branch in Center City. So I went to check them out Wednesday night and the venue didn&amp;#39;t disappoint. They had a wall of windows that gave a good city view and the decor was typical for their restaurants. I decided to order a dish I&amp;#39;ve had before at the KOP site - the lemon and garlic shrimp with asparagus and angel hair pasta (off the low cal menu). While the taste of the dish was fine, the sauce had a weird gelatinous quality that limited my enjoyment. The cheesecake was great as usual.", "rating": 3, "date": "8/27/2015"}, {"text": "Went to lunch with a friend.  My friend ordered a burger and I ordered a &amp;#34;Make your Own Omelet&amp;#34; to go.  I ordered: Egg white, pepper, onions, ham, and mushroom with sweet potato fries and wheat toast.  I paid whatever price.  20 minutes later, end result, I received an egg yellow omelet with mushroom and peppers and wheat toast.  I noticed it was wrong but I had to get back to work.<br&gt;<br&gt;They are batting less than .500 on my order.  Thanks Shannen N.", "rating": 1, "date": "9/18/2015"}, {"text": "I am quite surprised by all of the negative reviews that I have read for this restaurant. I am not a stranger to fine dining and have been to several of the top restaurants not only in Philly but around the world so it is not like I have unsophisticated tastes or an unsophisticated palette and I can certainly recognize good service from poor service. I have only been to this restaurant once but what is not to like?  The venue is stunning and the location is superb.  The tables are set far apart from each other and the ceilings are very high making it easy to catch up with friends and loved ones in a seemingly private and quiet setting.  I found all of the wait staff to be very friendly and accommodating and there are tons of delicious and inexpensively priced items to choose from on the menu.  I appreciate that they offered a skinny menu and found the chopped salad on that menu to be amazing. At $12 I had it for dinner and for lunch the next day.  My friend and I started with the tuna carapacio which was wonderful and we also enjoyed our cocktails.  I don&amp;#39;t think the overall three star review that this restaurant has is indicative of the experience that you will have there.", "rating": 5, "date": "1/28/2016"}, {"text": "Great restaurant, just not this location. After being CCF-lovers for quite some time, the service at this location let us down. Randomly stumbling in on a Monday night, my friends and I were seated immediately. The nightmare began when our waiter first approached the table to greet us and asked us if we had any questions about the menu, after waiting and waiting, he brought out only three waters.. when there was clearly four of us. We proceeded to place our orders, and after patiently waiting for our food and breadsticks, nothing. We called over the waiter and asked &amp;#34;hi may we have our breadsticks?&amp;#34; he replies, &amp;#34;oh, you want breadsticks? sure&amp;#34;. We were very disappointed at the fact that we may have never received breadsticks if we had never asked. Not to mention, we finished our waters and had to sit around waiting for the waiter that never came to check up on our table. If we wanted more water, we had to wave over our server.<br&gt;<br&gt;So finally, our pasta dishes and pizza arrive at the table. It looks absolutely delicious, as always; however, the server did not bring out cheese. Trying to get the server&amp;#39;s attention (once again), we waited for him to grab the cheese for the pasta. Another disappointment. Despite the upsetting service, the food was still extraordinary. If you want a pleasant dining experience, I would suggest going to another CCF location or ordering take out.", "rating": 3, "date": "7/17/2015"}, {"text": "Location is great, very clean and attractive restaurant. Training of staff needs work. Our waitress didn&amp;#39;t know the salad dressings or soup and offered drink refills when we were ready for the check", "rating": 3, "date": "12/23/2016"}, {"text": "Party of 4 and we were seated right away. Ordered the old fashioned burger, well done. Everything was great, and we all had exactly what we ordered. Too full to have dessert. Will come back to just have the Godiva chocolate cheesecake next time.", "rating": 5, "date": "8/22/2016"}, {"text": "The interior of this restaurant/bar is exquisite. However, on my recent dinner visit, I received a menu and then my waitress got lost for over ten minutes. It was not pleasant. I was at a booth facing the bar and to my left were many people waiting to be called. I felt like they were breathing down my neck. I hope to return again and get better service. MY experience at the same restaurant at the King of Prussia Mall has been incredibly good, however.", "rating": 3, "date": "1/5/2018"}, {"text": "Always a great experience, big fan of the setup with large windows and a great view of the city streets. Tonight our server was Nita and she was wonderful. Enjoyed the beet salad and fried cheese wedges along with some excellent cheesecake. Great food, better service and wonderful environment.", "rating": 5, "date": "1/1/2018"}, {"text": "My boyfriend and I came to the factory out of pure desperation and hunger. We had not eaten since 11am. This restaurant was open late night and came in clutch. The best part about this factory is the long upwards climb on the escalator. It felt like I was being transported to some sort of gender confused restaurant without a central decoration theme. Anyway, my boyfriend and I sat down and began to scope for the cheapest meal. Too bad the menu purposefully confuses and tricks you into making bad choices. This menu had a plot, a climax and an epilogue. Anyway, we got &amp;#34;lime chicken&amp;#34;. It satisfied me. The waiter seemed upset that we weren&amp;#39;t going to double our check amount by getting cheesecake. The best part of this trip was when we went to catch our uber. A homeless man came up to us and gave us lifelong relationship advice that we will forever take with us and cherish as we go forward in life. You do not need a ring to be a husband.", "rating": 4, "date": "12/28/2017"}, {"text": "This would be a 1 but the pizzas and flat bread were good.  4 of us went for lunch and waited an hour for our food. After 40 minutes I went to fron desk and they said sorry we will let manager know right away.  20 minutes later the food showed up. My friends salad no dressing.  The wrong salad for me and then when they brought it bac it had the wrong dressing poured on it and instead of taking it back brought me the right dressing for the side.  I guess they expected me to eat it with vinagerette and ranc.<br&gt;Ordered the portofino pizza and the server kept calling it portfolio.  It was all so horrible it was funny but to be honest a manager should have come to our tabe.<br&gt;<br&gt;Never again", "rating": 2, "date": "7/13/2015"}, {"text": "We took my mom out to the cheesecake factory last night to celebrate her 77th birthday with the family. We went to the Willow Grove location. Our waitress was Robyn. She was very accommodating and so was 6rest of the staff, We went in the evening around 4:30pm. To my surprise there was no wait. This was our visit to this restaurant. We ordered appetizers, drinks, dinner and cheesecake to take home. They give you large amounts of food, so much that we even had take a lot of our foodff..At the end 6f dinner a few waitresses came out with a slice of cheeese cake and a  little candle lit singing happy birthday, My mother was so happy. We definitely will be going back there again. Thanks for the great hospitality.", "rating": 5, "date": "11/19/2016"}, {"text": "This restaurant is really nice! Top floor is the only place for seating. The menu is huge, I always like to look online ahead of time. I got a peach Bellini to start with. It a very tasty but didn&amp;#39;t taste alcoholic at all. Food was standard for Cheesecake Factory. The service was incredibly slow for a Monday night however. Waited an hour just to get our entrees. Can&amp;#39;t imagine what it&amp;#39;s like on a busy night. Food was good and so was the cheesecake so besides the service, 4 stars it is!", "rating": 4, "date": "3/9/2016"}, {"text": "Found a cockroach in my salad tonight. Alive. Management handled it well but yuck. How does a cockroach get tossed into your salad?!", "rating": 1, "date": "7/8/2016"}, {"text": "My third visit and you can sense the slow decline in what was pretty good service and quite good food (for the $) after only just under a month open.  <br&gt;<br&gt;Now the &amp;#34;downstairs&amp;#34; hostess is busy, busy on her cell phone and the &amp;#34;upstairs&amp;#34; desk staff is busy, busy looking bored, disinterested and talking among themselves.  The server staff is trying but management is, at best, focused on...who knows what...not the customers for sure.<br&gt;<br&gt;Seated at the tiniest, most crowded table in a half empty restaurant--I guess this was convenient for...the staff. When I asked for new table the manager was nearly dumbfounded and reluctantly reseated us after asking if we had ordered anything--I guess if we had ordered we would be punished by not being allowed to switch tables. (Actually our server finally took initiative and moved us since the manager was busy...talking with the hostesses.)  Food arrived at a reasonable pace and was C+---beef in Hibachi Beef was dryish but other items good. Tried to buy a piece of cheesecake (at almost $10 a pop) and couldn&amp;#39;t get anybody to sell it to me. 1 counterperson--3 customers---all on a very slow night overall---while 2 hostesses and 2 mangers stood right next to cheesecake case chatting with each other.<br&gt;<br&gt;They hustled for the first few weeks--now they&amp;#39;re just taking orders for pretty good food with diminishing service. Bottom line--almost faithful (local Center City eat-out-all-the-time nearby residents) are now twice a year customers...maybe...locals who wouldn&amp;#39;t send visiting friends and relatives here for sure...<br&gt;<br&gt;As other reviewers have said...it could&amp;#39;ve been a hit but it&amp;#39;s really just hit...and miss at CCF!", "rating": 1, "date": "10/23/2015"}, {"text": "We recently received a sub-par key lime cheesecake and that&amp;#39;s an understatement.  It was borderline rancid and it didn&amp;#39;t help that it took forever to dethaw.  This was a supreme disappointment to our colleagues at the office who all agreed that it could very well be the absolute worst cheesecake ever made.  This was a 30 dollar waste on a 9 inch pie and will probably never order from here again although at least the customer service was satisfactory.", "rating": 1, "date": "6/25/2015"}, {"text": "Sub par service. Came with a group of 5 people 3pm on a Saturday. We ordered 4 salads and a soup, and it took 45 minutes to come out. There was a giant hair ball next to the table which solidified the experience. The cold soup, slow service, and soggy salads are the reasons I will never come back or recommend Cheesecake Factory to anyone", "rating": 1, "date": "1/30/2016"}, {"text": "I went to lunch at this Cheesecake Factory at 15th and Walnut today with some friends. We had a really comfy cozy booth in the room with the giant glass windows. I absolutely loved being able to have multiple views of the city skyline while eating lunch. The atmosphere was extremely pleasant and the food was tasty! Not a fan of all the calories on the menu................ but I guess they must have to do that!", "rating": 5, "date": "1/21/2016"}, {"text": "I ordered to go and sat on the bench waiting to be called for 20 min... and then since no one called me i asked the togo worker and he said i called u i was like in this noisy restaurant it is impossible to hear since i an sitting on the bench and not standing next to the cashier... he is supposed to come to with the food he saw yet even when I didn&amp;#39;t hear he did not bring the food to me I could have waited for 20 more minutes", "rating": 1, "date": "9/27/2017"}, {"text": "Service Terrible<br&gt;main course decent<br&gt;Service terrible<br&gt;Cheesecake good<br&gt;service terrible<br&gt;overall, terrible experience on a quiet Sunday night for a family dinner.<br&gt;Won&amp;#39;t make that mistake again!", "rating": 1, "date": "9/4/2016"}, {"text": "Large portions, that&amp;#39;s the good part. I wanted so much to love their cheesecake, but it was frozen several times, dense, and the grahmcracker crust was gooey. One of the worst cheesecakes I&amp;#39;ve had.", "rating": 1, "date": "7/7/2015"}, {"text": "six of us dined here yesterday.the food was average/good.presentation was nice.<br&gt;issues with waiting. ..and waiting....and waiting for food.<br&gt;its one thing to enjoy a leisurely meal but our wait bordered on insanity.<br&gt;the server was a bit too perky but didnt hover.<br&gt;love that bread they serve ,all crunchy and delicious. upgrade from breadsticks definitely. <br&gt;desserts are pure heaven, even a bowl of strawberries  (7 smackers mind you ) were served in a really nice way...<br&gt;but be prepared to wait..and wait", "rating": 3, "date": "7/16/2015"}, {"text": "I love the Cheesecake Factory and was excited that one just opened in center city. Like the other locations I&amp;#39;ve visited, the food is so good and the portions are huge. Customer service was great which is another plus. Highly recommend the monte cristo for brunch.", "rating": 4, "date": "7/30/2015"}, {"text": "Beautiful, especially for a space in Philly! I love the variety. It is a chain but they do it very well.", "rating": 5, "date": "8/9/2016"}, {"text": "was here monday with my neicey poohz,had a blast everything from the service to desert was truly impeccable!!", "rating": 5, "date": "9/5/2015"}, {"text": "Great service with great food. The amount of food is more than what I expected and the taste was amazing. The Cheesecake Factory is not only for the desert place but for fantastic pastas with salad. In addition, the atmosphere is perfect for a date or hangout or day out with friends in anytime!", "rating": 5, "date": "10/13/2015"}, {"text": "A+++++! Our server was great, everything we had was great. The managers came around to check on us and were very friendly and sincere. We had the artichoke appetizer and I highly recommend it. I suggest you park nearby, because you will have leftovers! Such a great addition to the city.", "rating": 5, "date": "6/24/2015"}, {"text": "Good inexpensive place to eat for less than $20 per person. It&amp;#39;s right in the middle of center city, so it&amp;#39;s classy without being too expensive.", "rating": 4, "date": "7/11/2017"}, {"text": "I went there for a birthday dinner with my friend. Surprisingly six or eight people had birthday on the same day so birthday song was with us all night. To be honest, I didn&amp;#39;t like the server because of his attitude. It seemed that he didn&amp;#39;t really want to serve us. We ordered cocktail, which was good. Crusted chicken and lettuce wrap were also very delicious. The only dish we didn&amp;#39;t like was the grilled pork, which was overcooked and tough. Overall I loved this dinner and the environment so I gave this restaurant 4 star.", "rating": 4, "date": "2/3/2016"}, {"text": "Awesome first time experience with The Cheesecake Factory! We were amazed at the selection of entrees and it took us a while to decide as it all sounded great. We opted for the Eggroll Sampler which was delicious all the way around the plate! Our entrees were very good and to finish it all off the cheesecake was phenomenal. Our server was also an absolute pleasure. We&amp;#39;ll definitely be back!", "rating": 5, "date": "10/29/2015"}, {"text": "Great for a treat if you go to college in Center City! It&amp;#39;s delicious as any other CF and the waitstaff is nice and accommodating.", "rating": 4, "date": "8/21/2016"}, {"text": "My boyfriend wanted to come and randomly get dessert and of course I was all for it! We came to get his favorite apple crispers and I ordered the cookies dough cheesecake ! The dessert and presentation was great! If the service was as great as the food I would&amp;#39;ve given 5 stars hands down. Unfortunately we did not get any silver wear or plates for the bread... Also I didn&amp;#39;t get a refill on my drink until we were ready to leave and pay. I know all the servers are not this way because the table beside us was lucky enough to get a server that actually seemed to like their job. If the waitress was more enthusiastic and on top of it this would&amp;#39;ve been a great experience... Maybe next time we will get the cool guy with the mohawk that served the table next to us!", "rating": 3, "date": "10/11/2015"}, {"text": "For a Saturday night we were started pretty quickly. Service was good and the food was fine. The cheesecake however was HORRIBLE. When the waitress came over I commented how tiny the slice was. It used to be enough to share but this piece was pretty much smaller than the two dollops of whipped cream. I ended up being happy that the piece was so small because it tasted really bad. The cheesecake part dry and crumbly. I guess I should thank them for helping me watch my calorie intake...", "rating": 3, "date": "10/10/2015"}, {"text": "The Good: The space is wonderfully decorated and the service and food were fine.<br&gt;                  Most of the portions are large and easily splittable.<br&gt;<br&gt;NOTE: Allow time to wade thru the 16 page plus menu<br&gt; (Oh, and there&amp;#39;s a second menu for additional reading..........) Can we say overkill??????<br&gt;<br&gt;The Bad: Be forewarned - this was one of the NOISIEST restaurants we&amp;#39;ve ever been in.<br&gt;<br&gt;The music was LOUD, the noise level in this place was VERY LOUD. We had trouble understanding each other from across the table. We did ask the manager to turn the music down and he graciously did turn it down a little. However there are all hard surfaces in this place so it was still an issue that we tried to ignore during our dinner.<br&gt;<br&gt;Finally our guest said she felt like she was shouting to be heard and was uncomfortable. We agreed and decided not order cheesecake (yes, we didn&amp;#39;t order cheesecake at The Cheesecake Factory...) We just wanted to get out of the NOISE.<br&gt;<br&gt;We MAY try this for lunch, because we all liked the decor and menu choices are enormous. BUT, If the noise level is the same, we won&amp;#39;t stay.", "rating": 3, "date": "11/10/2015"}, {"text": "What else can you expect from the Cheesecake Factory? It&amp;#39;s pretty mediocre food that costs more than it should and has slow service. However, the building is very nice and the atmosphere is quite pleasant. The Cheesecake Factory served its purpose of a decent meal that left us satisfied overall.", "rating": 3, "date": "8/7/2016"}, {"text": "I enjoy cheesesteak factory enough to call it one of my favorites, but this location is becoming a joke. First strike, is dining in with over an hour wait for appetizers, only to get dirty plates and utensils to eat with. Second strike, ordering a Caesar salad to go with no dressing in the container. 3rd strike, I ordered the Pasta with Chicken in Scampi sauce, and the ingredients that are suppose to be in it are missing. I got dry noodles and some chicken chunks, that&amp;#39;s it, no veggies at all... 3 strikes, you&amp;#39;re out! This restaurant is consumed with incompetence.", "rating": 2, "date": "9/16/2015"}, {"text": "Best to go before noon and the lunch crowd. Nice view and food is adequate nothing special. Nice lunch portions.", "rating": 3, "date": "4/19/2016"}, {"text": "Went here for my birthday celebration with two friends. Not only did they wish Happy Birthday to the wrong person, the food was less than lackluster and a server shushed us for being too &amp;#34;loud.&amp;#34; The food runner looked at me sheepishly as he realized he sang happy birthday to the wrong individual and apologized before making his quick escape. That same server that shushed my table was also complaining about working at The Cheesecake Factory - saying that she was working for longer than she was supposed to. Would not recommend going there. Nothing but disappointment. The branch at the King of Prussia Mall is a much better franchise.", "rating": 1, "date": "8/17/2017"}, {"text": "I love the Cheesecake Factory, I didn&amp;#39;t have dinner there because we were in town for a marathon and we wanted to check out one of the local independent restaurants for dinner. We did stop by to grab dessert and take it to our room. I understand sometimes it&amp;#39;s hard to assist a customer right away because the restaurant is busy. We waited for about 5 minutes before even being greeted. The staff was completely neglecting us along with 4 others waiting. I mean, I paid $18 for two pieces of cheesecake. At least make an attempt to be pleasant. Let&amp;#39;s just say I won&amp;#39;t be stopping by this location again.", "rating": 1, "date": "10/31/2015"}, {"text": "Went here around 4 and got the lunch specials Herb Crusted Filet of Salmon  and Chicken Piccata. Both were brought out in a timely manner and cooked perfectly. Definitely recommend either dishes, and they were pretty big portions for a lunch special size. The atmosphere was quiet since this was before dinner rush, and our server was always there when we needed him. Got the Chocolate Mousse cheesecake that was to die for.", "rating": 5, "date": "2/3/2016"}, {"text": "The service is awful at times and other times its superb. Not sure why this is so, but I have been there quite a few times. The food isn&amp;#39;t out of this world. They do so many different cuisines because their menu is vast, but there isn&amp;#39;t a single dish I am crazy for. However, they have amazing appetizers. Love their stuffed mushrooms, flatbreads, lettuce wraps, etc. It is for their appetizers they get a 4 instead of a 3.", "rating": 4, "date": "1/31/2016"}, {"text": "This is my second bad experience at this Cheesecake Factory. The service was absolutely HORRIFIC! I have had some bad severs, but nothing comes close to what I have experienced twice in this place. My wife and I are a long time customers of Cheesecake Factory - in the past we ate there at least 2 times per week. I used to go to the ones in KOP and Cherry Hill. After this last time in the city, I will never EVER return! Servers are absolutely incompetent, lazy, careless, and snobs. Managers are WORTHLESS! Do not go there unless you want to treated like garbage. Take your business to Cherry Hill , KOP or any other restaurant in the city.", "rating": 1, "date": "1/19/2016"}, {"text": "Pretty good food, definitely get a lot of it. It seems to always be busy here, but food never tales too long coming out. They have tons of variety with every meal of the day. Good for families, dates or girls night out.", "rating": 4, "date": "4/6/2016"}, {"text": "My husband and I were serviced 12-27-15.<br&gt;Our sever (Edward M), appeared to be overwhelmed with his tables he was responsible for. He served the table on my right and left, but didn&amp;#39;t acknowledge us right away. Five minutes later, he asked us for a drink order. We ordered. My Husband also mentioned, we didn&amp;#39;t have saucers for our loaf of  bread. He came back with 2 saucers to accommodate us. Our dinner was very tasty.<br&gt;Although he forgot my vegetable, I waited and caught him at another table to tell him. He served us hastily. ÇF was good, but waiter was so so.", "rating": 4, "date": "12/27/2015"}, {"text": "always have had a great meal here and the wait staff has been excellent. it&amp;#39;s a beautiful place. one of the better cheesecake factories in the area.", "rating": 4, "date": "7/14/2017"}, {"text": "Service is ok. Food is delicious. Just be aware, you are eating with mostly low class people so do not be fooled by the gourmet presentation of each menu item. Basically is 80% low class. 15% middle class and 5% high class people will eat here. So definitely don&amp;#39;t bring a lot of money because there is a 40% chance you you will get jumped that day you choose to eat here. Obviously not in the restaurant, but some place near it. It&amp;#39;s a great place to go to when your with a large amount of people because of the large variety of food. I recommend it as a backup place, but remember, the people your dealing with in this restaurant have little to no manners, meaning they will not say sorry for any reason, no excuse mes, no holding the door open, no saying thank you for holding the door open, these people that eat here are complete animals and will wait for a table no matter how long it is. Oh and the worst is when people dress up to go to this place..It&amp;#39;s the fcking Cheesecake Factory, not Peter Lugers Givme a break", "rating": 4, "date": "5/2/2016"}, {"text": "Where do I begin? I tried to give #cheesecakefactory downtown Philly a try. As soon as we walked in (myself,a friend and my daughter) the host was in the back so she came about 5 mins which wasn&amp;#39;t bad but she had attitude and didn&amp;#39;t give her a kids menu. Okay! fine not a big deal, but as we&amp;#39;re walking almost every table we passed was dirty! I mean DISGUSTING, while the waitresses and waiters was talking with each other. We sit down and the host begins to give her silverware(DIRTY SILVERWARE) we expressed we wanted plastic BC the silverware was so dirty her respond was to one talk to our waiter about that and two put the DIRTY( I mean food still on the fork dirty) back into the draw to give to other customers! (red flag) next I ordered a glass of Merlot .. I should&amp;#39;ve took a picture of my glass but it was so dirty my friend took it back to the bar BC it was greasy like someone literally just had a drink and they washed it with water and poured my wine in there. My friend took the wine back, spoke with the manager about how dirty the restaurant was, instead of him bringing the wine back asking did we need anything or just see how dirty the place was he sent a waiter. Now, someone comes and looks at the silverware ( not a Mgr) and begins to wipe he DIRTY silverware with a cloth .. A CLOTH! Not rewash them but a cloth! DISGUSTING!  On top of everything, the waiters , omg their clothes were gross like they were in the back cooking the food themselves! Yes it was bad. Next to us was a set up where they came the dirty dishes (I guess and ice tea along with a register when everything was gross. I&amp;#39;m also attaching photos BC just expressing it isn&amp;#39;t enough. So, all of this honestly probably happened within 15-20 mins tops. We got up walked over to the mgr.which is never came back to make sure i even  received my wine and his respond was l&amp;#39;m embarrassed this place looks like this but I&amp;#39;m just coming in and trying to fix it , we expressed when trying to fix it first you need to rewash your dishes NOT wipe with a cloth! Also, as we are getting up from our table we were expressing it to another waiter with how dirty the place was and HE AGREED! Saying yeah I understand you guys are totally right it&amp;#39;s dirty in here I&amp;#39;m sorry you guys had to come in and witness but we were confused BC everyone was standing around literally doing nothing while tables were still dirty ! I will never eat downtown Philly or even a drink at the Cheesecake Factory! My experience was horrible! I would not recommend anyone eating downtown Cheesecake Factory unless you want to get sick BC they don&amp;#39;t clean anything! I have NEVER experienced anything like this before! Customer service was horrible,  eating there was not an option at this point! Totally unacceptable!!", "rating": 1, "date": "5/17/2016"}, {"text": "4 for dinner on a Sunday night, I order the Vegan Cobb Salad. It arrives , I start eating and it has cheese and bacon in it. The manager happens to walk by , sure enough this is a regular Cobb Salad. After a long while the real Vegan Cobb Salad arrives without dressing, I hunt down the waiter . He brings Dressing, Manager stops by to let me know that Salad is on him. Comments on the 3 wonderful Dressings that are on the salad. I only got one. Manager offers cheesecake on the house. <br&gt;Leaving and stopping at the ladies room . Filthy dirty and no toilet paper. Inform manager on the way out . Does not seem to concerned,<br&gt;NOT GOOD.", "rating": 2, "date": "11/16/2015"}, {"text": "My co-workers and I went to the Cheesecake Factory to meet over lunch. Upon our arrival, one of my co-workers saw a roach on the floor, we thought that might have been a single incident until after being seated at our table; we placed our orders, was engaged in discussion at which point one of my co-workers saw another roach on the back of my seat, after some bewilderment, we get up, while another of my co-workers kill the roach; the manager comes over and offers us a seat in another location, we say fine; until while standing waiting to be seated we see yet another roach crawling on another seat. The manager acknowledged that there had just been extermination. At that point we all opted to leave the establishment as none of us had much of an appetite after that incident. I highly recommend that extermination be done after hours and allow enough time so that bugs such as roaches be totally eliminated before the establishment reopens. Unfortunately, I will not be back to that particular Cheesecake Factory and will probably be suspicious of others. If the dining area was like that, I can only imagine how things were in the kitchen where there&amp;#39;s much more food.", "rating": 1, "date": "9/7/2016"}, {"text": "Our first server was very nice, although she didn&amp;#39;t know much and had to check her notes a couple of times (which wasn&amp;#39;t a problem at all) I ordered the steak medallions well done with out mushrooms (I&amp;#39;m allergic) the bring our food out and i look down and there&amp;#39;s mushrooms. When they finally brought out my right food, it was not well done, closer to medium well.  Our table was rarely checked on, and we ran out of ketchup and butter and couldn&amp;#39;t get more because no one came over unless they were bringing us something. Multiple other little things could be fixed as well, but the main thing being their attention to customer satisfaction. They did not do anything for us other than apologize for screwing up my order badly, which when it comes to allergies it should be taken more seriously. If this restaurant wasn&amp;#39;t a chain I would most likely not return, however I&amp;#39;ll try it again when they work out some of the kinks", "rating": 2, "date": "2/1/2016"}, {"text": "No greeting. Waited 20 minutes for service and water. We said we both had gluten allergies and a few minutes later, waitress comes back with our water and a bread basket. We quickly said &amp;#34;no we can&amp;#39;t have bread!&amp;#34; Also, servers were standing near our tables, on their phones, cursing and being completely unprofessional. Burger came out without a gluten free bun (as advertised) and they ran out without letting us know. Only bright side is the manager came over at the end and sincerely apologized, paid for our entire meal, and gave us free gluten free cheesecake.", "rating": 2, "date": "10/15/2015"}, {"text": "Leanna was SUCH a great server I&amp;#39;ve been to the Cheesecake Factory many times before but my experience this time was phenomenal!! Food was great as usual. I would suggest the stuffed mushrooms", "rating": 5, "date": "3/2/2017"}, {"text": "This review is for service only, the food is excellent and up to par with other Cheesecake Factory chain restaurants. I came here on a Sunday afternoon around 1pm so it was relatively slow, we were seated in a corner next to another family even though there were 15 empty tables in the same row where we could have been more spaced out. Normally I wouldn&amp;#39;t mind this but the table next to us had screaming little kids, which is understandable but atleast don&amp;#39;t sit a couple directly next to them when there are open tables elsewhere. About 15 minutes went by before we were even greeted about a drink, except we weren&amp;#39;t greeted and asked if we wanted a drink we were simply brought waters and quickly asked if we were reading to order so without thinking we spouted out or order and remained drinkless, except the waters we were brought. The appetizer came out in decent time and the food quickly followed but we maybe saw our waitress once at this point and I asked to order a sparkling water and she said sure I&amp;#39;ll bring it right out. 20 mins later still no drink, I had to ask another waiter to get it for me. Then when we were done eating we both had our napkins on the table clearly done eating for a solid 25 mins and our waitress went Missing and did not come back for the check. By the time she did we passed on desert because we were going on a 1.5 hour lunch at this point. I&amp;#39;m not sure I&amp;#39;ll be back to this location pretty disappointing especially when you have a certain standard for Cheesecake Factory.", "rating": 1, "date": "4/17/2016"}, {"text": "I visited Philly this past weekend from Washington, DC, and decided to go to the Cheesecake Factory. You can never go wrong with the Cheesecake Factory, or so I thought, especially since it&amp;#39;s one of my favorite budget places to eat, the food is always plentiful, reasonably priced, and tasty. Well, that&amp;#39;s until this last visit. First, let me start by saying this is a BEAUTIFUL location but, unfortunately the service and quality of food does not match the atmosphere. I&amp;#39;ve never received such horrible service in my life. It was slow, unorganized and downright shameful. My dish (Four Cheese Pasta) was made twice and still was not right. I spoke with the manager and she apologized and offered to make it over a third time. At that point, I was over the whole experience and was ready to travel back to my own city where the Cheesecake Factory service is excellent, and the food is even better. If you&amp;#39;re ever in Philly, avoid this location like the plague. It&amp;#39;s doing the franchise a disservice.", "rating": 1, "date": "5/1/2017"}, {"text": "Had a disappointing visit on a Saturday Night. Got Seated in immediately, but it took 30-40 min until our waitress came in to check with us. The place wasn&amp;#39;t even busy yet it took 40 minutes for our waitress to check in with us. We ordered the steak and pasta. The steak was good but the pasta was disappointing. The pasta was very bland and the chicken was very dry. Service is very weak here.", "rating": 2, "date": "4/16/2017"}, {"text": "I go to all of the locations in the Pa area even Cherry hill. Came in for lunch 11:30 am Sept 21,2015 Always go at lunch if you want the best service and price on lunch specials . They burned my miso salmon it had a burned look and taste. But guess what I love burned food. So I did not care,but this would piss off anyone else. I only buy miso salmon for over five years .Im a miso salmon whore.", "rating": 3, "date": "9/22/2015"}, {"text": "I went tonight with my friend, and as always, it was crowded. It was not my first time here. My first experience at this restaurant wasn&amp;#39;t that good, but I decided to give it a second chance. The staff told us to wait 40 minutes so we did. They made us sit at &amp;#34;the end of the bar&amp;#34; which was two seats at a lower counter, so the barman barely saw us. Nobody came to give us a menu so we had to take one by ourselves. Nobody came to take our order for 15mn until we finally ask for someone. They didn&amp;#39;t gave us water nor bread automatically, we had to ask for it. Every time. Even for forks, knives and napkins.  We wanted to change our seats because the counter was next to the restroom so many people were walking behind us. They gave us a &amp;#34;beeper&amp;#34; saying that we will have a table in 20mn. 20 mn later, an other woman was working at the front desk and she told me with in a condescending and annoyed way that I can&amp;#39;t transfer from a table to another. Also the waiter didn&amp;#39;t take our order correctly so we had to wait 35 mn total to finally have our food. I got the meatball pasta, which was really tasteless, my friend had the Miso Salmon, which wasn&amp;#39;t bad. At the beginning we wanted some desert but we though that this place didn&amp;#39;t deserved our money. This place looks nice and fancy at first but we realized fast enough that it is just a popular and overrated garbage. I never write reviews on places that I don&amp;#39;t like but this will be an exception and I hope that the owners of The Cheesecake Factory will do something about their staff and terrible service in the future.", "rating": 1, "date": "10/23/2016"}, {"text": "Wonderful, plentiful salads. Order &amp;#39;lunch&amp;#39; size for dinner. Still too much. Sure, it&amp;#39;s a chain. Sure, it&amp;#39;s formulaic. And so what. Good value for money. And this location, atop Walnut Street, is bold and beautiful. And tacky, of course. Service was great, though a bit overdone, this being the resto&amp;#39;s &amp;#39;soft&amp;#39; opening week and all. Expect crowds after the official opening. Mall people will descend. As for Applebee&amp;#39;s next door? Are they packing their bags already? -- Hotspur for The PJ.", "rating": 4, "date": "6/25/2015"}, {"text": "I just had the worst shrimp scampi I&amp;#39;ve ever had. This cheesecake factory&amp;#39;s food is not up to par with the other restaurants of the chain that I have visited in the past. My whole dish was unsatisfactory with dried pasta that looked at least a couple hours old. My shrimp was unseasoned and left much to be desired. The waitress was ok, but associated too much with other staff on the job instead of being attentive. All in all, the King of Prussia and Cherry Hill locations offer better service and better food quality.", "rating": 1, "date": "11/18/2016"}, {"text": "My experience at this Cheesecake Factory was probably one of the worst experiences I have ever had at a restaurant. I was meeting some friends who were already there when I left my house. An hour later when I arrived they had still not received their food. I decided to just order a drink and avoid the long wait. The waitress, Kendra was curt and neglectful. It took my friends 20 minutes just to get the sauces they had asked for when they originally ordered. It did not end there however, Kendra then LOST my credit card when we paid.  Instead of trying to locate it, she continued with what she was doing. I asked for the manager, Peter who was just as if not more apathetic. &amp;#34;Yeah..uh sorry, can&amp;#39;t find it.&amp;#34; I told him this was ridiculous and his only response was &amp;#34;well we won&amp;#39;t charge you for the drink&amp;#34;. Well obviously not because I no longer have a credit card. He comped my friends meals but I have never been so furious at someone&amp;#39;s lack of customer service skills. The only other thing he could give me was a post it note with the corporate 1 800 number. Ridiculous.", "rating": 1, "date": "11/6/2016"}, {"text": "So I was there last night for some late night dinner and it will be my last. We walked in 10 30 and none came to greed us nor give us water. Apparently none gave a $hit Bc the kitchen closes at 11 and they waited until 10 57 to come tell us that they were closed. Manager couldn&amp;#39;t give less of $hit bc he walked up on us after a lil conversation with the waiters, and told us &amp;#34; look people want to go home&amp;#34;. If u are looking somewhere to eat and it happens for u to be around there at 10 30, do your self a favor and drive to the nearest diner.", "rating": 1, "date": "8/4/2015"}, {"text": "The food and atmosphere was decent but they screwed my check up and charged my card multiple times. After probably 15 minutes of trying to get it fixed, I&amp;#39;m pretty sure that I&amp;#39;m still screwed, but didn&amp;#39;t want to devote anymore time to the ordeal.", "rating": 2, "date": "12/27/2015"}, {"text": "Worst Cheesecake Factory experience ever! Service was slow (even though it was empty), the quality of the food was horrible, and the manager was nonchalant and rude. To top it off, the manager still tried to charge me for uneaten food and up-charged me for 2 kids drinks (charged me the price of adult drinks). Needless to say I will never be back!", "rating": 1, "date": "2/7/2016"}, {"text": "Food is like every other Cheesecake Factory and is just enough to fill you up. However food takes forever to come out even on an early weekday lunch service.", "rating": 2, "date": "3/9/2016"}, {"text": "Where do I begin?!?!  As soon as you enter, the hostess seems as if hurts to greet customers with a smile. We were a party of 7 and she told us the entire restaurant was full and there were no tables available (although there was no one waiting to be seated).  I found this concept hard to believe so I walked the floor of the restaurant and found a table that was available to accommodate us but it needed to be cleaned. I let the hostess know and she said she knew b/c they took an inventory (not sure why she didn&amp;#39;t take inventory before telling us there were no seats). We waited another five minutes and then we were seated. Now we get the waitress who doesn&amp;#39;t want to smile or acknowledge us. Smh. No pleasantries, no bread, took forever with the drinks, never apologized for any of the mishaps, and just outright rude. Stay clear of the Cheesecake Factory!  The food and service sucks!  The mashed potatoes were cold and my husband&amp;#39;s Cajun jambalaya had NO flavor!  This location needs to close down or they need to get all new staff!  Smh", "rating": 1, "date": "6/20/2016"}, {"text": "Had Sunday night dinner this summer with my cousins from Ireland, party of 7. Service was great.  our meals and desserts were excellent.  Our server made sure all 7 meals arrived at the same time and recommended some great items. The Cheesecake factory was a highlight of my cousins&amp;#39; trip to NYC and Philadelphia.  Looking forward to my next meal there.", "rating": 5, "date": "10/16/2016"}, {"text": "Wednesday before thanksgiving 2017 and I have to work in DC so I go to visit my mother and the Cheesecake Factory is a safe bet. Walking in and seating is quick and the waiter asks for drinks. It&amp;#39;s cold out so 2 waters 2 coffees. 12-15 minutes later no coffee or water and says he was backed up. 5 seconds later we walk out. I talked to the manager and left. I have worked in the restaurant industry for James beard awarded chefs, French culinary chefs with notable companies such as the kimpton as a sommelier certified from the CMS or as a restaurant manager. I have a lot of latitude when it comes to service or food to a degree but this is the first time the cheesecake has let me down. Dc tysons palm beach gardens etc. cheesecake has always been consistent except tonight. Note I blame none of the other staff, the manager was empathetic, the hostesses were properly dressed and diligent it was just the server and his lapse or lack of care. I plan on returning on my next visit from dc.", "rating": 1, "date": "11/23/2017"}, {"text": "The building is beautiful, but the service is absolutely horrible. I came here with one other person during lunch on a Tuesday around 12:30pm, I did not leave until 2:15, and it really wasn&amp;#39;t even that busy and we only order sandwiches. Most restaurants in center city are much more cognizant that the people who come in for lunch on a weekday have to be in and out, but not this place. I would be surprised if they stayed in business much longer if they keep this up.", "rating": 2, "date": "8/23/2016"}, {"text": "I&amp;#39;ve eaten at cheesecake factory&amp;#39;s in 5 states never disappointed except for this one. Ordered crabs cake came out room temperature second time they came out cold waitress apologized  said did I want dessert because she felt bad. Ordered dessert and was charged. The manager was no where to be seen", "rating": 2, "date": "1/17/2016"}, {"text": "Beautiful setting, but absolutely terrible service even after asking for a manager to bring it to his attention. Food was cold, mimosas were warm &amp;amp; full of OJ, not coming back to this location. Sat around dirty plates for 4ever waiting on check. Not even a busy day", "rating": 1, "date": "1/17/2016"}, {"text": "I am not very fond of collecting memories but this one guy at Cheesecake Factory at Walnut Street would probably remain in my memories for some time. Excellent food is one thing but the way Jonathan helped us celebrate our son&amp;#39;s birthday lunch was a memory that would last for some good time. I am going back soon just to enjoy the pleasure of being served by this one guy, Jonathan. Thanks Jonathan.", "rating": 4, "date": "4/27/2016"}, {"text": "One and done.  I went here yesterday March 22 for dinner and was very disappointed.  I had to wait approx. 10 minutes before anyone greeted us at our table.  Finally a waitress comes by and asked was anyone helping us, we said no, she then said she would serve us.  <br&gt;Firstly, she didn&amp;#39;t tell us her name but took our orders, I ordered the Jamican Black Pepper Chicken with the option of shrimp.  I ordered the shrimp and chicken with brown rice.  Well I got white rice and only four small shrimp.  Had to get brown rice sent to me in a bowel and was told it comes with white rice??!!!  The meal was unflavorful, only thing good was the salsa.  <br&gt;Then for dessert I ordered strawberry cheesecake to go with No whipped.  When I got home to eat my dessert, it was filled with whipped cream all over.  Suffice it to say, I will never come back.  I will go where the food is great and I great exactly what I order, that is the Cheesecake Factory in a Cherry Hill.  Thank God I know what that meal is suppose to taste like or else I would never return to the Factory.  <br&gt;<br&gt;The only good thing about this place is the decor.", "rating": 1, "date": "3/23/2016"}, {"text": "worst service. went there with a coworker for lunch today. ordered a cup of green tea they brought out a mint tea bag. ordered full size specialty pizza &amp;amp; crab bites appetizer. after waiting 45 minutes they brought us a personal size pizza for one. Had no time to wait for the order to be corrected. i had stop at Wendy&amp;#39;s for a burger &amp;amp; head back to work. $14 for 2 cups of tea &amp;amp; an appetizer that wasnt anything to rave about.", "rating": 1, "date": "10/2/2015"}, {"text": "I love the cheese cake factory. But the one in Philly is the worst cheese cake out of all of them. I drive to Cherry Hill, NJ to go and enjoy my self! They one in Philly does not operate like any of the other cheese cake factory. They staff is rude, you can not get service and the management does not care. Will never go back to this one. Will continue to visit all other cheese cake locations. I would advise the cheese cake factory to take a real look at the one in philly and re higher all new staff and management to brig it up to the cheese cake factory standards.", "rating": 1, "date": "12/21/2015"}, {"text": "I&amp;#39;m not a huge fan of chains like this, but I&amp;#39;ve had meals at other locations where the food is good. Overly processed, enormous portions, yes. But that&amp;#39;s what the place is about. You know that going in. The food here was not good. Even in that generic, Cheesecake factory way. Overly salty steak tasting like it was just drowned in soy sauce. Some eggroll dish I shared with the friend I went with also was not good. Drinks were not good. Waitress was sweet. Silverware was dirty. Fairly empty considering. I think they&amp;#39;ve got some kinks to work out if they want to deliver up that chain experience other locations produce.", "rating": 2, "date": "12/10/2015"}, {"text": "I have been to CCF in King of Prussia and now to the new Center City location.  Besides the impressive space and decor, I honestly can&amp;#39;t see what people get so excited about.  The cheesecake is just &amp;#34;OK.&amp;#34;  I ordered the classic with fresh strawberries.  I really didn&amp;#39;t see much difference between it and any frozen brand you can get from the grocery store.", "rating": 2, "date": "7/20/2015"}, {"text": "We went there for lunch today and left in 45 min without ever getting any food.  Drinks came fast and they were good, but food was all other story. My salmon never came because I was told it was over cooked.  My husband&amp;#39;s beef medallions came well done instead of medium rare.  They brought his food down without bringing anything to me.   My husband sent his meat back and when a manager came to apologize we decided to leave. Philly is the city full of great restaurants and we will never be foolish enough to go back to The Cheesecake Factory..", "rating": 1, "date": "8/13/2015"}, {"text": "I visited the Philadelphia Cheesecake Factory 12/15/2016 for a work holiday lunch at opening time.  We were a group of ten.  The meals arrived to the table sporadically.  I ordered the famous factory meatloaf and my order was the last to arrive.  When it arrived, and I began to eat, the entire meal was lukewarm so I sent my food back.  When it finally returned approximately 15 minutes later, I received the same plate of food and it appeared as if someone in the kitchen had taken a fork and chopped up all my food on the plate.  In addition, the reheated meal was not too much warmer than the first time it arrived at the table.  Since it took so long, I thought the delay was because they were preparing a new meal. The meatloaf was mealy, mushy, and watery tasting, as if they used water to steam the plate while reheating it.  The mashed potatoes and gravy was all mixed up and half the vegetables were missing from the plate.  I always order the meatloaf and enjoy it every time, but this time it was horrific.  The waitress apologized, explained that the meatloaf is premade the day before.  Which leads me to believe my food was never heated.  The waitress sent the manager over and he asked if I wanted to &amp;#34;give it another try.&amp;#34; I told him to forget it.  By this time the rest of the party was finishing their meals. As a manager, you would think he would have asked if I wanted to order something else.  I turned down his offer to &amp;#34;try it again.&amp;#34; and wound up ordering cheesecake to go.  He removed the meal from the bill.  Such a disgrace and horrible experience.  So much for a holiday lunch...", "rating": 1, "date": "12/15/2016"}, {"text": "This was one of the worst restaurant experiences I have ever dealt with. From beginning to end the service could not have been any worse. When we walked into the door the hostess did not seem to want to be bothered with any of the customers. I had asked for a table to seat 13 people and was told the wait would be about an hour. After about 35 minutes of waiting, my party and I noticed that the hostess had walked out of the restaurant. A customer had asked us if we were waiting to be seated and we replied &amp;#34;yes,&amp;#34; he then informed us that the restaurant had been struggling that night and that he waited over 30 minutes for a to go order. We were then seated after about an hour and a half wait, but when we arrived at our table there were only 11 seats and even those were crammed together. We asked management if we could have another table added to the two that were already pushed together and the staff made it seem as though it was too difficult of a task to be done, so we began to move the tables ourselves until finally one of the employees saw and politely moved them for us. The hostess we had, who never mentioned her name throughout the entire meal, had the worst customer service I have ever seen. She asked if we would like drinks but only took drink orders for 5 of the guests. When asked about one of the drinks on the menu, the waitress seemed clueless. After we finished our appetizers, our meals began to come out, but our waitress did not take any of our finished dishes from the table in order to make room. After our meals, our waitress did not even ask if we would like to have any left overs wrapped to go or if we would like dessert, even after two guests ordered cheesecake. Throughout the entire dinner, my party, as well as myself, did not have a good time and we all agreed that we will not be attending this location ever again.", "rating": 1, "date": "10/17/2015"}, {"text": "The décor in the restaurant was great but the service and the food were horrible.  I tried this location twice and each time has been worst. I tried to attribute the first visit to the location just opening and the staff was new but the second time was worst.  My husband order an appetizer, the wings and they were dry and overcooked.  We ordered our entrees, Miso Salmon and I ordered a burger.  The Miso salmon was dry and didn&amp;#39;t have all the ingredients such as the miso that he was used to, when he tried to explain this to the waitress she had no idea what the dish should look like and never brought over the manager.  My burger which I thought was a safe selection was either left over from the day before and was served on the dinner rolls that they serve when you arrive.  We have always visited the Cheesecake Factory in the King of Prussia mall and never experience this service or horrible food.  If in center city stick to the local restaurants or bars but don&amp;#39;t try this place.  I&amp;#39;m just glad we didn&amp;#39;t get food poisoning. :-(", "rating": 1, "date": "1/15/2016"}, {"text": "i love cheesecake factory--food&amp;#39;s not gourmet but the ambiance is fun so it makes up for it. i&amp;#39;ve been to at least 10 different locations in various states and this one is by far the worst of them all. nothing ruins an experience more than poor service. horrible service. <br&gt;we were seated pretty quickly on a Saturday afternoon, but no one came to our table for the next 10-15 minutes--not even to give us water. when they came to take our drink order, it took another 10-15 minutes for them to bring it to us--the place wasn&amp;#39;t packed and there were servers all over the place and ours was nowhere to be found. a different server came over to bring a beer and then our actual server finally came with my iced tea and 1 water even though there were 2 of us. we were sure to order the app and entree at the same time since it was apparent it would take awhile. the appetizer came at a normal speed--after taking 2 bites,  a completely different server came with the entree--great timing and communication. as were finishing up the meal--i&amp;#39;m still taking bites from the plate,the server came back and asked if we were done...ok, i guess so. we then ordered a cheesecake to-go--she came back with the check and 15 minutes later the cheesecake came from yet another server. how many people does it take to serve 2 people? And how long? I know it just opened, but it was really disappointing to say the least.", "rating": 2, "date": "8/6/2015"}]}