{"address": ["350 Christiana Mall", "Newark, DE 19702"], "monthly_reviews": {"2019": [[0, 2.0], [1, 2.0], [2, 3.0], [3, 3.5], [4, 3.5], [5, 3.0], [6, 3.0], [7, 3.5], [8, 3.5], [9, 4.0], [10, 4.0], [11, 4.0]], "2017": [[0, 4.0], [1, 4.0], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.5], [7, 4.0], [8, 4.0], [9, 4.0], [10, 3.5], [11, 3.5]], "2020": [[0, 4.0], [1, 3.5], [2, 3.0], [3, 2.5], [4, 2.5], [5, 2.5], [6, 2.5], [7, 2.5], [8, 3.0], [9, 3.0], [10, 3.0], [11, 3.5]], "2018": [[0, 3.5], [1, 3.5], [2, 2.5], [3, 2.5], [4, 2.5], [5, 2.5], [6, 3.5], [7, 3.5], [8, 4.5], [9, 4.0], [10, 4.0], [11, 3.5]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "I&amp;#39;ve been to this Cheesecake Factory before and have never had a bad experience but tonight&amp;#39;s was exceptionally great. Our servers name was Chad C. and he was wonderful. My husband had the carne asada steak, my son had the mini corn dogs and I had the tuna poke. All of the food was really good.  The poke bowl was huge, the corn dogs were obviously made in house and not bought frozen and the steak was a healthy portion size. I love the bread here as well and the fact that they give two different kinds. My husband and I each ordered a slice of cheesecake, he got the chocolate hazelnut and I got the salted caramel and they&amp;#39;re both amazing. We will, of course, return. And hopefully that will be soon.", "rating": 5, "date": "7/24/2019"}, {"text": "We ordered online to pickup curb side. There was a time to pick up our order and we got there 5 minutes before the designated time but we NEVER RECEIVED A TEXT THAT OUR FOOD WAS READY. We called the restaurant to no avail. So we had no choice but to flag one of the employees down. He could not find our order. A few minutes later he came out with our cold food. I sent the food back,  less than five minutes later, the Luke warm fries were brought to us. A few minutes later the burgers came to us. The meal tasted like reheated burgers and fries! They threw in a slice of cheesecake to shut me up. I don&amp;#39;t recommend this restaurant! They have really gone down in quality and service.", "rating": 1, "date": "6/12/2020"}, {"text": "Meal was absolutely amazing, they had our seating worked out perfectly with our big group, great service. Never disappointed when dining here", "rating": 5, "date": "9/1/2020"}, {"text": "It&amp;#39;s what you&amp;#39;d expect from a CF.  <br&gt;Excellent customer service.<br&gt;Love all the low cal options they offer.<br&gt;It would be nice if for the kids grilled cheese they used better cheese. Pretty sure they use artificial kraft cheese.", "rating": 4, "date": "7/18/2018"}, {"text": "The key to CF is to go when they are not busy and not overwhelmed with patrons. We arrived around 7pm and were seated within 5 mins. Our server Gary was exceptionally nice. We ordered sodas and a pineapple mojito which was delicious. The egg roll sampler was pretty good (some were a bit soggy inside) 7/10. For entrees we ordered a cheeseburger (well done) and steak burrito. Both of the meals were presented nicely but the serving of meat was of normal cheesecake factory proportions. Again our server was very nice and apologized a few times for delays. Food delivery wait time was appropriate. <br&gt;Finally, the cheesecake. Am I going crazy or again have the portion sizes for the cheesecakes dramatically decreased? We ordered the bday cake batter cheesecake and reese peanut butter choc cake cheesecake both 8/10.", "rating": 3, "date": "7/11/2019"}, {"text": "This is my first time at this location, had a very bad experience.<br&gt;Firstly we reserved in advance and was taken to table 25, the one at the last.<br&gt;The table wasn&amp;#39;t clean, straws and fork fallen below the table and the seats were not cleaned.<br&gt;Bought to their notice , they did clean but found a lot of flies and something was biting my legs down the table.<br&gt;Beware of the seats they give you!!", "rating": 1, "date": "8/2/2020"}, {"text": "I called to make a reservation and they want me to do their jobs and book it online. Maybe I should just serve myself and cut out the middleman too. What a joke! The chain food isn&amp;#39;t that good, famous from what? A show? Meh.", "rating": 2, "date": "8/15/2020"}, {"text": "Usually love it here, but so disappointed today. Specifically asked waiter for wheat bread only(as usual-never an issue) and he brings us the usual. We only eat wheat and push the basket to edge of table and he says nothing. But, we were pretty neglected. Ordered the Monte Cristo sandwich, which put politely, tasted like . Both my daughter and I hated it. It took so long to get our food we didn&amp;#39;t even bother to complain. It came out coated in &amp;#34;crispy corn flakes&amp;#34;. I hate corn flakes and wouldn&amp;#39;t have ordered had I known. I commented that it wasn&amp;#39;t on the menu. The waiter agreed and brushed me off. My daughter felt like hers didn&amp;#39;t have bacon on it. I had to reassemble mine(see pretty pic) so the eggs etc were actually between the slices of French toast. I&amp;#39;m going to have to have a serious come to Jesus before coming back here. I still feel sick to my stomach 4 hours later.", "rating": 2, "date": "2/2/2020"}, {"text": "Went for lunch today and was seated with Sam B . She is the best server I&amp;#39;ve ever had!!! Service was efficient and she was helpful and made good recommendations. Also, the burger I got was cooked perfectly and my sisters pasta was great too. Definitely coming back to sit in her section again!!", "rating": 5, "date": "7/30/2020"}, {"text": "I love going to this place mostly because of the cheesecakes.<br&gt;<br&gt;My personal favorites are chocolate tuxedo and chocolate tuxedo but trust me every single cheesecake is just super delicious and amazing.<br&gt;<br&gt;Also in appetizers their stuffed mushroom and fried Mac and cheese is a must try.", "rating": 3, "date": "3/2/2019"}, {"text": "This place is a chain but you always get solid food, go home full, and have lunch for the next day", "rating": 5, "date": "3/3/2019"}, {"text": "I love this place soo many options and the food is always delicious. <br&gt;This location is convenient since it&amp;#39;s located at the mall. The service is great! And their happy hour is reasonable !", "rating": 5, "date": "11/30/2019"}, {"text": "I went for Sunday brunch and sadly, the only thing that was good was my mimosa. My omelet and potatoes were very bland with no flavor. Bacon was supposed to be in my omelet but somehow it was left out. I mentioned it to our waitress and she apologized. No comp or any offer to make it right. We had to ask for salt and pepper. We were served rye toast with no butter or jelly so we had to request that too. I&amp;#39;ve gone for dinner and I wasn&amp;#39;t impressed. This was my final visit to The Cheesecake Factory.", "rating": 1, "date": "10/11/2020"}, {"text": "I have been to the Cheesecake Factory a billion times;  their menu has such a wide variety of food.  Ironically I have never had a steak from here so I ordered the filet with mushrooms and green beans.  All were super delicious.  I had a strawberry martini which was pretty strong - the way I like my drinks.  I opted to try the low card cheesecake for desert and it was yummy too!  The staff was friendly and we only had to wait about five minutes for a table.", "rating": 5, "date": "3/11/2019"}, {"text": "My mom and I decided to go here instead of the food court for lunch during our shopping day. We both wished we just ended up going on the food court. We were sat outside at a table that was dirty, had gum stuck to the menu that was helping the table stay sturdy (still didn&amp;#39;t help) and we opted to move... twice to find a somewhat decent table. Our waiter was not helpful or friendly. My food came out about 7 minutes before my moms did, and another waiter nicely came over to see if everything was okay cause he noticed how long we were waiting. Once my moms meal came, it was very noticeable that the had spilled the soup all in my moms sandwich as you can see in the picture. He also messed up the order and gave her southwestern chicken even though she ordered turkey. We didn&amp;#39;t say anything just to finish up because we were hungry. I did order the prosciutto and arugula flatbread with salad which was a nicely priced for lunch.", "rating": 1, "date": "8/12/2019"}, {"text": "I&amp;#39;ve dined at this location several times over the last five years and I have noticed a sharp decline in customer service in the last two years, particularly at the wait staff level. This I can only attribute to this restaurant&amp;#39;s managers and obvious insufficient training and lack of supervision. <br&gt;The food was ok (3 stars) but our waiter lacked any customer service skills (1 star is being generous). It&amp;#39;s not a good sign when we have had our empty glasses for almost 30 minutes and not once he stopped by to ask if we needed anything. On top of that our meals took an inordinate amount of time to get to us. <br&gt;I can&amp;#39;t see myself patronizing this business anymore, which is sad. I used to look forward to grabbing a meal here.", "rating": 2, "date": "8/7/2019"}, {"text": "Made a reservation for 4 still asked us to wait for 75-90 minutes. Ridiculous ...... what&amp;#39;s point of the reservation if you are still being treated as walk in ......", "rating": 1, "date": "6/27/2020"}, {"text": "I have heard so much about the desirability of this restaurant as a destination eatery. Well, I was less than impressed. I will get the negative out of the way. Too dark, at least at this location. I don&amp;#39;t like stark, harsh lighting,  but I could barely read the menu. The fries were totally unremarkable. Although warm, they were tasteless and chewy. The burger was fine, the meat flavorful enough, but Red Robin is just as good...maybe better. Of course the dessert was very good, it is a cheesecake factory after all! The service was good, polite and friendly. My recommendation is to go for dessert and a beverage, that is pricey enough without the overpriced burger and lackluster fries.", "rating": 3, "date": "12/3/2019"}, {"text": "My delivery order was done on time but missing items. I filled out the survey and was delighted to hear back within a couple days from the GM, Anthony S. He offered me and apology gift card he claimed would be in my email shortly. I never received the gift card or any responses to my follow up. Haven&amp;#39;t eaten here since, and honestly I&amp;#39;m not missing anything. 2 stars for being quick to respond -3 for false promises and messed up orders.", "rating": 2, "date": "9/9/2020"}, {"text": "Great food, greater cheesecake!!! Wish I didn&amp;#39;t have to travel so far to eat here!!!!", "rating": 5, "date": "12/5/2019"}, {"text": "Came here on a date with my girlfriend and i had a great time, drinks came first, meal came in about 20 min, I mean some people are expecting fast food time meals, it does not work that way lol, we were seated in a back booth that usually seats four, which was cool because i didn&amp;#39;t want to feel like i was crammed in the two seated booth. To the food I went with the 4 cheese pasta with chicken, my girl went with some sliders and fries, also a nice liquor drink mix.. forgot what it was. The meal i had was amazing, I guess any pasta meal with tomatoe sauce and different cheeses, especially a dab of ricotta cheese is a win win. Tab was about 51$, not bad for great prepared food and good hospitality from our waitress! A1 service", "rating": 5, "date": "6/21/2018"}, {"text": "I guess it&amp;#39;s not the same Cheesecake Factory we know. bad waiters training, lack of communication with the customer, food came late and cold. For that much money we payed u get a better service at chick fil a.<br&gt;Avoid if you have a party.", "rating": 1, "date": "6/16/2019"}, {"text": "I went here for my birthday lunch with coworkers and like always, was not disappointed! I got the southwest chicken sandwich and although I made a mess while eating it because of all the yummy toppings in the sandwich not wanting to stay in the sandwich, it was delicious! It had the right amount of spicy and flavorful to make the sandwich what I expect from anything called &amp;#34;southwest&amp;#34;. <br&gt;<br&gt;I did order a side of macaroni and cheese however and although it was good when it was hot, I wouldn&amp;#39;t recommend ordering that side unless you plan to eat it all super fast. It wasn&amp;#39;t as cheesy when it was colder after sitting there for a little while. Regardless, I will always keep going back to the Cheesecake Factory!!", "rating": 4, "date": "10/6/2018"}, {"text": "The server gave us our bread. I took a bite &amp;amp; found out there was hair cooked into the bread. Then order the roadside sliders and again found hair in the food.", "rating": 2, "date": "2/2/2020"}, {"text": "The cheesecake factory is by far a favorite for me and my daughter and family when they are in town. The cleanliness is always top notch and the service is definitely great each and every visit. The food of course is amazing from the Italian portion of the menu all the way to the breakfast. Personal favorite are the buffalo wings for sure, they are great and always hit the spot when I crave something spicy. The location is great especially after eating a great meal. Enjoying the mall and shopping within very close range is always a plus and a great way to walk off a full stomach. Overall it&amp;#39;s a great place and ownership definitely keeps it running smoothly.", "rating": 5, "date": "1/21/2020"}, {"text": "Went yesterday to celebrate our 12  wedding anniversary very busy but we got a table right away. Loved the atmosphere family friendly lots of people there. Had fried Mac and Cheese Balls very good  . Along with Burgers my wife and son ordered and I got Chicken Piccota everything was excellent .But of course main event was Cheesecake my wife got original  , my son got chocolate chip cheesecake and I got pineapple upside down cheesecake. So good  all of them . Our server was excellent  asked if we needed anything refilled water and was overall A 1 . Definitely be back soon", "rating": 5, "date": "8/18/2019"}, {"text": "Quick staff, quick seating, extremely busy.. was a bit quick to wrap up my food when I made a trip to the restroom but otherwise the Farfalle with garlic sauce was excellent.<br&gt;<br&gt;Massive servings. Definitely get the smaller portions. I&amp;#39;m a tall guy and I got full pretty quick on it. Very heavy.<br&gt;<br&gt;Would go again, huge menu, good atmosphere", "rating": 4, "date": "4/27/2019"}, {"text": "I&amp;#39;m giving this Cheesecake Factory three stars simply because our food was delicious. However, service needs to be addressed. First off, while waiting for our food, we hear the manager yell at an employee in front of everyone. This is just poor management. Issues with employees need to be addressed in private. <br&gt;Kimberly P. was our server and just sucked as a waitress. First off, my husband sat down while I was in the restroom. When I came out of the restroom, Kimberly saw me sit down and open up the menu, as she was facing our table near the register. I hadn&amp;#39;t even had literally 1 minute to look at the menu, when she asked if we were ready to order. I looked up at her, and told her that I hadn&amp;#39;t had a chance to look at the menu yet. Afterwards, I decided what I wanted and closed my menu. She walked past our table multiple times making eye contact with me, but not stopping to ask if we were ready to order yet. I felt like she was punishing me for not ordering when she asked me initially. Then my husband and I both ordered the Gluten free farfalle. The menu doesn&amp;#39;t tell you that you get rotini noodles with all of their GF pasta dishes, so I found that out when my food was brought to the table and was a bit disappointed. She brought me my GF pasta but brought my husband regular pasta. Although I am the only one with Celiac disease, my husband often orders GF for support. We said nothing about it and he ate it. Generally we wouldn&amp;#39;t blame the waitress for this error, but rather the cook. However, that is how she rang the order in. Still yet, no harm no foul. Her incompetence as a waitress came in mainly when she brought the check. She decided to drop it off after we finished our meal. She hadn&amp;#39;t asked us if we wanted dessert, but we requested it. While waiting for our dessert, she attempted to take our check twice. My husband had not yet put his credit card up. So on the second attempt, he reached into his pocket and pulled out his credit card so that she could run the card; she was obviously in a hurry. Dessert came and while we were still eating, she tried to take the signature ticket. My husband put his hand on it and said, &amp;#34;That part&amp;#39;s not done yet&amp;#34;. I mean, dropping the check off early is fine. But trying to pick up the signature page while we&amp;#39;re still eating is bad taste. All she wanted to do was see what her tip was going to be. There was no other reason to come after the ticket booklet at that point. Our credit card was already ran, so the food had been paid for long before we even got dessert. Needless to say, she ruined any chance of a tip at that point. Point in case being, the employees here need to work on their service skills.", "rating": 3, "date": "2/9/2019"}, {"text": "This place is the only place we get Cheesecake. Literally travel from California to come here. The staff is lovely &amp;amp; knowledgeable. Also, if you like Apple-crisp, you HAVE to try theirs", "rating": 5, "date": "12/12/2019"}, {"text": "Just ordered my food through door dash. Ordered the Chicken Carbonara from the Cheesecake Factory in the Christiana Mall. My food taste like pasta water no flavor, very disappointing a waste of $22.50.", "rating": 1, "date": "4/12/2020"}, {"text": "My husband and I went to the Cheesecake Factory yesterday for his birthday. It was very busy but I was able to walk around the mall and got back in time to quickly be seated. The tables for 2 were sitting maybe 5 inches away from each other on a booth. I did not like that. Not much privacy. Our waiter James was awesome very funny friendly and I can tell he enjoys his job. They went above and beyond. By the way the food tasted great, the scenery was beautiful and the service was fast. I will definitely be going back on a later date", "rating": 4, "date": "3/23/2019"}, {"text": "The Cheesecake Factory was my granddaughter&amp;#39;s choice of celebration on her 22nd birthday last weekend.  We invited 13 guests to attend.  Very early that day, we called for reservations at 6:30pm, and were told &amp;#34;You may not make a reservation until AFTER 5:30pm for dinner.  That&amp;#39;s our policy.&amp;#34;   Well, okay then, we waited until after 5:30pm, then called back.  The representative said, &amp;#34;You should have made a reservation BEFORE 5:30  .... unless you have more than 7 guests.&amp;#34;   I said, &amp;#34;Great, I have 13 guests.&amp;#34;   To which she responded, &amp;#34;OK, then you need to physically appear at the restaurant with at least half of those 13 guests to be seated.&amp;#34;   Makes no sense, but we wanted to please our granddaughter.  So, we proceeded to the Cheesecake Factory.  When we arrived, there were less than 7 guests there at 6:00pm, and the host wouldn&amp;#39;t seat anyone.  We waited at the bar from 6:00 to 6:30pm, at which point all the guests had arrived.  Surprise .... NO AVAILABLE SEATS!   The host told us the wait would be 90 minutes.   <br&gt;<br&gt;All 13 guests filed out the door, never to return.  <br&gt;<br&gt;We went to Brio, a better class of restaurant where they actually HAVE a sane, logical, and coherent plan of reserving seats, and had a fantastic dinner.   <br&gt;<br&gt;You are safe in the assumption that NOT ONE of those 13 guests will ever return to a Cheesecake Factory in their lifetime, and hopefully spread the word to all their families, extended families, friends, and perfect strangers, about the fiasco experienced at the local Newark, DE (Christiana Mall) restaurant.  <br&gt;<br&gt;My advice?  Stay away.", "rating": 1, "date": "11/17/2019"}, {"text": "It was a pretty good area! I went with my boyfriend and we were tryna find a restaurant was late, but wasn&amp;#39;t closing anytime soon so we just decided to cheesecake factory. I&amp;#39;ve been to MANY cheesecake factory in my life &amp;amp; I try to be spontaneous with trying different type of entree&amp;#39;s every time I went. It was actually not as bad than I use to have it. I had the bacon bacon burger and it was super yummy. My boyfriend had the steak along side with mash potato and string beans. The steak was cook perfectly and my burger was absolutely stunning. It wasn&amp;#39;t as busy than I thought. It was a 10 min wait for 2 people. The only thing that tick us off a bit was the food coming a little later than we thought, but luckily for us we weren&amp;#39;t as starving and the bread they serve us help us kept our energy up! Will be back for more sometime soon with this location!", "rating": 4, "date": "10/7/2019"}, {"text": "Big assisted Karen birthday today so we are eating at CF.<br&gt;So everything is delicious so far and very happy with the first app. Sweet corn cake tomales!!! Home run yessss maam!", "rating": 4, "date": "11/13/2017"}, {"text": "The good:  Was quoted a wait time that was accurate. The cheesecake was delicious. The entrees were very good. <br&gt;<br&gt;The not so good:  Took 8 minutes to be greeted by a server. He ended up just not being a very good server over the course of the meal. Very inattentive and not personable. <br&gt;<br&gt;The bad:  No manager visit to check in guests. I assume that this isn&amp;#39;t a priority for the company. But it would have addressed my issues and would have been appreciated. I had ordered a side dish that I was not happy with. I told my server I didn&amp;#39;t enjoy it. His response should have been &amp;#34;I am sorry to hear you didn&amp;#39;t enjoy that item, could I get you something else you may enjoy more?&amp;#34;  Instead, I got &amp;#34; Why don&amp;#39;t you like it?  Well that&amp;#39;s how we make it.&amp;#34;  The server did bring my the new side item I had asked for. My dinner date thought his response was odd also. My suggestion to all servers/staff. No matter how small of a problem. Always get a manager involved. It&amp;#39;s their job. For the managers in duty 11/3, I know it&amp;#39;s not always easy, but touching tables and meeting your guests is just as important if not more so than anything else going on within the restaurant", "rating": 1, "date": "1/12/2019"}, {"text": "Another one of my fav chains, Cheesecake Factory at the Christiana Mall is always a hit with me and my dining companions. The space itself is a sprawling oasis and I like the variety of seating options. I don&amp;#39;t know how to explain it except to say there are a lot of cozy nooks and crannies in there. Great for dates.<br&gt;<br&gt;There are however some spots I don&amp;#39;t care to be seated at. Specifically the back wall booths directly behind the servers station. First of all its noisy and the traffic is insane from all the back and forth.<br&gt;<br&gt;What also draws me to the Factory are the diverse menu options.  There&amp;#39;s something for everyone. The brunch menu is pretty good. The huevos ranchers are a little different from what I&amp;#39;m used to but was tasty nonetheless. The waffles are fluffy and while they don&amp;#39;t have a traditional chicken and waffles dish my creative friend simply ordered chicken tenders to go with. The mini crab balls delicious. Not as dense as a crab cake but lighter almost like a fritter if you will. And last for me the pasta with the crispy Parmesan crusted chicken on top is always soul satisfying.", "rating": 4, "date": "9/25/2016"}, {"text": "Had a peach Bellini and it was mixed perfectly. Corn tamale cakes are to die for. Plenty of leftovers. Not sure what they put in their food that makes me full every time but that&amp;#39;s pretty consistent throughout all cheesecake factories. The menu is extensive and noticeable with how many choices u have. Came in for Sunday brunch but decided to get some other non brunch items. The calamari could&amp;#39;ve been better. Did not like the chicken in my chicken quiles( the nacho egg lookin thing ) which is part of the brunch menu. It was really hard to chew on as if it was stuck on the bottom of the pan and someone forgot to stir or mix it while cooking. You can tell if u look at the pictures that it looks hard.", "rating": 4, "date": "9/29/2017"}, {"text": "S/o to my waitress Jenna who had to deal w me crying into my salad for two hours. She was very sweet and gave me some great words of wisdom and I won&amp;#39;t forget her. The salad was good too tho", "rating": 5, "date": "10/19/2019"}, {"text": "So I have loved this restaurant since it opened here but yesterday&amp;#39;s meal was awful.   I sure hope it was a bad cooks decision to not change the fryer grease.  Because my Crispy Orange Chicken was the worst it has ever been.  Burnt horrible taste and the sauce was like water in flavor.  My favorite go to menu item.   I told my waiter and hope he passed it along.<br&gt;<br&gt;Please feel free to contact me at <a href=\"mailto:Kzdzfd@msn.com\"&gt;Kzdzfd@msn.com</a&gt; and I would be glad to leave you my phone and talk with anyone that is interested in understanding what went wrong.   Believe me it was my favorite meal there and hope it returns back to the item I loved", "rating": 1, "date": "9/11/2019"}, {"text": "Every time we go the food just gets better and better the food here is just like GRAND LUXE should have know that they are family<br&gt;The impossible burger is EXCELLENT the Mac and cheese balls are great the buffalo blast is awesome with extras blue cheese the vanilla bean cheese cake with strawberry on side was just what I need for my sweet tooth", "rating": 5, "date": "8/20/2019"}, {"text": "Great for masochists. My first impression was when a hostess ran into my sister who was sitting down. Accidents happen but what irritated me was the lack of manners. She was completely unapologetic. I was stunned at first but quickly turned into laughter when the hostess turned around to shoot daggers at her.  As if to insinuate, she (the hostess) was entitled to some apology from my sister (the customer). We should have left then, instead we chased our losses. After waiting an hour for a table, we thought maybe the food will be worth it. It wasn&amp;#39;t. I ordered the bacon burger and my sister ordered the bbq burger. The waitress asked how we would like them cooked. We both said well done. Our burgers came out to us about 45mins later. I was starving at this point and couldn&amp;#39;t wait to dig in. I sinked my teeth into a large mouth watering bite. I almost puked. It was like sucking on pennies. The meat was raw. The burger was literally dripping out of my hands and onto the plate. My sister cut her burger in half. Same deal, raw meat. We wanted to leave. Of course we wouldn&amp;#39;t see the waitress again for a another 20mins. When she swung by to ask how everything was, we told her the burgers are not cooked. What she said next compelled me to write this review. I don&amp;#39;t write reviews often. Usually it&amp;#39;s only when I receive exceptional service. However, her response to &amp;#34;the burgers are not cooked&amp;#34; was so astonishing, it deserved to be documented. As she leaned over the table to gaze at the pink goo dripping out the bun, she said &amp;#34;Yea, I see. So do you want to take them home?&amp;#34;. WTF?! For what, as pets? We emphatically said no can we please have the check. She disappeared for a moment then returns to ask us if we&amp;#39;re staying for dessert. It would have been funny if we didn&amp;#39;t just waste 2 hours and were still very hungry. We said no, we just want to leave. She then gives my sister a half hearted sob story about how hard her day has been. We always tip well because they have to eat too (well cooked food probably), so we didn&amp;#39;t need the grifter act. What should have been no surprise to us by now, (but was) is that she couldn&amp;#39;t even deliver a well crafted BS sob story. It was as equally underprepared as the burgers.", "rating": 1, "date": "3/8/2020"}, {"text": "Came here for my boyfriend&amp;#39;s 21st birthday and we ordered drinks and didn&amp;#39;t get our food until an hour later so our drinks were warm by then. they claimed they burned our food and I understand it was busy but at least offer a discount. I will never return, especially because the food was bland and not worth the wait.", "rating": 1, "date": "2/15/2020"}, {"text": "Out for a family meal.  Good food with decent service.  Didn&amp;#39;t have to wait for a table.  We always enjoy the desserts too!  Only negative was the booth seat was uncomfortable.", "rating": 4, "date": "8/11/2019"}, {"text": "I love this menu so much. So much to choose from and everything I&amp;#39;ve had is super tasty. The portions are huge which justifies the prices but the quality isn&amp;#39;t always amazing. Their bread is sooo good and free. The service is always just okay because on any given night it&amp;#39;s packed. You&amp;#39;re probably gonna wait even on a week night. All in all, one of my favorites in Newark and surprisingly good for a chain.", "rating": 4, "date": "8/7/2018"}, {"text": "What a complete disappointment. First time I came here, it was great. Food was great, service was fast and friendly. So, I came back, and it was not as good. Food took longer, not as well prepared and server acted like Mr.Magoo...  I figured, maybe it was an off day. Tried a third time. Same deal, and it was 20 minutes to get a table, 30 minutes to get served. And floor under my table so slippery I felt like Tara Lapinski at the Olympics. So now, at the mall with the misses. She wants to try again. Well, rolled the dice and we got &amp;#34;snake eyes&amp;#34;. Now waiting over 30 minutes for our food, noisy seat by a cold window table and waitress came back 3 times to very my order. (I got two eggs and ham...) Hope they aren&amp;#39;t green. <br&gt;Sorry, this is the last time here. AMF!!!", "rating": 1, "date": "1/25/2019"}, {"text": "All I can say is what a disappointment... this place is NOT worth the money.. check came around to 70$ for 2 people .. The free bread they give you was Stale and hard, I couldn&amp;#39;t  bite into it. Also the butter was cold not even room temperature it was not spreadable.<br&gt;We got the egg roll sampler and most of them were ok. We ordered the Jamaican chicken and shrimp with rice and beans .. they forgot the plantains on my plate and only gave me about 4 shrimp .. the sauce was bland Not spicy at all , the rice was hard and unseasoned as were the beans , very bland . Could not finish my 20$ plate it was not good.. My partner got the steak and salmon... Steak was immensely tiny and rubbery with an old tasting piece of also tiny salmon.. THEN came the Dulce de leche cheesecake... also NOT good.when ever I ate a piece the layers would separate  in my mouth like a cheap Tasty Cake cupcake .. I will Not be coming back here .. GO ACROSS the street to BAHAMA BREEZE way better", "rating": 1, "date": "4/22/2018"}, {"text": "I don&amp;#39;t ear at Cheesecake Factory&amp;#39;s often, but the food is always enjoyably consistent and generous of portion. What&amp;#39;s prompted me to write a review today was our great fortune in having Anam A. as our server. Aside from being genuinely friendly and welcoming, she was extremely knowledgeable about everything on the menu, and was consistently attentive despite it being a very busy Sunday evening. Our drinks were always full, our food arrived like clockwork, and her service elevated our dining experience; we&amp;#39;ll definitely request her on our next visit, which&amp;#39;s probably be all the sooner for having had such a pleasant visit!", "rating": 5, "date": "4/14/2019"}, {"text": "Food is always above average. Cheesecake is awesome - small for the price but awesome. Serving sizes (other than cheesecake) are average. Food taste is well above average.  Bit pricey for me but not outrageous.  Not cheap enough to order delivery like a Seasons, Pats or Chinese food.", "rating": 4, "date": "8/18/2019"}, {"text": "My fiance and I stop in here a few times a year.  It&amp;#39;s our closest Cheesecake Factory, about an hour from where we live.  I&amp;#39;ve been to several locations and this one lives up to the standard.  Great service and everything on the meal is delicious.  What more could you as for?", "rating": 5, "date": "7/2/2018"}, {"text": "Food was delicious as usual. Servings are always large and more than enough for my hungry clan. My server (Shanea) was the best. There were 7 of us and she was very attentive to all our needs while handling her other tables also. If you visit this location ask for Shanea&amp;#39;s area you will not be disappointed.", "rating": 5, "date": "5/5/2019"}, {"text": "The Cheesecake Factory has become too expensive. Almost 15 dollars for a lunchtime vegeburger and a small side salad. We didn&amp;#39;t get the bread until the rest of our food came and the butter was a frozen lump I had to hack at to put a little on my bread. There isn&amp;#39;t much lighting in there, and it was quite a gloomy day, so it was depressingly dark. I guess that was to hide the fact that my salad was sadly wilted and in the throes of decomposition.  This used to be my favorite place to eat during a visit to the mall. It is in a slow and steady decline.", "rating": 2, "date": "1/4/2020"}, {"text": "I don&amp;#39;t give 5 very often, but for my first ever visit to Cheesecake Factory I was impressed. They work to appeal to everyone and they are successful. I found something on every menu appealing. <br&gt;<br&gt;I started with a dirty martini-per usual-and it was right-sized because I LoAThhh a tiny martini this day and age. <br&gt;<br&gt;{Aside [restaurants with tiny martini and wine glasses, if you are reading this, SMARTEN UP! I will choose another restaurant for that reason alone if I&amp;#39;m in the mood for a drink] End aside}<br&gt;<br&gt;Then I moved on to crab bites while I read the massive menu! I can&amp;#39;t tell you about it all, but there is literally something for everyone-clean, vegetarian, pescatarian, Mediterranean, omnivore, paleo it&amp;#39;s all there! <br&gt;<br&gt;For the entree I elected one of their new specials. I&amp;#39;ve always been a chicken parm lover and their chicken parm pizza is like an upside down chix parm! BIG round traditional chicken parm (when it arrived I thought oh crap! It&amp;#39;s literally a pizza, but it&amp;#39;s not) topped with a angel hair pasta with a lemon herb cream sauce. Very tasty. What really got me was the size. I&amp;#39;m on leftovers. So 2 dinners later and I still have lunch tomorrow. And I&amp;#39;m an eater!<br&gt;<br&gt;And then cheesecake of course. I had the raspberry with lemon cheesecake -wow! Next time the tiramisu cheesecake. I will be back. And I&amp;#39;m NOT a chain lover. No wonder it&amp;#39;s such a large chain. They really do it right.", "rating": 5, "date": "6/14/2017"}, {"text": "Service was very slow. The cheese cake came before the food. <br&gt;The fries were awful, Old, not freshly made. <br&gt;The crab bites were very good. <br&gt;<br&gt;The cheesecake was ok. Large portions and I can only speak to the Tiramisu cheesecake and it was just ok. Potions were large, so was the price. <br&gt;I expected better since the line is usually out the door", "rating": 3, "date": "4/19/2019"}, {"text": "I come here all the time and they never disappoint.<br&gt;<br&gt;This time around I came with my family after the mall closed. During peak hours this place can have a hefty wait. On this particular occasion our waiter wasn&amp;#39;t that engaging. Still, he got the job done. The service varies depending on who you get but I&amp;#39;ve never had anyone who was flat out rude. Management always accommodates if you have an issue.<br&gt;<br&gt;The menu is extensive so there is always something new to try. The desserts are great and the cheesecake is rich. I like the original cheesecake with a &amp;#34;Big Ol&amp;#34; strawberry on top! As well as the apple crumble.<br&gt;<br&gt; Love, love, love. It looks fancier but is still affordable and the portions are more than enough.", "rating": 4, "date": "12/13/2016"}, {"text": "I&amp;#39;ve been several cheesecake factories in different cities and this one is of my favorite!! I got the chicken carbonara with parmesan cheese. ABSOLUTELY DELICIOUS! I mean I was super hungry but it was amazing. It was a huge portion so I had to pack up half and bring it home with me for lunch the next day. I also got a fresh strawberry cheesecake..AMAZING!! My friend got the smores cheesecake...OMG TO DIE FOR. SO GOOD!!!! I recommend either but if you love chocolate, get the Smores!<br&gt;<br&gt;Service is great! There might be a line on weekdays so you can either sit at the bar or wait.", "rating": 5, "date": "1/16/2015"}, {"text": "Waiter was missing and barely checked on us. I&amp;#39;ll never go here again. Waited for along time for bread. Had to get bread from another waiter. Everyone was frustrated with the slow service. It wasn&amp;#39;t that busy. Had to repeat drink order multiple times. Manager needed to be on the floor observing.", "rating": 1, "date": "5/27/2019"}, {"text": "I had Evelyn&amp;#39;s special pasta and it was ok, dry in taste but the ambiance of the place is amazing ! Service is awesome.<br&gt;This place has some amazing vibe. If you are looking for a noisy yet quite place to hang out with some good food, this is the one of the best places to go.", "rating": 4, "date": "9/19/2017"}, {"text": "I went to lunch here today with my daughter and granddaughter. The kids meal of spaghetti and meatballs was very generous but salty. We got the artichoke crab dip which was delicious and the Impossible Burger ( veggie hamburger) also quite good. The main reason I come to the Cheesecake Factory is for the cheesecake. I took my slice to go and I was very disappointed when I got home and saw how small the slice was. I remember in the past the cheesecake filled the container. The piece I got today was half that size and (needless to say )the price has gone up.", "rating": 3, "date": "3/16/2019"}, {"text": "I was really looking forward to this lunch. My fiance and I went out yesterday (Sunday) as a late Valentine&amp;#39;s Day celebration and celebrating our first wedding venue shopping. I always get the same dish and I was super excited (even waited 45 minutes), but my dish was SO SALTY at this location. I&amp;#39;ve never had this issue at the Cherry Hill, Philadelphia, or King of Prussia locations. Typically, I would tell the server how I felt about my meal, but they were so busy, and I did not feel comfortable sending back my food to the kitchen. I even tried my fiance&amp;#39;s pasta dish and even that was so salty too! I could not even eat more than 5 bites of my dish because it was THAT salty. I got the Farfalle with Chicken and Roasted Garlic and the sauce wasn&amp;#39;t even the correct one. It almost tasted like a Marsala-type sauce instead of the roasted garlic parmesan sauce it was supposed to come with. you can see in the picture that the consistency of the sauce is no where near from what it should be. In addition, it was missing the caramelized onions. Luckily, we got appetizers which were good - cheeseburger spring rolls and Caesar salad.  Most likely will not return to this location.", "rating": 2, "date": "2/18/2019"}, {"text": "Food was good. Service was good. Our waitress was very friendly. Wait times weren&amp;#39;t bad if you go during lunch time otherwise it&amp;#39;s always packed around dinner time", "rating": 5, "date": "9/14/2019"}, {"text": "You want to go out to eat but don&amp;#39;t know what you want? Go to the Cheesecake Factory!! They have everything!   Seriously....my dad and I were at the mall for the Apple Store and we both wanted different things and this is the perfect place to eat.  We got a nice table outside on the patio, which either has a view of the mall entrance or parking lot but honestly you can do some nice people watching.   My dad got an eggplant dish which was delicious.  I got the southern fried catfish which left something to be desired but the sides of mashed potatoes were amazing.  We also split spinach dip, which was really tasty.  I took home a piece of the salted caramel cheesecake which I ate over the next two days.   You really can&amp;#39;t go wrong here.", "rating": 4, "date": "10/3/2017"}, {"text": "I had the filet mignon steak and it was grilled to perfection and perfectly cooked to med-rare. Our server Cait was awesome and took good care of our table.", "rating": 5, "date": "9/25/2018"}, {"text": "I like the chain, but the customer service at this one is absolutely terrible!! I&amp;#39;ve had several occasions of bad service there but I keep going back periodically hoping that they step their game up. I want to like this location but I just end up disappointed and annoyed..", "rating": 1, "date": "3/2/2019"}, {"text": "Met up w/family from out of town here for dinner. Food is always good... only complaints are:   A - the menu is almost too diverse. Pages and pages long... I can barely decide with a normal menu<br&gt;B - floor is always super slippery in the Christiana Mall CF. Not sure how the poor wait staff and especially patrons in heels do not fall and kill themselves. They should have definitely gone with a non-slip surface instead of the really polished tile. (Although I would never condone this myself, if anyone is looking for a good slip-n-fall place for a fast bunch of lawsuit bucks, this would def be a good option!)<br&gt;<br&gt;Our appetizers included the mac-n-cheese balls (yummy comfort food in true form) and fried calamari (most tender calamari I&amp;#39;ve ever had is always at CF.) Followed by a variety of dinners, which were all very good. And wrapped up with several different kinds of cheesecakes. (My favorite is always the banana creme... so light, fluffy and refreshing after a full meal), but you can almost never go wrong with any of their flavors.<br&gt;<br&gt;Our waitstaff was friendly and efficient, and gave us several little gift cards at the end that are good for a free cheesecake with every $30 purchase (customer appreciation) good through 10/3.", "rating": 3, "date": "8/18/2017"}, {"text": "Came here with my family last night. Couldn&amp;#39;t post this because they have really bad service depending on which area you&amp;#39;re seated in. One suggestion would be that they offer their guest wifi. <br&gt;<br&gt;I don&amp;#39;t really like &amp;#34;chain restaurants&amp;#34; but this is one that is always great! The food menu is so extensive it offers so much to appease all appetites. The drinks (alcoholic) are also plentiful. I had the classic strawberry Margarita. It was okay. Not strong at all. Very light. <br&gt;<br&gt;As my entrée I had the Baja Chicken Tacos, which never disappoint. It does say spicy chicken. To a person that enjoys spicy food, it&amp;#39;s not that spicy to me. But if you prefer things that isn&amp;#39;t spicy, choose another menu item. <br&gt;<br&gt;All in all the experience was great. Look forward to the next dining experience.", "rating": 4, "date": "1/17/2016"}, {"text": "Came here tonight for my brother birthday dinner and they never disappoint. Good food, great service and amazing cheesecake .<br&gt;<br&gt;To drink I had the &amp;#34;modern old fashioned&amp;#34; which was quite tasty, well crafted with a decent strength. I ordered the Jamaican pepper shrimp entree with white rice, black beans and plantains- amazing! It is a little on the spicy side though so if you don&amp;#39;t enjoy your mouth a little tingly you might want to try something else. <br&gt;<br&gt;The waitress was very attentive and timely which helped us have a smooth evening.", "rating": 5, "date": "1/16/2016"}, {"text": "Love the CF. Never a bad meal or bad service. They are always consistent. Servers are well trained and attentive. Food is fabulous. Our go to place.", "rating": 5, "date": "9/3/2019"}, {"text": "It was my first visit to a Cheesecake Factory. The wait time for my nephew and I was about 15 minutes, which really isn&amp;#39;t bad at all. It was very busy in there, so I honestly thought it would&amp;#39;ve been longer. Our waitress was nice, but often times disappeared for times, but again, it was really busy, so that was fine. I was told by a family friend that the portions weren&amp;#39;t huge, but when my plate came out, it was HUGE. I had no idea how I&amp;#39;d finish it, haha. The food was SO good. I got the Parmesan crusted chicken with mashed potatoes and green beans. My nephew got an omelette that came with toast and home fries. Again, huuuuge plate for him too. Of course, you can&amp;#39;t go to the Cheesecake Factory and not have cheesecake. We took ours to go. I&amp;#39;m now just eating mine (Godiva chocolate cheesecake) and am in love. If you&amp;#39;re a chocolate lover, I highly recommend it. <br&gt;<br&gt;The only &amp;#34;downfall&amp;#34; were the prices, but I definitely didn&amp;#39;t think it would be on the cheaper side. For my nephew and I, our meal totaled about $60 + tip: for<br&gt;<br&gt;2 entrees, two Shirley temples, two slices of cheesecake, and Mac and cheese (had to try it, heard it was a must) <br&gt;<br&gt;I would definitely come here again!", "rating": 5, "date": "12/28/2017"}, {"text": "I&amp;#39;ve been waiting for a long time to come down here to dine and I must say, it wasn&amp;#39;t exactly what I thought it&amp;#39;d be. <br&gt;<br&gt;First, the wait to be seated was estimated to be 50 minutes, but it actually was more like 20! That was awesome. Our waiter was not bad. He made sure to check up on us and was readily available. Also, he would repeat our every order he in exact detail back to us for approval. Perfect. <br&gt;<br&gt;I ordered the Jamaican Black Pepper Chicken and Shrimp entree with a glass of red wine. The rice that came with the meal was unfortunately overcompensate and a little crunchy. The sauce on the chicken and shrimp was spicy and extremely flavorful however!<br&gt;<br&gt;Finally, you cannot go to the Cheesecake Factory and not get some Cheesecake. I ordered the key lime cheesecake a la mode.  This was literally heaven on a plate. It was so delicious that I had to slow down eating it to truly enjoy the perfect proportion of whipped cream, ice cream and the cheesecake on my spoon. Absolutely superb and I recommend that to finish off your meal. <br&gt;<br&gt;All in all, I rated it a 3 because my meal was fairly lackluster given the entrée. My overall experience was so-so, but I would still recommend it, ESPECIALLY the Cheesecake !", "rating": 3, "date": "3/4/2017"}, {"text": "Everyone knows the Cheesecake Factory has great food and a good variety. That being said- they just got rid of the best food on the menu- the Crab Wontons!!! I am so disappointed as this was my favorite dish, as well as my friends and families. We will definitely miss it!   <br&gt;Also, compared to other Cheesecake factories I have been to (King of Prussia, Cherry Hill, Baltimore) this one unfortunately lacks more in good service/ food quality.  It also tends to have a long wait, I&amp;#39;d def recommend a reservation in advance!", "rating": 3, "date": "11/28/2017"}, {"text": "Oh this is one of our favorite places in a great location at Christiana Mall.<br&gt;Good is always good..", "rating": 4, "date": "6/23/2016"}, {"text": "Don&amp;#39;t overthink cheesecake, sometimes decadence isn&amp;#39;t attractive or tasty, I loved the regular Oreo cheesecake tried the new one and found myself pulling it apart, sometimes you just want really good rich Oreo cheesecake.", "rating": 3, "date": "1/19/2019"}, {"text": "We were excited to dine for lunch at the Cheesecake, we loved the one in Chestnut hill, ma. <br&gt;Today was not good, slow service, and two issues with kids meals. <br&gt;The spaghetti with meatball was not great, they were out of meatballs so they offered to mAke a meat sauce- bad idea. The meat was undercooked and sitting on the pasta, our son would not eat it. <br&gt;Our daughter found in her food a sprig of ??? We pointed it out to the server and she dismissed it- we will not be back. <br&gt;Too bad, they were ounce good-but they have lost their edge.", "rating": 2, "date": "12/1/2015"}, {"text": "We arrived hungry after dress shopping for an upcoming wedding, we were told a 30 min wait, fine, I work in the industry, occasionally it has to happen. 40 mins later, our buzzer goes off, we are seated (7) with baby at a booth that doesn&amp;#39;t quite fit us at all. As we already started feeding the baby, they try to have us go back outside to wait an additional 15 mins. They ended up having a table ready for us in about five, after us refusing to get up until the baby was finished eating. <br&gt;The server treated up politely, noticed we were celebrating a special occasion, she was busy, but attentive. A few of us ordered steaks that were paired with shrimp scampi, one was highly over cooked, the other was very under.. we all got them cooked the same way. We brought the attention to the server. They did nothing, a manager never even stopped by to check on us. We ordered out cheesecakes to go because of our disappointment, and even my cake had a hair in between the whip cream and slice! I don&amp;#39;t think anyone in our party will be returning.", "rating": 1, "date": "7/16/2019"}, {"text": "One of the worst customer service experiences I have had in a long time. From a manager no less. First off, we have been to Cheesecake Factory around the country, including Hawaii.  We have even been to this one a number of times. The food has always been really good and the staff very nice.  Not this time!  I think it might be time for a change in management!<br&gt;<br&gt;We have to drive two hours to meet our daughter at college and take her to dinner for her birthday.  This is her last year, so we wanted to invite her friends that she may not see a lot more to come along. 9 people total. She called the restaurant two days ahead of time BECAUSE THAT&amp;#39;S WHAT THE WEBSITE SAYS TO DO and after a lengthy wait for the manager was told she needed to call back the next day.  She called again the next day and after another 20 minutes wait for the manager, she was told that they don&amp;#39;t take reservations, that some body needed to come check in ahead of time, and maybe they could fit her in within a few hours.  He was extremely rude on the phone.  The website says pretty much the earlier the better for dinner so we got there at about 6. We told them we had 9 people and again, wait for a manager. Are you kidding me!  Same manager as on the phone took our number and said maybe we can fit you in in about 3 hours. Then he just walked away. No &amp;#34;we&amp;#39;ll call you&amp;#34; or anything. We were left wondering if &amp;#34;maybe&amp;#34; meant &amp;#34;we don&amp;#39;t want your business so leave&amp;#34; or &amp;#34;we are gonna try&amp;#34;. By his attitude, I would guess the former. I looked around and noticed that they were not that busy for a Cheesecake Factory and they were sitting small tables within 10-15 minutes.  In my mind, that told me that they really didn&amp;#39;t want my business. On the flip side, wasn&amp;#39;t I bringing them three small tables at once, appetizers, drinks, and meals, while tying up less wait staff?  Anyway, after about 10 minutes of wondering whether we were going to be considered at all, we left. We ended up going to JB Dawson&amp;#39;s around the corner, were seated in under 15 minutes, had some delicious food, and friendly staff.  The Cheesecake Factory called me 3 hours later for my table.  No kidding!!!<br&gt;<br&gt;I think the Cheesecake Factory, and this manager especially, need to reconsider the way they/he treat customers and people in general. I know it was a Friday evening but we had just driven two hours, we tried to do everything right, and he was still rude.  And on my daughter&amp;#39;s birthday, no less!", "rating": 1, "date": "3/17/2018"}, {"text": "Second time going a few days ago on December 5th. The first time my wife and I left because of the really long wait time. This time around there was no wait other then 3 host that felt it was more important to finish their conversation then to greet and seat. That was my only problem this visit. I love the decor. The prices are fair. Server was nice but tried to upsell us to more expensive entrees. Love the calm atmosphere. Staff was overall friendly.", "rating": 4, "date": "12/7/2018"}, {"text": "Love coming to the Cheesecake Factory even though their menu is so big I have trouble deciding what to get as everything always sounds amazing. This was my first time at this location and I have no complaints. Service was great we didn&amp;#39;t wait long to order or get our food. Started with avocado egg rolls that were just ok they weren&amp;#39;t bad just not super crispy and I didn&amp;#39;t like the dipping sauce. I also got the beet and goat cheese salad which I almost always get at any Cheesecake Factory&amp;#39;s I go too as it&amp;#39;s one of my favorite salads. It&amp;#39;s very refreshing and I love the dressing. My husband got the orange chicken and the chicken was super tender and the breading on the chicken was very crunchy. I got the lunch Madeira chicken pasta and that was very good with great flavor. And of course we couldn&amp;#39;t leave without getting a cheesecake. This time we got a key lime cheesecake and the celebration cheesecake and both were delicious.", "rating": 4, "date": "3/9/2018"}, {"text": "Fantastic service. Great food. Excellent drinks. Fabulous cheesecake. The best server we&amp;#39;ve had in a long time. Overall an extremely pleasant experience.", "rating": 5, "date": "9/30/2018"}, {"text": "Visited with Steph and Alex on a Sunday night.  I ordered the Georgia Peach which is  my favorite drink ,and we skipped appetizers so we could make it to dessert. I had the Bang Bang Chicken and Shrimp which is a spicy thai dish with curry, peanut, chile and coconut, with sautéed Vegetables and served over steamed white rice. It was so good and covered in toasted coconut, with large pieces of shrimp and chicken.  I could not eat it all, because I had to get the Mango Key Lime Cheesecake. They all sound good but this one is my absolute favorite!! It is like being in cheesecake heaven.", "rating": 5, "date": "2/2/2015"}, {"text": "Out of the blue me and my family decided to eat dinner here, my husband knew the waiting time will be long but we didn&amp;#39;t mind it. So went in line and waited for 20 minutes to be seated in our table. I had pasta carbonara and I&amp;#39;ll rate it 3.5/5, my husband had shrimp with noodles (not really sure what&amp;#39;s the name on the menu) but he loved it though the serving wasn&amp;#39;t that much but he was satisfied and dad had cheese burger which he said it was okay and the cookies and cream cheese cake was a bomb! Plus we had the great service by our server, he was really awesome!!!!!  Would love to be back!", "rating": 4, "date": "9/3/2018"}, {"text": "My wife and I have been to this Cheesecake Factory several times and maybe one or two others out of state. The Cheesecake Factory&amp;#39;s menus are huge. 20 pages or something outrageous like that, but in a good way. They have so many options to choose from that you will always find something to eat. Some of their fried foods like the fried shrimp and fish &amp;amp; chips are rather greasy when served. It would be nice of the chain could find a way to overcome that.<br&gt;<br&gt;The booths are a nice size and comfortable, but the tables are small an too close together. You can always easily listen on the conversation next to you. Not fond of that. The ceilings are high and the voices of everyone talking reverberate everywhere, making the noise level loud.<br&gt;<br&gt;I&amp;#39;ve never had a bad experience with the restaurant or their staff. I&amp;#39;m sure I&amp;#39;ll be back to the Cheesecake Factory in the future.", "rating": 3, "date": "11/10/2016"}, {"text": "Food was just OK but bartender Zach was excellent!!!  He is great with his customers and has great conversation....", "rating": 4, "date": "3/2/2017"}, {"text": "This is the closest Cheesecake Factory to where I live. The service was superb, and the food was excellent. Always love our experiences there, and can&amp;#39;t wait to go back!", "rating": 5, "date": "7/9/2018"}, {"text": "Bang bang chicken and shrimp is the bomb. You can&amp;#39;t go wrong with dessert every cheesecake I&amp;#39;ve ever had was delicious. I would say the drink menu is lacking, I wasn&amp;#39;t impressed.", "rating": 4, "date": "8/13/2016"}, {"text": "There are some people who get on their high, hipster horses about chain restaurants -- blah blah blah something about authenticity blah blah blah...Who cares if the food tastes good? And, generally speaking, the food at the Cheesecake Factory, while likely considered predictable and uninspired by the clichéd foodies of the world, does indeed taste pretty good. <br&gt;<br&gt;The wait times, however, can be a legitimate buzzkill as CF doesn&amp;#39;t offer call ahead or reserved seating.  The waiting area is essentially nonexistent and has horrible flow.  Also, the Christiana Mall location does get pretty slammed, which is a common feature  among most other CF locations. If you get there before 4 pm on a high volume day, the wait time should be pretty bearable.<br&gt;<br&gt;The food quality is not too shabby; the overwhelming menu offers something for just about everybody except for Anthony Bourdain wannabes, and who wants to break bread with blowhards like that anyway? I enjoy the grilled steak tacos, guacamole, and dynamite shrimp. My boyfriend tears up the dynamite shrimp and is somewhat fond of the bang bang chicken and shrimp. For dessert, the chocolate tower truffle cake is a necessity. Seriously, the fate of collective human happiness rests upon this slab of chocolatey goodness.<br&gt;<br&gt;Whenever we visit, we receive pretty decent service. Hopefully that won&amp;#39;t change any time soon. If you&amp;#39;re looking for a relaxed, casual atmosphere that is small on snobbery and big on selection, then you ought to try this place out!", "rating": 4, "date": "1/2/2016"}, {"text": "The lemon raspberry cake and lemon cheese cakes where the surprise of the visit! I usually don&amp;#39;t like them but we ordered a few options to share, and they were amazing! The chocolate did not disappoint! The food was delicious as well!", "rating": 5, "date": "5/28/2017"}, {"text": "Have been to cheesecake factory in 2 other states. This one was a little dull compared to them when it comes to entrees. But, cheesecakes are great. I usually like to grab a piece of cake to go.", "rating": 3, "date": "7/26/2017"}, {"text": "Cheesecake Factory is my favorite restaurant to go to for special occasions. The truffle butter chicken, mashed potatoes and asparagus is delicious, I get it every time. The cheesecake and cocktails are TO DIE FOR. It&amp;#39;s a bit pricey, hence why I don&amp;#39;t go often. But absolutely worth it for such a delicious meal in a unique atmosphere!", "rating": 5, "date": "2/24/2019"}, {"text": "Never and i mean never order the new york strip.  Thin and expensive.  For the price they should be embarrassed to serve it.  Service was great and somehow the chef was able to cook this pper thin steak perfectly to medium.  Just not sure how they are selling this thing for $21.95!!!  Nothing on the menu  as far as the weight of the steak either.  Last tome wasting my money here.", "rating": 1, "date": "2/20/2019"}, {"text": "Dined here this afternoon and ordered the seared ahi tuna that I get all the time. Couldn&amp;#39;t get past the first bite without feeling sick. The tuna was sour and when I told the waitress she said the manager cooked himself a piece and said it tastes fine. Still didn&amp;#39;t change the fact that my dish was inedible. Again, I have had this dish from their establishment before and it didn&amp;#39;t taste like this before. Not only did I not eat any of my meal that the waitress took from our table, but I had to pay the full $21 for it with no substitution or compensation. She did not check on us to see if our food was okay until the person i was with completely finished their meal, while my plate sat there barely touched the whole time. When she finally did come by all she asked was if we were ready for the check. We were one of three tables in sight.", "rating": 1, "date": "1/28/2019"}, {"text": "For 18.50 i got a bowl of rubber like pasta, 2 pieces of shrimp that were undercooked and few pieces of sausage. My server was one of the few working so he was all over the place, and my friends stake tacos were super small like little kids sized, her rice was flavorless and the beans were undercooked. The deserts were the only thing i didn&amp;#39;t have to force my self to eat. We drove 2 hours total to get there and back from dover, for one of the worst overpriced meals we&amp;#39;ve ever had. Never again.", "rating": 1, "date": "1/28/2018"}, {"text": "I confess - I&amp;#39;m a huge fan. Say what you will, I don&amp;#39;t care. <br&gt;<br&gt;Cheesecake Factory&amp;#39;s, like many chains, are very similar in all of their locations. Christiana is no different, except perhaps a little bit smaller than others. I&amp;#39;ve been about three or four times now, and every server has been very good and very patient. I feel like the food at Cheesecake is so consistent. I really can&amp;#39;t remember ever having anything bad at any location. I&amp;#39;ve always gone for lunch, and it has never been more than half full and so we are seated right away. There is also an ample amount of outside tables, but it&amp;#39;s right next to the entrance to a busy food court in the mall. <br&gt;<br&gt;Highly recommend this place, very solid option for lunch or dinner. Like I said, you can pick almost anything that sounds good for you, and it will be delicious. I tend to go for their pastas and sandwiches. Most recently I&amp;#39;ve had their cuban sandwich. It&amp;#39;s their version on the traditional, but very tasty. Historically I haven&amp;#39;t been a fan of sweet potato fries, but theirs were awesome! Perfectly crispily cooked. I&amp;#39;m also not big on dessert, but their red velvet cheesecake is the only thing that changes my mind. I think the only downside to this location is the parking. The lot is fairly shallow right by their entrance, and so you often have to park far away. Once you consider the portion sizes of their meals though, you&amp;#39;ll want to park far away to walk it off!", "rating": 4, "date": "7/9/2013"}, {"text": "Like many restaurants with large menus, the food can often be subpar, this was my experience at TCF. (The Cheesecake Factory is well known for their large menus that change all the time). I found our entrees and mixed drinks were hit or miss. My father ordered the tropical tiki punch, which came with an awful acrid citrus taste and smell relatively similar to toilet cleaner. Our server was polite and had no problem changing his drink. Next our appetizers came out, no complaints there. When our meals came out only one of the 5 of us enjoyed our meals. My meal was the chicken parm &amp;#39;pizza style&amp;#39; which I immediately regretted ordering after my first bite. The pasta&amp;#39;s sauce was mediocre and the breaded chicken that it topped was to greasy and not as crispy as I&amp;#39;d have wished. My sister ordered a burger that was cooked over an &amp;#39;open flame&amp;#39;. When she got it, it was practically a hockey puck. There were parts that were so burn it was inedible. After this, we explained to the waiter our problems with our food. He offered a free cheesecake and took the meals off. Needless to say, The Cheesecake Factory seems to be only good for the actual cheesecake.", "rating": 2, "date": "11/4/2018"}, {"text": "Definitely a regular here. The food is always good and flavors are consistent. My only complaint would be the wait... You have to wait long to be seated, and long for your food. Honestly, when you go to a good restaurant, this is expected. If possible, make reservations if you don&amp;#39;t want to wait. I think they only do reservations during weekdays. Call ahead to be sure. Also, good parking is hard to get! The beginning of the parking lot is always filled. You can park over by target or anywhere you see a spot if you don&amp;#39;t mind the walk. This location is at the mall, so it&amp;#39;s always busy.", "rating": 4, "date": "5/21/2016"}, {"text": "It was my husband&amp;#39;s first time there.<br&gt;He Was very impressed with the atmosphere and the food.<br&gt;We Were able to eat outside on the patio. <br&gt;Which Made a very nice evening.", "rating": 4, "date": "10/6/2013"}, {"text": "Never tried this place Be for but I&amp;#39;m so glad I did....they are very nice and the food is amazing and music is great.....you have to come here", "rating": 5, "date": "3/3/2017"}, {"text": "I had to wait an hour for a table at 6:30 pm on a Thursday night. It is good, but I don&amp;#39;t think it is wait for an hour kind of good.  The buzzers do work in the food court while you are waiting.", "rating": 3, "date": "1/6/2018"}, {"text": "One of my favorite restaurants in Delaware and the only Cheesecake Factory restaurant location that is consistent (compared to all the other locations I&amp;#39;ve been to). I&amp;#39;ve never been disappointed at this Cheesecake Factory...the food is always good and we usually get outstanding service. I usually get Sheila&amp;#39;s chicken and avocado salad or the farfalle with chicken pasta dish or sometimes even the bistro shrimp pasta...all really yummy! I even recommend the miso salmon, but ask them to cook it lightly...just so that the fish is flaky when you get it and not hard as a rock. Trust me, this request is do-able...my parents do this all the time and don&amp;#39;t have any issues. And as for dessert, I like a lot of their cheesecakes and their cakes...you just have to go with what you&amp;#39;re craving. Some of my faves include: tiramisu cheesecake, mango key lime cheesecake, red velvet cheesecake, key lime cheesecake, lemon meringue cheesecake, carrot cake...the list goes on and on. <br&gt;<br&gt;Overall, love this place and will eat here for as long as I&amp;#39;m in Delaware.", "rating": 5, "date": "8/1/2017"}, {"text": "Ate at the bar to elude the ridiculous double-line queue of hungry patrons. Our wait: 3-4 minutes because we sharked out the bar area.<br&gt;<br&gt;Expected and reliable fare for the brunch hour. Pineapple mojito was quite tasty!<br&gt;Some rocket salad with shaved cheese, some pear, blue cheese flatbread, a chicken avocado grilled club, and we foiled our own plans: absolutely no room for any cheesecake.<br&gt;<br&gt;Kinda defeated the purpose for coming. Among 3-4 other CF that O have patronized, this one in DE is a bit smaller (Pdx, Sacto, SF). Ever popular and swarming...can access the restaurant from the exterior. 90 degrees away from the Brio/CPK/Lawson side.", "rating": 3, "date": "2/25/2013"}, {"text": "This restaurant is the BOMB! I went here with my parents and my brother about 5 weeks ago and it was delicious. This being my second time, I knew what to expect. I got the Pasta Carbonara and for dessert, the Lemon Raspberry Creme Cheesecake. Iverall, a nice place to take the kids, the portions are huge, so come with an appetite!", "rating": 5, "date": "11/27/2015"}, {"text": "Great, friendly service and great food. Much better than other Cheesecake Factory allocations that I&amp;#39;ve been to", "rating": 5, "date": "7/15/2018"}, {"text": "I eat here all the time and have always enjoyed the experience, but that changed on Monday  May 27. It wasn&amp;#39;t a crowded day due to the holiday and my family and I were seated right away. (There were 3 of us) We sat for 15 minutes before anyone approached the table and asked what we wanted to drink. Since we waited so long, I ordered our drinks, a few appetizers, and our entrees to get it out of the way. After about 25-30 minutes the waitress brings the entrees. When I mention that we did not receive our appetizers her response was &amp;#34;oh, do you still want them?&amp;#34; She then proceeds to say that the appetizers were rung in with the entrees and that they were ready, but were sitting in the window. She brought them out to us and they looked old, hard, and very un-fresh. I asked to speak to a manager at this point named Anthony. Although he took the appetizers off the menu, he was very nonchalant regarding the issues and didn&amp;#39;t care at all about the level of service we received. I&amp;#39;m considering not returning. The staff was HORRIBLE but after meeting the manager, I see why.", "rating": 1, "date": "5/29/2019"}, {"text": "Ordered the chicken and biscuits and I got chicken and 2 rock solid biscuits that weren&amp;#39;t even close to edible. <br&gt;<br&gt;Told the waitress and she took them from me and offered to bring some more. <br&gt;<br&gt;Manager came over 3 minutes later to apologize about the fact that I wasn&amp;#39;t served any biscuits with my chicken and biscuits entree saying that they would be out of the oven &amp;#34;in 5 minutes&amp;#34; stated that they had some from yesterday but I did NOT want to eat those. I let him know that I was in fact served those biscuits. He apologized, said fresh ones would be out in a few minutes and offered free desert.<br&gt;<br&gt;20 minutes later the waitress brings the biscuits out to me in a to go container because she said they realized I was probably ready to just take them with me. <br&gt;<br&gt;Wow.", "rating": 3, "date": "11/11/2015"}, {"text": "Went for happy hour from 4-6pm yesterday. Appetizers and drinks on the happy hour menu are $5 and small plates range in price from $4-7. Our table ordered mojitos, cosmopolitans, skinny girl martinis, fried Mac &amp;amp; cheese balls, burgers, buffalo chicken blast, artichoke heart, bread &amp;amp; butter is complimentary, and I think there was something else for happy hour, but don&amp;#39;t remember. Burgers were received well. Buffalo blast was mediocre, it&amp;#39;s not chicken wings, apparently the chicken it shredded and mixed with batter or put inside a wonton wrap and then fried, so there isn&amp;#39;t much chicken. Table favorite hands down was the macaroni and cheese balls with marinara sauce. Everyone at the table likes artichoke and we were all sorely disappointed when it came out; it looked old roasted and dry, and was equally bland and very chewy. We sent it back to the kitchen. <br&gt;<br&gt;Drinks. Mojito had lots of mint and was delicious, so we ended up ordering a second. Skinny girl martini, didn&amp;#39;t try it, but the person who ordered did not mention anything about it, but decided to order a second, so I&amp;#39;m assuming it was also good. Cosmo, the person who ordered this liked it, but it was a bit of a fiasco. The drink came with the customary salt around the edges which was not requested, it was sent back, they then poured it from the salted glass to another glass hence taking some of the salt with it, which was again returned and remade in a new glass. That item was also order a second time.<br&gt;<br&gt;Desserts, unfortunately are not a part of the happy hour menu at all. So the slices are pretty much $8/9 each, which is fairly ridiculous. I know most of them are specialties, but still a lot per slice. One friend ordered the lime/lemon meringue cheesecake, which was almost gone before we left. She loved it. I ordered Chris&amp;#39;s outrageous cheesecake which was equally delicious and took half home with me, and our other friend had the strawberry cheese, which she said was good as well. <br&gt;<br&gt;We all would definitely return for happy hour, the happy hour menu is both impressive and extensive, unlike other restaurants that just have 3-5 choices, is tasty, and service is friendly. Even though we returned items to the kitchen, there wasn&amp;#39;t any backlash. Our server remained professional and courteous, even if she was thinking something else. Lol", "rating": 3, "date": "2/20/2015"}, {"text": "The estimated wait to be seated was 20-25 min and ended up being more like 50. Other than that the food and service were excellent. The space in the front of the restaurant could be used to better advantage since it is always so crowded. There is very limited seating and there are always crowds of people blocking the entrance during peak times. A redesign with more seats for people waiting might help it not feel so u comfortable and chaotic.", "rating": 3, "date": "5/14/2017"}, {"text": "I have always enjoyed the food at the Cheesecake Factory - most recently the Greek salad has become a favorite with the Teriyaki Chicken and the Pepperoni Pizza. Of course I love the desserts! <br&gt;<br&gt;This has been a great addition to Christiana Mall and has ample seating although it isn&amp;#39;t the largest Cheesecake Factory. <br&gt;<br&gt;The reason a 3.5 star establishment gets 1 star is the absurd corporate policy of sending out kids menu food on plates to hot to the touch. Why they cannot simply plate on regular plates is beyond me. Every time we are there with our kids, we have to send their orders back to be re-plated. As long as this continues to be corporate policy at the Cheesecake Factory, I will give everyone I eat at 1 star reviews despite the level of the service.", "rating": 1, "date": "8/26/2014"}, {"text": "Prompt service<br&gt;We ordered shrimp scampi, shrimp linguine and turkey burger<br&gt;Everything was delicious and service was pleasant", "rating": 4, "date": "1/4/2013"}, {"text": "Went to this location on a Sunday afternoon I must say it was busy! We were told a 45min wait but got sat in about 20min. Not bad! Our server was very nice and friendly although after 10min in to our meal she was asking if we&amp;#39;d like boxes, we felt rushed. The food was good. We ended up taking most of it to go just to eat in peace. The place wasn&amp;#39;t too clean our glasses were dirty and the floor under our table was disgusting! (I only saw the floor because our 6 month old baby dropped her toys under it) oh lord there was so much dirt stuck to them that after we left we decided to set them on fire to heat up our left overs. Only go there if you are very hungry.", "rating": 3, "date": "3/26/2017"}, {"text": "Three pieces of chicken nuggets. A splash of garlic and olive oil with a handful of sun dried tomatoes and veggies. Thats the 18 dollar version of  Cheesecake Factories Garlic noodles. As much as i hate to have to write this review because your avocado egg rolls and cheesecakes are out of this world. This meal was highly disappointing.", "rating": 2, "date": "2/11/2017"}, {"text": "I&amp;#39;ve been to this location a few times, the food is good, however some options aren&amp;#39;t so great, definitely ask for a recommendation from the servers, they are very knowledgeable and give good suggestions, the cheesecake is amazing a good spot for lunch too and not as expensive, the only downfall is they are very busy most of the time hopefully they will expand this location", "rating": 4, "date": "5/6/2017"}, {"text": "Was very disappointed tonight . We&amp;#39;ve been here many times and have gotten great food but tonight was just horrible. It took 15 min standing at the door before we were greeted by a hostess and seated. When we received our food it was terrible!!! The appetizer Caesar salad was great but everything else was down hill . I had requested the chicken res with a extra side of mashed potatoes and everything was ice cold and the chicken and onion was awful. The mashed potatoes had a rotten fish taste so I couldn&amp;#39;t eat them and had to send them back . Overall I used to love this place but I feel like every time I come back it&amp;#39;s just keeps getting worse . Every time we come back we hope it makes a turn around and is as good as it was when they opened but sadly that&amp;#39;s not the case . Normally when we come to dine our bill is always 70+ for only 2 to 3 people and with the quality of the food now it&amp;#39;s just not worth it . I just hope you guys can really step up your game.", "rating": 2, "date": "3/17/2019"}, {"text": "Let me start with this: I am 30 years old. <br&gt;I went into this restaurant yesterday to use the gift card I received for Christmas. <br&gt;<br&gt;I ordered a glass of Chardonnay (because even if they switch it up and bring you the house, chances are it will be decent). <br&gt;<br&gt;I handed my ID to the waitress and she looked at it and informed me that it had expired (a week before-- on my 30th birthday)...... <br&gt;<br&gt;The waitress proceeded to shrink down to the floor and tell me that she was unable to serve me because the ID was expired. She told me that she could get into a lot of trouble. <br&gt;<br&gt;I am not sure what the link is between her getting into &amp;#34;a lot of trouble&amp;#34; and my ID being expired...?<br&gt;<br&gt;I am not underage, and I was not driving a car, so how exactly could she get into &amp;#34;trouble&amp;#34; ????? <br&gt;<br&gt;I could see if I had no ID at all, but it clearly stated my DOB being WELL OVER the legal drinking age. <br&gt;<br&gt;I got through Philly airport a few days before &amp;amp; that&amp;#39;s where it was pointed out that the ID had expired, ON MY 30TH BIRTHDAY!!!! <br&gt;<br&gt;I guess I can get through homeland security, but the Cheesecake factory had none of it!", "rating": 1, "date": "1/15/2014"}, {"text": "It&amp;#39;s no secret that the Cheesecake Factor has done the near impossible, mastered pretty much everything they make. I&amp;#39;ve never had a bad meal here, I won&amp;#39;t say everything is always perfect, but I&amp;#39;ve had no complaints. This one stays pretty busy and getting parking is near impossible (it&amp;#39;s at a mall!) but the food is good. And there are so many options everyone can find something.", "rating": 4, "date": "4/18/2017"}, {"text": "Here last week, sit down really quick. Enjoy the atmosphere, and order the food. The food here taste better than the Cheese Cake Factory in Abington and many places. The food is satisfying. The taste is perfect for me that day! Hopefully, people shop around Christiana Mall can stop by and try this place!!", "rating": 5, "date": "11/7/2016"}, {"text": "They were out of the lasagna when I went on Sunday. Also, our waiter never gave us bread. He was very strange, while I was picking out what cheesecake I wanted he stood there waiting for me to decide. Cheesecake took 17 minutes to come. Also, the tables for 2 are way too close to each other.", "rating": 2, "date": "3/27/2018"}, {"text": "The food is good very good. Steak tacos were excellent! Finished off dinner with Key Lime Pie Cheesecake, also excellent.", "rating": 4, "date": "12/21/2017"}, {"text": "Celebrated my daughters birthday here last evening. Waitress was great but drinks sucked. I do not mind oaying $12.00 for a vodka martini, but please put some vodka in it without the ice. Martini glass was small and only 2/3 full. Food was OK.", "rating": 3, "date": "11/2/2016"}, {"text": "Ordered carry out. Honestly expected better quality for it being a Wednesday night. The fries were cold and hard like cardboard. The veggie burger was just a rice patty. No mushrooms or other veggies that they advertise on menu. I will not be back. The prices are too high for the quality of food.", "rating": 2, "date": "7/7/2016"}, {"text": "Went for an early dinner because we did not want to wait. The food is always great, service was good and then there is the cheesecake. They have other sweet stuff if you do not like cheesecake.", "rating": 5, "date": "2/26/2017"}, {"text": "My first visit. No wait to be seated. We just went for cheese cake. I had the raspberry white chocolate it was amazing. My wife had the red velvet cheese cake, it was huge! both awesome. How does that wiped cream stand up so long, I&amp;#39;m used to it melting/falling over. It was a bit pricey 8 and 8.50 for our slices. I think it should of been 5-6. We will be back. Possibly getting a small cake for the holidays.", "rating": 4, "date": "2/25/2018"}, {"text": "We weren&amp;#39;t sure what to expect from this place when we went there...knew it was a chain but how could a place that specializes in cheesecake possibly be bad? right?<br&gt;<br&gt;There are several reason why:<br&gt;<br&gt;1.) they have a menu that is over 7 pages long! How can you do anything extremely well if you have that many damn items on the menu. From tartar to burgers? Seafood to tacos? Just to expansive for the cooks to get anything 100% spot on with cooking techniques and flavor/seasoning.<br&gt;<br&gt;2.) they have a dish there that is the most caloric pasta dish overall out of all the nation&amp;#39;s chain restaurants. Ummm...hello?!?!<br&gt;<br&gt;3.) their cheesecake, while yummy, should have a warning that each slice is a MINIMUM of 1,100 calories.<br&gt;<br&gt;4.) the service is subpar with many young kids that are more interested in flirting with one another and checking their smartphones than effectively waiting on tables.<br&gt;<br&gt;5.) Salads are overdressed to the point of being slimey and mush.<br&gt;<br&gt;I just don&amp;#39;t have the energy to go on.<br&gt;<br&gt;It is a chain restaurant that&amp;#39;s main goal is to cash in on as many customers a night as possible. Even though they are no cheap, you are still getting subpar food with half ass service.<br&gt;<br&gt;Again, please take into account that this is my humble opinion.", "rating": 2, "date": "2/13/2014"}, {"text": "Bad service racist service and super slow ... And extra the manager is 0%professional ...", "rating": 1, "date": "1/6/2016"}, {"text": "The food was really tasty. However, my boyfriend&amp;#39;s pretzel coated chicken was dry and TOO crunchy. Our server had a very poor attitude. My boyfriend would say &amp;#34;thank you&amp;#34; and she would not acknowledge him. She tossed the check book onto the table and took FOREVER to give us refills and clear off our eating space. When we asked her if she was okay she just said &amp;#34;na I&amp;#39;m good&amp;#34; while turning her back. She did not apologize or anything. If it weren&amp;#39;t for her this review would have been a four.", "rating": 3, "date": "11/9/2015"}, {"text": "Horrific experience. I&amp;#39;m allergic to cow&amp;#39;s milk. My waitress brings me my veggie burger, whose bun was coated in BUTTER. So I ask our waitress, Lori, to check if the bun itself had whey or other milk products. She comes back and says that she has a gluten-free bun that doesn&amp;#39;t contain wheat. Did I stutter? Milk and wheat are not even remotely the same thing. <br&gt;<br&gt;So I told her to scrap the burger and I got a goat cheese beer salad. Still to be determined if the pecans in the salad were candied in butter. If I go into anaphylaxis in an hour I guess I&amp;#39;ll know.", "rating": 1, "date": "11/14/2013"}, {"text": "Good cheesecake but my guest got ill after having the shepherd pie.  So maybe we will not go back again.  I hate to blame the restaurant as I did not get ill.  But I can&amp;#39;t be sure.", "rating": 4, "date": "5/10/2016"}, {"text": "Gave me a new found love of Asparagus! The burger was perfection and what seemed like garlic fries were all of that.", "rating": 4, "date": "3/30/2014"}, {"text": "If I reviewd restaurants on food only, this location would be 5 stars. However, i review the dining expirence.  First, the lighting is terrible. It was a busy night and they were on a wait, no complaints there. The lighting was so bad I could not read the menu without the help of a cell phone. Next, the service was terrific. The Cobb salad was awesome, whole avacado, chicken, bacon, veggies. The cheesecake was $8 a slice. I could buy an entire cheesecake for 8 bucks. And the restroom was dirty. Would go again.", "rating": 4, "date": "10/11/2015"}, {"text": "My parents and I went there for lunch yesterday since I was going home, I ordered the ahi tuna, mom ordered the beet and goat cheese salad and dad ordered the chicken salad sandwich with fries... I am currently writing this review from the bathroom as the phone sits on the toilet because I&amp;#39;m at the I feel like dying point so I give joy a single shit about germs... it started at about 2am last night I actually woke myself up with the worst gas I&amp;#39;ve ever had thinking it was just a lactose moment I went back to bed only to be woken up again by my intestines saying Bitch you better go make friends with the toilet... I am still sitting in the bathroom trying to decide which end to place on the royal throne and I know tmi has left the building. You say well how do you know that&amp;#39;s what it was. Well the day after Christmas this was all I ate since I had over ate the day before and my parents are currently deciding the same thing and poor people only have one bathroom so that I&amp;#39;m sure is the fight of a life of who gets to use the bathroom.. needless to say I can&amp;#39;t even think about that lunch without helping my stomach along and trying to relieve myself of everything left in my body.. I&amp;#39;d give this experience a negative 13 since that&amp;#39;s how many times I&amp;#39;ve thrown up since 3am...", "rating": 1, "date": "12/27/2018"}, {"text": "Always a great time at The Cheesecake Factory.  Not long to wait and the service and food is delicious!  Chicken Picatta is the best!", "rating": 5, "date": "11/11/2016"}, {"text": "The food is okay but they don&amp;#39;t do reservations OR call ahead seating. What the hell us up with that? I don&amp;#39;t have an hour to sit around waiting. Someone gave me a gift certificate and now I don&amp;#39;t even want to use it because they make it very difficult to use it.", "rating": 1, "date": "12/16/2017"}, {"text": "I just love it here! The food is gourmet the presentation always wows me.....<br&gt;I had a kale salad with salmon <br&gt;OMG was it delicious <br&gt;The salmon was perfectly cooked moist <br&gt;And seasoned to perfection <br&gt;The salad was beyond yummy with the perfect amount of dressing<br&gt;Always a great experience  I have never <br&gt;Had a bad meal or experience here.", "rating": 5, "date": "10/25/2016"}, {"text": "Great service here !! Kristyn was our server thank you for here . And the ambiance here is very good too . If you come to christiana mall come here ....!!", "rating": 5, "date": "9/14/2017"}, {"text": "I met a friend for lunch and we were seated promptly.  We ordered the crab artichoke dip for starters and and each a ordered salads.  I had the lunch size chicken Caesar salad and my fried had the Asian salad, both on the &amp;#34;skinneylicious&amp;#34; menu.  Both salads were quite good as was the crab dip, but it was a bit salty and didn&amp;#39;t have an abundance of crab meat.  Unfortunately, we were too full to have desert!  Definitely <br&gt; Would come back.  Also rest rooms are very clean.", "rating": 4, "date": "9/8/2016"}, {"text": "I&amp;#39;ve eaten here several times and have always had good experiences and today was even better because our server Lauren was phenomenal! She was friendly personal and even humorous with me and my husband. We asked her what her favorite dish was and she was glad to share the information while being very enthusiastic about it. She knew the menu very well also (which is extensive). She continued to refill my husbands drinks without even asking! I ordered the chicken bellagio and my husband ordered the Louisiana chicken pasta. Our chicken was cooked to perfection and we both enjoyed the flavor of them very much. The menu has numerous chicken, pasta, drink and appetizer items. Menu here also has the &amp;#34;healthier &amp;#34; choices if you desire too. The chocolate hazelnut cheesecake is my favorite so of course I ordered that for desert! Yum yum! We ordered fried mac n cheese for appetizer and we loved that as well. The atmosphere is a little loud but this restaurant is extremely busy so that is expected. Only disappointment was the wait, but again, this place is very very busy every time I come here so.... it is what it is.", "rating": 5, "date": "7/22/2017"}, {"text": "Went for dinner last night, only about a ten minute wait. Our waitress was very good brought out our sons food first and ours followed soon after. Very attentive, the food was ok, typical chain food. The cheese cake was insane! So good!!! The lighting is a little dark other than that no issues at all I would reccomend", "rating": 4, "date": "11/4/2015"}, {"text": "It is a standard Cheesecake Factory, it upholds the chain&amp;#39;s reputation and fulfills the expectations.  It is great? No.  It is acceptable and reliable? Yes.<br&gt;<br&gt;Also there is tons of parking and it is attached to major mall with tax free shopping.  If you are shopping it is a step above going to the food court.", "rating": 3, "date": "9/27/2013"}, {"text": "I&amp;#39;ve been here a few times and have had a good experience each time I have come. The food is really good. The menu is huge but I appreciate the variety. I also appreciate that Cheesecake Factory offers a &amp;#34;skinnylicious&amp;#34; menu for those being health conscious.", "rating": 4, "date": "8/6/2016"}, {"text": "As far as chains go this is probably as good as it gets.  Took my brother for dinner last night.  Service was pretty good, I had mushroom flatbread and edamame, my brother had some sort of gumbo jambalaya thing and seriously the biggest piece of chocolate cake I&amp;#39;ve ever seen.  Only lame thing was that the coffee was ice cold and I had to wait 15 minutes for hot coffee.", "rating": 4, "date": "8/24/2013"}, {"text": "Well now, look what we got here: 25 kinds of cheesecake, as well as a burger bistro menu with the usual suspects (10 types of chicken, burritos, nachos, 15 pastas, steaks,  surf n turf, personal pizza). Portions are generous, service is well-drilled, and the decor screams upmarket airport lounge. Appears popular.", "rating": 3, "date": "12/18/2014"}, {"text": "I love the atmosphere as well as the dim lights. It&amp;#39;s romantic and the food is great. I always get the Bang Bang chicken! I think its the best item on the menu.", "rating": 4, "date": "5/7/2016"}, {"text": "Dec. 2013<br&gt;Love love love!  The dishes are phenomenal!  You may have a small wait but it&amp;#39;s well worth it! The wait staff is attentive and courteous!  Menu selections are always changing making each trip unique. The atmosphere is kind to family, business, romantic or just because visits.<br&gt;Update may 2015<br&gt;Customer service has poorly declined.  My last 2 visits were horrible!  The last one resulted in emailing corporate.  Changed from 5 to 3 stars.", "rating": 3, "date": "12/2/2013"}, {"text": "I was here with my family to enjoy a good dinner on a Saturday night.  I&amp;#39;ve never been to this location before and I most certainly won&amp;#39;t be returning.  For starters, we had a crackhead waitress.  No, I&amp;#39;m serious, our waitress was a straight up crackhead, she probably was high while we were there.  She took our drink and food orders, and she never came back to our table.  She avoided us the whole time.  Some other waitress brung our food out, some other waitress gave us our drinks.  When we finally saw her long after we we finished eating, we asked for a refill. She said this direct quote &amp;#34;I&amp;#39;ll have the manager bring it to you&amp;#34;. Now I sense racism and she&amp;#39;ve been avoiding us because of the &amp;#39;black people don&amp;#39;t tip&amp;#39; stereotype.  We never got the drinks by the way.  After waiting for an additional half hour, we stopped her again while she was trying to avoid us and demanded the bill and some boxes.  We were finished for about an hour and never got any refills.  I hate this restaurant and won&amp;#39;t ever come back!  I hope that crackhead waitress they have overdose in the bathroom on whatever it is she&amp;#39;s shooting in her arm.  The table behind us was a black family too and they was having the same problem.  Sucks for her because I always tip at least 15%.  The food is good by the way.  If you don&amp;#39;t want to be racially discriminated against, don&amp;#39;t eat here.  They will judge you solely because of your race and won&amp;#39;t do their job while you have to watch them take so much care of everyone else.", "rating": 1, "date": "3/19/2015"}, {"text": "My favorite foods here are the Chicken Bellagio, Herb Crusted Salmon, Factory Chopped Salad, Factory Burrito Grande and the New England Clam Chowder. Favorite drink is red sangria. My favorite cheesecake is the peppermint bark hands down. I love the versatile menu however sometimes I think it hampers the food execution. I remember having a dish that was intensely overpowered by garlic when CF first came to the Christiana Mall-I believe it was the pasta carbonara. I prefer to get take-out or sit in a booth because the restaurant otherwise is extremely noisy &amp;amp; not very private.", "rating": 3, "date": "4/13/2013"}, {"text": "I love trying new restaurants &amp;amp; new food, but Cheese Cake Factory still is my favorite. &amp;#34;Jim&amp;#34; is the best waiter I have ever seen in my life such a loyal and friendly with everyone.. Great service.. I hope the manager take a look on my review and give him a bonus (;", "rating": 5, "date": "2/17/2015"}, {"text": "On 8/5/2017, I went to celebrate my birthday. Myself &amp;amp; friend notice there was 2 dogs inside (no they wasn&amp;#39;t for the blind). One was in the female tote on shoulder &amp;amp; her male company had other on lease. They was standing by cheesecake stand. At first, 2 of your waitress was petting &amp;amp; rubbing the dogs. Look up 2 more of your waitress came over. One young went back to clearing the table and the other young lady start taking orders. After, the finish what was needed they came to petting and rubbing dogs. Not one of these waitress washed their hands and big dog licking 2 of the waitress in the face. My friend spoke with the front hostess and she spoke with the waitress. They had a serious attitude and turning up their nose towards us. As we was walking out. A couple came in and said oh no dogs..... lets go and they left. I was very disappointed because I have eaten there before. That will be my last time going in.", "rating": 1, "date": "8/10/2017"}, {"text": "I wish I could write a negative review although the app won&amp;#39;t let me. Been at the restaurant for 2 hours. Ordered 1.5 hours ago and still don&amp;#39;t have our meal.", "rating": 1, "date": "8/5/2015"}, {"text": "Food here is alright. It&amp;#39;s not bad but it&amp;#39;s not something I would ever crave either. <br&gt;<br&gt;Slightly pricey food but I guess some people come here for the atmosphere.<br&gt;<br&gt;They got my food order wrong once but the manager came out and apologized so I don&amp;#39;t really mind. People make mistakes and I guess at least this place has the decency to recognize and apologize for it.", "rating": 3, "date": "12/2/2014"}, {"text": "Always have a great meal here. We always come early or at odd times in order to miss the rush and long wait time, I&amp;#39;d suggest coming for lunch or an early dinner. The staff is always fairly friendly and attentive considering how many tables there are to take care of they are wonderful. I usually get a sandwich they have it&amp;#39;s basically a blt with turkey and avocado (can&amp;#39;t remember the name whoops). But everything is always great. All the items on the menu are priced really well for what you get. However, my family gets caught up in the extensive menu and often spurges on trying appetizers or getting a slice of cake to take home, and that tends to be what gets the bill looking less fun.", "rating": 4, "date": "7/21/2015"}, {"text": "Good food, but lousy service. Every time I go in there the bathrooms are always dirty and there&amp;#39;s never any toilet paper. You sit down your feet stick to the floor in the restaurant. It just makes you wonder where your food is coming from. Always crowded, loud and disorganized.  Such a shame because I&amp;#39;ve heard such great things about it... Gave it my three - strike you&amp;#39;re out.", "rating": 1, "date": "12/9/2015"}, {"text": "Oh what has happened to the Cheesecake Factory?! It used to be a fun and delicious restaurant but the quality has REALY dropped off, and the Christina location is FILTHY! Management should be ashamed. Gross...", "rating": 1, "date": "7/27/2014"}, {"text": "Terrible food and terrible menu.<br&gt;<br&gt;Dessert is good though.<br&gt;<br&gt;Go to a local mom and pop restaurant instead.", "rating": 1, "date": "6/15/2015"}, {"text": "The menu does not have a variety and it&amp;#39;s pretty simple. I chose the soft tacos and they were pretty good. Nothing else on the menu looked appetizing. The space of the tables are entirely too close for my liking.", "rating": 2, "date": "10/23/2015"}, {"text": "Food is great, wait and waiting area is not! They need a better layout for the amount of traffic they have constantly. We had a hr 45 min wait. We decided to walk the mall for the first hr 30. The waiting area is ridiculous and the staff gets very rude, telling people to move and yelling. Where do expect people to wait outside in 30 below weather, and when the pager doesn&amp;#39;t work beyond 20 ft. I&amp;#39;ll probably skip this place next time not worth the wait especially when folks are getting yelled at by staff.", "rating": 2, "date": "3/19/2017"}, {"text": "When I go to Christiana mall, I usually make my way over to The Cheesecake Factory for lunch.  They have a huge selection of food there, and with me being gluten-free, they have an amazing selection of gluten-free options clearly laid out on their menu.  They even have gluten-free pasta for their pasta dishes!  My latest meal was the Carbonara Pasta with chicken and it was delicious.  I can&amp;#39;t speak for the cheesecake and other gluten options, but what I&amp;#39;ve had of their entrees is really good.  Update: they now have gluten free sandwiches on their menu!  I had their smoky bacon cheeseburger with fries (also gluten free) and it was delicious!  The gluten free bun was fresh, soft and chewy.  I was so happy that I could finally eat a sandwich WITH the bread!", "rating": 5, "date": "12/31/2014"}, {"text": "I love this location!!! There&amp;#39;s nothing bad I can really say about TCF. The menu has great options and I have my favorites that I usually stick with. I can definitely go without the overpriced mediocre tasting cheesecake. The entrees and appetizers are delicious. The drinks are overpriced as well though. I love the food!!!", "rating": 5, "date": "10/21/2014"}, {"text": "I have been slowly trying to ween my family off chain restaurants and my latest experience at this one is a good reason why.  We went here on a Thursday night for a dessert treat.  Something about and $7 slice of fatty cheesecake appeals to my wife and kids while my wallet silently weeps.<br&gt;<br&gt;Service: for once we didn&amp;#39;t have to wait 2 to 3 hours to be shuttled in a cavern of restaurant.  (Everyone table&amp;#39;s conversation is amplified, jumbled and combined into a unpleasant roar.)  We sat down, ordered, and somehow it took almost 10 minutes to slice $21 worth of cheesecake (3 slices) and bring it to the table. It may sound petty, but if I am ordering around 3000 calories of cheesecake at a price that could feed a family of four for dinner, you better ridiculous white pants/shirt combo in high gear and serve those slices of cake quickly.<br&gt;<br&gt;Attention to detail:<br&gt;The waitress came back to see if my family were enjoying thier fat-pills and she boxed and bagged my daughter&amp;#39;s leftover slice of cake.  This morning, my daughter naturally wants her cake for breakfast!  (I&amp;#39;m guilty of leftover chinese food for breakfast) Now what reminds me of stoner McDonalds workers spitting in the food was the layer of macaroni noodles crushed into the base of her leftover cake????  Really? <br&gt;<br&gt;Price: <br&gt;For reheated frozen food, this place is a joke!  <br&gt;<br&gt;Overall: a perfect match for Christiana Mall and its consumers.  The only positive thing about my visit is that I no longer have to hear my kids suggest going there ever again.", "rating": 1, "date": "7/13/2012"}, {"text": "Why do I keep giving this place second-chances with their steak? I&amp;#39;ve been here TWO more times since my last review and both times I got well-done despite asking for medium. I&amp;#39;ve tried almost each steak they offer and each one comes underseasoned and overcooked. I could do a better job myself for half the price. The most recent time, two other party members got well-done steaks and burgers despite both asking for medium-rare. We got free dessert for that one. I can appreciate the effort they&amp;#39;re putting in, but that cook has some problems or is intentionally wasting their money.", "rating": 2, "date": "6/3/2014"}, {"text": "This was the worst service I have experienced. We waited 40 minutes for a table for 5. While waiting I saw strollers wheel chairs and sleeping babies being held in a mothers arm. Standing room only. Once we got seated it was so dark you needed a flashlight to read the menu. 3 people ordered appetizers, there food came fast. So while they ate 2 people sat and watched, starving after waiting 40 minutes. Once the other food came, it was horrible. Burnt fish and under cooked vegetables   The complaints lead to the manager coming to our table. They tried redoing the vegetables but they were raw as fresh produce. She offered me an alternative but I refused. Corn was so under cooked I couldn&amp;#39;t swallow it. I was offered a free cheese cake. I don&amp;#39;t like cheesecake either. It was my granddaughters birthday. They did get that right, with the cake and candle singing happy birthday. I was so dissatisfied I may have ruined the moan", "rating": 2, "date": "2/26/2016"}, {"text": "I&amp;#39;ve been to this location and other Cheesecake Factory locations multiple times, and this service has been consistent across the board, as well as the food.<br&gt;<br&gt;You can get stuck in an hour plus waiting time, if you aren&amp;#39;t careful. I would say lunch would be the best time to avoid that or a later dinner, but I have seen the lunch wait get a little long...maybe not an hour wait though. The good news is, you can stalk patrons in the bar area, as that seating is first come first serve, and I&amp;#39;ve had decent luck doing that at other locations. <br&gt;<br&gt;Also, the portions are very large. The lunch pizza and salad is VERY filling, as well as the pasta, and Renee&amp;#39;s Special (half of a turkey or chicken salad sandwich, a salad, and the soup of the day. If the soup doesn&amp;#39;t sound like one you want you can substitute for fries). My only &amp;#34;gripe&amp;#34; has been that the last couple of times I have been the caesar salad has a lemony taste to it, even my mom noticed it. Not sure why that it is....<br&gt;<br&gt;People really shouldn&amp;#39;t complain about the calorie count or the price of the cheesecake. First of all, it&amp;#39;s at a restaurant, so anything here is going to contain more calories than if you made it yourself, it&amp;#39;s the reason you shouldn&amp;#39;t eat it every day! Is $7 steep for a price of cheesecake, I guess that depends on who you are asking. If you had one of their drinks at dinner, you probably paid about that for it. Basically, you wouldn&amp;#39;t pay that much if it wasn&amp;#39;t delicious. <br&gt;<br&gt;Overall, this is one of the better chain restaurants you could go to.", "rating": 4, "date": "10/24/2012"}, {"text": "I give this particular Cheesecake Factory one star because the wait was much longer than the hostess said. The steak was unseasoned so I ordered the fried fish and it was an unfortunate failure also. The one positive aspect of this visit was the professionalism from the wait staff..Will not be returning", "rating": 1, "date": "3/26/2017"}, {"text": "I was very hungry this particular morning. I decided to order myself a delicious Medium Well Macaroni and cheese burger. I went to go pick it up and I managed to take three big bites, when I noticed that my burger was not well done. It was rare. My burger was charcoaled on the outside and rare on the inside. I was about to throw up when I decided to go inside and show the manager. I go back inside I let the server working at the counter know that my burger was raw. She didn&amp;#39;t ask me anything she just took it out back. She said I will be getting a new one. I didn&amp;#39;t even want a new one. So I had to wait again for a burger and this time I didn&amp;#39;t even want it. Finally, when my burger was ready, she gave me the new one. I thought, well new burger new fries, I mean they did mess up my original order. I was waiting for a long time until the server came with my new burger. I open my new order and there are no fries. I tell her hey where are my fries and she said oh were they in the old bag. So I&amp;#39;m supposed to eat my old fries that are now cold, hard, and soggy. I got so upset when she came back with my old bag. The bag was crumbled and looked like she got it from the trash can. She got the fries out and said oh here you go. Here are your fries. So now I have a new burger but my fries are cold, hard, and soggy.  This had made me rethink going to any cheesecake factory in the future. I will gladly tell anyone Interested on going there to go somewhere else.", "rating": 1, "date": "3/11/2018"}, {"text": "Too dark, too noisy and too expensive. We all had to use our phones to see the menu, the food and our check. I ordered their &amp;#34;famous&amp;#34; meatloaf. It was just OK, but I can get better at a local diner for $8.99. I love succotash, but this was raw. The corn was like fresh off the cob and thrown in a pan with tomatoes and zucchini for about one minute. Won&amp;#39;t be back.", "rating": 2, "date": "3/11/2016"}, {"text": "Extremely poor customer service by the location manager. Had a coupon emailed to me for two free slices of cheesecake.  Went to redeem it today and the manager insisted it wasn&amp;#39;t good until the new year.  Proved to her that it was 12/26 and she said it doesn&amp;#39;t matter &amp;#34;I don&amp;#39;t have the button, go call corporate!&amp;#34;<br&gt;<br&gt;Will not be returning.", "rating": 1, "date": "12/31/2013"}, {"text": "Casual yet elegant modern decor. Very friendly happy helpful staff. Delicious casual food. The food is nicely presented and very creative, southwest nouvelle cuisine  at it&amp;#39;s best. Everything is fresh and colorful, taste buds party.", "rating": 5, "date": "2/2/2015"}, {"text": "I would make it a point to stop here for brunch a few times a month, but I stopped. The service is poor and the servers do not treat EVERYONE the same! I ordered breakfast potatoes with my brunch meal that tastes like they were cooked next or with meat. I do not eat red meat or pork. When I told my server that the potatoes tasted like meat and weren&amp;#39;t  good. She said &amp;#34;Oh yeah they cook potatoes on the same grill with the meat!&amp;#34; Then she walked away and did not come back for at least 20min, She never offered to correct the order or asked how we liked everything. Additionally she didn&amp;#39;t refill coffee or our mimosas at all. That was my last visit. I know go to brunch at Michele&amp;#39;s in Dover Downs cost way more but food and service is better!", "rating": 1, "date": "11/7/2013"}, {"text": "After several attempts getting in before with no luck (1-3 hour wait), we went on Valentine&amp;#39;s Day. The wait was 30 minutes so we took our pager and sat at the bar. As it turns out we just drank and ate our meals right there! Not only was it quick but while sitting at the bar you get served better than a waiter/waitress tending to 5 tables.<br&gt;<br&gt;      Jambalaya I had was great and my Fiance said her Steak Diane was also awesome! The Cheesecake we took home was of course the best you can get anywhere. The wait is bad but everything else is top notch!", "rating": 5, "date": "2/19/2012"}, {"text": "My hudband and I have been here a number of times.  This time my eyes were opened. We were at the bar.  Ester was a wonderful bartender.  Then the man sitting next to my husband happened to be the manager&amp;#39;s friend.  The manager came up and told him he would get him a table even though the wait was 30 min.  With 2 min the manager came back  the friend was going to a table.  I thought it was rude to make people that had waited 30 min for a table, wait even longer because a friend walked in. Watch who is  being seated before you when you go here.", "rating": 3, "date": "10/19/2013"}, {"text": "After hearing so much about the Cheesecake Factory, my family and I decided to try it out for a late lunch. We arrived at around 3, so we did not have to wait. However, it seems that an hour+ wait time is not unusual. <br&gt;<br&gt;The menu was gigantic, with many options to choose from. We ordered nachos for an appetizers and received dry, sad looking nachos with zero taste. <br&gt;<br&gt;When we all got our meals, we all agreed they were very bland (we all got different meals) and disappointing. With all the hype this place seems to get, we were all expecting the food to taste good. We decided to try the the cheesecake, which was good but not great. <br&gt;<br&gt;I felt the prices were too high for the quality we received. The wait staff was okay, and the place was clean and had a nice ambiance. Other than that, I won&amp;#39;t be back and I&amp;#39;m not sure I want to try another location after this experience.", "rating": 2, "date": "7/15/2011"}, {"text": "My family and I visited the new Factory at the Christiana Mall this weekend for my daughter&amp;#39;s birthday.  Had a good time.  The Memphis Burger was big - pulled pork and coleslaw on top of a regular burger - and quite tasty.  The Dutch Apple Caramel cheesecake for dessert was really good as well.<br&gt;<br&gt;I actually thought the service was better than average, as no less than four different servers came by and waited on us throughout the meal.  It seemed to be a point of emphasis that none of the staff walking by allow a beverage to get too low.  Meanwhile, our waiter was also prompt and friendly.<br&gt;<br&gt;It felt like the bill was a little on the pricey side after figuring out what we ate, but that&amp;#39;s the deal with this place I guess.  It&amp;#39;s an upscale chain restaurant and you should definitely appreciate that going in.  It was packed though, and routinely has long lines.<br&gt;<br&gt;I think we&amp;#39;ll definitely go back for other &amp;#39;celebratory&amp;#39;-type meals.  Just feels like that sort of place.  Enjoyed it!", "rating": 4, "date": "5/31/2010"}, {"text": "This place is over-priced. I say this based the price of a cosmopolitan made with Skyy vodka $11.50 REALLY!!  I enjoyed my salad and the service was great. I was taken back with the price of the drink. I will go again and just order water next time.", "rating": 3, "date": "4/8/2013"}, {"text": "The service was good, the atmosphere was good but the food, although pretty to look at, was bland. I ordered the Orange Chicken, my wife the Chicken Marsala. Neither were served with any real flavor, so much so that I wondered if it was the intent to make bland entrees so that the Cheesecake would stand out in the end? Regrettably, however even the Cheesecake was not that impressive. My Cheesecake was average at best.<br&gt;<br&gt;In the end I felt the entire experiance was disappointing and I regret waiting 15 minutes to be seated at 2pm in the afternoon on a Sunday. I have no idea why people would stand 45 minutes or longer for a dinner service.", "rating": 2, "date": "8/5/2010"}, {"text": "The place ,food ,cheesecakes and the atmosphere is great ! The only drawback is that the waiting time during the weekends is too long. Had to wait for 1 hr 45 min. The food portion sizes are good and the choice of cheesecakes are amazing!", "rating": 4, "date": "1/10/2016"}, {"text": "Today was our 3rd time at the Cheesecake Factory. Everything I&amp;#39;ve ever had is better than good. The menu is extensive ... Mexican, Italian, Asian, American, omelets, small plates, skinny meals. Tonight I had the fried fish sandwich on toasted brioche. It was really really good. The weather was lovely so we sat outside. Our waitress was excellent. Can&amp;#39;t wait to go back and try something else.", "rating": 4, "date": "9/2/2013"}, {"text": "If I can, I would give this place 0 stars. The waitress was horrible, the food was bland, and the service overall was garbage. The food was cold when we got it, my daughter waited longer for her food then my wife and I did (All she had was Mac &amp;amp; Cheese). We barely ate any of our food, and the waitress did NOT ask if we wanted to box it ump, she took it off the table and threw it out (Not that we would of taken it). I would NOT recommend this to anyone and I will NOT return to this place again.", "rating": 1, "date": "4/1/2016"}, {"text": "The service was subpar, had too wait 20 minutes for anything we asked, ie... Water, refill drinks, steak knife.   WTH!!!!  Spent way too much money for ice cold mashed potatoes.  I expressed that I was not happy with the service or food and nothing was done about it.  I will never, ever, ever go back.", "rating": 1, "date": "1/4/2016"}, {"text": "Came here on a busy Saturday night. They have practically everything you want on the menu. Ordered the chicken with bowtie pasta and garlic sauce, it is very tasty. The portions were huge, had to actually take some home in a to-go bag. Much better selection and quality than Olive Garden. Original cheesecake was creamy, and sweet.", "rating": 5, "date": "8/2/2015"}, {"text": "Surprisingly, the service was very bad. Not at all what I&amp;#39;m used to at other Cheesecake Factory restaurants, the waiter did not even give us straws with our drinks, we had to ask our food runner for straws because our waiter was nowhere to be found.", "rating": 2, "date": "2/9/2013"}, {"text": "Friendly service and awesome cake! We ordered special chicken and burger. The onion ring is quite delicious. Cake is best!", "rating": 4, "date": "1/9/2013"}, {"text": "Had a great lunch there yesterday! Ordered the chicken avocado sandwich and it was outstanding .... so much in fact I wish I could have ordered one to go!", "rating": 4, "date": "10/4/2015"}, {"text": "For the money, the food from this place is really not all that. Great presentation, but the cheesecake is actually in my opinion not good at all. I have tried vanilla, key lime, the peanut butter cup one, and regular. Couldn&amp;#39;t eat it. The newest Moroccan dish is sub par, claims to be marinated and just tastes blah. I&amp;#39;d rather get something from inside the food court and save my money for shopping.", "rating": 2, "date": "11/18/2012"}, {"text": "My first visit tonight with my sister. We arrived at 4pm so was seated immediately &amp;amp; service was very good. She had Steak Diane and I had the Chicken Madeira.  We both agreed that dinner was very good.  My asparagus were perfect crisp tender and the mushrooms done lightly sautéed. It was excellently prepared.  I would definitely go back again.", "rating": 4, "date": "5/4/2015"}, {"text": "I was impressed that the manager reached back out and invited me back for another try at her cost.", "rating": 3, "date": "10/1/2015"}, {"text": "The food is excellent--we had the fire roasted artichoke appetizer to start.  It was cooked to perfection and paired with a very tasty dipping sauces that supplemented the artichoke.<br&gt;The main entrees were also superb.  We chose the Luau Salad and Bar-b-que Salmon. Both were well prepared and presented.  The salad had a great combination of fresh ingredients and the serving size is very generous.<br&gt;The BBQ salmon was exquisite.  It&amp;#39;s so easy to cook seafood improperly--to cook it too long or not long enough, use the wrong seasonings or make poor choices for sides.  Everything was right in this case: The salmon was perfectly cooked. The BBQ sauce was tangy and flavorful but not overpowering,  so it didn&amp;#39;t eclipse the delicate taste of the fish.<br&gt;What cannot be understated is the quality of the service. The staff were friendly, professional and attentive.  What was really special was the personal attention from the manager.  When notified that the young child with us was cold, he raised the thermostat and returned promptly with a Cheesecake Factory T-shirt and stuffed penguin toy.  She couldn&amp;#39;t have been more pleased.  <br&gt;All things considered, it was a superb dining experience and we will certainly return again soon.", "rating": 4, "date": "6/29/2011"}, {"text": "Food was OK for lunch.  Soup was tasty but not hot. Salad was plentiful but oily. Sandwich roll was fresh. Tea was weak. We didn&amp;#39;t see our waitress at all, could have used another beverage. I have had better cheesecake, not worth the calories or the price. Next time we will try one of the other mall eateries.", "rating": 3, "date": "2/12/2014"}, {"text": "I don&amp;#39;t have a cheesecake factory near me, so any time I have an excuse to go to one I take it. This place is fantastic. Good food, great dessert,  good prices-what else could you want?", "rating": 4, "date": "6/25/2012"}, {"text": "In the mood for a good salad, I ordered crab and artey chokes as an appetizer.  Not dissapointed, it was scrumptous.  Got the salad I ordered....lettuce with some fruit mixed in.  Much lettuce, not much fruit.  Still pretty good though.  Would have been awesome with more fruit, pecans, feta, etc. Next time, I&amp;#39;ll get the BBQ chicken salad.  I was sorely tempted to eat some of my buddies when he wasn&amp;#39;t looking.  My tummy was excited to start, just satisfied to end.", "rating": 4, "date": "8/27/2013"}, {"text": "Very poor, especially when compared to other outlets in the same chain. The Christiana restaurant is much smaller than the average Cheesecake Factory and as a result it is unbearably crowded and the wait times (which one understands will be long going in) are exasperated. Staff is not up to par with other locations. Part of the Cheesecake Factory experience is top notch waitstaff, but not here. We were also disappointed by the food. Not to the level of quality one expects from CF but at the same price.", "rating": 2, "date": "5/16/2011"}, {"text": "Went with a girlfriend after shopping.  Wow the decor was way past my expectations...after all it&amp;#39;s in a mall.   Should be in Vegas or at least AC.   The menu was huge and our waiter helped us decide.   He had great food pics.    Food was so good.   Will definitely go back!", "rating": 5, "date": "7/26/2012"}, {"text": "Two girlfriends and I visited the new location at Christiana Mall this past weekend, and we were very happy with our visit. It was a gorgeous day and we were able to sit outside without too much of a wait. Our server was friendly and efficient, and our food was wonderful. All three of us ordered pretty light fare, in anticipation of concentrating of dessert. We shared Arugula Salad, Beets with Goat Cheese, Greek Salad, Crispy Artichoke Hearts, Ahi Tartar and Shrimp Scampi Crostini. Everything was beautifully fresh and tasty. The menu is as think as a book, so in the future I will try to decide what I&amp;#39;d like to have before going. The cheesecake was AMAZING. Key Lime, Adam&amp;#39;s Peanut Butter Cup Fudge Ripple, and some other amazing chocolate monster served with ice cream (I cannot find the name) were ordered, consumed and greatly enjoyed. The only things that keeps The Cheesecake Factory from receiving the 5th star from me is that you definitely felt like you were in a chain restaurant and the three of us together spent over a hundred dollars and we didn&amp;#39;t even have alcoholic drinks, making it an expensive afternoon nosh.", "rating": 4, "date": "5/5/2010"}, {"text": "Not bad. Had Jamaican shrimp. Wasabi crusted tuna wasn&amp;#39;t great. Good coffee. Lots of flies.", "rating": 3, "date": "12/25/2011"}, {"text": "fav!  love the chicken piccata and the bread there.  always tastes good.  service is top notch....can eat here everyday.  portions are huge.  always have leftovers for the next day!", "rating": 4, "date": "5/31/2016"}, {"text": "I would have given a five star rating except for the extreme wait times. The food is amazing and the staff is awesome too. One of my favorites.", "rating": 4, "date": "11/19/2011"}, {"text": "So the food is pretty good here, service is always great.  I absolutely love their carpaccio.  That&amp;#39;s usually why we end up going here.  I have had a few other entrees here, and all of them are at least good.  They have a few things that are exceptional.  Then there is the cheesecake.  Who can go wrong with cheesecake?  Overall a great place to go even at a mall location we have never had to wait for more than 15 minutes, and they do call aheads which is great when you have 4 kids and it takes forever to get out the door!", "rating": 4, "date": "4/30/2013"}, {"text": "Obviously a chain so not quite the unique feel of a great local place but all things considered they have very good food (upper end pricing for a chain like this but that&amp;#39;s expected), a friendly staff, and a ridiculously lengthy menu...and delicious desserts! Most recently had the Bang Bang chicken and shrimp and it was very good. Hard to give any chain 5 stars but outside of the steakhouses...hard to find a better and more consistent chain restaurant with a diverse menu.", "rating": 4, "date": "7/5/2012"}, {"text": "Finally a place to go in the mall that you can get waited on except TGI Fridays...This place is typical chain ...Some items are extremely reasonable and delicious like the small pizzas and the corn fritters. I love the chicken Thai lettuce wraps because the sauces are delicious! Don&amp;#39;t EVER get the fried mac and cheese (my 15 year old ordered this dish) It is horrible AND expensive didn&amp;#39;t even touch 4 of the 5 huge fried balls. The waiter never asked if we were happy with the dish...It is pretty obvious when you are paying $10 for an app and you don&amp;#39;t touch it ! Be careful of the drinks too..$3 for a soda! Overall good food and good service...", "rating": 3, "date": "10/3/2011"}]}