{"address": ["825 Dulaney Valley Rd", "Ste 1159", "Towson, MD 21204"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 2.5], [4, 2.5], [5, 2.5], [6, 4.0], [7, 4.0], [8, 3.5], [9, 3.0], [10, 3.0], [11, 2.5]], "2017": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 2.0], [4, 2.0], [5, 2.0], [6, 3.0], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.0], [11, 3.0]], "2020": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.0], [6, 2.0], [7, 2.5], [8, 2.5], [9, 3.5], [10, 3.0], [11, 3.0]], "2018": [[0, 3.5], [1, 3.5], [2, 2.5], [3, 2.5], [4, 3.0], [5, 4.0], [6, 3.5], [7, 2.5], [8, 2.5], [9, 2.5], [10, 3.0], [11, 3.0]], "2021": [[0, 3.0], [1, 3.0]]}, "reviews": [{"text": "I normally am not a chain restaurant kind of lady, but you can never go wrong with CF. My boy loves coming here with me, he loves sitting in the two person booth. He loves the chicken fingers a lot! I had the salmon last time, i think the miso, and WOW! it was amazing. I always get great service here.", "rating": 5, "date": "6/8/2020"}, {"text": "First and foremost, this place is Dark as hell inside. <br&gt;<br&gt;Other than that, the service is pretty. Though their menu is always fairly overwhelming (because it had the drink menu, the lunch menu, the speciality menu, the brunch menu, the cheesecake menu ...), there are a few good selections. <br&gt;<br&gt;Food: <br&gt;During my visit, I had the Jambalaya Pasta. It was fairly good. I did request to have more sauce because the noodles were kind of dry. Once that was on the pasta, it was a game changer. <br&gt;<br&gt;The brown bread is my favorite! Best while it&amp;#39;s warm of course. <br&gt;<br&gt;Drinks:<br&gt;Drinks were pretty solid. I sat at the bar during this visit. It was on a Wednesday, so there was not too many people there. Bartender was friendly and. Accommodating. <br&gt;<br&gt;Overall good experience. Definitely a lot to choose from.", "rating": 4, "date": "10/17/2019"}, {"text": "Had a 12:45 reservation was a few mins late They Cancelled it. So we decided to make another reservation we knew the wait would be about and hour which was ok! I explained to the waitress about our earlier cancellation and we really only wanted Brunch. She talked to the manager and we were able to order off the brunch menu everything was flavorful hot an fresh!", "rating": 4, "date": "8/25/2020"}, {"text": "Awesome place for dinner tonight and the choices for cheesecake are incredible! Had a great waiter-Austin-who took our orders quickly and brought out our drinks and bread quickly. Placed our order and it was off the &amp;#34;skinnylicious&amp;#34; part of menu but sandwich was fresh and good portion. Cheesecake was amazing, although I was only able to take 2 bites. Got take home container for cheesecake and salad. Place was clean with nice music and friendly staff. I&amp;#39;d definitely recommend this place and only took off 1 star since most main dishes had onions in the description or sauce which I can&amp;#39;t eat. More restaurants should have a non onion option for sauces etc. otherwise it would be 5/5.", "rating": 4, "date": "7/4/2019"}, {"text": "Out of 5 Stars<br&gt;Service: 5<br&gt;Cleanliness: 4<br&gt;Food: 4.5<br&gt;Beer Selection: 1<br&gt;Overall: 4<br&gt;Comment: Stopped in on a Thursday evening and they weren&amp;#39;t very busy. Asked for a table for two and was told it was a ten minute wait. No problem. However, when I looked a round there were literally dozens of tables empty. Why the wait? I let it go and we were called about 5 minutes later. Our waiter greeted us immediately. Austin was friendly and very helpful. Ordered drinks and they came in a few minutes. Food took about 15 which is about average and nothing to complain about. Had the Turkey and Avocado sandwich and it was excellent! A little small but it was one of the low calorie dishes so I kinda of expected that. Finally, I had the Adams Peanut Butter Cup cheesecake and incredible! Obviously they&amp;#39;re known for cheesecake and for that they definitely didn&amp;#39;t disappoint. Overall, a nice place and a good experience. I&amp;#39;d return.", "rating": 4, "date": "7/4/2019"}, {"text": "We had lunch at Cheesecake Factory in Towson and our experience was good.  The staff were all friendly, service was quick and the food was delicious.   I recommend this restaurant.", "rating": 4, "date": "11/5/2020"}, {"text": "Kara (our waitress) was excellent! Food was delicious. Cheesecake factory gives you many options to choose from. If you&amp;#39;re health conscious, they have food for dieters, vegans and low calorie options.", "rating": 5, "date": "3/1/2020"}, {"text": "As I always say, I&amp;#39;m not a big fan of chain restaurants but the Cheesecake Factory has always been an exception. Their food is always great, and this time was no different. Came here on Saturday 10.19.19 before heading to see Maleficent at Cinemark Towson. They don&amp;#39;t do reservations or call ahead seating here, which is a bit of a gamble coming here on a Saturday so we decided to give ourselves plenty of time (or so we thought). Our movie started at 8:30 and we had reserved seats, so we weren&amp;#39;t terribly worried about getting there exactly at 8:30. We arrived to the Cheesecake Factory around 6:30. I figured we&amp;#39;d probably have a half hour to 45 minute wait, so I was assuming we&amp;#39;d be sitting by 7:15 and hopefully done eating by 8:15. Well I was spot on with the 7:15 part but our server didn&amp;#39;t come to greet us and take our drink order until almost 7:30. And he passed by our table several times beforehand. When he came to take our drink order, we were already ready to put in our food order since we were a little pressed for time; however, before we could say &amp;#34;we are ready to order,&amp;#34; he walked away to get our drinks. And he didn&amp;#39;t come back with them (fountain drinks, not cocktails) for another 5 or so minutes. When he came back with the drinks we told him we were ready to order. We got stuffed mushrooms to share, and I got ribeye medium rare and my partner got a chicken Cesar salad. Our server went to get us bread and yet again was gone for 5-10 minutes. Our food didn&amp;#39;t come until around 8:00 so we had to rush to eat. Unfortunately it wasn&amp;#39;t our server who delivered the food so we had to wait to see him again to ask for the check while we were still eating, so we could just get out of there. When we finally saw him again, we asked for our check. He came back with it after another 5 minutes, I gave him a gift card to pay, and then when he came back with the receipt we asked for a box for the salad. Then a large party of maybe 10 got seated right next to us, and instead of getting our box he proceeds to immediately take their orders as soon as they sat down. We had to flag down a hostess for a box for our leftovers. <br&gt;<br&gt;I get it, Saturday&amp;#39;s are busy here and so we tried to plan accordingly. I don&amp;#39;t think it&amp;#39;s unreasonable to expect to not have to rush for an 8:30 movie when you get to the restaurant 2 hours before the movies start time. But we didn&amp;#39;t end up leaving the Cheesecake Factory until around 8:25 after arriving at 6:30. For 2 people. Thank goodness for reserved seating at the movies. <br&gt;<br&gt;I will say that my ribeye was one of the best I&amp;#39;ve ever eaten and I tried my partner&amp;#39;s chicken Cesar salad which was also delicious. The stuffed mushrooms were great too. 5 stars for food, 1 star for service.", "rating": 3, "date": "10/26/2019"}, {"text": "I&amp;#39;ve ate at Cheesecake Factory multiple times and at several locations.  This time we chose the Dulaney Valley Road location in Towson. 01/05/2020. Emma was our server and I must say she was amazing!!! Attentive but not constantly at the table. Gave refills before we asked. I ordered cheesecake to go and she had them put the whipped cream in a side container. I have never had anyone ever offer to do this and I always get a slice of cheesecake to go. She even gave us to go cups of our drinks without us asking. It&amp;#39;s the little things that leave the best impression. <br&gt;I will definitely ask for her to be my server the next time. Kudos to Emma!", "rating": 5, "date": "1/5/2020"}, {"text": "I did not even eat here recently this review was based on just PHONE SERVICE. I wanted to get this coupon deal at the restaurant, and their website was not letting me order it at all. So I called and asked the server who answered for the deal and she was like I am not sure let me get my manager and I was like, thank you. When the manager Gigi got on the phone, not only did she interrupt me but she was rude. The deal ended and I was unaware but that was not the issue, she told me it was over many times over and over and did not recommend a solution or another deal she just keep repeating it was over and when I finally said oh ok, she just abruptly hung up the phone. I do not think I have ever had such rude phone service except from uber eats. I would rather go to the location in Inner Harbor and wait an hour than return here for that service.", "rating": 1, "date": "6/29/2020"}, {"text": "I have severe Celiac Disease and they were able to accommodate me perfectly and even brought me out gluten free bread to eat when the &amp;#34;regular&amp;#34; bread was brought out (and it was delicious!!). Will definitely be returning!", "rating": 5, "date": "10/30/2020"}, {"text": "After a long day decided to go to dinner with my friend after work. Arrived and the waiting area only had two parties. We requested a booth, and they said they it would be about 10 minutes to clean off a table. They gave us a pager and we said we would just be checking out the Cheesecake display. <br&gt;<br&gt;After 10 minutes we went to the desk to get menus, so we would know what we wanted when we sat down. While standing at the check in desk we saw a woman approach and ask for a booth for two. The hostess responded sure we have one free now. They took her to the booth a few feet away. We then inquired about  our booth and they said it was ready. <br&gt;<br&gt;We were walked over to a half table half booth. We reminded the hostess we wanted a full boith, she walked us back to the hostess stand and told the person there we needed a booth. They informed us it would be another 15 minutes. I spotted the manager and went over to express the concern about what transpired. He went over to discuss with the hostesses. They said they paid us, which was not true because it never went off nor did they verbally call us. The hostess got really snappy and walked by stating they were cleaning off table for us. <br&gt;<br&gt;We finally were seated and our server John waa super nice and hospitable, such was a nice change. I would advise training all staff in customer service especially people on the front line dealing with guests. <br&gt;<br&gt;The fish and chips were fresh and the batter was well seasoned. Not sure how soon I&amp;#39;ll be returning to this location.", "rating": 3, "date": "3/7/2019"}, {"text": "The worst of the worst.  I feel guilty even giving them 1 star - they don&amp;#39;t even deserve that.  I called for carry out and after 10 minutes &amp;#34;the bakery&amp;#34; where you order didn&amp;#39;t pick up, so I walked over.  After 20 minutes waiting for a salad I ordered it was clear that all I was going to get was the run around.  &amp;#34;The manager will be right over.&amp;#34;  He/she never came and I gave up and walked out.  4 people behind the front desk and NOBODY who could care less about service or telling the truth.", "rating": 1, "date": "9/28/2020"}, {"text": "With multiple tables open, we were unable to be seated due to a lack of wait staff. 30 min wait. Explained we only wished a drink, nope they couldn&amp;#39;t see their way around that one.", "rating": 1, "date": "10/11/2020"}, {"text": "2 times in a week!<br&gt;<br&gt;I was at Towson town center and my daughter wanted to come here.<br&gt;<br&gt;Much better dining experience from the Downtown location last week.<br&gt;<br&gt;Food:<br&gt;<br&gt;Dynamite shrimp- deliciouso!! They are really great. They are fried to perfection and the spicy dipping sauce so good!<br&gt;<br&gt;Fried chicken sliders - Good. Some of the chicken was smaller than other pieces. <br&gt;<br&gt;Margarita- Great!<br&gt;<br&gt;Service was good.", "rating": 4, "date": "2/17/2018"}, {"text": "Worst experience ever <br&gt;Food came out cold <br&gt;Broccoli was reheated to the point of mush ....not eatable <br&gt;I had spit the cold broccoli back on my plate and that was reheated and sent back to me <br&gt;Barmaid knew I was unhappy and did nothing but give me the bill <br&gt;40 dollars for half a filet and reheated spit out broccoli <br&gt;<br&gt;I travel alot and stay in the Shetaton across the street ....I will never eat here again .<br&gt;<br&gt;Oh and the manager that I requested at the hostess station was about as helpful as a filthy door knob.<br&gt;<br&gt;Never again", "rating": 4, "date": "8/23/2019"}, {"text": "I know that things have been difficult during the pandemic and I truly understand. However, I hope that the portions return to the original size after the economy begins to recover. God bless.", "rating": 3, "date": "6/10/2020"}, {"text": "I went in for lunch on a weekday the service was good and not to rushed and not to slow I ordered the Louisiana chicken pasta and added asparagus, this was my first time trying this dish and it was good I would order again , and had the red velvet cheesecake To go", "rating": 5, "date": "7/13/2019"}, {"text": "Our waitress Salina gave me and my wife an outstanding service. Very polite and courteous!!!<br&gt;Wife ordered the fish tacos and I ordered crispy pineapple chicken and shrimp which blew our minds, just amazing!!!", "rating": 5, "date": "7/22/2019"}, {"text": "This was my first time here and besides the server being amazing nothing else was worth coming back<br&gt;<br&gt;Pros: <br&gt;<br&gt;awesome server <br&gt;<br&gt;Cons: <br&gt;<br&gt;*atmosphere ( it was freaken hot in there )<br&gt;*The food sucked (sliders had next to no meat on them, the one slider had a sliver of meat that didn&amp;#39;t even take up the little slider bun<br&gt;*it was so loud you couldn&amp;#39;t hear each other talking<br&gt;*our friend got a expensive meal and it looks like a toddler threw it together.", "rating": 2, "date": "10/27/2019"}, {"text": "SLOW waited 1 hr &amp;amp; 30 min for one spaghetti and 2 cheesecakes. Never coming back to this location ever again", "rating": 1, "date": "9/29/2020"}, {"text": "I love the Cheesecake Factory from the presentation of the restaurant to the wonderful food. Yes even though I love Cheesecake Factory this location has let me down twice. Since they don&amp;#39;t offer reservations I have set up two parties at this location (meaning showed up 2 hours before the event) and they have always had an excuse when it&amp;#39;s time for the area I waited for being available. So that&amp;#39;s been a let down. The manager the second time comped some appetizers on the house but my guest were starving from the wait so many people were upset. <br&gt;<br&gt;The food at this location is delicious! I have only experienced one issue before and it wasn&amp;#39;t their fault. The service to get our food was average which was disappointing. The waitress we had wasn&amp;#39;t the most personable person but we were all still nice with her. The appetizers came at a decent rate but our main entrees were all coming out at all different times. That was disappointing for the simple fact everyone was starving! Even though the food wasn&amp;#39;t all on point one thing that truly was were the drinks! I ordered three and they were all pleasant! <br&gt;<br&gt;Hopefully this location can get it together to get the 5 stars I know them to be!!", "rating": 3, "date": "10/18/2017"}, {"text": "This location is one of my favorites! It&amp;#39;s always busy that&amp;#39;s the only reason i didn&amp;#39;t give 5 I had to wait 2 hours before. I love that it&amp;#39;s valet parking and parking lots because it&amp;#39;s hooked to Towson town center. Happy hour at this location I from 4-6pm. Awesome items. Just like any other CF the menu has something for everyone. This location has outdoor seating also. They have the to-go parking in the garage near the valet. The bathrooms are always clean. Customer service is awesome.", "rating": 4, "date": "11/9/2018"}, {"text": "Cheesecake factory never disappoints in my book. I had the bacon bacon cheeseburger, wife had pizza and a salad and daughter had a pasta meal. Along with calamari for an appetizer. Everyone enjoyed the meals and as usual the cheese cakes and carrot cake to take home. The wait here is a little longer than usual which means it took a while for the food to come out but our server Sarah C. was great and that makes up for the wait. Once again cheese cake factory wins our heart!!!", "rating": 4, "date": "3/7/2020"}, {"text": "I can&amp;#39;t say I&amp;#39;ve had a ton of food from Cheesecake Factory.  But the nachos are amazing.  The chips are thick pita like and super good.  The nachos are loaded with everything nachos should have and the cheese is amazing!  The cheesecake also is a go to and delicious.  My favorite is the Oreo cheesecake!!  On the healthier side of things, the Mexican tortilla salad from The Skinnylicous menu is really good.  Menu is very extensive and has everything you could possibly want.  Out of the things I&amp;#39;ve ordered, I&amp;#39;ve never had anything I really disliked.  This place is usually busy and pricier.", "rating": 4, "date": "7/7/2019"}, {"text": "These folks just can&amp;#39;t get it right. Just went there last week and had a great dine in experience. Back today and there&amp;#39;s NO dine in and the to go inside order experience was the horrific!! The online special was totally out. There&amp;#39;s only one person taking in person and phone orders. You have to stand back in line again when your order is ready   worse part today got all the way home and the order was wrong. No peas in the pasta as requested no salad as requested but fries instead. Uuugghh too much money time and inconvenience. Gave two stars since the mac n cheese burger was cooked perfectly. Won&amp;#39;t be returning until things turn back to normal. Whatever that is ....", "rating": 2, "date": "7/3/2020"}, {"text": "I wish I had more time to take pictures while I was at this restaurant, but honestly... what&amp;#39;s most important is I went on a Saturday night, probably 8pm. Of course, everyone&amp;#39;s dinner hour. My cousin and I were planning to walk in and upon meeting the host, we were informed that the wait was 1.5-2hours. At that time, I made reservations with The Cheesecake Factory on this Yelp app and was seated, with my drink within 45 minutes. Please take advantage if you have the ability as I had to share my (first) great experience!", "rating": 5, "date": "2/27/2020"}, {"text": "Food is always pretty good with a wide variety of options for everyone. Portion sizes and cheesecake slices are pretty big and filling for the prices. This specific location has had VERY slow service the past 2 times I&amp;#39;ve been here (Mon 5p and Sun 7p), so I won&amp;#39;t be back here for a while.", "rating": 3, "date": "3/10/2020"}, {"text": "Been here twice so far and each time the food is great comes out at the reasonable time. Can&amp;#39;t tell you how much I love that. The part I dislike truly is the no reservations. I on some part understand it. But still. But the low lights gives it an amazing feel the decor if you ever look up its different but it does go along with that. I got the penne four cheese and it was worth it. I will be back to this location again.", "rating": 5, "date": "5/9/2019"}, {"text": "This place is usually hit or miss from my experiences. Today was a hit!!! I had the day off and decided to take myself on a date. I sat at the bar, and from the moment I sat down the bartender (Will) was very attentive! I&amp;#39;d never been here for lunch, so he gave an honest explanation about the lunch portions. I decided to have the lunch version of the meatloaf which was cooked to perfection. While dining, Will maintained the perfect balance of making sure that all was well, having general bartender-customer conversation, and giving me space. <br&gt;<br&gt;Overall, my visit was phenomenal. If you have yet to do so, pay this location a visit. If you&amp;#39;re sitting at the bar, ask for Will!!", "rating": 5, "date": "8/14/2018"}, {"text": "This is located in the Towson Town Center which is easy to get to from Route 695, they have an attached parking garage which makes it nice for inclement weather.<br&gt;<br&gt;We have been here several times and always enjoy it.<br&gt;<br&gt;We got seated immediately as it was right around 12:30 on Sunday.  Within a minute we were greeted by our server who was simply outstanding and extremely attentive and friendly !  Could not have had better service .....<br&gt;<br&gt;We ordered the assorted egg rolls appetizer and it was hot and full of flavor.  The normal bread basket and butter was perfect as usual.<br&gt;<br&gt;Our meals came to our table hot and well presented.  <br&gt;<br&gt;My wife loved her meal, the name eludes me but it was outstanding !<br&gt;<br&gt;I ordered the Chicken Madeira, sorry if mis-spelled.  The dinner looked great, had great flavor and so forth until I started cutting into the 2nd chicken which was RAW.  The server immediately got the manager who apologized and offered to make it again, I kindly declined and they removed it .... was not to thrilled as I could have eaten the other chicken which could have been just as raw ?<br&gt;<br&gt;Whom ever cooked this needs to be a little more aware !<br&gt;<br&gt;Naturally we had to get their killer cheesecake to go ...<br&gt;<br&gt;We can&amp;#39;t complain for the most part, under cooked food happens .... but this should not happen !<br&gt;<br&gt;We will be back ...... but I&amp;#39;ll change my selection !<br&gt;<br&gt;Service was flawless - 5 Stars !  My wife&amp;#39;s dinner was 5-Star .... <br&gt;<br&gt;I had to rate this visit 4 stars due to undercooked chicken.", "rating": 4, "date": "1/6/2019"}, {"text": "Worst Cheesecake Factory EVER! <br&gt;<br&gt;Usually this is my go to restaurant for some good food and low key night, but this experience was horrible. <br&gt;<br&gt;First of all, the table was disgusting.. dirty cups let there and straws. The small plates and utensils were unwashed!!! Disgusting. <br&gt;<br&gt;Then when we ordered, 2 of our plates were incorrect and we let it go both times bc mistakes happen. On top of that, the server charged us for both plates... so I was charged for 2 messed up plates and the 2 actual plates even if I had ordered it originally and they eased up my order!!!!! <br&gt;<br&gt;Then we ordered cheesecake to go and came home to 2 plain cheesecakes instead of what we actually ordered and paid for! <br&gt;<br&gt;We let that go to, but then my sisters both got food poisoning from eating here. They both had the lasagna and a burger and both got sick. <br&gt;<br&gt;I called and the manager said sorry. Really? <br&gt;<br&gt;This place is a mess and do yourself a favor, please don&amp;#39;t go here and risk your health.", "rating": 1, "date": "1/7/2020"}, {"text": "I had a 6 PM reservation for 2. We were a little early to our reservation and were sat shortly after arriving. Out server Sam was the best and gave great service. The food was delicious. We had complimentary bread, pretzel bites with fondue cheese as an appetizer, I got the mac and cheese burger and my boyfriend had the shrimp and chicken gumbo. For dessert I had tiramisu cheesecake and he had the original cheesecake with strawberries. Great food and great service. Will definitely be back.", "rating": 5, "date": "8/14/2020"}, {"text": "Terrible service.  Sat waiting for entree about an hour and then was told it was not ready after they finally served the other 2 members of my dinner party.  Never again.", "rating": 1, "date": "2/16/2020"}, {"text": "I&amp;#39;d like to start by saying my boyfriend and I&amp;#39;s experience last night at the Cheesecake Factory was one of the absolute best we&amp;#39;ve had at the restaurant. Our waitress Emma was pleasant and accommodating from the time we sat down til the time we left. If we could request her services again, we&amp;#39;d do so with no hesitation. Great service compliments the dining experience!!! Now, on to the food. We started with drinks. I enjoyed a Peach Bellini while my boyfriend enjoyed the Georgia Peach. Both drinks were frozen cocktails and refreshing. Then we enjoyed the cheeseburger spring rolls appetizer which were absolutely delicious! By the time we thought to take a picture for this review, we were finished! Our entrees are attached. Truffle Honey Chicken w/ mashed potatoes and Louisiana Chicken Pasta w/ a slightly spicy sauce. So darn yummy!!! Succulent chicken breast, flavorful, fresh! Very very pleased with both dishes. Healthy portions which allowed for to go boxes. And of course, we couldn&amp;#39;t leave without getting dessert. So full from dinner, we opted to take our desserts to go. One cheesecake slice w/ fresh strawberries and one slice of the blackout cake (chocolate w/ chocolate chips &amp;amp; almonds). Wea wonderful date night.", "rating": 5, "date": "1/4/2020"}, {"text": "I understand there&amp;#39;s reservations. But when we walked in the host said 45 mins wait. it&amp;#39;s going on 1 hour and a few minutes now. I understand covid. But we expected to be seat by then or a few minutes after.", "rating": 1, "date": "7/25/2020"}, {"text": "Came in Friday night for dessert after eating at Stoney River. The carry out counter was crowded but we had patience and decided to wait. 15 mins went by before we were next to order and the girl at the counter was on the phone w what  seemed to be a carry out order, no problem. As I&amp;#39;m observing the chaos behind the counter I noticed the girl that was making the orders was not wearing gloves when others were. <br&gt;<br&gt;She continued to make the orders, adjusting or touching the actual food on the plates to place it or move it around. Then, best of all she kept touching her face and wiping her nose then continuing to make the orders. NO THANKS. <br&gt;<br&gt;Look, I get &amp;#34;if you only knew what happened in restaurants etc..&amp;#34; but, if you have your employees making the food in a well populated customer waiting area, you should probably make sure your following health code and guidelines. Gross.", "rating": 1, "date": "1/18/2020"}, {"text": "Service was HORRIBLE!!!! It took 30 minutes after we were seated to get waters and menus!!!! We ordered a round of shots and the waitress rudely sat them down and didn&amp;#39;t explain which ones were which! She stated she didn&amp;#39;t remember and walked away! It took us then over 30 minutes to get someone to take our order! The manager was very nonchalant about the situation! It took then 40 minutes to get our food. No one checked on us or refilled any of our drinks! Piss poor service! The white bartender refereed to one of my friends as &amp;#34;bruh&amp;#34; and the manager didn&amp;#39;t care! Don&amp;#39;t waste your money!!!! I will never spend another cent here!!!!", "rating": 1, "date": "7/18/2020"}, {"text": "Fantastic visit, great customer service, slightly above average food. Visited this location w a large party after goddaughters graduation.<br&gt;We were given Abby &amp;amp; Kia to take our orders, etc.  They were extremely professional, nice and 100% accuracy w orders. <br&gt;The appetizers came out at a good pace but the entrees dragged a little as far as reaching the table and there were major complaints about a few food items. Mainly the blandness of a few items and  $1 - $3 upcharge on other sides offered. <br&gt;I must admit, I was a little shocked about the complaints ... Until I tasted my food.<br&gt;Collectively we ordered Nashville hot chicken nuggets, Lunch salmon fresh grilled salmon, Bacon bacon cheeseburger, Lunch fettuccini Alfredo w shrimp, Lunch soup, salad, and Chicken salad sandwich. Also, Calamari &amp;amp;<br&gt;Angel shrimp pasta.<br&gt;Everything came to the table plated well.", "rating": 4, "date": "6/22/2017"}, {"text": "I do enjoy cheesecake factory and the menu options that they have.  Our daughter had a pasta dish, my wife had some of their nachos. and I had a chicken quesadilla.  We all enjoyed the food.  <br&gt;Our server was a nice young man, whom was attentive, when he was able to come to our table.  The food took quite a while to get to our table, and there was no apology about the delay nor was a reason given.  I get that the chain is widely popular and can be busy, but this was not acceptable.", "rating": 3, "date": "4/19/2018"}, {"text": "Went for lunch on labor day. No wait to be seated. The waitress was nice and patient. The servings are always large. I wish they had a separate vegetarian menu. Looked like gluten free items were marked but not vegetarian.", "rating": 4, "date": "9/3/2019"}, {"text": "Visited The Cheesecake factory yesterday for my daughters birthday dinner. The food was as expected, no disappointments. I realize that the prices on the menu aren&amp;#39;t cheap, but to charge for a birthday cheesecake is a bit ridiculous. I&amp;#39;m surprised I wasn&amp;#39;t charged for the happy birthday song...", "rating": 2, "date": "11/7/2019"}, {"text": "This place is always great.  I don&amp;#39;t come here too often because the prices are pretty high.  We went last night and everything was fantastic.  Nicholas was our waiter and he was great.  The wait for our entrees was a little longer than expected, but other than that all was good.", "rating": 4, "date": "9/10/2019"}, {"text": "Had an awesome experience here with our large group. We showed up with 20 to celebrate a graduation. The hostess told us it would be a while-- understandable with such a big group--but updated us regularly on timing. <br&gt;<br&gt;We shared several apps including spinach dip, thai wraps, and the buffalo blasts. They were delicious! The waiter kept the bread refill coming and handled the drink refills well too.<br&gt;<br&gt;Entrees were amazing, especially the chicken marsala and salmon with herbs. <br&gt;<br&gt;We split the bill without any issues and took home some cheesecake slices for dessert. I&amp;#39;ve been to several locations but found this one to be so clean, and very communicative about food, waits, etc. Would definitely recommend.", "rating": 5, "date": "6/13/2019"}, {"text": "I really love this place and it&amp;#39;s one of my favorite restaurants because of the fresh grilled salmon dish I get every time I come and the complimentary bread that is second to none (I order ALL wheat bread)! The mediocre rating is because their only specialty is the cheesecake, so their menu covers a wide range of food styles (Italian, asian cuisine, seafood) with no exact specialty. With this, most of their food items are just okay and you&amp;#39;d be better off going to an Italian restaurant for pasta, etc. The amount of chicken they put in their pasta dishes and salads is simply deplorable and not worth the money. On the upside, you will definitely go and find at least one dish you love and that will be your favorite. I definitely recommend this place if you stay away from certain dishes.", "rating": 3, "date": "1/21/2018"}, {"text": "Our experience was beyond subpar. I wish that the servers amazing service was enough to give more stars, unfortunately the Manager at this location bumped this rating from a possible 4 star review to a complete 2. I accidentally ordered the wrong dish, I mistakenly ordered the Cajun Jambalaya pasta, I wanted the Gumbo. I let our server know, and she completely understood and exclaimed that she had to wait for the manager to take the dish. When her manager came over he was incredibly condescending, stating &amp;#34;you don&amp;#39;t know the difference between pasta and rice!!!!&amp;#34; Very rude. I explained to him that it was an easy mistake and I didn&amp;#39;t want the meal, I didn&amp;#39;t touch the food, I just want what I meant to order. He continued being rude before he inevitably took the plate. ALL HE HAD TO DO WAS TAKE THE PLATE, I wasn&amp;#39;t being rude, I explain my position politely. <br&gt;<br&gt;Also, we ordered 2 separate alcoholic beverages and they were basically diluted Juicy Juice. <br&gt;<br&gt;The manager, was a tall heavyset Caucasian male with glasses. Crude and condescending, his attitude is everything you&amp;#39;re not supposed to represent in the hospitality industry.", "rating": 2, "date": "9/7/2018"}, {"text": "I love the Cheesecake Factory! They do not take reservations, so if you plan on coming during a busy time, be prepared to wait a little bit. They give you a buzzer and the waiting area is large! I&amp;#39;ve been to this location many times, and overall the service is great. There were times it took a while for the food to come out, but it was busy and the kitchen was probably backed up! The managers were very kind and offered us complimentary cheesecake! My favorite meal here is the chicken and avocado sandwich! The bread is buttered and their is always so much chicken, bacon and avocado on the sandwich. The Cheesecake Factory does not skimp! With such a wide variety of options, there is certainly something for everyone!", "rating": 4, "date": "3/12/2019"}, {"text": "Can&amp;#39;t give them a 1 because the waitress tried starting it off the bathroom is horrible. Got our bread it was cold then the food my order came out wrong my nephew asked three people including the manager for ranch and everyone forgot my order the noodles taste like paste and were stuck together this is not the cheesecake standard that it&amp;#39;s suppose to be terrible disappointment.", "rating": 3, "date": "12/29/2018"}, {"text": "I&amp;#39;ve been to this location a few times, the service is usually pretty below average and the food is just not that good. TCF used to have a higher quality and you just knew when you were going to eat there that you would be having a good time. The past few times I&amp;#39;ve been to this location, the servers has treated me pretty poorly except the 1 time I was with my parents. It&amp;#39;s obvious they know who has the money and they can be willing to do anything to get that extra tip. I would say come here if you&amp;#39;re not a student/ have someone older with you. Then you&amp;#39;ll get the service you want!", "rating": 3, "date": "5/18/2019"}, {"text": "We picked up some cheesecakes to go and the server was considerate enough to let us know that a certain flavour was still frozen and needed to wait to thaw.", "rating": 4, "date": "7/6/2018"}, {"text": "I ordered Shepard&amp;#39;s pie as you can see in the picture. The worst Shepard&amp;#39;s pie ever. Felt like I&amp;#39;m eating a pile of grease. Very disappointing as this is a staple for Cheesecake Factory. Do not order here again ever.  The quality has drastically gone down. I will never eat here again. No coronary for me<br&gt;<br&gt;On a lighter note. I spoke to the manager  about my food. He was very gracious and apologized for the food and allowed me to order something else. I ordered an spinach, bacon omelette with toast instead.... the omelette was very good and I was happy. I appreciate the professionalism and the prompt action by the manager. Because of him we stayed and our experience was remediated. Thank you Mr. Manager.", "rating": 1, "date": "12/19/2017"}, {"text": "Ive been to cheesecake Factory so many times and it never fails me. The portions are beyond generous. The atmosphere is nice. I went during shift change and I must say the servers did a good job transitioning. The new server picked up where the other server left off smoothly. The service was amazing. And lets not forget about the cheesecake!!!!", "rating": 4, "date": "11/4/2018"}, {"text": "always super crowded and loud, rude hostesses.  run by children, basically.  ordered cheesecake online for curbside pickup, called 3 times in the 30 minutes that i sat and waited while the employees came outside and cussed and smoked by the dumpsters, while i had 3 kids in the car with me.  was told 3 times the cheesecake would be right out, never came, left, canceled order.  manager called the next day, apologized, said charge would be credited, gift card was in the mail.  neither has happened, it has been 14 business days, and i am not calling again.  will just dispute with credit card company.  won&amp;#39;t waste my time dealing with this crap again.  the cheesecake is delicious but not worth all of that", "rating": 1, "date": "7/31/2020"}, {"text": "Bunch here is great. That&amp;#39;s really all I eat from here other than the amazing cheesecake. This location is great and very popular, as it is always crowded. Sometimes, the wait can be pretty ridiculous. Service is pretty good. There have been a couple of times that I have had to send food back, which was disappointing. But, each time, the issue was corrected.", "rating": 3, "date": "7/19/2017"}, {"text": "I&amp;#39;ve been dining at the Cheesecake Factory for many years and I have noticed a consistent decline in both the quality of the food and the service. I dined at the Towson location earlier this week and the food was almost inedible. I sat at the bar and it took over 45 minutes to produce a burnt omelette accompanied by charred toast (without jam or butter) and room temperature potatoes. I requested siracha sauce which took another 10 minutes to arrive. I ordered bread upon arriving and I was told that they were out and that more would be coming shortly (this has happened each and every time I have eaten at this location in the last four years). The rolls did not arrive until I finished my meal. The man next to me at the bar made a remark that he didn&amp;#39;t even eat a portion of his dinner because he was waiting on dinner rolls. How long does it take to toss frozen bread in an oven? The menus were also incredibly sticky and I&amp;#39;m not convinced that they were being properly wiped down. The sanitation effort seemed minimal in light of COVID. It&amp;#39;s not worth the frustration, the price or the potential health hazard.", "rating": 1, "date": "7/31/2020"}, {"text": "We had the PERFECT dining experience here last night! Only had to wait 15 minutes for our table, excellent service and all three of us loved the food we ordered. <br&gt;<br&gt;I had the grilled pork chop with yummy mashed potatoes and sautéed green beans--delectable! A spoonful of homemade applesauce made it even better. My sister was in the middle of a cleanse and was able to find several salads that fit the bill. The restaurant&amp;#39;s iconic &amp;#34;book menu&amp;#34; now includes many more healthy salad options that included several &amp;#34;super foods&amp;#34;--Brussels sprouts, quinoa, kale, sunflower seeds, arugula , roasted beets and lots more. She added steak to her salad but there were a few other options (almond crusted salmon!) and enjoyed every bite.<br&gt;<br&gt;Our friend decided on a stir fried shrimp and chicken entree served in a sweet pineapple sauce over rice...she couldn&amp;#39;t even finish the large serving and was able to take half of it home for another meal. We decided against dessert, even though we were tempted...1500 calories for a single slice of their cheesecake was just too outrageous! <br&gt;<br&gt;Try the &amp;#34;new and improved&amp;#34; Cheesecake Factory. Your taste buds will thank you!", "rating": 5, "date": "2/17/2019"}, {"text": "I like the cheesecake factory, but I love the fact it was a first date location.   This visit I got a burger, because apparently all turkey in the place was not being served....no reason given, but I am guessing a recall.  The menu here, is expansive.....no....it is a BOOK.   There is something for EVERYONE.<br&gt;  The burger I had was medium rare, and it was perfectly cooked.    My love had a veggie burger, and she enjoyed it as well.   One thing was troublesome...    The first person who was our server was great.    Then there was shift change and no warning..... we had a new server.   The second server was ok, but it is good customer service to inform the customer , instead of doing the &amp;#34;server switch&amp;#34;, lol.", "rating": 4, "date": "11/4/2015"}, {"text": "Today&amp;#39;s bartender, who shall remain nameless was sarcastic and looked at me like I was crazy when I made a reasonable special request on our most recent visit 07-02-17 at 10am. I requested that my eggs be cooked hard/well done, like I do EVERY time. We are regular customers, so I know exactly what I want and how I want it. He stated &amp;#34;the consistency of eggs won&amp;#39;t get hard.&amp;#34;  What eggs does he eat? Bill Nye the Egg Guy. Annoying! He poured a very weak Typhoon for $11.50 and failed to order my potatoes. They were not served with my entrée. We will return, but if he&amp;#39;s bartending, we&amp;#39;ll sit elsewhere.<br&gt;*Four stars for the food and not the last dining experience.", "rating": 4, "date": "7/2/2017"}, {"text": "Normally Cheesecake Factory is my last minute go-to chain restaurant for family night, because the food and service are good. I&amp;#39;m giving two stars based on my recent experience ordering a cheesecake 4 hours prior to our scheduled pickup time. Our cake was still frozen completely. The manager working that evening was rude and unprofessional to say the least. After that experience I will not be returning to the Towson location.", "rating": 1, "date": "4/27/2019"}, {"text": "We dined on a Thursday afternoon. We were seated in the bar area. There were people seated at five of the other tables. We waited about 5-minutes before our server showed up and introduced herself, Jessye.<br&gt;Jessye was polite but a little soft spoken. <br&gt;We ordered water and the Thai Lettuce Wraps for our appetizer. Of course we were given our water right away.  It was a bit before our wraps arrived. <br&gt;Our server appeared to have vanished and it was a good ten minutes before she came back and took our entree order. We ordered Chicken Chipotle Pasta and the Veggie Burger. <br&gt;The wraps came with three different sauces. All 3 were tasty and the wraps were delicious. <br&gt;The Veggie Burger tasted bland but had nice consistency and great toppings, red onions, avocado, cucumbers cheese and lettuce. <br&gt;I thought the chicken had good flavor but was a bit over cooked. <br&gt;In typical CCF fashion our meal was filling. Sorry we didn&amp;#39;t have the capacity for cheesecake. <br&gt;Overall it was a decent dining experience. We would dine there again.", "rating": 3, "date": "4/19/2019"}, {"text": "I never have a bad experience here.  Despite the restaurant being corporate, they strive to train their employees to make each guest feel well taken care of like a regular customer.<br&gt;<br&gt;I recently went to the mall to exchange some make up at the Sephora.  I was starving and decided to sit at the bar for a quick bite to eat and a drink (or two).<br&gt;<br&gt;Joe C. took care of me and did a wonderful job.  He makes a mean margarita, and provided a nice, light, lunchtime banter with me as I sat and enjoyed my lunch.<br&gt;<br&gt;I ordered a glass of rose, a margarita, the Tex mex egg rolls, the Caesar salad, fried mac and cheese balls (to go), and fried chicken sliders (to go).<br&gt;<br&gt;Everyone from the food runners to the bussers were efficient, pleasant, and great.  I would go back next time I am at the Towson Town Center for sure.", "rating": 5, "date": "4/25/2017"}, {"text": "I have to preface this with the fact that I did not dine in here.  I really only wanted a piece of cheesecake.  With that being said, I was on a mission and right before I left here I thought I would stop in quickly and be on my way.  That turned out to be a fiasco.<br&gt;<br&gt;I walked in and walked right up to the cheesecake counter and looked at the cheesecake menu.  (Man, that&amp;#39;s too many cheesecakes in one sentence) After looking at the menu I had to wait several minutes to be noticed standing there.  Once I was noticed, I was ignored.  Finally I was asked what I wanted and then told it would be several minutes to get it because of the orders from the people dining in.  <br&gt;<br&gt;When I did finally get my order I was happy to finally pay and get out of there.  If looks could have killed in here, I probably wouldn&amp;#39;t have been walking out.  The person cutting and serving the cheesecake did not look like she was in a happy place.  In fact it looked as if she was in her own personal hell.", "rating": 3, "date": "11/6/2016"}, {"text": "My doctor told me to ingest gluten as part of a gluten challenge so yup! I was in there all too excited to eat the &amp;#34;chocolate&amp;#34; bread according to doctors orders. I did and totally broke out but that&amp;#39;s ok. That chocolates bread is divine. Drinks are always great. Had the tuna tartar which could&amp;#39;ve been a little better but I think that&amp;#39;s because I&amp;#39;m used to how they made it in NY. Either way a good clean spot that gives you the quality and service that the CF is known for.", "rating": 4, "date": "4/19/2018"}, {"text": "I ordered a Cobb salad that wasn&amp;#39;t satisfying at all. No eggs and bad greens with it which was lettuce instead of mix greens like the menu express. The waiter never mentioned they were out of ingredients to give me option to change my order. And also my cheesecake whip cream was very watery and not flavorful like in the past. Customer service was poorly as well. I will never come back to this location again for lunch. Very disappointed", "rating": 1, "date": "10/17/2019"}, {"text": "Every time I come to Cheesecake I always get the Louisiana Chicken Pasta because it&amp;#39;s SO GOOD! It has bowtie pasta, peppers, onions, mushrooms in a creamy sauce, with fried chicken on top. It also has a spice sprinkled on top that reminds me of old bay. The portions are huge, and they have lunch prices available until 5 PM! I always have leftovers that I need to box up and save for the next day. My only complaint about the pasta is that whenever I reheat it, there&amp;#39;s always TONS of oil. Other than that, the pasta is always fantastic. I have noticed that the chicken portions have gotten smaller, which is unfortunate, but I will continue ordering this pasta dish because I love it so much!", "rating": 4, "date": "4/17/2018"}, {"text": "Every time I come to this Cheesecake Factory, the wait is an hour or longer. This is ridiculous. I love Cheesecake Factory but I will not be coming to this one again.  People come in after us and get seated. Management and hostesses are rude.", "rating": 1, "date": "4/27/2019"}, {"text": "This was a very disappointing experience.  Monday night, restaurant not crowded.  We waited for a long time for our entries.  I ordered the angel hair pasta with shrimp.  It tasted like it had been seating under the hot light for a good while.  This particular entree is $19.95 and it was not worth the price.  Do not recommend this place.", "rating": 1, "date": "11/18/2019"}, {"text": "Good food, sloppy service. On my most recent visit, here is the order the food came out:<br&gt;1) entrees<br&gt;2) bread<br&gt;3) soup<br&gt;4) butter for the bread<br&gt;5) appetizer<br&gt;<br&gt;The waiter kept apologizing, but never worked her way out of the fluster, and things kept going wrong. Way too many things on the table; didn&amp;#39;t get to eat the appetizer until last because I couldn&amp;#39;t maneuver over my huge entree salad. <br&gt;<br&gt;Also, the bus boy who kept cleaning the adjacent tables had a massive quantity of cologne on, which severely decreased the already limited enjoyment I was getting from my awkward meal. The waiter also took our check away before we had even paid, which made things even more awk. The food was good as usual, but the service was a big mess. Also, there was a super annoying loud talker sitting next to me and reading every menu item and description out loud, but I guess that&amp;#39;s not their fault.", "rating": 3, "date": "8/30/2014"}, {"text": "Its probably called the cheese cake factory for a reason. I had pancakes chicken and waffles and scrambled eggs with hollandaise sauce. It was ok didn&amp;#39;t really leave a big impression in the tastebuds but I do like to be fair and try this place a couple more times to really have a just opinion about it. This experience I had here this time was mediocre at best. They did take a while to bring the food out and the syrup made my mouths dry. Idk it could have been me very I&amp;#39;m thinking having brunch here isn&amp;#39;t he best idea to go with.", "rating": 3, "date": "12/19/2017"}, {"text": "I&amp;#39;ve only been here twice now and my very first experience was amazing! Everything that I ordered tasted delicious . I ordered their strawberry lemonade, Korean fried cauliflower, fish and chips, I used sweet potato cut fries instead. Everything tasted fantastic and this is definitely a go to spot.<br&gt;<br&gt;Their prices are reasonable. For four people we paid $90. But the service &amp;amp; quality was great.", "rating": 5, "date": "1/11/2018"}, {"text": "Two of us went to catch up. I ordered the skinnylicious lemon garlic shrimp. Its was the perfect portion given the fact that i was still going to order cheesecake. I wanted pasta but the pasta portions are enough for 3 meals. The entree was yummy! It had nice size shrimp linguine pasta and asparagus. Afterwards i ordered my favorite - the tiramisu cheesecake - delicious as always! <br&gt;<br&gt;The waitresses changed shifts midway but they were both great!!!", "rating": 5, "date": "1/21/2018"}, {"text": "This particular trip to Cheesecake Factory was interesting. I tried the the honey truffle chicken and I was unimpressed. The flavor was pretty bland. I sent it back. I ordered the Crispy Chicken Pineapple and Shrimp. That was delicious. The others in my group sent their food back as well. We had an issue getting things brought to the table and having items cleared. One thing that was a little different was the drink refills. The server informed us that she doesn&amp;#39;t change the glasses because it&amp;#39;s a lot of work for the bartender. I&amp;#39;d never heard that before. Overall it wasn&amp;#39;t the best experience but it wasn&amp;#39;t the worst.", "rating": 3, "date": "3/10/2018"}, {"text": "I don&amp;#39;t really know how to review this location because I come here so much, and sometimes it&amp;#39;s great while other times it is dreadful... So I&amp;#39;m gonna meet them half way with a 3 star review...<br&gt;<br&gt;First of all, I absolutely love their happy hour menu items! All apps are five dollars and selected drinks are five dollars as well! I love to go with my boyfriend have a couple margaritas and nachos and just relax. <br&gt;<br&gt;The service is definitely hit or miss! You can tell they no longer really hold their staff to the high service qualities they once did! You once would get a nice greet from the server who would break down things for you. Now you get more of a what&amp;#39;s up welcome to cheesecake what do you want to drink? That&amp;#39;s really sad because their service is one thing about the company I always loved! I&amp;#39;m here about 3-4 times a month and 3-4 times a month I get different service.... <br&gt;<br&gt;The bartenders.... There is only one I have encountered named Aja who is amazing, bubbly and friendly! If I see her at the bar I most definitely will sit there. Aside from her the other bartenders I have had are a bit dry and non personable....so I don&amp;#39;t sit there unless Aja is working.<br&gt;<br&gt;The servers- man have they changed... Bare minimum service, not as friendly and social and knowledgable as they once were... I came across one I really liked and I will request him from now on...<br&gt;<br&gt;The management.... Oh the management.... Very sad from the beginning days of when they opened.... These managers look underdressed, disheveled and not very personable. One lady dropped my food off, she clearly was a manager. She just dropped food off and left!!!! I mean what a perfect opportunity to indulge the guest when you drop food off to them! All you have to do is smile and say hello and ask how everything is? Ask what brought us in... I mean something.... We received non of that.... But hey if the owners are ok with the store managers operating like that, who am I to say anything...<br&gt;<br&gt;The drinks, I love my margarita I get there... Aside from that I only order wine from their bar. The bartenders are trained to count liquor and never over pour or hook a drink up.... So what you get is a 1.25 ounce pour in your mixed drink... For those of you who don&amp;#39;t know ounces it&amp;#39;s not even enough to really taste in a vodka and cranberry for example.... Their drinks are rediculously OVER priced for the little amount of alcohol they do pour! So I recommend beer and wine unless it&amp;#39;s happy hour... Then I would order some of their mixed drinks just to try....<br&gt;<br&gt;The dessert, I have nothing bad to say their desserts are on point!!!!!!! However the bakery where you order Togo cheesecake, those attendants are not friendly, polite, or moderately personable! They are some of the most cold shouldered employees I have ever met. Hence why I do not order from them very often. I normally just order through my server or bartender.... <br&gt;<br&gt;I do really enjoy their food and desserts and drinks. I just don&amp;#39;t always enjoy my service... I wish they would go back to their old ways and teach these servers what being a waiter is all about....", "rating": 3, "date": "3/15/2016"}, {"text": "6/1/18 while visiting from out of town my young server help me pick the perfect lunch. She was very polite and patient due to the fact I was unsure what I wanted for lunch that day. Atmosphere was very quiet and facility was very clean. The cheesecake is still the highlight of my meal and will remain my favorite part of coming to the restaurant!", "rating": 5, "date": "6/7/2018"}, {"text": "Why even go to this place that they call a restaurant. The food is horrible and the service is even worse all the way from management down to the porter.", "rating": 1, "date": "1/4/2019"}, {"text": "If I could a zero stars I would. The manager Brian complete and utter a-hole. My family and I came to resturaunt with a party of 20 to celebrate my nephew&amp;#39;s send off to college. The resturaunt was notified the day prior and reminded the day of the arrival of the party at 7:00pm. Brian who is anything but helpful was extremely rude and seemingly did not want to even attempt to accommodate seating the party. He brushed my nephew off by telling him that it would be a 2 1/2 hour wait without even scanning the restaurant to see if there was any way we could be seated sooner. Thankfully for the resturaunt chain they hire hostesses with GREAT CUSTOMER SERVICE, DECENCY, and CLASS because ERICA went abound and beyond to assist us after witnessing her manager with a complete DISMISSAL of our party. I&amp;#39;m not sure if it is a racial issue that this man had or if he was having a bad day but either way this piece of  of a manger can learn a lot from Erica proper display of customer service. Brian is a disgrace to the Cheesecake Factory brand and is clearly DISCRIMINATORY in how he treats customers patronizing this establishment. I would NOT recommend coming here if you aren&amp;#39;t the same race as Brian because he will hand you his a** to kiss", "rating": 1, "date": "8/16/2019"}, {"text": "Vegetarian review: I usually get the Evelyn Pasta if I come here. Very simple dish with simple garlic and oil sauce  (dairy free). My last visit I ordered the Impossible burger, new item on the menu. So it totally tastes like meat. The cut was a little too thick for me. Not bad though. Im not sure about the bun but the special sauce contains mayo. Just FYI if you&amp;#39;re vegan. The Asian cauliflower bites were good but a little sweet. The vegan cobb salad was just ok.", "rating": 3, "date": "10/30/2018"}, {"text": "Ok so I get that you were busted for serving under age people, but refusing to serve alcohol for a government issued vertical ID is just plain rude. The manger on duty was a jerk about it too and unapologetic. It was a valid US license that everyone accepts except Cheesecake Factory apparently.", "rating": 1, "date": "7/26/2018"}, {"text": "Cheesecake Factory is hands down 5 stars and this location is great! The servers are super good and it&amp;#39;s big, roomy and has great food always. Sometimes the dishes are a little different every time you order. Also there is a obscene curfew for teenagers. There is a bar area and they do a good job of keeping tables private within the large space. Yummy yummy food of course and great for big group!!!", "rating": 4, "date": "9/29/2019"}, {"text": "yesterday i went to the cheesecake factory to enjoy the company of my friends and some delicious food. sadly, my last expectation was not met. Upon entering the restaurant I had hoped to be assisted by one of this establishment&amp;#39;s lovely waiters/waitresses. Unfortunately, my friends and I had to wait and especially long time to do so. We had to wait SO long to the point where we took recreation in counting exactly how many minutes would pass before we were assisted. I wish I could tell you about how exactly long we had to wait but I lost count after 40 minutes. Upon being visited by the waitress we gave our orders and we were told that in the meantime while we waited for our drinks and entrees to be prepared; we would be given the restaurant&amp;#39;s supplemental bread dish to enjoy before our food was ready. Well, as soon as we got the bread we were met with the absolute displeasure of finding a thick disgusting, repulsive wad of pre-chewed gum on our bread. Of course we were not made aware of the fact that the bread was going to come with pre chewed bread and inquired whether or not we would have to pay extra for the additional gum piece. We were not given an explanation. But seeing as we were famished and how nowhere else to go we decided to abstain from consuming the bread and hoped that there would not be anymore surprise additional gum pieces emerging on any of our food. I have included below a picture of the gum which appeared on our bread for your viewing pleasure. Overall, our time here has been a horrible experience and though we decided to ignore the shortcomings of this venture. We will not be returning to this establishment. This might be by far the worst dining experience at a Chesapeake Cheesecake Factory franchise that I will ever have the dissatisfaction of experiencing. The only reason that this establishment is even receiving one star is because every meal for the rest of my life will now be better by comparison. If in the Maryland area, stay away from this place! Sincerely, a law student who doesn&amp;#39;t like being screwed over by bratty corporations and waitresses.", "rating": 1, "date": "3/4/2020"}, {"text": "Choose another place to eat...... We had reservations for 7 PM and waited two hours to be seated and after two (2) hours of excuses from the wait-staff and management, we left the restaurant.<br&gt;<br&gt; We will never go there again and we will tell everyone we know about this experience.", "rating": 1, "date": "3/2/2019"}, {"text": "Don&amp;#39;t do pickup option! I order food that was suppose to be ready 10:11, it took 30 more minutes. When my fiance went to pick it up they ignored him. Bad service.", "rating": 2, "date": "7/30/2019"}, {"text": "Great food! Located next to Sheraton where I am staying and has the nicest stores in the mall: LV, Burberry, Tiffany, Cartier etc. staff is very nice as well. Always love cheesecake decor", "rating": 5, "date": "10/24/2017"}, {"text": "I ordered a carry-out meal on Feb. 13. Arrived at restaurant. They had a power outage, so my order could not be made, obviously.<br&gt;<br&gt;Was willing to wait for refund. Manager assured me he would clear out the charge when the computers booted up so I wouldn&amp;#39;t have to wait. <br&gt;<br&gt;So I left. Problem being, they never removed the charge for my meal on card.<br&gt;<br&gt;Called one week later. Talked to the business manager after being left on hold for 10 minutes. She couldn&amp;#39;t help me.<br&gt;<br&gt;So I&amp;#39;m still being charged for food I did not receive. They couldn&amp;#39;t control the power outage. But they could control charging a customer for food they could not prepare.", "rating": 1, "date": "3/3/2018"}, {"text": "I am sad to say I was disappointed in the service. While our waiter was great the kitchen was extremely slow. I ordered a chicken parmesan sandwich but for some reason it came out drenched in some sort of pesto basil oil. The menu only said it came with marinara sauce on it. I was informed it was a recent change to the preparation but why isn&amp;#39;t that listed on the menu as such or why wasn&amp;#39;t I told? It then took the kitchen about 17 minutes to get a newly made sandwich out as my family was already done eating when it did. The server was kind about the situation but ultimately it boils down to the kitchen, when a mistake is made it should be top priority of the kitchen to remake the meal. Then it took about 15 minutes for a piece of cheesecake to get to us after we ordered it when we were all ready to leave. Not to mention we got no discount on the bill for the mistake with my order. Another point too is that appetizers are extremely over priced. We ordered a pretzel appetizer one time and only got a few pretzels and it was $12! Not to mention a small appetizer Cesar salad is $13. Lastly, I have to point out that the waiting area is way too small for the amount of costumers, I couldn&amp;#39;t imagine going on a Saturday night. So overall yes I would recommend this location but you should really confirm with the server that what you are ordering is what you are getting as it is listed on the menu.", "rating": 2, "date": "2/16/2020"}, {"text": "This Cheesecake location is solid. The wait staff is pleasant and the food is what you can expect from a Cheesecake Factory. The host staff&amp;#39;s attitudes can be a little 50/50, but they do what they can with the hoards of people that eat here.", "rating": 4, "date": "8/3/2017"}, {"text": "This is one of my favorite restaurants. My last visit went very well, our server was very attentive and recommended a lot and knew the menu well. Our food took a little while to come out but we went on a Friday night so I can understand a delay. My own bad thing was my chocolate cake came out cold so I did not want to eat a ice cold piece of cake and had to take it home.", "rating": 4, "date": "8/1/2019"}, {"text": "Towson&amp;#39;s Cheesecake Factory is just like any other. The wait can get very long but you always get the quality food that&amp;#39;s a little over priced, but you know you&amp;#39;re going to spend that much when you go to Cheesecake. <br&gt;When I&amp;#39;ve ordered cheesecake from the bakery area, it&amp;#39;s always been crowded and the wait for just one or two pieces of cheesecake can get a little long. The workers are usually pretty frantic and working as hard as they can so its not really their fault. But definitely think the management should figure out how to speed up the process.", "rating": 4, "date": "10/23/2015"}, {"text": "So it&amp;#39;s honestly been about 15 years since I&amp;#39;ve eaten in a Cheesecake Factory and I wasn&amp;#39;t a huge fan back then. My recent visit to this location didn&amp;#39;t do much to change my mind. I don&amp;#39;t think it&amp;#39;s anything I can really put my finger on, but I&amp;#39;m just not as impressed as others.<br&gt;<br&gt;We arrived on a a Sunday - early afternoon and we&amp;#39;re told it would be 15-20 minutes...40 minutes later we were seated...another 10 before we were asked about drinks and another 10 before we got the drinks...so an HOUR after we walked in the door we got our drinks.  I get it, you&amp;#39;re busy, but you are ALWAYS busy...have enough people working!<br&gt;<br&gt;So the food itself was pretty good.  My daughter really liked her fish and chips and Cesar salad not the best she had, but she liked it.  My sine thought his chicken parm sandwich on french garlic bread WAS one of the tastiest he&amp;#39;s had...and he swears it was the garlic bread.  <br&gt;<br&gt;My wife wasn&amp;#39;t that hungry so she just ordered a house salad and a white chicken chili. She enjoyed it and said it was very flavorful and savory and just the right amlint...though she would have preferred it a bit spicier.  I tried the fish tacos wanted to have two grilled and two fried, but apparently that&amp;#39;s impossible so I got all four fried. They were very good, as were the black beans.  We finished the meal with a slice of a chocolate cheesecake, which was very good, but not as good as Mom&amp;#39;s. <br&gt;<br&gt;So the service wasn&amp;#39;t great...but I don&amp;#39;t blame my server-side was just too busy and wasn&amp;#39;t getting help from the bar or kitchen.  I&amp;#39;ve always thought Cheesecake Factory just tries to be too much...menu is huge and I don&amp;#39;t think you can have superior food when you are trying to do so many different meals.", "rating": 3, "date": "4/9/2015"}, {"text": "I had an issue with multiple members of the rude curbside team  at 9:10pm on 2/16/19 it took three calls and five different people to attempt to place the order I then arrived and they had failed to submit my order nor did they come out when I called to alert them of my arrival, so I called and asked for the manager. The manager Chris sprung into action and promptly &amp;amp; politely came out in less than 2min and personally re-took my order, he then expedited it and hand delivered the hot meal curbside in a few short minutes. Chris was empathetic and provided outstanding service making sure my concerns were remedied before I left the restaurant!. Kudos to Chris for the top notch service and my stellar experience with Manager Chris will be the sole reason I come back to the Towson Cheesecake Factory!.", "rating": 5, "date": "2/16/2019"}, {"text": "Today my girlfriend and I came here to grab something quick to eat.  She ordered a pasta dish. I ordered the chicken and shrimp gumbo.  My food came out amazing, her&amp;#39;s not so much.  However,  our waiter Wade and the manager Lafonte went above and beyond to make our experience memorable and much better.  I recommend asking for them whenever you go.", "rating": 4, "date": "11/10/2018"}, {"text": "I have had a large variety from the Cheesecake Factory in Towson. Sliders, pasta carbonara, loaded potatoes, mac and cheese balls, edamame, etc, as well as dabbling in my fair share of cheesecakes. I love Cheesecake Factory and I talk about coming here whenever the opportunity presents itself. The food is rich and the portions are huge and worth the expense. You will go home not only satisfied once but satisfied twice as you will most likely have leftovers. <br&gt;This is a nice location although if it&amp;#39;s possible to go to the one at the inner harbor, it is worth going as it is beautiful, spacious, and has great service! The outdoor seating in Towson is noisy but still pretty. Both locations are great for dates, parties/gatherings, or just hanging out. <br&gt;I will say that they definitely skimp out on cheesecake when it is for take out. I was given a sliver from Towson for the same price as dining in. Not cool. Would rather dine in, just order cheesecake, and take it home.", "rating": 4, "date": "11/29/2015"}, {"text": "It was ok. I went for the impossible burger, which they were out of. I&amp;#39;m happy it&amp;#39;s selling well but they should probably keep a lot on hand as they don&amp;#39;t have a lot of vegan options. Our server was nice but it just felt dingy.", "rating": 2, "date": "9/16/2018"}, {"text": "Off to a slowwwww start here. We like the food , been here before but the service is not fast!!! 10 minutes and still no drink, that&amp;#39;s poor service!!! The worst part is, the station is next to our table. So he finally has a drink for us but it&amp;#39;s water, we ordered tea! <br&gt;<br&gt;Back again and Phil did a great job with service!!!! The food is always fabulous!!!", "rating": 4, "date": "10/16/2018"}, {"text": "I&amp;#39;m giving two stars becouse this place was just that bad. The menu is huge, don&amp;#39;t know the exact number but around 14 pages long. I ended up choosing the chicken crusted Romano ($17). While waiting on my food, i also had to wait on my drink to be refilled, for at least 5 to 10 minutes as many a waitress and waiter passed by it sat empty. Finally I had to stop a waitress passing by in order to get my drink refilled.<br&gt;<br&gt;This was a Tuesday night, with no wait to be seated mind you, so no legit reason for anything to be taking so long. <br&gt;<br&gt;When our food arrived, my noodles where under cooked and the chicken.... well for $17, when you order what is essentially chicken parmesan, you picture a real piece of chicken and fully cooked noodles. The chicken was more of a McDonald&amp;#39;s nugget style. Not real chicken, more like mashed meat, formed and shaped into a flat piece of meat with a crust on it. Not at all what $17 Should have gotten me.<br&gt;<br&gt;The drink I ordered was a long island iced tea. Which is 90% alcohol. Not this drink, 10% alcohol max. It was so watered down it tasted more along the lines of a soda than an alcoholic beverage, and they cost over $11 to boot.<br&gt;<br&gt;The service was extremely slow. Literraly over 10 minutes just for the waitress to get the check and bring it back. Unreal.<br&gt;<br&gt;End of story, I will NOT be coming back to this place ever again, and with so many other options nearby, why would anyone want to come here?", "rating": 1, "date": "10/4/2017"}, {"text": "This is our first time at Cheesecake Factory in Towson, MD, came here with boyfriend to get appetizers: wings, tex-mex egg rolls and cream of mushroom soup. There was not a wait which is always great therefore we were seated immediately. Our waitress was kind and attentive. Sadly cream of mushroom soup was not on the menu that night (few nights ago I believe Wednesday). The tex-mex egg-rolls were overly saturated in grease so we couldn&amp;#39;t eat those, just had our waitress throw them out. They were paid for. The wings were good- they always are. We also tried for the first time pulled pork sliders which boyfriend obsessed over, ended up ordering another. Overall things were good. Thanks for having us!", "rating": 3, "date": "8/26/2018"}, {"text": "We are regulars and the kitchen was off tonight my. Sauces were bland and threw off the taste of everything. Bread was stale and kitchen didn&amp;#39;t seem to care quality was off. Hopefully this was a one night incident because we really enjoyed meals here preciously. Server Ace was ok. Only problem he was defending the poor sauces. Ended up taking food to go. The dining experience was not great. :(", "rating": 2, "date": "4/11/2017"}, {"text": "Ugh I love Cheesecake Factory. I go there periodically and I honestly am never disappointed. Always good food and good staff.", "rating": 4, "date": "7/13/2018"}, {"text": "Extremely disappointed in my visit ONCE again. The last time i came here i avoided writing a nasty review because people make mistakes, but once again the disrespectful, uneducated staff had the audacity to be rude with us. The first time, i asked nicely where the bread was since I had been at my table for 24 mins and the MANAGER told me that &amp;#34;they had none and when they did we&amp;#39;ll get it so be patient&amp;#34; and walked away with anger on his face..... id be happy to be patient if you didn&amp;#39;t talk to me that way as a manager, who is hired to be an upper hand member of the staff. Today (10/15) i was yelled by the lady who cuts cheesecakes at front for 1) not stepping aside and 2) because I asking where my slice was after i had paid for it and waited over 10 mins to be served a READY piece of cake. <br&gt;<br&gt;To cheesecake factory: maybe you should reconsider who your hiring when you do so since your staff all seems to be so unmannered and dead in the head. RULE OF THUMB : TREAT YOUR GUESTS WITH RESPECT AND MAKE THEM FEEL WELCOMED!!!!", "rating": 1, "date": "10/15/2017"}, {"text": "Over the years the Cheesecake Factory has become one my least favorite restaurants to dine at. Since I was in the area, I decided to give them another try. After this visit, my mind has not changed. I never understood why the lighting is so dim that you can barely read the menu and see your entree when served. The menu items serving size has become smaller and the cost larger. I ordered the explosive shrimp that wasn&amp;#39;t bad. The fried shrimp was bland, no taste. The dipping sauce had all the flavoring. I guess that is what makes the shrimp explosive. For my entree I ordered the grilled salmon. The presentation of my entree was nice. I was disappointed when I tasted the salmon...it was dried out. My steamed veggies had no seasoning &amp;amp; were hard. The mashed potatoes were the only thing that wasn&amp;#39;t bad on my plate.", "rating": 3, "date": "6/7/2018"}, {"text": "I ordered a cobb salad.. It came but I wanted different chicken so u asked the server to please instead of chicken breast I just wanted grilled chicken...they put lunch meat on the cobb salad!!!! Not grilled as described...i know I&amp;#39;m not at a fancy place but at least be honest with the description..also the bread came out stiff but slightly warm‍ this place needs new servers because they aren&amp;#39;t the best..last time I came and I was satisfied but this might maybe wasn&amp;#39;t the best but it will be the last and then I went to speak with the manager and AL he did was make excuses &amp;#34;Uh Uh sorry..I understand&amp;#34; yeah typical read from a manual of &amp;#34; what to say when a customer is upset&amp;#34; I didn&amp;#39;t bother..still hungry and pissed..the manager &amp;#34;Brian&amp;#34; said &amp;#34;your not the only person were cooking for so the chicken takes long&amp;#34; actually it doesn&amp;#39;t..your cooking gmo chicken that can be warmed up and grilled in 5 min..your server was being a dick and so we&amp;#39;re u sir but due to the average stars this place gets. Its no shocker..GROSS", "rating": 2, "date": "4/4/2018"}, {"text": "After walking the huge mall we decided to take a load off and eat here. It was an early time and although a Saturday I didn&amp;#39;t think it would be too hard. The wait was about 5 minutes. <br&gt;<br&gt;I asked for a GF menu, the hostess said that it is now a part of the regular menu - which is nice! I know how large their menu is but it&amp;#39;s nice to see that some can be modified for my GF diet. We were placed in a 2-top near the bar. <br&gt;<br&gt;When we sat down, I got up to use the restroom. Told my girlfriend to order me a water. Came out of the restroom, she hadn&amp;#39;t arrived yet. 15 minutes later, still nothing. I told her I&amp;#39;d say something in 2 minutes but by then someone had popped over. We had picked what we wanted to order, so when she said &amp;#34;let me get you rdrinks&amp;#34; I said &amp;#34;no, we can order.&amp;#34; I didn&amp;#39;t want to lose her again! I ordered the chopped salad - gluten free. Dressing on the side. <br&gt;<br&gt;We waited 35 minutes for our salads. I never saw the waitress again. When someone else brought me my salad, it looked great and I said... &amp;#34;Actually I got dressing on the side, is there already dressing on it?&amp;#34; She said &amp;#34;No. But you got gluten free... and the only GF dressing we have is oil and vinegar.&amp;#34; <br&gt;<br&gt;...to which I replied... &amp;#34;Then...can I have that?&amp;#34; <br&gt;<br&gt;Ugh it was just a frustrating experience. There was a huge wait when we left. I&amp;#39;m a former server so I feel the pain of a busy Saturday lunch crowd but come on. It&amp;#39;s Cheesecake Factory, you&amp;#39;re always busy. Our waitress was nice, but neglectful. It wasn&amp;#39;t a nice experience. The food was good, but that&amp;#39;s all.", "rating": 2, "date": "9/15/2014"}, {"text": "I am in love with the firecracker salmon appetizers. I sat at the bar having drinks, chatting people up, and talking to the bartenders for a smooth 3 hours.  The kitchen was a bit slow with getting meals out; however, it was exceptionally busy (there was a wait to be seating in the main dining area).  The drinks were delicious and well made and I especially enjoy the dirty martinis and sangria here.  I&amp;#39;ll definitely be back to treat myself to a nice dinner and drinks again.", "rating": 5, "date": "12/15/2016"}, {"text": "Overall, it was very nice. <br&gt;<br&gt;Pros:<br&gt;The staff was friendly and attentive. <br&gt;The food was excellent.<br&gt;Call me Capitan Obvious, but the lemon cheesecake was outstanding. <br&gt;<br&gt;Con:<br&gt;It&amp;#39;s too dark in there. I couldn&amp;#39;t read the menu without using the flashlight function on my phone.", "rating": 4, "date": "10/8/2017"}, {"text": "Love love love the Cheesecake Factory-especially Towson&amp;#39;s!<br&gt;<br&gt;Whenever my friend is in town we make the drive down to Towson for some shopping and cheesecake.  We&amp;#39;ve never had a long wait and have always had excellent service and food!  This past trip our waitress was Carol (I hope I&amp;#39;ve spelled it right!)-officially one of my favorite people.  She was so sweet and absolutely hilarious.  We loved finding out that she&amp;#39;s from York too!  She made sure our trip was worth it.  Carol, we love you and hope you&amp;#39;re working next time we&amp;#39;re in Towson!<br&gt;<br&gt;On a more &amp;#34;Yelp review&amp;#34; note, I have never had a poor experience at this location.  The food and drinks are always done well.  I highly recommend the Fried Macaroni and Cheese appetizer, the Hershey&amp;#39;s cheesecake, Mango Key Lime cheesecake, or the Kahlua Cocoa Coffee cheesecake for dessert, and my new favorite, the Caribbean Cooler for a drink.  It is one of the tastiest blended drinks I&amp;#39;ve ever had.  At first I thought it was a virgin, but then again, the drink is better when you can&amp;#39;t taste the alcohol right? ;)<br&gt;<br&gt;I always have luck parking in the garage right by the restaurant.  If you&amp;#39;r driving down Dulaney Valley from the I83 side, turn left right before the mall and you&amp;#39;ll find a garage that also offers valet parking.", "rating": 5, "date": "7/17/2016"}, {"text": "I had a good experience at this restaurant! Vincent our waiter was very good and funny! Would totally recommend!", "rating": 5, "date": "7/28/2018"}, {"text": "We were a party of 20. It&amp;#39;s an hour+ wait but Chris, the manager, came over personally to provide time/table updates. We were made to sit, wait and wonder into oblivion. We&amp;#39;ll remember TCF the next time, the next kid joins the US ARMY. Thanks Chris", "rating": 4, "date": "4/22/2018"}, {"text": "Always a good meal here with incredible cheesecakes. Good food carries the place because the menu is dreadfully long, and plating is horrendous.", "rating": 4, "date": "5/27/2018"}, {"text": "This place is always busy, but it is so worth the wait. You will find a ton of options on the menu here. I have never ordered the same entree twice and everything has always been delicious. On my last visit I ordered a chopped salad from the Skinnylicious menu which was excellent. It had a delicious dressing, grilled chicken, bacon, avocado, corn, tomatoes, etc. The portion size was perfect; about half the size of one ordered from the standard menu. Those salads are huge. I can never finish them and I think leftover salads are just gross, so i liked this better. If you order any entrees from the standard menu prepare to have leftovers. Of course the cheesecakes here are fantastic, too. My favorite is the Pineapple Upside Down cake. I have also had the Hershey&amp;#39;s chocolate cheesecake and the Red Velvet. <br&gt;<br&gt;The Cheesecake Factory is, in my opinion, the best option for eating at the Towson Town Center.", "rating": 4, "date": "1/30/2015"}, {"text": "Standard Cheesecake Factory menu. Staff is friendly but slow with service. Food tastes great and prices are reasonable.", "rating": 4, "date": "2/24/2018"}, {"text": "At this point, if you haven&amp;#39;t been to a Cheesecake Factory, you need to boost your social life! I&amp;#39;ve been to this location many times, so here is my all inclusive review:<br&gt;<br&gt;Things I Like:<br&gt;- Without question, the most robust menu in all of restaurantland. They have EVERYTHING, aaaaand they launched a &amp;#34;skinny&amp;#34; menu. <br&gt;- Full bar with creative specialty drinks.<br&gt;- Ridiculous amount of fun choices for cheesecake/dessert. Can&amp;#39;t go wrong with any of it.<br&gt;- Most importantly, they might have THE BEST WAITSTAFF SERVICE in the county. Management there has done a great job creating a culture that spoils it&amp;#39;s guests.<br&gt;<br&gt;Things I Don&amp;#39;t Like: <br&gt;- Prices are taller than usual chain restaurant, and quantities match. While paying a little extra is sometimes necessary to have better food, I feel the overbearing quantities that go to waste are what I am actually paying for. But some fans of Cheesecake Factory really value this aspect.<br&gt;- MAKING YOUR CUSTOMERS WAIT. On a Friday or Saturday night you will arrive and wait for a table between 45 minutes to an hour. A whole blob of impatient and hungry people get blinking vibrators to taunt them as they wait I a &amp;#34;holding pen&amp;#34; type if area. This is awful. CF doesn&amp;#39;t take reservations. This is kind of lame. I no longer go to this restaurant on hose nights, and I go less often overall.<br&gt;<br&gt;In conclusion, any other day of the week besides Friday/Saturday, this place is great. I have them 4 stars. To earn 5, they need to take better care of their guests and establish a reservation system that eliminates abusive waiting experiences.", "rating": 4, "date": "4/18/2014"}, {"text": "The service was okay but not exemplary. My food was less than okay and I am not a happy camper. How do you mess up an omelette I&amp;#39;m not really sure. As soon as it came out I knew it was going to be gross. Even the presentation wasn&amp;#39;t good. Also did I mention how spongey my eggs were. Kind of reminded me off the carton eggs they give you at a complimentary breakfast. That&amp;#39;s exactly why I sent these back. They needed to be complimentary.", "rating": 1, "date": "3/31/2017"}, {"text": "I really don&amp;#39;t eat at a lot of chain restaurants and here is the reason why. I ordered a Strawberry Shake with Vodka and received a dirty strawberry and the dirt fell into the shake. The server told me it&amp;#39;s not dirt. Ok well what is it then? Yelpers you be the judge.", "rating": 1, "date": "3/31/2018"}, {"text": "The wait is the usual 30 or so minutes. Food is delicious! On a recent trip, my friend&amp;#39;s daughter lost her tooth during the meal--the manager played Tooth Fairy and gave her a dollar bill! How nice.<br&gt;Always pleased with the quality of food.", "rating": 4, "date": "7/1/2018"}, {"text": "I&amp;#39;ve been to the Cheesecake factory 3 times now. Once was with a friend at the Inner harbor and the other two times were with friends at the Towson location. The menu is very large and usually takes us a bit to decide on what to get. My favorite item is the Cobb salad. Its enough for two meals. Fresh crisp lettuce with chicken, avocado, egg, cheese and plenty more toppings. I have them toss it with blue cheese dressing since I&amp;#39;m not a fan of other dressings. I also enjoy the mojitos. They have the traditional flavor or you can mix it up with some fruit. I recommend the passion fruit. I&amp;#39;m not very adventurous when it comes to cheesecake flavors so the two slices I&amp;#39;ve had were good but nothing to brag about. <br&gt;<br&gt;This place is always packed. So be prepared to wait. To kill time while waiting we decided to walk around the mall and see all the stores Towson town center had to offer. The prices of most things are average.", "rating": 3, "date": "1/30/2015"}, {"text": "I know, I know people love this place. Frankly, I feel that it is very over done. Way too much food and not like it is a bargain, they sure charge you for it. Maybe this is a great business model, and it sure seems to be but I think this is the Golden Corral for the upper middles.<br&gt;<br&gt;They food was good, not great. The wine selection was a quaffer&amp;#39;s delight (nothing noteworthy), service was adequate and the atmosphere could only be described as cacophonous. I could not hear myself think. I&amp;#39;ll only go here if everyone else wants.", "rating": 3, "date": "10/18/2014"}, {"text": "The service is extremely poor, my food came out cold but the plate was extremely hot so it had obviously been sitting under a heat lamp, put in an order for a drink from the bar (which was not busy at the time as we were seated right next to it), 20 minutes later I asked our server where my drink was and she tells me she forgot to put it in. Over all poor service for a dinner that pricey. Will never go back.", "rating": 1, "date": "4/6/2019"}, {"text": "Lousy management. Lousy. I&amp;#39;m not a huge fan of Cheesecake Factory to begin with. But this place sets a new low in terms of organization and service. Told me wait was 20 minutes. Actual wait was 45. Then waited an hour before food arrived. Then my burger came with a giant chunk out of it. Like a big bite. Taken by someone who was not me. I don&amp;#39;t actually think it was a bite but I&amp;#39;m still not sure how else a giant half moon chunk was missing from my burger. Or why. <br&gt;<br&gt;You&amp;#39;ve been warned!", "rating": 1, "date": "1/29/2017"}, {"text": "Dined here many of times with family and friends. <br&gt;Customer Service has been great all times. I enjoy the portion sizes lol because I always get to take some home and eat it another day.<br&gt;My waittress is always very pleasant. <br&gt;My go to dish is the bang bang chicken and shrimp <br&gt;And red velvet cupcake. <br&gt;Anyone can find something on the menu. Go and enjoy", "rating": 4, "date": "10/30/2016"}, {"text": "Absolute nightmare.  Never!  Ever!  Ever come here.  The worst service I&amp;#39;ve ever experienced.  They couldn&amp;#39;t get anything right.  This is no joke.  We had to leave.  And then they tried to make us pay for our meal.  It NEVER came!!!<br&gt;Don&amp;#39;t waste your time.  Server was an idiot.  Her manager was even worse.  This place needs to clean house and train staff.  <br&gt;<br&gt;Save your time and high blood pressure meds.  You&amp;#39;d be better off at McDonald&amp;#39;s. Heck, Denny&amp;#39;s even is higher brow.  <br&gt;<br&gt;If I could give negative stars - I would. <br&gt;<br&gt;Cheesecake Factory Towson is a colossal failure !!!", "rating": 1, "date": "3/24/2016"}, {"text": "The reason I gave two star is because of the experience ordering phone by phone. I was placed on hold for an eternity. While on hold they should have had a recording indicating orders could be placed online. The lady that picked up the phone said that is just busy on Fridays. Well if it that busy hire more staff", "rating": 2, "date": "4/6/2018"}, {"text": "Came today with a fairly large party and the food service was stellar!!!  Awesome experience by the entire team.  The food, bread, apetizers..... Everything was great.  Kudos on a job well done.", "rating": 5, "date": "12/21/2016"}, {"text": "I always order my cheesecake curbside pickup; however, this evening after waiting on hold for ten minutes I was informed that pickup orders for cheesecake are not allowed. I work in the mall and only wanted to pick it up curbside. Oh AND ALL of the 15 minute curbside parking spaces were occupied by patrons who definitely were there longer than 15 minutes. A HUGE inconvenience for a restaurant whose main staple is CHEESECAKE!", "rating": 2, "date": "1/7/2018"}, {"text": "7:30 pm at night , busy time for the restaurant business on Friday night ! <br&gt;I would say the counter should have a cashier stand by any time ! We been waiting for a while for orders ! No body take the orders right the way ! Not really acceptable !<br&gt;If it is too busy on weekend , please hire one more cashier !", "rating": 2, "date": "10/17/2014"}, {"text": "Service was terrible. I waited 20 minutes for my waitress to come back to my table after I was finished dinner. Ordered a piece of cheesecake to go and my check. I watched this same waitress standing around the waitress station for 10 minutes more talking to all of her coworkers while I waited for my check. Still waiting for my cheesecake as well. I did not plan to spend my evening sitting in the Cheesecake Factory waiting for side conversations to end.", "rating": 1, "date": "3/21/2019"}, {"text": "I am not the biggest fan of the overrated cheese cake factory menu however I do occasionally make a trip out to this congested, no parking, busy Towson area to grab a slice of cheesecake. Honestly, how I feel about this chain restaurant is this: back in the day red lobster used to be the go to spot for the dope boys to impress a lady nowadays red lobster has fallen off the grid and is now replaced by the Cheesecake Factory. So it is just a fancier chain restaurant to go on a first date or take the family now.", "rating": 3, "date": "1/23/2016"}, {"text": "It&amp;#39;s your typical Cheesecake Factory. In a city dearth of quality restaurants, we are stuck with mediocrity.", "rating": 2, "date": "12/7/2015"}, {"text": "It is what it is. It&amp;#39;s an expensive chain with slightly fancier food than others, and a price to make sure you know it. I wouldn&amp;#39;t go here normally - just too much money for what it is, and it&amp;#39;s always super crowded with obnoxious people. However, I won a gift card while playing BINGO at my daughter&amp;#39;s school, so why not? The chicken sandwich was pretty nice, and the fries it came with were decent. My girlfriend got a pasta dish of some sort and that was also good. The cheesecake is really where the magic happens... It&amp;#39;s a lot of money, though. And when you&amp;#39;re done, you don&amp;#39;t need to eat any more calories for the next three days!<br&gt;<br&gt;Service was just average.", "rating": 2, "date": "6/27/2014"}, {"text": "Not many things could be said of Cheesecake Factory negatively. It&amp;#39;s reputation of a upscale comfort food establishment is true. However, I must dissect this Towson location and even comment on a few issues controlled by corporate. The location is nice and most importantly clean. However, I don&amp;#39;t understand the decor. It&amp;#39;s quite confusing and kinda reminds me of an Indian restaurant. The food prices are not super pricey, but certainly not the most affordable. The food came hot 25 minutes after ordering but the portions seemed skimpy. I like most people love cheesecake so I obviously ordered a slice. To be honest, I expected to be in cheesecake heaven. I thought I&amp;#39;d have my life flash before my eyes after biting into what&amp;#39;s supposed to be the best cheesecake on earth. But that wasn&amp;#39;t the case. It&amp;#39;s a middle of the road cheesecake that extremely overpriced. I guess that&amp;#39;s why when you look around the restaurant you don&amp;#39;t see many people actually ordering it. They have plenty of options in terms of flavors but how do you price a slice of cheesecake almost as much as a steak entree? While the food is decent and the atmosphere is confusing but decent, the most important factor of this restaurant is disappointing. But it&amp;#39;s not bad...", "rating": 3, "date": "10/13/2017"}, {"text": "This was our first time at the Cheesecake factory. We came in and seated quickly. Our server&amp;#39;s Name was Annie who was pleasant and very informative. We started off with Crispy Crab Wonton. Which was well received by my picky eaters. My oldest son ordered the Herb Crusted Filet of Salmon which he found tender and perfectly seasoned. My youngest had their pizza and he was pleased. I had the Shrimp and Chicken Gumbo. It had a bit of a kick, but that is what I expect with gumbo. It was so much food we had to take a majority home. Our first time there impression was great. Your pleasant staff (Annie) and the lady who brought the appetizer to the table who I did not catch a name were great! Thank you and we look forward to another trip back sometime in the future.", "rating": 5, "date": "11/16/2015"}, {"text": "Service has greatly improved from last visit.  While there were a few hiccups in the food presented, our waiter was awesome.", "rating": 3, "date": "1/26/2019"}, {"text": "If you ask for fettuccini Alfredo they will sneak a tomato in there . So make sure you tell them your food allergies and they don&amp;#39;t do reservations so get there asap", "rating": 2, "date": "3/23/2018"}, {"text": "Was expecting to have a romantic date with my girlfriend until Janice started singing happy birthday in my damn ear.. 5 times. It was not my birthday. Don&amp;#39;t even get me started on the little shit that kept sliding his chair into our table. Control ya damn kids. Food was good tho.", "rating": 5, "date": "2/26/2019"}, {"text": "Huge selection and if you go early 11:30 it&amp;#39;s not busy at all. Nice wait staff, and reasonable pricing.", "rating": 4, "date": "3/3/2018"}, {"text": "The service was terrible and the bathrooms were gross. We were disrespected by the manager and the server. Marisa was the server. Invoking policy is one thing, plain rudeness is another. Never going back.", "rating": 1, "date": "7/26/2018"}, {"text": "I have been to this Cheesecake Factory numerous of times but this last time was bad. The young lady named Amanda who helped me with my togo order was perfect. She was very nice and had a smile on her face. I ordered chicken scampi. That pasta was drowning in oil. Heart attack waiting to happen. I ordered tiramisus but instead another young lady gave me tiramisu cheesecake. Crazy but I am not a big fan of cheesecake.I called and told the manger how they gave me the wrong dessert. He asked if I had my receipt and I said no. I had made two separate orders and lost the receipt with the dessert. His response was to come in and get a new slice but I told him I could not leave work. I asked if I can come in tomorrow he told me no. To make a long story short he one did not even try and solve the issue and two he low key thought I was lying about being there in the first place.", "rating": 2, "date": "1/29/2016"}, {"text": "The ambiance was fabulous, the Sausage and Shrimp Pasta was terrific and the Lemon Raspberry Cheesecake was life changing! 5 Stars doesn&amp;#39;t do this place justice!!!", "rating": 5, "date": "1/31/2018"}, {"text": "I have been going to this location for a long time and service is definitely declining. Even though you are given a time to pick up when ordering online they are rarely ready and tonite was no exception. Three people deep in line and 5-6 people behind the counter - a few working on desserts, the rest, clustered in the corner and no one waiting on pick-up customers! When I received my order I should have checked, A chopped salad missing avocado and no instructions (that they ask you to type into &amp;#39;customize&amp;#39; your salad) followed. No bread included this time - they must have forgotten that. At least I received 3 forks?! Very disappointing...", "rating": 1, "date": "1/27/2019"}, {"text": "Manager was being very rude to me and family because of is having 20 people in a group. First told my sister at 2:00 to come back at 5 for a table but my sister was told on the phone from someone to come two hours ahead of time for a 4pm seating.. When we got back at 5 gave us one of those devices and said we have we have to wait two hours for seating.. Will never go back there again.. Customer Service sucks!!!", "rating": 1, "date": "3/15/2018"}, {"text": "Poor customer service. Bought $200 worth of gift cards with a free piece of cheesecake for each $25 gift card. They will only let you let you use 1 free cheesecake per carry out order despite spending $75. Last time I will be doing that! Not everyone can go to a restaurant. Some people are handicapped and rely on others to enjoy food from a restaurant.", "rating": 1, "date": "1/23/2019"}, {"text": "I&amp;#39;m not really a fan of these chain restaurants, but this one is ok. No frills, just consistent Cheesecake Factory dishes. I will say the Mushroom Swiss burger I had was perfect!  They really should promote their burgers more. IJS that menu is so huge it&amp;#39;s hard to pinpoint what else is on the menu outside of cheesecake.", "rating": 2, "date": "9/7/2015"}, {"text": "This was my first time being at The Cheesecake Factory.<br&gt;Our seating was excellent as we had a good view of the restaurant and staff is very friendly!<br&gt;Our waitress, Katie, was phenomenal and on top of things and answered any questions that we had.<br&gt;The appetizers, Crab balls and the fried Zucchini, were AWESOME!<br&gt;Our meals were more than enough to eat, taking leftovers home for the next day.<br&gt;The Lemon Raspberry cheesecake was delicious!<br&gt;Can&amp;#39;t wait to go back again", "rating": 5, "date": "12/3/2016"}, {"text": "Horrible customer service! I place a phone order and told the lady my order. I repeated my order three times in order for her to get my order correct. She was too busy talking to other in the background while taking my order. Once i received my order it was completely wrong. I told the worker who handed me my order that it was wrong and she just walked away as I was talking to her. Another lady came by and fixed the problem.", "rating": 1, "date": "9/22/2018"}, {"text": "We ordered the curbside to go and it was a disaster. We figured that we&amp;#39;d call and place our order before the dinner rush. While the on the phone they told us that it would be 30 minutes.<br&gt;<br&gt;I arrived at the curb and in front of their white backdoor about 25 minutes after we placed our order. I called to let them know that I had arrived for our order that we called in. I watched as they walked out of the door and delivered to other drivers in their car. Each time another employee walked out, they walked right past my car.<br&gt;<br&gt;After sitting there for 30 minutes, I called again to let them know I was still there and again provided them with the color and make of my car and even told them that I was parked right in front of the door, where they were walking out. The girl said, &amp;#34;Ok&amp;#34;.<br&gt;<br&gt;Another 20 minutes passed and I again called to tell them I was there to pick up an order and gave them the name of the order and again, the make and color of my car and my location. The guy on the phone didn&amp;#39;t seem to care and had a slight arrogance to his voice, almost annoyed that I was calling. During the entire fiasco, there wasn&amp;#39;t any employee who walked out with food and took it back.<br&gt;<br&gt;My wife called to find out what was going on and I told her. She too, called the restaurant where they proceeded to tell her that they&amp;#39;d look into. After sitting next to the curb, in front of the door that they walked out of, for an hour I finally left, angry.<br&gt;<br&gt;As a customer, we did everything that we were supposed to. Cheesecake Factory, as a provider of goods and services, failed miserably in their responsibilities.<br&gt;<br&gt;After I arrived home, my wife called to speak to the manager. To our surprise, he lied right to her, telling her that on three different occasions, they walked out and couldn&amp;#39;t locate me. I can&amp;#39;t believe a manager would do something like that. This particular location needs to start over with their staff, from the hostess all the way up to the manager. Every visit we have had horrible customer service and when we bring it up, no one seems to care.", "rating": 1, "date": "2/9/2015"}, {"text": "Stopped by this location with my family and friends that we havent seen in years. In this day and age, customers having food allergies and unable to eat certain things is understandable. Apparently not to the manager named Brian/Bryan that works at this location. My godmother has very particular food allergies so when she orders something she has throughly asked the waiter for the food she is interested in. Apparently in the kitchen, they add sauces and such to food and send it out to tables. This was the case with her salad which had salmon and came out topped in a mayonnaise sauce. In this instance, she didnt want her food made all over again. She asked the manager that her meal price be cut in half since it wasnt an added protein, it came with the salmon on it. The manager Brian/Bryan would not oblige and only would give us the price of additional salmon which was much less than what the entire salad was worth. This was all while Completely blaming her for not expressing her food allergies while ordering. This is so inconsiderate because if the chef in the back didnt add things to a meal that isnt on the menu itself, we wouldn&amp;#39;t be in this situation. Terrible customer service.", "rating": 1, "date": "8/24/2018"}, {"text": "The hostesses were extremely friendly. The wait was longer than we were told, about 40 mins when they told us 20, but that&amp;#39;s okay. Our waiter was John. He was so nice and very helpful with our questions. The food was good, I got a salad and it was huge. John always made sure we weren&amp;#39;t low on water which was nice because some restaurants take forever to refill. The Cheesecake was still frozen :( which kind of ruined the greatness of the rest of the experience. But I would return to cheese cake factory", "rating": 4, "date": "12/30/2017"}, {"text": "I have never waited longer in a restaurant like this. Our waitress seated us and dispearred since. Our drink was not served until we are half done with the meal. Never came back since. And we had to get another waitress to pay for the food. Very bad exprience and definitely not coming back.", "rating": 1, "date": "8/9/2018"}, {"text": "What a great place.  Took Ms Angie out to celebrate her 28 birthday.  <br&gt;<br&gt;Love the food", "rating": 5, "date": "10/22/2015"}, {"text": "Great Cheesecake! Smooth, plenty of toppings, and even a little extra side of cool whip Mmmmm<br&gt;<br&gt;Food isn&amp;#39;t bad either. Salads are crazy BIG! Some of there sandwiches could use better fitting names though. The &amp;#34;Pit Dip&amp;#34; is far from pit beef. The &amp;#34;Pulled Pork&amp;#34; is now a Carolina style Pork Sandwich? That was what I mistakenly ordered. I sent it back too! There pulled pork sandwich used to be phenomenal! Had it many times over the years. Now it&amp;#39;s a sloppy mess with an overload of unneeded fixings. What a shame! <br&gt;<br&gt;Only thing I really don&amp;#39;t like is the wait time. Friday-Sunday is so busy! Good luck getting a table in under an hour. Shame they don&amp;#39;t offer call ahead seating or reservations. I&amp;#39;d go there more if they did. <br&gt;<br&gt;I recommend this place for weekday/weeknights and early bird meals. If you go during the weekend, go shopping instead of standing in there for an hour.", "rating": 3, "date": "5/15/2015"}, {"text": "Visited this restaurant for lunch. Not busy at all. Ordered a water and a ginger ale. Never got the ginger ale. Ordered a turkey burger and a chicken sandwich. Turkey burger was raw, not cooked. Waiter asked if we wanted it out on the grill longer or another item of the menu. That question should not have been asked. Manager came and apologized. All in all a bad experience", "rating": 1, "date": "10/21/2018"}, {"text": "The experience was a pleasant one.  The food did not disappoint and service was quick and efficient.   The only thing that was annoying to this writer is the loud and uptempo music that detracted from the dining conversation. Otherwise, this is a good value for the money.", "rating": 4, "date": "8/24/2018"}, {"text": "Highly recommend. Came here 2x while staying for a soccer tournament. Food is yummy: fried catfish; mash potato; free beans and onions; also had the gumbo.. Oh and the Lemondrop Martini&amp;#39;s to die for.... Tasty. Wait was long but it was the week end but service was ok", "rating": 5, "date": "3/12/2016"}, {"text": "I took my son here on a Saturday evening for dinner. It was our first time visiting this location but have dined at several other locations previously. I ordered the Jamaican Black Pepper Chicken and Shrimp. I have ordered this dish many times and immediately knew it wasn&amp;#39;t made well. The shrimp and chicken were unusually small and the plantains were missing. I had a huge amount of rice and black beans, and the amount of pineapples on the plate was minuscule. I believe my dish was rushed as the seasoning tasted as though it was just sprinkled on top. My son ordered the spaghetti and meatballs, his entire dish was salty. We ate about half the meal and ordered our cheesecake to go. Our Cheesecake was great as usual. I think this may have just been a fluke because I have always had a great experience at this chain. The dining room was packed and had a long line. Our server Andy was also great!! We&amp;#39;ll try this location again so I hope it was just a bad night.", "rating": 2, "date": "1/23/2018"}, {"text": "Let me start off by saying I&amp;#39;ve always been a huge fan of TCF and have been craving one of my favorite entrees from TCF, the orange chicken.  Well, living about 45 mins away, I don&amp;#39;t make it down that way that often.  An opportunity became available when my wife asked me to bring her some cheesecake for lunch at her work up the street.  I went online and ordered for curbside pickup.  The order was supposed to be ready at 12:26 and I arrived at 12:10.  As always, all the displayed pickup spots taken by mall patrons clearly not picking up from any restaurants.  I assumed when filling out my vehicle info and being given a pickup time, they would bring out the food when ready or possibly have someone designated to curbside check from time to time.  Nope, I ended up calling around 12:45.  I was told I was supposed to call when I arrived which being a first time curbside patron, I did not know.   Not very pleased, I just wanted to leave since my wife&amp;#39;s lunch break was now half over.  By the time I got to my wife&amp;#39;s work(10 mins away), the food was somewhat cold and the cheesecake was room temp.  My orange chicken which i was REALLY looking forward to was very bland and didn&amp;#39;t have much flavor.  The southwestern egg rolls were greasy too the point of throwing out.  My wife&amp;#39;s club sandwich was 30% mayo.  The only thing good about the experience was the cheesecake(go figure).  Although room temp, it was very food.  This lunch treat was not in anyway worth the near $100 price.  A big disappointment all around.", "rating": 1, "date": "5/22/2019"}, {"text": "I had great lunch and great dinner here. Food was well made, the right amount of crunch, and the right amount of flavor. Portions were generous and I had lots of leftovers. Their sliders were amazing, in fact, I am craving them now. Service was friendly and efficient every time, though there was a long wait to be seated since they were so busy. Good place!", "rating": 4, "date": "4/26/2015"}, {"text": "I usually love everything I get here from the entrées to the appetizers and cocktails. Here are my favorites:<br&gt;Drinks- Mai tai, mojito, mango mojito, long island and rum punch. All are made strong, delicious and garnished beautifully. <br&gt;Appetizers- Avocado eggrolls (FAVORITE), buffalo chicken crisps, firecracker salmon rolls, crab balls, dynamite shrimp...I could go on and on literally all the apps are amazing!<br&gt;Entrees- I never thought I&amp;#39;d say this but the Kale and quinoa salad is AMAZING!!! It&amp;#39;s hands down my favorite thing to get now. It comes in a huge proportion with a delicious lemon vinaigrette dressing. The perfect balance of sweet and salty. Other entress that are good is the Louisiana chicken. The portions here are very big and filling so plan to take home a to go box. The cheesecake speaks for itself. There are dozens of flavors and they all taste delicious! My favorites are the lemonchello, peanut butter, red velvet, key lime, banana cream, oreo, strawberry and turtle. Fyi the happy hour is also really nice. They have $6 food and drink items. Enjoy!", "rating": 5, "date": "11/29/2016"}, {"text": "For me to say that I will never return to restaurant the experience has to be pretty bad. My family and I went to the Cheesecake Factory for my sister&amp;#39;s birthday. Prior to this I had noticed that the Cheesecake Factory&amp;#39;s food wasn&amp;#39;t as good as it used to be. However, I loved the bread and the cheesecake and the food was better than most places so I would at least frequent this restaurant 2-3 times per year.<br&gt;<br&gt;This last visit however turned out to be the catalyst that ensures that I will never again visit any Cheesecake Factory! Six of us went to the restaurant on that Sunday. I could talk about how the initial server was either incompetent or just didn&amp;#39;t like us due to the way she acted. However, that was not the &amp;#34;highlight&amp;#34; of the evening. One of my other sisters has a severe pineapple allergy. This was made clear when ordering drinks and food, to the point where my sister even chose a different drink because the staff was unsure what ingredients were in it(how does that work?)<br&gt;<br&gt;My sister asked whether or not the meal she was ordering had pineapples in it (Bang Bang Chicken &amp;amp; Shrimp). She was assured that it did not. If anyone has seen this particular dish, you know that it is completely covered with sauce. My sister received her meal and began to eat it, without really paying much attention. As she began to eat it, she began to cough severely and complain of trouble breathing to the point of tears. My mom immediately began to urge her to drink water as we looked for a benadryl to give her. My brother grabbed her plate and looked through her food and discovered not one but several pineapple chunks in the food. He tasted it to confirm.<br&gt;<br&gt;We gave her a benadryl and she could breathe a little better. So we called the manager over and explained the situation. We showed him the pineapple and he exclaimed&amp;#34; Oh my God. They&amp;#39;re all through the dish&amp;#34; He rushed back to the kitchen and came back with the Kitchen manager, who tried to persuade us that there weren&amp;#39;t any pineapples in the dish but rather it was applesauce! APPLESAUCE!<br&gt;<br&gt;What kind of morons, did he think we were to believe that a pineapple chunk was applesauce?! The kitchen manager became snide with us and at no point did they take responsibility for the mistake they made. My sister began to experience the worsening of symptoms. It was obvious that she needed something stronger than benadryl. We told them we were rushing my sister to Patient First because the benadryl wasn&amp;#39;t working and the manager says, &amp;#34;Oh yes, let me get your check to you so that you can be on your way&amp;#34; They wanted to make sure we paid before we went to see to my sister&amp;#39;s wellbeing!<br&gt;<br&gt;I later spoke to the general manager and my sister spoke to corporate. They refused to acknowledge the fact of what they&amp;#39;d done. The woman from corporate told my sister to take a picture next time. Both were extremely rude and acted as if we&amp;#39;d inconvenienced them! I told the manager, our family was the one who was sitting at patient first after what was supposed to be a birthday celebration. My sister had to receive several shots and was on medication for a week after that episode.<br&gt;<br&gt;At no point did Cheesecake Factory take ownership of their mistake. I will never be returning to their restaurant. Maybe it won&amp;#39;t make a difference to them. However I hope if anyone has a food allergy that you do not visit this restaurant. You could die and they wouldn&amp;#39;t care. They&amp;#39;d tell you as the woman in corporate said &amp;#34; Take a picture next time&amp;#34; That &amp;#34;picture&amp;#34; is worth a thousand words. It tells you just what they think of their customers.", "rating": 1, "date": "1/5/2017"}, {"text": "I don&amp;#39;t usually have anything but good experiences here and I have been eating at Cheesecake Factory restaurants since 1986 when I lived in Los Angeles. For one thing, they give you LOADS of food! A total and complete contribution to the country&amp;#39;s obesity problem. Lots of yummy food for the price and a gazillion calories!! The cheesecake and desserts are so good, I feel like I gain weight just looking at it. Save this place for special occasions or just go once every 2 months!", "rating": 5, "date": "10/4/2014"}, {"text": "Normally love The Cheesecake Factory. Today not so much. Had the Cobb Salad, both of us. Bitter ice burg lettuce with 5 tiny morsels of bacon. $15.50 each. Not worth it. 4 pieces of chicken. Oven was broken, so no bread. Really disappointing. <br&gt;Towson Cheesecake Factory needs to step up their game, compared to other Cheesecake Factory Restaurants.", "rating": 1, "date": "6/11/2017"}, {"text": "Excellent menu and good service. We came in for a grad celebration were disappointed. Nice job everyone?!", "rating": 5, "date": "5/31/2018"}, {"text": "The food is very good but it shouldn&amp;#39;t take so long to get small plates and dessert in the middle of the afternoon. And now I&amp;#39;m waiting for the check. To me that is like being held hostage. After you deliver the cake (7minutes after coffee) then bring the bill.", "rating": 3, "date": "7/21/2017"}, {"text": "More or less, the Cheesecake Factory gives you a ton of options so everyone is satisfied if they have a particular craving. On top of that, the cheesecake menu is enormous and the portions are huge (as are the portions of most meals here).<br&gt;<br&gt;However, don&amp;#39;t expect anything special from the Cheesecake Factory. The basics are all good and what you would expect - pretty much anything that&amp;#39;s not too crazy is good. However, orders that aren&amp;#39;t so simple will be just &amp;#34;okay.&amp;#34; I ordered the enchiladas and my friend got a chicken sandwich, both of which were very mediocre. Another huge downside is that seats are right on top of one another, so you&amp;#39;re esentially in conversation with the people sitting next to you.<br&gt;<br&gt;Good spot for the family and to keep everyone happy. Not so much for 2 people looking for conversation and a good meal.", "rating": 2, "date": "11/13/2014"}, {"text": "Typical cheesecake factory restaurant.  It is in the Towson mall and it is usually pretty crowded in here.  I usually really like Cheesecake factory but the service over at this one is just ok.  The servers are not mean or rude but not overly helpful either.  For the most part you will get what you expect from this cheesecake factory.", "rating": 3, "date": "11/19/2014"}, {"text": "At a chain restaurant like this, for me, service and quality of food are the most important especially since I have had some bad experiences at a few chains, the cheesecake being one of them.<br&gt;At this location food and drinks are consistently good and I have been here more times than I can remember. The service is nice, friendly and attentive.", "rating": 4, "date": "8/4/2014"}, {"text": "I went here today with 3 of my friends and can say it&amp;#39;s one of the most memorable moments of my life due to our server Antoine. Antoine is one of the most enjoyable servers I&amp;#39;ve had in a restaurant setting. The food was good as always, but Antoine and the serving was the unsung hero of my lunch.", "rating": 5, "date": "6/8/2018"}, {"text": "The fat manager with a beard that looks like Seth Rogan is one of the worst managers I have ever experienced. He has poor people skills. I wish I remembered his name because everyone else was great and the food was dank", "rating": 5, "date": "6/7/2018"}, {"text": "This place is always busy, but the food is delicious... so it&amp;#39;s worth the wait. I always get the firecracker salmon rolls. They are sooo delicious. I can never visit  without getting a slice of cheesecake. The cheesecake slices are far from small  <br&gt;<br&gt;I love the following cheesecakes:<br&gt;Banana Cream w/ banana sliced<br&gt;Red Velvet <br&gt;Caramel (there are two kinds and they are both good)<br&gt;Original<br&gt;Pineapple", "rating": 5, "date": "11/10/2014"}, {"text": "I never ever had a bad experience at any location. The food is always good, hot, and the service is fast and friendly. The menu is a bit overwhelming because there are so many delectable choices to choose from. I&amp;#39;ve been dining at with this restaurant for over 12 years. It&amp;#39;s good for celebration, groups, family, and date night. The desserts are always fresh and memorable!!!", "rating": 5, "date": "11/8/2014"}, {"text": "I usually come for happy hour. The food and drinks are always up to standard. However the service tends to lack. Whether it be long greet time, not knowing about the menu, or not being attentive. Besides that everything else is pretty good and I can&amp;#39;t complain. I would like to give 3.5 stars but since that&amp;#39;s not an option 3 it is!", "rating": 3, "date": "5/15/2014"}, {"text": "My niece purchased a red velvet cake with cream cheese icing, while the cake was delicious, the proportion of cake to icing was like 1 to 2. Stop filling cakes with all this icing and give customers the fair share of cake for the price.", "rating": 2, "date": "5/21/2018"}, {"text": "Lunch started out great and we had a nice waitress. My Thai lettuce wraps looked great when it arrived at our table. All was well until I noticed a dead fly in my toppings. I put it aside on my plate and was completely grossed out and wondering if I had eaten any other insects that I could not see. The waitress did get a manager immediately, but he didn&amp;#39;t seem surprised and offered to take the meal off the bill. That would have been expected at the minimum; however, no one else at the table would eat the food out of the kitchen. The manager told us that people were going in and out for the patio seating and &amp;#34;it happens&amp;#34;. We were very disappointed by the response. I won&amp;#39;t be back.", "rating": 1, "date": "7/2/2016"}, {"text": "Very disappointed. Came with a group and the food was bad all around. Cold, tasteless, not as described. Our waitress was great and the cheesecake was great so those are my 2 stars, otherwise I was extremely unhappy with this location. This was my first time at the Towson location but I&amp;#39;ve been to other locations many many times over the past 20 years.", "rating": 2, "date": "1/29/2017"}, {"text": "I always enjoy a dinner or brunch at Cheesecake! This location is conveniently connected to the Towson mall. So if you become hungry from shopping and want to have a nice sit-in dinner, this is the place to go. The time to be seated takes a little while but its worth it. The outdoor seating is also very nice. I would highly recommend having a dinner here!", "rating": 5, "date": "6/15/2016"}, {"text": "Cheesecake Factory has the BEST service in town. Everyone is always extremely nice. I and high quality servers. The food is amazing and reasonably priced for the portion size. I enjoy coming here to eat with friends and family all the time.", "rating": 5, "date": "3/8/2014"}, {"text": "We waited around a half an hour for a table here. The service was very slow, they took fifteen minutes just to get two lemonades. Our food came out after thirty minutes, which was okay. I had the Fish and Chips. it also took them fifteen minutes to bring one piece of cheesecake to us and another twenty to get the check. Would not recommend.", "rating": 1, "date": "4/22/2017"}, {"text": "My daughter and I have visited The Cheesecake Factory in Towson many times, but this is the first time we have ever received bad food.  The service was good and the main meal was decent, but the appetizer which was the Spinach Dip tasted ok but not up to par with other spinach dips that we have had.  Later that evening both of us did not feel well for the rest of the weekend.  We tried to think of other foods we have eaten, but the spinach dip was the only food we shared.  You can mark Cheesecake off of my list of places to eat.", "rating": 1, "date": "4/17/2018"}, {"text": "So.., my wife and I were watching an episode of The Big Bang Theory and I suddenly had a hankering for dinner at the Cheesecake Factory.<br&gt;<br&gt;I&amp;#39;m not sure I can add any new insights for a chain that&amp;#39;s been around so long. Colleen and I stop in to eat there about once a year. The food is always good but they tend to pile it on. (My personal belief is that a restaurant&amp;#39;s portions should not be any more that a normal human can eat). Every thing (including my martini) was very tasty.<br&gt;<br&gt;I had the red velvet cheesecake for desert. <br&gt;<br&gt;Now here is where you must have a strategy to eating your dinner if you want cheesecake for desert. Don&amp;#39;t eat the bread that comes as you sit down, order something small or simply don&amp;#39;t eat all the food piled up in front of you and you would normally have saved room for a piece of cheesecake. (Normally is the key word here). The piece of RVCC that landed in front of me was so good and so HUGE, I made myself sick. (Its the next day in the morning as I write this and I&amp;#39;m still feeling it). <br&gt;<br&gt;In this case (as with most), less is more.", "rating": 4, "date": "4/3/2014"}, {"text": "Been here several times. Everytime is great. The waiter I had last night was very knowledgeable with the menu and nice. The crusted chicken romano is one of my favorites. Make sure you prepare wait on the weekends or arrival early. It can get really packed.", "rating": 5, "date": "1/13/2018"}, {"text": "Great salads, but the &amp;#34;Walk Up Seating&amp;#34; is a drag. Still, we stuff our pockets with crackers and energy bars, sign the list, and wait...  Yup, the food is that good!", "rating": 4, "date": "12/2/2016"}, {"text": "I came here for my birthday lunch today. It&amp;#39;s a Monday at 1pm, the place is not very full. Our waitress seemed kind of aloof honestly. She was very slow the entire time. Didn&amp;#39;t catch her name, but she had curly light blonde hair. The food was good as always (thankfully). I wanted to order cheesecake to eat there, but I had somewhere to be! We ordered cheesecake to go instead. The next time she came to the table, she didn&amp;#39;t have checks or the cheesecake. I have no clue why the service was so slow! Worst of all, after I was already home I realized she gave me the wrong cheesecake. I ordered Reese&amp;#39;s, but got the Oreo one...and it wasn&amp;#39;t amazing. I think I&amp;#39;ll pick a different birthday place next year.", "rating": 2, "date": "4/3/2017"}, {"text": "I feel like this place is overrated. Its always SUPER busy, but I guess that happens when its attached to the mall. So be prepared for a long wait.<br&gt;<br&gt;The food is decent, but expensive. They do dish out large portions, though. They have a rather large menu, and have a little bit of something for everyone.<br&gt;<br&gt;The cheesecake is pretty good, I will admit. I don&amp;#39;t really want to go just for cheesecake, even if they do have a take-out section for cheesecake.", "rating": 2, "date": "3/28/2014"}, {"text": "I wasn&amp;#39;t happy with my meal because the tenders were dry, so i&amp;#39;m assuming they were probably over cooked and they were bland too. When my server came out to ask how my food was, I told her just that. Also, because I didn&amp;#39;t like them, I said I didn&amp;#39;t want them. She took them away without even offering for me to get something else in place of it and I was still charged. I&amp;#39;m only giving this a 2 instead of a 1 because the fries were good and so was the cheesecake.", "rating": 2, "date": "2/9/2018"}, {"text": "If there&amp;#39;s a quarter star, I&amp;#39;ll give it to them!! I was third to the last on queue standing for a good 20 mins total and all the orders and the people behind me who ordered were gone, the guy in the register (Alec B--on the receipt) noticed me and asked &amp;#34;What fudge cake are you getting?? What cheesecake??&amp;#34;...what the hell?!? He needs to get customer service classes because he didnt even apologize!!", "rating": 1, "date": "10/15/2016"}, {"text": "Food took hours to come and my pot stickers were disappointing at best. Had to live off the bread. The cheesecake tasted good tho (banana). I hated the decor because the booths made a me 4&amp;#39;8&amp;#34; feel very claustrophobic and the small size of the seats meant my butt was halfway parked on the person I was sitting next to, who is a petite little self like me.", "rating": 3, "date": "5/15/2016"}, {"text": "Stopped in here just last night just to pick up dessert. I had the peanut butter reese cheesecake. Let&amp;#39;s just say if you like cheesecake and you like reese peanut butter I say this is truly a hit. It was not too busy so I was in and out.", "rating": 4, "date": "5/6/2013"}, {"text": "The menu is huge. I would recommend looking at it at home and make your mind in any way, otherwise you might be stuck with two menu brochures (light menu and the regular fares). Be prepared to get a monster of a meal, one plate can feed a person for two days...Their portions are huge. Drinks are delightful, service is efficient and quick. Save room for dessert! Their cheesecakes are a must (they offer a carry-out too, where you can buy their cheesecakes by the slice or the whole cake). What a variety!!! Their coffee is good...<br&gt;<br&gt;Date night-share two appetizers and drinks, can easily suffice as a meal...Parking is easy (mall garage or valet). Location is excellent. If you go on Friday-weekend nights, be prepared to wait...I don&amp;#39;t think they take any reservations, but one can always order a drink at the bar and hang around, waiting, people-watching...Place is always hopping. I guess we&amp;#39;ve been there about ten times so far and never were disappointed. My favorites so far (besides the cheesecake) are their calamari appetizer, mojitos, and GLAMBURGERS!!!! Americana burger beats Five Guys, enough said...Try it! Their french fries are superb, even the day after, place them in the hot (400 degrees) oven for 5 minutes and they come out nice and crispy! Seriously...This is the place to go (if you don&amp;#39;t mind the noise, noise is a minus, but oh well, the place is popular!).", "rating": 5, "date": "4/30/2013"}, {"text": "Food was excellent and portion sizes were very large and filling. We went in for Saturday Sunday brunch (10-2pm) and my friend got Green Chilaquiles with Carnitas and Egg and I got the Fried Chicken and Waffles Benedict. Chicken was perfect, moist on the inside and with tasty batter on the outside, and went with the waffles well. My friend really liked the Chilaquiles. Server seemed rushed even though the restaurant was less than half full, but was quick to get anything forgotten like side of syrup or drinks. <br&gt;The food was so satisfying neither of us could fit dessert at the end, but the cheesecake there is amazing, so we ordered two slices to go for when we weren&amp;#39;t as stuffed. I was disappointed in how bland the white chocolate peppermint bark cheesecake was, didn&amp;#39;t taste like much besides a lot of crunchy minty bits where&amp;#39;s the cheesecake? but the reason I tried a new flavor is because I love so many of TCF&amp;#39;s flavors! I admit I usually just go for cheesecake and not a whole meal, and then the Lemon Raspberry Cream or Chocolate Mousse cheesecakes are wonderful favorites. I took a chance on the Vanilla Bean cheesecake (too many places think vanilla means tasteless) and really enjoyed it, definite vanilla flavor and the crust, mousse, and cheesecake were all distinct and great together.", "rating": 4, "date": "11/27/2017"}, {"text": "My wife and I went here with a gift card. We had eaten the cheesecake before but never ate dinner here. We were pleasantly surprised! Although most options are on the expensive side, it was hard for me to pick between all of the great offerings. I settled on the bang bang (thai style) chicken and shrimp. Very delicious... I saved room for a Kahlua cheesecake slice which was scrumptious. My wife had a very good French onion soup and Nutella cheesecake slice.<br&gt;<br&gt;I&amp;#39;d say we waited a bit long between waitress visits, and were seated a bit too close to other customers (there was a couple right next to us, cafeteria style)!. The free bread should just be eliminated as it was not wanted (we were destined to overeat either way) and frankly not too great. Regardless, I would highly recommend the restaurant for its great menu and classy (but not unwelcoming) atmosphere.", "rating": 4, "date": "8/29/2016"}, {"text": "First time I have been to this location and I must say the apps were not very impressive. The cheesacake was good. <br&gt;<br&gt;This review is mainly for our amazing server, Dave. He was great!!! We have a party of 6 who was very slow and needy, but he was so nice and accomidating! He had a great sense of humor and very personable. By far one of the best servers I have ever had.", "rating": 4, "date": "8/28/2014"}, {"text": "I&amp;#39;m not a huge fan of the Towson area, as I find it to be overly crowded and expensive. Lately though, I find myself being introduced to the area in a new light... local boys will do that to ya.<br&gt;<br&gt;Cheesecake Factory: decent prices, very LARGE menu (probably 5 normal pages of menu items), inviting atmosphere, good food. The prices may seem expensive at first glance, but the portions you are given are about (2) servings of food and will last you for about two meals. And of course, the dessert: let&amp;#39;s just say I&amp;#39;ve had pretty phenomenal cheesecake in New York but Cheesecake Factory is up to par and I&amp;#39;m no longer required to drive all the way to New York for a slice of heaven. Not to mention you can get any amazing flavor of cheesecake that you want; I personally lean more towards anything and everything with Peanut Butter. <br&gt;<br&gt;For those who are tuned to my Nautilus Diner review and are awaiting the next chapter of my personal &amp;#34;Rom-Com&amp;#34;.. date #3 was tasteful and supposedly I&amp;#39;m &amp;#34;honest to a fault&amp;#34;, go figure :)", "rating": 4, "date": "1/18/2013"}, {"text": "I am dropping a star as the food and service just isn&amp;#39;t impressive. Albeit, I still love the red velvet cheesecake.", "rating": 3, "date": "4/1/2015"}, {"text": "First off, the wait was a long line and we had to wait forever and there was not even that many people there. Second, when our pager when off we had to wait another 10 minutes to be seated. When we were seated the hostess took us to a table and it was not ready then she just disappeared and left us without a table in the middle of the restaurant. Fourth, she was very rude. Fifth, the service was terrible and the food was not what it used to be. Don&amp;#39;t eat here. Go to another cheesecake factory that runs more efficiently.", "rating": 1, "date": "10/28/2017"}, {"text": "Brought out my Burger and said fries will be right out 15mn later my burgers gone and they bring out my fries I told them to just keep them . Still got charged full price had 3 people with me 100 tab and no type of sorry or anything. I will never eat at this location again .", "rating": 1, "date": "1/9/2016"}, {"text": "The food here is very good.  That being said, it is overpriced, very dimly lit (felt like I was eating in a cave) and overcrowded.  The seating is horrible, you&amp;#39;re basically touching elbows with whoever is seated at the table next to you.  In my opinion you&amp;#39;d have a much better time calling in your order and eating this good food at home.", "rating": 2, "date": "11/3/2015"}, {"text": "SO bad for you, yet I think almost every time that I return to towson I go here at some point. <br&gt;Of coarse I think the majority of the people know about the factories food, but I have to state my opinion anyways. <br&gt;The menu is quite extensive, pages and pages of food that ranges from salads, to sandwiches to full on courses.  <br&gt;I always seem to opt for a sandwich , buffalo chicken~ Thats the way to go  :] <br&gt;I used to get cheesecake when I went .. but that has become at thing of the past..<br&gt;Its just eye candy for me now.", "rating": 4, "date": "10/1/2010"}, {"text": "Great food. Good Gluten free menu. Management and wait staff should be retrained. Food took too long to get out. Messed up my daughters GF meal. The bread we were supposed to get at beginning came towards the end of our meal. The side dish of broccoli (very tasty) came soon after. Then it took 15 minutes for slice of cheesecake, which had some paper in it. We got it comped but still. <br&gt;I watched the manager talk to bar staff rather than walk around and see if people needed anything or were ok. He sets the tone for the poor service.", "rating": 3, "date": "6/26/2016"}, {"text": "Fantastic place to eat, whether it be for casual lunch or dinner date.  The semi-casual, semi-formal ambiance allows you to chill out and enjoy some of the best cuisine in Towson, MD. I highly recommend this place.", "rating": 4, "date": "9/1/2013"}, {"text": "There is everything to love when you step inside The Cheesecake Factory! Something might mentally be wrong if you feel otherwise. I would  suggest to not go on weekends unless you don&amp;#39;t mind the wait like 30 mins plus. The decor is classy yet comfortable and casual. Everything on the menu is made fresh. The prices are a little high about $8-10 for an appetizer and an entree would range $20 or so. The portions equal what we pay, big portions. The hot wings are huge meaty and fabulous. Some of my friends go JUST for the wings!<br&gt;<br&gt;       I get the Jamaican shrimp with rice, beans, plantains and mango <br&gt;salsa. That runs about $20 and is well worth it, spicy and sweet. My friend got the steak and fries. They enjoyed it, tender juicy and a big portion of great tasting fries. You can order a side of mac &amp;amp; cheese that&amp;#39;ll cost about $4.95 but the portions of it you&amp;#39;ll definately have some for a doggybag. I&amp;#39;ve only bought 2 of their cheesecakes but all the flavors I have tried are phenomenal. <br&gt;<br&gt; Honestly, everyone that I introduce to The Cheesecake Factory loves it <br&gt;and become lifetime fans.", "rating": 5, "date": "8/25/2010"}, {"text": "I&amp;#39;ve been to this CF the most, so I have more to base my star level on. I&amp;#39;ve said it before, if it was based just on cheesecake, it would be a 5.<br&gt;<br&gt;But the wait at this sucker is almost ALWAYS more than an hour. I&amp;#39;d say about 3 out of the around 10 I&amp;#39;ve been here the wait has been minimal. I do wish they had a call-ahead wait list, because people-watching in Towson Town Center is fun for about 4 minutes, then it gets gross. It is miserable waiting for this bitch.<br&gt;<br&gt;Moving on, a plus of this CF is it seems big... more booths. But I don&amp;#39;t really think there are more booths, as I&amp;#39;ve been seated in those dumb long tables where you&amp;#39;re nearly elbowing the people next to you several times. <br&gt;<br&gt;My food has been generally okay, but a few times things have been lukewarm instead of hot, and that is not something I feel comfortable complaining about. <br&gt;<br&gt;The service has always been fine here. Except the hostesses/hosts. They seem like they have a &amp;#39;tude, when pa-lease, they should be the ones trying to win us back after we&amp;#39;ve waited 90 minutes to be seated. <br&gt;<br&gt;Anyways, the cheesecake... oh, oh, the cheesecake. *dies*", "rating": 2, "date": "4/11/2011"}, {"text": "Love the Thai Lettuce Wraps!  Cheesecake a bit pricey but delicious. Great service. Will definitely come back. Disappointed the appetizer pretzel crusted chicken skewers have been discontinued.", "rating": 4, "date": "5/22/2016"}, {"text": "Food was great but carry out service was terrible. Called to place and order and they tried to charge me extra for a dinner item when I specifically requested the lunch special (difference of 8$). Received the bag and all the lids immediately came loose spilling the sauce. Again the food was delicious but I would recommend going in to dine and staying away from the carry out service if possible.", "rating": 2, "date": "1/27/2015"}, {"text": "It was just ok. The food was ok. The wait staff was ok. My brother pick this place and since it was his day we had to oblige. The one at the Harbor is way better in my opinion.", "rating": 3, "date": "6/10/2015"}, {"text": "Usually I like CCF ! I love their chicken samosas and selection of wines. <br&gt;But this location is not up to the standards of CCF. <br&gt;I think the margherita pizza I tasted here is so far the worst margherita ! I mean, there is Olive Garden which competes but still, this location is pretty awful too..", "rating": 2, "date": "12/30/2014"}, {"text": "Nice place, never had a bad meal there.  Service has always been friendly and very good.  A little pricey but recommended.", "rating": 4, "date": "7/27/2017"}, {"text": "This review is strictly for the best waitress ever, Julie.  She is super cute and bubbly. Accommodates to your every need. I always ask if she&amp;#39;s working every time I visit the Cheesecake Factory and you should too! :)", "rating": 5, "date": "3/19/2015"}, {"text": "The Cheesecake Factory has a large menu, so anyone could find something that they like. They also have a lot of great drinks! However, it is always busy here, so making reservations would be a good idea", "rating": 5, "date": "1/18/2015"}, {"text": "Had lunch with friends and the food was ok but the booth was dirty.  The server was good but slow", "rating": 3, "date": "9/24/2014"}, {"text": "I don&amp;#39;t have a Cheesecake Factory where I live, so if I can get to one when I&amp;#39;m out of town, I will. I don&amp;#39;t love the place, but they&amp;#39;re not awful. The problem for me is their menu is so huge, I&amp;#39;ve yet to find anything I absolutely love. However, I think I finally found my meal there.<br&gt;<br&gt;First, the wait was surprisingly short. I&amp;#39;m used to having to wait at least half an hour. We had a wait but it wasn&amp;#39;t too bad. The service was good too, as it always is. They must put a big emphasis on service there because I&amp;#39;ve never had a bad experience in regards to that.<br&gt;<br&gt;Then, the food. I got the meat loaf which was amazing. I was tossing up whether to get the sandwich or the meal. I got the meal, but I asked for a side of the tomato bacon jam because I thought it sounded interesting (it comes on the meat loaf sandwich). It was all so good, including the jam. The brown gravy on the meat loaf is good too but the jam is something different. You can get meat loaf with brown gravy anywhere. It comes with mashed potatoes and corn succotash, and boy was that succotash good.<br&gt;<br&gt;The portions are ginormous, so if you&amp;#39;ve never been to one, be very hungry when you go or be prepared to either split your meal with someone or take leftovers with you.", "rating": 4, "date": "6/4/2012"}, {"text": "Went there for the first time and I would definitely go back.  The food was a little bit more pricey than I expected, but it was worth it.  I had a S&amp;#39;mores Cheesecake, which was delicious, but really rich.  I wouldn&amp;#39;t recommend any cheesecake with chocolate in it, because you probably won&amp;#39;t be able to eat all of it.  Looking forward to my next trip there.", "rating": 4, "date": "1/17/2015"}, {"text": "I ate at this location many times over an unexpected trip to MD.  We always had great service and the food was predictably good. We had everything from salads (the kale, greek, farro and beet, chopped veggie) to apps (tex mex egg rolls, quesidillas, fried mozzarella, flat breads), club sandwiches, chicken marsala, and of course, cheesecake. <br&gt;It&amp;#39;s a busy location, so prepare to wait if you go during peak hours.  Go to the bar and try the Georgia Peach, it&amp;#39;s delicious!", "rating": 3, "date": "11/24/2012"}, {"text": "I don&amp;#39;t want to write a lot on here because The Cheesecake Factory is the Cheesecake Factory.  How can you not love a place that has Cheesecake?<br&gt;<br&gt;The only thing with this though is I didn&amp;#39;t like the aftertaste of our burger sliders (kind of tasted gross).  But their Avocado Egg Rolls were to die for.  And their drinks were delicious!<br&gt;<br&gt;If I were you (a guy taking a girl on a date), just get 1-2 appetizers with a drink, then of course get some cheesecake!  The portions here are just TOO BIG to get an entree AND cheesecake.", "rating": 4, "date": "3/5/2012"}, {"text": "Sucks bigtime.<br&gt;What ever my husband odered they didn&amp;#39;t have...what kind of resturant first have anything....<br&gt;<br&gt;Real racists..took for ever to acknowledge us..then it took a while to take the order...took forever to come <a href=\"/redir?url=http%3A%2F%2Fback.to&amp;amp;s=443d2e89ea806cd7a3c868c063eac7358881c8db25ba91c7bc38c94679bd5134\" target=\"_blank\" rel=\"nofollow\"&gt;back.to</a&gt; say they dint have it....and it repeated 4times.<br&gt;My food was burnt !!<br&gt;Plenty of resturants in the area to go too...dint have to come here and be treated like this...", "rating": 1, "date": "3/8/2014"}, {"text": "Yes, it&amp;#39;s a chain; yes, it&amp;#39;s very popular, noisy and crowded; but yes, it is always good! i have NEVER been disappointed with my food at this fun restaurant. The prices are very reasonable, the portions pretty large and the quality, always great. The service has been lacking on one occasion, but that was the exception and i won&amp;#39;t let that ruin my opinion of this fine chain restaurant. I usually get one of the very imaginative chicken dishes or a steak combo platter. You can&amp;#39;t go wrong with one of their BIG SALADS either. I don&amp;#39;t know how they ever sell any cheesecake here as I&amp;#39;m always too full to do anything except order a slice to go. But on that subject, I just love the Mango Key Lime Cheesecake and the Dulce de Leche...absolutely delish!!!", "rating": 5, "date": "6/4/2014"}, {"text": "On your next visit, make sure you give the Imperial Chicken and Shrimp some attention. In just a few words... Yum!", "rating": 4, "date": "2/7/2015"}, {"text": "I didn&amp;#39;t even get a chance to try their food b/c they would not take my reservation! <br&gt;<br&gt; I had a party of 11 plus 2 children and wanted to make a reservation for a Thursday night at 7pm.  I didn&amp;#39;t think I would have a problem since I was calling a week ahead of time.  <br&gt;<br&gt;They said they only took reservations from 4-6pm, how ridiculous is that.  <br&gt;We didn&amp;#39;t want to wait when we got there so that&amp;#39;s why I was calling wayyyy ahead of time.<br&gt;<br&gt;This restaurant just lost the business of a whole family.", "rating": 1, "date": "7/10/2012"}, {"text": "My husband and I had our date night here. Even though it was a weekday, the place was packed. After just a couple of minutes wait, we were seated.<br&gt;<br&gt; I sincerely wish they didn&amp;#39;t put the tables so close to each other. The adjacent  table was only a couple of inches away that it felt like we are practically one whole table. The size zero waitress didn&amp;#39;t have any place to stand between the tables to take our order. And I could literally hear the the neighbours stomach growling!! lol..<br&gt;<br&gt;Appetisers-<br&gt;1. Sweet potato fries with the mustard dip was absolutely fantastic. Crispy,crunchy, sweet fries with a little bit of salt sprinkled on top !!!!! <br&gt;2. Crispy  taquitos was ok-ok.. Nothing spectacular..<br&gt;<br&gt;Entre-<br&gt;1. My husband&amp;#39;s order of Jambalaya pasta with chicken and shrimp was nice and full of flavour. You&amp;#39;ll like it if you like spicy stuff.. They even put a good amount of shrimp and chicken it it. So that definitely is something we would definitely order again. <br&gt;2. My Garlic noodle with shrimp was FLAVOURLESS, kind of SHRIMPLESS too.. The only thing good about the dish was the freshly grated cheese they put on top!! I asked the waitress about the dish having only a few shrimp, she told me that  they put only 4 per portion, which was exactly what i got. <br&gt;<br&gt;We definitely would go again, but ask for a booth first!!", "rating": 4, "date": "10/20/2012"}, {"text": "I was out on a date tonight at the cheesecake factory. <br&gt;Not by first choice mind you, this was a geographic decision.But I have always enjoyed my CF visits.<br&gt;<br&gt;The decor at this Cheesecake factory is Egyptian themed and looks great, high ceilings marble,hard wood, very nice.<br&gt;The food and service were good as well. But just good. Not quite as nice as the face she puts forth.<br&gt;<br&gt;We started with fried calamari, it was fresh and tasty, a nice portion. <br&gt;<br&gt;For dinner my date had the Fish n Chips and I did the Cajun Jambalaya pasta.<br&gt;4 large battered pieces of hand battered fish. I tasted some, OK, not bad. Lots of batter though.<br&gt;<br&gt;My Jambalaya was decent, medium sized shrimp, chicken, onions peppers and tomatoes in a spicy sauce over a bed of linguine. Not incredible just reliable good food.<br&gt;<br&gt;For desert I had the strawberry shortcake with fresh strawberries,  this is where CF shines...good stuff.It was huge I couldn&amp;#39;t finish it. My date had the peanut butter something cheesecake, she said it was good. I didn&amp;#39;t taste it, I&amp;#39;m not a cheesecake fan.<br&gt;<br&gt;Our server was a friendly young man, kinda funny how he asked how something looked every time he placed a dish down, had me laughing.<br&gt;<br&gt;Check came to 73 bucks  for two minus tip..I guess someone&amp;#39;s gotta pay for the marble and 30 foot ceilings..<br&gt;<br&gt;All in all a good experience for a chain.<br&gt;<br&gt;Nice digs Cheesecake factory, but I wish you were as delicious as you look.<br&gt;<br&gt;One thumb up for the cheesecake factory.", "rating": 3, "date": "9/22/2011"}, {"text": "Large portions, decent if predictable food.   But the tables are so damn close together it&amp;#39;s like you&amp;#39;re eating family style at an Amish place.  Ridiculous.   You&amp;#39;re better off for &amp;#34;privacy&amp;#34; at the bar. .... although if you&amp;#39;re unlucky enough to get the bartender we had, she&amp;#39;ll completely ignore you in favor of trying to impress the suits who (she assumes) will tip better.   Someone needs to explain to her about self-fulfilling behavior.  Idiot.<br&gt;<br&gt;Next trip to Towsontowne, I&amp;#39;ll stick to the food court.", "rating": 2, "date": "7/25/2011"}, {"text": "Standard Cheesecake Factory meal. Was pretty good as far as chain restaurants are concerned.  Wait staff was attentive.", "rating": 3, "date": "8/25/2014"}, {"text": "Never trust a &amp;#34;restaurant&amp;#34; that can&amp;#39;t execute a simple dish that can be made at home with the same half assed effort. I could have saved my $20 and had leftovers...", "rating": 2, "date": "1/7/2014"}, {"text": "An extremely long wait for an appetizer on a Thursday nite. Not happy. Need to improve on service. Food was okay but not worth the wait of 30 minutes.", "rating": 1, "date": "6/4/2015"}, {"text": "My sister took me to lunch here last week. The service was outstanding! The decor is beautiful. The Sheppards pie tastes homemade and delish. I had apple crumb cheesecake I loved every bite. Can&amp;#39;t. Wait to take my husband soon. Excellent lunch. For my first visit I was really impressed. Everything was amazing!", "rating": 5, "date": "2/8/2015"}, {"text": "It&amp;#39;s good . . . it&amp;#39;s a chain . . . it&amp;#39;s way too long of a wait on the weekends.  <br&gt;Went for lunch today and the smaller portions are great.  Navajo chicken sandwich was fabulous.  Good eats . . .but it&amp;#39;s a chain.", "rating": 4, "date": "8/24/2011"}, {"text": "It&amp;#39;s a chain. What can I possibly review about a chain? Portions are large but the prices aren&amp;#39;t low. Cheesecake is good. Wait is too long and it&amp;#39;s way too hyped up. Spend your money on a local restaurant and you will have a better night.", "rating": 2, "date": "4/3/2014"}, {"text": "I must say, when you know almost everyone who works here your dining experience is that much better.<br&gt;<br&gt;I got the alfredo for lunch, and it was a good portion. Very good, too. My strawberry cheesecake was fantastic. It was like having sex in my mouth. That&amp;#39;s how amazing it was. <br&gt;<br&gt;Pricey, but you get what you pay for.", "rating": 4, "date": "8/12/2011"}, {"text": "Ate many Cheesecake Factory across the country and one in Towson Town Center is the first cheesecake that was an epic fail. From the moment waking in the hostess doesn&amp;#39;t greet with a smile, but with the snootiest attitude! You come out to eat expecting a great experience but with this older lady in the front, don&amp;#39;t expect it! Food was salty and bland the pasta was over cooked. Don&amp;#39;t think I&amp;#39;ll ever come back!", "rating": 1, "date": "9/25/2016"}, {"text": "There&amp;#39;s nothing to hate about the Cheesecake Factory, it&amp;#39;s just overwhelming sometimes because the menu is sooo huge, and the place is even bigger. You can&amp;#39;t make reservations for small groups (not sure of the number) so keep that in mind when you plan to go. I generally only go when I get a gift card. <br&gt;<br&gt;That being said, they have this crab wonton appetizer that is awesome and highly recommended! Also, they have a frozen drink which is called the georgia peach I THINK and it&amp;#39;s worth a try as well!", "rating": 3, "date": "7/10/2012"}, {"text": "Food pretty good. Service at the bar is usually not good. Three bartenders and not one showed a bit of personality and cared that we were dining with them. They did not give or offer us bread but they offered the people around us. My wine glass was filthy and sticky. Servers and bartenders work for their tips and these bartenders clearly didn&amp;#39;t care.", "rating": 2, "date": "12/17/2016"}, {"text": "going out of my way to avoid chains for years, I suppose I missed a potential gem. As most everyone knows virtually every restaraunt in Towson has closed, The only remaining is Cafe Troia. All that is left is nearly a dozen crappy sushi places and bars.<br&gt;<br&gt;Not wanting to head to Lutherville, we decided &amp;#34;why not&amp;#34; never been there.<br&gt;well, everything we ordered was either good to excellent. <br&gt;Now this is not fine dining, but I can tell you the wines were serviceable, the food was fresh and well-made and of generous proportion. The servings, as one would expect in a chain, were huge and the service was prompt and courteous.", "rating": 4, "date": "5/13/2012"}, {"text": "The food was pretty good.  I ordered the Steak Diane and the first medallion I bit into wasn&amp;#39;t as warm as it could have been.  The other pieces were a bit warmer.  It was cooked correctly as ordered (med-rare).  Our waiter seemed to have other things that were more important, however I didn&amp;#39;t notice where his other tables were.  His inattentiveness caused us to leave and return to our hotel for a few more drinks.  Had he been more attentive, we would have stayed for another drink.  And the kicker: he came by and picked up the check before we had left.  Major rule in waiting tables...never pick up the check while the customer is still there.  Glad I tipped him appropriately.  Perhaps I anticipated that?<br&gt;<br&gt;Bottom line: it was good for a semi-late dinner after being on the road and traveling, but I will try another restaurant next time I am in the area.", "rating": 3, "date": "2/8/2012"}, {"text": "Best Cheesecake Factory in town. Clean, good service, and the food is prepared the way it is supposed to be.", "rating": 5, "date": "11/7/2016"}, {"text": "I went here for the second time this past weekend. I had been telling my best friend about it ever since I had gone for my birthday and we finally decided to go.<br&gt;<br&gt;Upon arrival we were seated right away. It was a tiny both, but since it was just two of us, it was okay. Our waiter Paul was awesome. I swear he&amp;#39;s a mind reader of some sorts since he knew exactly what my friend was going to order to drink and the type of cheesecake she was going to get later. Or he&amp;#39;s just a really good guesser. But still, he was hilarious and was a fantastic waiter.<br&gt;<br&gt;The food was amazing! My only complaint is that I wish my salad had more chicken in it. You give someone a huge salad and just a few small bits of chicken? Doesn&amp;#39;t add up. But still, I&amp;#39;m sure we&amp;#39;ll be going back and I&amp;#39;m sure it will be just as good!", "rating": 4, "date": "7/21/2011"}, {"text": "We walked in around 8pm on a Thursday night and we immediately seated.  Our waiter attended to us quickly and was very helpful and friendly.  We ordered the shrimp bistro pasta and the double bbq bacon cheeseburger.  The food was so good we each cleared off our plate. The portions are huge! Unfortunately they dont serve smaller portions for dinner, only lunch before 5pm. One of the better experiences I&amp;#39;ve had at a cheesecake factory restaurant.", "rating": 4, "date": "9/19/2009"}, {"text": "I love the Cheesecake Factory and this location did not disappoint.  We were seated right away in a nice corner booth--away from the noise.  Our waitress was very nice and accommodating.  Everything we ordered was from the Skinnylicious menu and although the dishes had less calories, they were not lacking in taste or size.  I particularly enjoyed the Skinnylicious lettuce wraps and the Asian Chicken Salad.  The low cal Sangria was also delicious.  Overall, I really enjoyed my meal here.", "rating": 5, "date": "5/24/2013"}, {"text": "An acquaintance used to say the Cheesecake Factory&amp;#39;s portions offended him.  They do serve you a huge amount of food, and from a very extensive menu; ranges from diner to comfort to Asian-accented.  Our usual go-tos are the Avocado Eggrolls (deep fried and stuffed full with avocado chunks, sundried tomato, red onion, cilantro, with a great spicy, sweet-tangy tamarind-cashew dipping sauce) and the Thai Lettuce Wraps (chicken, bean sprouts, variety of dipping sauces, veg garnishes; crisp and fresh).  One could make a meal of just an app.  <br&gt;  <br&gt;Really, though, can&amp;#39;t come to a place called the CHEESECAKE Factory and not have the cheesecake.   Fave fun flavors:  Banana, Oreo, Chocolate Mousse, Key Lime, Pumpkin, could go on and on.  Have found the fruit flavors to be like fruit (not artificial) and the chocolate ones very decadent. Haven&amp;#39;t tried a bad one yet (but then again, it is cheesecake, can&amp;#39;t really go wrong).<br&gt;  <br&gt;The Dulaney location sees its fair share of tired mall goers and packs of roving teenagers.  The wait can be a little long, hostesses a  little on the underage side and flaky, and the waitstaff just about the same.  Lighting is somewhat dim, and the space is tight.", "rating": 4, "date": "10/22/2011"}, {"text": "Waiter was bad, very slow. Took a good 20-30 minutes for the food to arrive. Gave her my card to pay, didn&amp;#39;t come back for a good 5 minutes. Finished our food, waited about 10 minutes for her to actually get our bill. Wouldn&amp;#39;t recommend.", "rating": 1, "date": "4/20/2016"}, {"text": "After calling ahead to reserve a table for a large group of co-workers for our holiday lunch - we were told on arrival that they could not find our booking and had filled all the large tables with walk-ins. They then disputed we had called at all. They offered to split us between booths and told us that it was our fault we had no confirmation number. Had I known they would provide one by phone or that I should have asked for one, things might have been different. <br&gt;<br&gt;Service here was appalling and we gave up. Across the way is a better steakhouse where I would recommend diners considering eating here should rather go.", "rating": 1, "date": "12/15/2010"}, {"text": "Damn right, I&amp;#39;m a fan of the Cheesecake Factory and the oversized portions.  I&amp;#39;m a fan of the amazing layout and dimly-lit atmosphere.  I&amp;#39;m a fan of the customer service provided by the hostess and the waiters/waitresses.  Finally, I&amp;#39;m a fan of those irresistible cheesecakes that I can&amp;#39;t seem to eat at the restaurant once I eat my large dinner.<br&gt;<br&gt;What I am not a fan of is the long wait times.  Unfortunately, Cheesecake Factory does not take reservations, so it&amp;#39;s a first come first serve type of deal.  You know what that means: you got to bum rush a couple of people to get in front of the line.  Oops...I meant to say get there early.  The wait is definitely worth it.<br&gt;<br&gt;I have gotten the Steak Diane, which is pretty good.  I have also gotten the Shrimp Scampi and Chicken Madeira combination.  It was my first time getting Chicken Madeira, and I&amp;#39;ll say it was OK.  The Shrimp Scampi definitely hit the spot though.<br&gt;<br&gt;Note:  There is valet parking offered by the Cheesecake Factory for only $5.  However, it tends to fill up pretty quickly.  There is also Curbside dining, something similar to Applebee&amp;#39;s and other restaurants that offer this service.<br&gt;<br&gt;I haven&amp;#39;t been at the bar yet, but I will surely be making my way here very soon.  My optimal equation:  <br&gt;<br&gt;Bud Light (or any alcoholic beverage) + cheesecake = match made in heaven.", "rating": 4, "date": "5/8/2010"}, {"text": "Ugh. I am not strongly anti-chain, but this place really suffers from the bland mediocrity that anti-chain people complain about. &amp;#34;Factory&amp;#34; is right!<br&gt;<br&gt;Every time I&amp;#39;ve gone, there&amp;#39;s been an enormous wait. The tables are uncomfortably close together; I don&amp;#39;t know how the poor servers manage to get around. With all the people they cram in there, it gets really loud. I&amp;#39;ve been there 3-4 times and never had an appetizer or entree that was worth the price. Despite all the oil and salt the kitchen adds, the food lacks distinct flavor and character.<br&gt;<br&gt;Their mixed drinks are pretty good, though many are syrupy-sweet. The tall, fluffy pieces of cheesecake are decadent, but I don&amp;#39;t like waiting through a sub-par meal to get to it. I prefer stopping here after I&amp;#39;ve been shopping at the mall and buying a to-go slice of cheesecake to bring home and eat in comfort.", "rating": 2, "date": "9/21/2011"}, {"text": "It has been about ten years since I had been to the Cheesecake Factory downtown.  My recollection was that the cheesecake was superb, the portions were absurdly large and the non-dessert food was poor.  Today, my family decided to try the new Towson location for lunch.<br&gt;<br&gt;We arrived at 12:15 and were told that the wait would be about 20 minutes.  This proved to be accurate.  Once we were seated we ordered our beverages including specifying that we wanted lemon with the iced teas.  The drinks were delivered, but no lemons.  We asked for lemons two more times before they were delivered.  Among our orders, a caesar salad was requested with the dressing on the side.  It came drowned in dressing.  This was bad enough, but furthermore, the caesar dressing was terrible as these things go.  The herb-crusted salmon on another salad was cold, undercooked and smothered with wet herbs (i.e. not &amp;#34;crusted&amp;#34; in any way).  A Pizzete appetizer was good, the four cheese pasta was fine and some chicken tenders were OK too.  The fries had been salted so heavily that they were barely edible.   <br&gt;<br&gt;As I feared, we had more food left over than we had been able to consume.  Since the salads had been drowned in dressing, they were not salvageable.  This single location must throw out enough food in a month to feed a small country.  I am not a religious person, but I found myself thinking that the waste was positively sinful.<br&gt;<br&gt;We did order a slice of Oreo cheesecake to go.  I ate some of it tonight, and it was superb.<br&gt;<br&gt;To sum up, Cheesecake Factory has not changed at all in ten years.  My recommendation is to eat your meal next door at P.F. Chang&amp;#39;s and then buy some Cheesecake to go and eat it when you get home for dessert.", "rating": 2, "date": "4/10/2009"}, {"text": "Lunch at the Cheesecake Factory in the Towson location proved to be delightful. Usually chain restaurants are not my favorites but this one changed my mind so much I ordered a bunch of gift cards so i could return another time. The menu is extensive and requires a good pair of reading glasses for those who have problems viewing lots of type on a page. I was given a book with many pages of food selections as well as a brochure with a number of skinnyliscious selections. Nothing tastes better than a nice fresh cold salad on a hot June day so I ordered the French garden salad with grilled chicken (from the skinny menu) and a glass of cold iced tea. In about 15 minutes my food came out as I was finishing reading an article about how couples criticize each other. The server presented me with a huge beautiful salad with field greens, beets (there could have been a few more) candied pecans, goat cheese and perfectly grilled sliced chicken. This was  a salad masterpiece created by the staff in the Cheesecake Factory kitchen. I ate the whole thing with a very nice tangy sweet balsamic vinaigrette dressing that I drizzled on it. There was a bit too much purple cabbage but I pulled it out so i could taste the other greens. The chicken was perfectly  grilled without grease and was fork tender.<br&gt;<br&gt;I have no criticism of this lunch. The service was perfect, the iced tea was real and the salad was delish. The bill was not cheap for sure but somehow I did not mind paying for good food and such a nice experience. I can&amp;#39;t wait to receive my gift cards so I can return in the near future. Bon appetit as Julia Childs would have said.<br&gt;<br&gt;I checked out the restroom and noted that the facility was clean and well stocked. Lastly, the place was busy for a Tuesday but the noise level was fine and there was no strange annoying music playing in the restaurant to disturb people who wanted to chat over lunch.", "rating": 4, "date": "6/25/2013"}, {"text": "I have been to many Cheesecake Factory restaurants across the U.S., but went to this one for the first time on New Year&amp;#39;s Day.  <br&gt;<br&gt;It seems that the major knock on this location is the sub-par service.  I didn&amp;#39;t encounter that issue when I was there, although the place may have been less popular due to the holiday.<br&gt;<br&gt;The food was good - I shared the everything pizza with my wife and we left feeling full and happy.  I find the portions generous and the prices reasonable.  There also is a great variety and the food is consistently good.<br&gt;<br&gt;If there were a Cheesecake Factory closer to my home, I would probably go more - that is how much I like the chain!", "rating": 4, "date": "1/26/2011"}, {"text": "We find it very crowded and loud. Some of the seats are close together and dont seat where the wait staff heads for the kitchen. The food of course is good and staff are usually on par. We have been here many times and will again.", "rating": 3, "date": "6/10/2013"}, {"text": "This is awesome food and great service.  Go.  Plain and simple", "rating": 5, "date": "9/22/2013"}, {"text": "Ok so chain restaurants kind of give me a bad feeling. So many are poorly executed that I tend to streer clear of them. That being said I am almost always pleased with the cheesecake factory in Towson. I get the healthier side of the menu mostly Asian or Thai type dishes but I am always happy at the end of my meal. I got the pear martini which was both refreshing and just slightly sweet. I had a wonderful birthday dinner and our serve was spot on. So thank you cheesecake factory for finally being a chain that I will continue to go back too. The only bad thing I can think of is the menu is so large it takes me about 20 minutes to decide what I want. But since my family is almost always tardy for the party no biggie. My cocktail and some light browsing of the menu was nice this past Friday night.", "rating": 4, "date": "6/4/2013"}, {"text": "This location is ALWAYS busy. I have never come here and had a wait time of less than 40 minutes. Here are some suggestions if you plan to come here: <br&gt;A.) Don&amp;#39;t come when you&amp;#39;re really hungry--You may be driven to cannibalism while you&amp;#39;re waiting for a table. <br&gt;B.) Don&amp;#39;t come here without reading material/smart phone gaming/portable movie player/folding chair--Since their &amp;#34;table pagers&amp;#34; that they give you will not get a signal beyond 10 feet of their doors, going for a walk around the mall as you wait 3 hours for a table is out of the question. You need to stay entertained somehow. What&amp;#39;s the folding chair for? Oh, that&amp;#39;s for your you to rest your aching feet. There is ONE (1) long bench that is there in the lobby waiting area (inside) and a couple benches beyond the doors of the mall entrance, and as you can imagine, they fill up quickly. This means, you&amp;#39;ll be left with standing for the entire length of time until you get a table assignment which typically takes between 40mins to 1 hr 30 mins for a party of 2-4 people.<br&gt;C.) DO NOT COME HERE IF YOU HAVE A PARTY LARGER THAN FOUR PEOPLE. We made the mistake of coming here with 6 of us one time, and we had a 2 hour wait. They wouldn&amp;#39;t even give us a pager until the wait time was at the 1 hour mark, but after waiting 2 hours and 40 minutes, we decided to just hit up P.F. Changs right next door. <br&gt;<br&gt;Trust me, the quality of service that you&amp;#39;ll get isn&amp;#39;t typically worth the stress of the long wait times. I&amp;#39;ve been here a handfull of times, and each time I am asking myself it it really is worth it. Answer: NO. You&amp;#39;re better off ordering the food to-go, and enjoying the meal in the comfort of your home...where there is NO WAIT TIME.", "rating": 2, "date": "12/8/2012"}, {"text": "Never had a bad experience here, food is great and prices are reasonable. The waiting staff is always courteous and pleasant. Only down fall is I wish they would take reservations or at least do call a heads.", "rating": 5, "date": "3/1/2016"}, {"text": "I have eaten at Cheesecake Factory probably 4 times and have never had a bad meal. The portions are huge. You will definitely have leftovers to bring home. So far, the menu item I liked best has been the Chicken Madeira. My husband had a teriyaki steak dish tonight and that tasted good, too. There are a lot of items to choose from. The cheesecake is delicious.     Most of the slices are big enough to share. My family usually orders two different kinds of slices and shares them. Be prepared to wait a long time to be seated. I have never had less than an hour wait here. Tonight the wait was 1 1/2 hours. You can roam the mall for a bit while waiting as long as you are back 1/2 hour before your estimated wait time given. They do not take reservations or do call ahead seating.", "rating": 4, "date": "3/1/2014"}, {"text": "went here for my birthday with my boyfriend august 4th around 9p.m. got seated really quickly. .got seates by the kitchen (loud and rude conversation, trash being dragged next to our booth as the night went along) me and my bf are both chefa and RARELY go out to eat for that very reason. so when we do head out we expext excellent service KNOWING how the food industry runs.. the waitress (very low hair cut, female, heavyset, darkskin with glasses- didnt give a name so im describing her) was very rude. rushed us when ordering our drinks..didnt come back for our order until 15 minutes later...only refilled my bfs water and only filled my coke once. brought a basket of 2 peices of burnt bread to the table and never came back with more when we told her it was burnt. left us a square of butter in a dirty dish..tgen we don&amp;#39;t see her for anoyher 20 or ao minutes when we pulled her up to take our order...waited another 30 gor our food. (alfredo and cajun pasta) the alfredo was good, bu you could tell the food has been sitting there for a while...my noodles were stuck together..while waiting for our food we conversate about the service and the tip..no later than 5 minutes after that she comes rushing past us yelling &amp;#34;I KNOW I BETTER GET A TIP!! I TREAT MY CUSTOMERS DAMN GOOD, I SHOULDN&amp;#39;T BE HEARING ANY COMPLAINING...&amp;#34; going on and on to the too of her lungs..IN FRONT OF MANAGER&amp;#39;S AND CUSTOMERS..cussing and yelling about a tip..she was ear hustling on our convo knowing she had been avoiding our booyh the whole night. it wasn&amp;#39;t even busy! we then got our food and ahe came over with a nice/nasty attitude clearly you could tell ahe was trying to be smart so we asked for our check to leave...she comes back and asks &amp;#34;oh, you aren&amp;#39;t getting arent cheesecake?!&amp;#34;  we replied.. no and she walked off to get the check..came back for the money and asked if we needed change.. told her rude ass NO nad got my birthday cheesecake from the bakery stand and she walked behind us the entire time...we chooae this CCF because its the best in baltimore...might have to find another spot now..", "rating": 2, "date": "8/6/2018"}, {"text": "Great service tonight!  In town for business and wasn&amp;#39;t really big on the Cheesecake Factory bc the menu is so large but - I was a team with the colleagues and actually- tonight&amp;#39;s visit was quite pleasant! For a friday night- the wait was reasonable. The waiter was FAB! His name was Mike and he was stellar. Very accommodating and prompt. I got the Boston House Salad and added cranberry, avocado and grilled shrimp. Excellent. I must say. Everyone at the table had desert. The mango key lime cheese cake was great. I&amp;#39;d go back definitely!", "rating": 4, "date": "9/13/2013"}, {"text": "Was here yesterday. I was seated almost immediately, and it took a bit to get our bread, but that&amp;#39;s okay. I ordered the Kobe Burger, and it was amazing. It took a while for the waiter to refill our drinks, but it was a pretty busy night. I got the Ultimate Red Velvet Cake Cheesecake to go for dessert. It was great.", "rating": 4, "date": "4/19/2015"}, {"text": "I think Cheesecake is a little overrated. The food is good, depending on what you get. But I&amp;#39;ve never had anything that completely blew me out of the water. It&amp;#39;s good, a little pricey but big portions. But they just need a few new menu items that really blow other restaurants out of the water. <br&gt;<br&gt;But the Oreo cheesecake is a gift from heaven.", "rating": 4, "date": "11/30/2013"}, {"text": "I have been to every cheesecake factory location in Virginia, DC and Maryland. Like many others have said its very nice in there. I have been there for dates, family and girls night out trips. This place is pretty amazing. My favorites are the Buffalo Blasts, Fried Mac n Cheese, Chicken Bellagio, and the flatbreads.<br&gt;<br&gt; I personally don&amp;#39;t care for the avocado rolls and the samosas are okay. Beware of the nachos, very greasy and it gets very repetitive eating it. The biggest problem with this restaurant is if you got past 9pm on a weekend.Service is very rushed and the managers have little patience with complaining customers.  Since its connected to the mall, it gets really crowded. And the cheesecake is obviously amazing. My personal favorite is the White Chocolate Raspberry Truffle.<br&gt;<br&gt;Its a good place to go and the prices seem high but the portion are so big you&amp;#39;ll probably have leftovers.", "rating": 4, "date": "11/18/2011"}, {"text": "I went to this restaurant the other day with a group of co-workers for our holiday luncheon.  I have to say that it was a pretty positive experience, despite my general loathing of chain megaplex restaurants. <br&gt;<br&gt;Three people in our party ordered appetizers to share with the rest of the table. One person ordered the BLT salad which to her shock and awe was a halved head of iceberg lettuce with mayonnaise, egg, bacon and tomato chunks spilling all over it like a volcano science fair project gone wrong.  We all sampled it and were unimpressed.  I thought it was a bad concept all around-messy and hard to eat.  The other appetizer was crab wontons.  Most people liked this, and while I thought it had a good initial &amp;#34;crabby&amp;#34; flavor, but didn&amp;#39;t like the overly greasy after taste.  Another appetizer was the fried/stuffed artichoke hearts.  These were cheesy and delicious enough alone without the dipping sauce it came with.<br&gt;<br&gt; For my lunch, I ordered the Cajun pasta which had shrimp, chicken and vegetables in a spicy sauce over tri-colored linguini. It was very delicious, assertively spicey, and of course an insane amount of food!   Many of the others in our party had the grilled salmon and found it very favorable.  Everyone brought home leftovers and desert.  I enjoyed the key-lime cheese cake, which was suitably tart but assuaged by the additional whipped cream.  <br&gt;<br&gt;Our waitress was pleasant, attentive and quick with our many requests for additional napkins, straws, boxes, etc.  She definitely deserved more than the 15% automatic gratuity for large parties.  All staff there at lunch were pleasant and polite.  I will happily revisit in the future.", "rating": 4, "date": "12/7/2010"}, {"text": "We dined here on Tuesday evening. We were greeted by the hostess and seated immediately. Our waitress acknowledged us immediately as well and took and delivered our drink order promptly.<br&gt;We started with the popcorn shrimp, which arrived piping hot. A rather thick battered shrimp, which hid the taste of the shrimp.<br&gt;Next we ordered the Ahi Tuna and a Cobb Salad. The cobb salad was their modern interpretation. Everything was chopped finely and mixed with their salad dressing and mounded on a large serving dish, all surrounded by a circle of cheese. If you like traditional cobb salads, order something different.<br&gt;The Tuna lacked any taste and perhaps could have been spiced up with a side of Wasabi.<br&gt;The most impressive part of the evening was the waitresses quick response to notice that we didn&amp;#39;t care for the meals and the lightening speed that a manager was a the table to inquire how they could improve the dishes going forward. Other chains could take note of this practice.", "rating": 2, "date": "7/4/2012"}, {"text": "Went on a week night with friends. No wait! We asked about the soup of the day and our waitress even brought a sample that was a very generous portion. Soup was tasty. Asked for a cup of it.<br&gt;<br&gt;I ordered the chicken enchiladas which came with black beans and cilantro rice. The enchiladas and rice were fabulous and the beans I would rate good. My friends ordered a burger with fries and chicken tostadas. Both were satisfied with their meals. <br&gt;<br&gt;We split the featured cheesecake of the month which had Oreos in it....very tasty and plenty for us all to have a portion.  <br&gt;<br&gt;Server was very nice and she gave recommendations and was attentive. The only thing she messed up was that after the sample of soup (Mexican Chicken) I said I would try a cup, but she never put in the order for it. I was so full anyway, I never mentioned it to her.", "rating": 4, "date": "1/28/2013"}, {"text": "Service was terrible. Apparently you are only permitted 1 glass of water during your meal. The waitress brought her kids with her and they were serving us bread. This has to be illegal some how. Food was so-so and the portions were large. Management needs to hire higher quality people!", "rating": 2, "date": "8/4/2012"}, {"text": "It is the same everywhere you go. Lots of choices, never had a bad meal. More stars for individuality, the cookie cutter familiarity brings a 4 star meal to a 3 star review so if you live on the moon and have never been to a Cheesecake &amp;#34;Fattery&amp;#34;, don&amp;#39;t hesitate to give it a try.", "rating": 3, "date": "9/10/2012"}, {"text": "I&amp;#39;m less a fan of chain restaurants, but my times at this Cheesecake Factory location have been good and everyone&amp;#39;s friendly, and not long a wait compared to hours at other locations. The restaurant&amp;#39;s in a hidden place of the shopping center; park across the street.", "rating": 4, "date": "11/11/2013"}, {"text": "What a great cheesecake factory!. It was my 1st time at this location so I wasn&amp;#39;t sure what to expect but wow!. Great food, beautiful place and terrific service. It earns  5 stars with me. We came in for brunch on Sunday. I had the lunch portion of the Chinese chicken salad. That was so large!. Crispy lettuce, almonds, grilled chicken, rice noodles and mandarine oranges in a ginger dressing. Tasty. My husband had the bang bang chicken and shrimp( a yummy Thai pasta dish ). For dessert I chose to skip the cheesecake( not an easy thing to to). Instead I opted for a bowl of perfectly ripe strawberries. My husband had the Godiva cheesecake. I took one bite and it tasted like a dark chocolate bar. I will be back here next month :-).", "rating": 5, "date": "1/30/2012"}, {"text": "So this place has been labeled the most unhealthy of all the chain restaurants. So much so they refuse to post calorie count.. Yes I am a healthy eater. One can assume if you are coming here you know what you are getting.. HOWEVER they now have a great healthy options menu. Turkey burgers, proteins without all the sauces. If you are going here for your typical birthday celebrations. Don&amp;#39;t be scared. You now have options. Or otherwise enjoy the great food they have work it off the next and don&amp;#39;t forget a slice of cake... Because everyone MUST EAT CAKE! Especially cheesecake. Sssh don&amp;#39;t tell my trainer. Lol", "rating": 3, "date": "11/17/2012"}, {"text": "Located in the Towson Towne Center, this Cheesecake Factory does a very brisk business. I have been there twice in the last few months and had great service each time. They now have a healthier options menu and the dishes were better than I expected.  While the food is standard casual fare, the cheesecake is very good! The Cheesecake Factory is a good option for good food in a fun environment after a day of shopping!", "rating": 3, "date": "1/5/2013"}, {"text": "We LOVE the Cheesecake Factory!!  Not what it does to our waistlines, but still.....<br&gt;This chain is the epitome of lard*ss American excess! You can get leftovers for 2 days off one meal, or eat yourself into a fat, salt, and just plain-too-much coma all in one sitting!<br&gt;And the food is surprising really good! The Kobe beef burger-- juicy beef, tastes really grilled in texture and flavor (maybe it is REALLY grilled, but I still have a chain prejudice where I can&amp;#39;t quite believe it and suspect it&amp;#39;s the best gourmet liquid smoke invented), beef tender and melty, rich brioche bun, just a smear of mayo and sweet, rich sauted onion....ohh, man, it&amp;#39;s good.....big-*ss salads, HUGE pizza (bigger than my son&amp;#39;s head, but he keeps ordering them-- and it&amp;#39;s the KID&amp;#39;s menu size, for like what, a baby elephant??? Yet the cheese is gooey and tangy, the sauce slightly spicy and sweet, the crust crisp yet chewy.....)<br&gt;And I can go on and on.....<br&gt;But- on an ironic note-- the CHEESECAKE SUCKS!!  I&amp;#39;ve tried a few times and gave up- do I just like odd flavors that don&amp;#39;t sell?? It&amp;#39;s tasted freezer-burned every time I&amp;#39;ve had it. Yuck! Not like I need the extra coronary bypass, but, please, it&amp;#39;s called the Cheesecake Factory.....<br&gt;Service has always been quick and attentive, once you&amp;#39;re seated.<br&gt;I like eating at the bar, too- much quicker to get in and served.<br&gt;I love this chain, and I&amp;#39;m not ashamed, because it IS HIGH QUALITY -- and the portions are so huge one noodle could feed an army!!  (speaking of high, and I could just imagine eating here high w/munchies--- you&amp;#39;d bust your gut right open!! Drugs kill!!!!!!)", "rating": 4, "date": "8/20/2011"}, {"text": "We waited for 30 minutes for a table. When we went to sit down, the server asked us to wait just a little longer while she cleaned the table. After another five minutes, we sat down. Then, the manager came by to say that there was a mistake, and we couldn&amp;#39;t sit there. While we waited, we saw person after person get tired of waiting to pay the bill. Suggest you skip this place and go to one of the many other restaurants at the Dulaney Valley Mall.", "rating": 1, "date": "2/28/2015"}, {"text": "The food here is decent and very much expected for a typical chain. The people at this location are very customer service oriented from my experience. It&amp;#39;s a shame they have to deal with the nut jobs and trash who tend to frequent this location. According to many, Towson used to be clean, safe and more upscale. I&amp;#39;d like to GPS the location of whatever Towson (mall) that was, because this one is red sticker away from being an outlet mall.", "rating": 3, "date": "8/24/2013"}, {"text": "I love this place. Everyone knows that the food and atmosphere is good. However, I love the idea of the curbside pickup - when it works... the management should look at improving the customer service around curbside pickup. I keep trying to do curbside pickup - about once a week. It starts with the phone call. I typically call my order in when I&amp;#39;m about a half an hour away from the restaurant. However every time I call, I am put on hold. Most of the time, I&amp;#39;m on hold for an indefinite amount of time. Yesterday I waited for five minutes on hold until I hung up. I called back again and was put on hold for another 10 minutes. This is valuable time since I was driving to the restaurant and I needed that time for the food to be prepared, so the food would be ready when I got there. What needs to happen, is management needs to implement warm transfers. I was waiting to be transferred to the bakery so someone can at least place my order, but I couldn&amp;#39;t even get my order placed because I was still on hold. So I called back and I talked to the lady who answered the phone and asked them to do a warm transfer over to the bakery. This means that someone would stay on the phone call and ensure that my transfer from one real human being to another real human being occurs. Instead the woman who answered the phone, Rachel, said that I just had to wait on hold and someone will answer when they get to me. It was a poor customer service experience for such a good restaurant.  Although I enjoy the restaurant, I probably won&amp;#39;t do curbside anymore.", "rating": 2, "date": "12/2/2016"}, {"text": "The food is pretty good.  I not a big fan of having to wait to be seated 75% of the time I go there.  My family loves it so, I will definitely go again.", "rating": 3, "date": "7/24/2011"}, {"text": "Worst service ever both inside and with curbside service. Staff has terrible attitude and hung up on me when calling to inform them that I&amp;#39;d arrived for curbside service and the food never came. Called to speak to a manager and the staff member hung up on me. Worst. Restaurant. Ever. And I&amp;#39;ll make sure everyone I talk to knows not to go to this location.", "rating": 1, "date": "11/8/2014"}, {"text": "I&amp;#39;d have to echo the suggestion of eating dinner somewhere else and getting a slice of cheesecake to go.  I mean, you&amp;#39;re just coming here for the cheesecake right?  The food is fine, and the portions are large, but it&amp;#39;s really not GOOD food. <br&gt;<br&gt;While the cheesecake is incredibly good, I&amp;#39;d have to recommend staying away from the cookie dough cheesecake unless you really like cookie dough and are ok eating half a pound of it with a few morsels of cheesecake thrown on.", "rating": 3, "date": "9/13/2009"}, {"text": "Their newest location, opened a few months ago and its fairly typical of most of the other ones.  Had a birthday dinner here, on a Monday, they were fairly busy.  I loved the fact they had 1+1 booths, gives a private cozy feel to the place.  The food is average American fair, I ordered a pasta bolognese, it was ok, large portion.  I had to box mine up, do not order shelf liquor drinks, they are weak.  Stick to the drinks on the menu.  Wait time was reasonable for the food, I think they were understaffed for a Monday.  Otherwise a pleasant experience.", "rating": 4, "date": "1/18/2009"}, {"text": "Our group of 7 went here for a weekday lunch.  Despite the fact that there was plenty of seating available, we were kept waiting in the lobby until &amp;#34;at least half&amp;#34; of our party had arrived.  Why??  Were they afraid they weren&amp;#39;t coming?!  We tried a variety of appetizers, potstickers (sauce was too tangy), lettuce wraps(PF Changs has them beat hands down), and calamari (fine, but nothing special).  I appreciate that you can substitute a salad for fries and they are very accomodating about putting sauces/dressings on the side.  Mostly we had sandwiches, which were, again, fine...nothing spectacular.  Their notoriously large portions left us with no room for dessert.  Service was good, seats are too close together, decor is nice.  Parking (even at lunchtime) is a nightmare.", "rating": 2, "date": "9/4/2011"}, {"text": "We happened to be in the Towson area, so we cruised into the Cheesecake Factory.  We had last eaten in the King of Prussia, PA CKF, about 7 years ago.  Once every 7 years is too soon.  My poor wife ordered an Ahi Tuna roll as an appetizer.  It smelled fishy (fresh fish has no odor).  It was smothered in some kind of mayonnaise-based mystery sauce and clothed in a greasy deep fried wrap.  I too, made the mistake of trying a piece. Well, we both paid the gastrointestinal distressed price.  . . for 2 days.  When the waitress asked (in an half-hearted way) &amp;#34;how was the meal&amp;#34;, we told her LOUSY!  Not fresh, fish stank, etc.  We got no response from the waitress or management.  We ate our piece of obligatory over-priced cheesecake (split 3 ways) and escaped.  Not good, not worth the money.  Place was packed, so I guess they think they do not have to care about the food quality or customer service. Stay away.", "rating": 1, "date": "12/17/2013"}, {"text": "Always very busy here... Most of the time it takes a while to get a seat here but the only thing Cheesecake factory has going for it is just desert.  Most of the food is ok but they charge you a lot for quality that is lacking.", "rating": 3, "date": "3/6/2011"}, {"text": "I thought the food was excellent, the portions were large and the price was right. Be careful, it will be hard to save room for dessert.... which is half the reason to go! I really enjoyed their tamale corn cake appetizer, sweet, savory AND a little bit of spice! The place was a bit noisy and crowded, but that is what I expected for a Sunday, though I expect it to be busy most of the time.", "rating": 4, "date": "8/22/2011"}, {"text": "Went on a Sunday around 2:30 pm and were seated right away. Of course all we had was dessert. I had the Banana Cream Cheese cake and was very surprised that it wasn&amp;#39;t too heavy. I was able to finish it! It came with slices of fresh bananas and Bavarian cream. Wonderful! Our waiter was excellent. It took about 25 minutes from the time we sat down until we left. I can say that was the fastest service I have ever had at any CF. I guess that it&amp;#39;s all about timing at this CF.", "rating": 4, "date": "7/17/2011"}, {"text": "Incredible food selection to satisfy anyone. Their alcohol is awesome as well. Be warned: their portions are HUGE (you may wanna split an entree with someone). Their desserts are 2nd to none. The service is quick and knowledgeable. I go here maybe 2 or 3 times a year and have never had a negative experience.", "rating": 5, "date": "4/15/2014"}, {"text": "One thing you can trust with Cheesecake Factory - the food is consistently good.  I have never had a bad meal there.  This is my weekend go-to place.  I love their skinnylicious menu, especially the asian style taco.  You can almost order any food on the menu and guarantee that it is going to be above expectation.  They are usually packed during the lunch hour at weekended.  We usually wait 10 minutes to be seated.   The food portion is huge, regardless whether you order the lunch portion or not, I always have the rest take home with me for another meal.  Their waiters and waitresses are all young people, with good and friendly attitude.  The service is relatively fast even when they have a full house.  You can see into the kitchen when they work on the food.  So you know it is clean.  However, most foods here are high in calories (and that is why I am so happy about their skinnylicious manu).  Their cheesecake is also creamy and the best I&amp;#39;ve ever had, but very fattening.", "rating": 5, "date": "6/24/2013"}, {"text": "The Cheesecake Factory is one of my favorite places to dine at. There Miso Salmon is almost next to none. But this location is previously said in other reviews is extremely crowded. Service lacks because of it, and last week when I came here they did not give us any bread. We had to wait a while to receive our check. A recommendation would be to have the waiters/waitresses take on fewer tables. Our waitress had over 6 tables on her own!", "rating": 3, "date": "4/30/2013"}, {"text": "Nachos were burnt and they were a bit stingy with the chicken and sour cream...My waitress was sweet, polite, and prompt. Their lunch chicken alfredo was very peppery!!! But it was still bearable and quite good. Soda was super delicious but water tasted a bit tapped. Best time to eat here is in the evening and on the weekend!", "rating": 4, "date": "10/1/2013"}, {"text": "Their menu has so much variety, if you aren&amp;#39;t sure what you are hungry for, don&amp;#39;t worry they have everything from Chinese to pasta on the menu. There is usually a wait here so I would definitely put in your name and then go shop at the mall while you wait.", "rating": 4, "date": "10/24/2010"}, {"text": "We visited on a Saturday and were seated immediately because the restaurant was not busy at all - it seemed like about half the tables in the place were empty. However, it was a solid ten minutes before our waitress bothered to greet us and take our drink and appetizer orders. Our appetizers came out quickly and were delivered by a runner before our waitress even took our meal order. We also had to ask the waitress for a bread basket, which at every other visit has been placed on the table within minutes of being seated. She acted like it was a terrible bother to go get one for us, but it&amp;#39;s one of the things we look forward to when dining here. Our meals came out quickly once we finally got to order and were again brought out by a runner. The food was average but nothing great, they have far too large a menu to do anything really well.  Our waitress never came back to see how things were or ask if we needed anything; she walked past at least half a dozen times but didn&amp;#39;t stop to check on us at all until she wanted us to order dessert which we declined. The waitress was quick to bring the check, but then didn&amp;#39;t come back to collect it for about ten minutes. This seems to be a general trend at all of the locations I&amp;#39;ve been to, so I shouldn&amp;#39;t expect anything better but I always do and am usually disappointed.", "rating": 2, "date": "5/16/2015"}, {"text": "Good food, okay service. Weve been to this location twice, and the first time was a five star experience. The waiter was amazing and the food was excellent. <br&gt;The second time we waited a long while for the server to even recognize us. ( and mind you it was slow). <br&gt;BUT the food was still good (which to me is important).", "rating": 3, "date": "7/3/2011"}, {"text": "I went to Cheesecake Factory on Monday night and was a fan of it. I had only been once and it was to the location downtown. I parked in the garage between Fridays and The Cheesecake Factory without a problem and was able to walk down the steps right to the Cheesecake Factory. My friends were already there and seated and said they only had to wait 5 minutes. Awesome...considering I thought it&amp;#39;d be atleast an hour wait because it was 6 o&amp;#39;clock and they take you on a first come, first serve basis. <br&gt;<br&gt;When I walked in the place was already pretty hopping. For appetizers we ordered crab dip and calamari which was yummy. They also gave us lots of bread which we also used to dip into the crab dip since it had only tiny slivers of bread that came with it. There was a ton of calamari that came with garlic dip and cocktail sauce which was very yummy even though I&amp;#39;m not too fond of knowing that it was squid.<br&gt;<br&gt;For dinner I ordered a special that was breaded chicken in a light wine butter sauce with broccoli and mashed potatoes. I think that there could have been more sauce, but it did come with two huge chicken breasts. I did enjoy it and thought it was different even though it didn&amp;#39;t knock my socks off. My other friend ordered the same thing as me, and my two other friends ordered the Shrimp Scampi and Cajun Jambalaya Pasta that had shrimp, chicken sauteed with onions, tomato, and peppers in a spicy cajun sauce on top of linguini.  Portions seemed huge and while some things on the menu can definitely be pricey, but there are also some pretty reasonable choices as well depending on what you get. For dessert my friend ordered a Banana Cream Cheesecake which I had a few bites of which was of course delicious, and my other friends ordered and shared a Chocolate Chip Cookie Dough cheesecake. I mean, you can&amp;#39;t really go wrong with a huge slice of cheesecake.<br&gt;<br&gt;Our waitress was really sweet and really on the ball with refilling drinks (and bringing a bowl of lemons for the water!) which I liked and our appetizers came out pretty much right away. I really liked the decorations and the design of the place. It was huge inside. I was also in a good mood that there was no line, although I&amp;#39;m aware that sometimes this place can get pretty packed and waits can be aware from an hour to two hours and even longer. Also heard that valet parking is $5 bucks which could be worth it if parking is a bummer, which I know it can be. Sometimes the parking garages can fill up fast. <br&gt;<br&gt;However, if you want to go here, I&amp;#39;d suggest NOT looking at the calorie content of your meal online OR of that cheesecake that you think you want to delight yourself with at the end...", "rating": 4, "date": "5/11/2010"}, {"text": "food excelent but staff was clueless and ignorent....think twice before stopping here....manager is just as clueless!!!", "rating": 2, "date": "5/30/2013"}, {"text": "I came here with a date because I was craving the Dulce De Leche cheesecake. Yum! Yum! Yum! <br&gt;I had great service, great food and a pleasant time. I love the cheesecake and it doesn&amp;#39;t bother me that there are large portions of food. Whatever you don&amp;#39;t eat, take it home.", "rating": 4, "date": "8/29/2010"}, {"text": "Don&amp;#39;t get me wrong, I am a fan of the fact that the Cheesecake Factory has a huge menu so there is something for everyone. The food is always consistent across locations too, so that wasn&amp;#39;t my problem.<br&gt;<br&gt;My problem was the 3 hour dining time. After a half hour wait I had what might be the worst waiter I&amp;#39;ve ever had at any restaurant in my life. This guy, Thomas I think his name was (looks like a combination of Jack Sparrow / Spencer from Criminal minds) was horrible. I could&amp;#39;ve lived with the fact that he was socially retarded, but the the fact that I couldn&amp;#39;t live with is how shitty the service was. Not only did our glasses spend most of the time empty, but it seemed like he was trying to avoid coming to anybody&amp;#39;s table and whenever he did it was to remind us that he forgot to do whatever he said he was going to do. It seemed like it took a half hour for everything, half hour to bring us drinks, half hour to take our orders, half hour to bring us refills, check, dessert menu, etc. It was just frustrating because I didn&amp;#39;t intend to spend my whole night at a Cheesecake factory, dinner shouldn&amp;#39;t exceed an hour. I thought maybe we were being impatient but I heard the table across from us asking another waiter about him too because they didn&amp;#39;t seem to be a fan either.<br&gt;<br&gt;I&amp;#39;ve never really felt the need to Yelp a chain restaurant before but I&amp;#39;d love to hear if other Yelpers have had this guy too and I hope maybe they can move him off of tables so people don&amp;#39;t go through what we did.", "rating": 2, "date": "9/12/2010"}, {"text": "As much as I love Cheesecake Factory, it&amp;#39;s actually not perfect. It has some major flaws. As great as the food is it&amp;#39;s been less and less about customer service. Lines are out the door, you are lucky enough to get a table on an off night or before the dinner rush. Forget any other time. If you get a table you are waiting a very long time for food. The food portions are very large but so are the prices. An appetizer could feed a family so if you wanna go cheap order an app. Though at this place cheap is unheard of. The ambiance is nice, great for a date type setting. 99 percent of the time food comes out great though once I went here and a bone wasn&amp;#39;t removed from the pulled pork and I hit my tooth on it and my friend&amp;#39;s burger was way undercooked. That&amp;#39;s what happens when they don&amp;#39;t quality check the food. We did get our meals comped on the same night and I got a replacement meal so they do try to make up for short comings. The menu is vast for apps meals and cheesecake varieties. Everyone can find something. So if you are willing to overlook flaws and wait...and wait for what you love then you will enjoy it here.", "rating": 4, "date": "10/4/2010"}, {"text": "The food is insanely fatty.  Pizzas are loaded up with cheese.  I felt horrible the next day.  I think this place might kill you if you eat there too often (<a href=\"/redir?url=http%3A%2F%2Fcalorielab.com%2Fnews%2F2007%2F07%2F28%2Fcalorie-pusher-comes-to-town-the-cheesecake-factory-hits-rochester%2F&amp;amp;s=a07a5762c921f103c507ff6f4ffaef53a042664c9df5770fce1ae1f93b6a934f\" target=\"_blank\" rel=\"nofollow\"&gt;calorielab.com/news/2007…</a&gt;).  Other than that, it seems like a nice, family-oriented place.", "rating": 1, "date": "2/27/2010"}]}