{"address": ["14559 SW 5th St", "Ste 4060", "Pembroke Pines, FL 33027"], "monthly_reviews": {"2019": [[0, 4.0], [1, 4.0], [2, 3.0], [3, 3.5], [4, 3.5], [5, 4.0], [6, 4.5], [7, 4.0], [8, 3.0], [9, 3.0], [10, 3.5], [11, 4.0]], "2017": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.0], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.0], [11, 3.0]], "2020": [[0, 4.0], [1, 3.0], [2, 3.5], [3, 4.0], [4, 4.0], [5, 4.0], [6, 4.0], [7, 3.5], [8, 3.0], [9, 4.0], [10, 4.5], [11, 4.0]], "2018": [[0, 3.5], [1, 4.0], [2, 3.5], [3, 3.0], [4, 3.5], [5, 3.5], [6, 4.0], [7, 4.0], [8, 4.0], [9, 4.0], [10, 4.0], [11, 3.5]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "I mean... can you really go wrong with Cheesecake Factory?  I feel like it&amp;#39;s just one of those staple restaurants that never fails.  Not fancy but not low quality either.  <br&gt;<br&gt;After a long day of shopping, we needed to eat and ended up at this location.  We were seated fairly quickly for a packed early Sunday evening.  <br&gt;<br&gt;I always get the same thing. The Jamaican black pepper shrimp. It never disappoints. We also had the pork belly sliders (delish).  The service was great and the drinks (mojitos) were awesome.", "rating": 4, "date": "10/19/2019"}, {"text": "I am a cheesecake factory fan.. love the decor and ambiance..if you can&amp;#39;t go to Italy let it come to you!<br&gt;<br&gt;Service was good,asses of food choices. This time I had the beetroot avocado and orange mini salad... very nice especially with the crispy nut shavings  on top. My main was the skinnyliciois chicken pot pie, which was ok, although I would not have this again. My three stars is a reflective of my main dish which disappointed me somewhat.  However I would come back.", "rating": 3, "date": "9/14/2019"}, {"text": "I love this place. Even though it is a &amp;#34;chain restaurant &amp;#34; the food and service never disappoint. Everything I&amp;#39;ve ever had from here has been top notch - including my favorite pineapple mojito!", "rating": 5, "date": "9/19/2020"}, {"text": "I recently came here for dinner with a large party of  about 20. Food was good and the service was ok. But  BOTH of their restrooms were out of order. I think this should have been something mentioned to customers upon approaching the hostess. Additionally, they were out of several menu items and came back to the table a couple of times for some of us to change our order.", "rating": 3, "date": "2/9/2020"}, {"text": "Would not let my family group sit together because we lived in different homes.... ridiculous because it does not affect the restaurant in any way if we sit in a group. They would still be serving the same people. So since the manager could care less, we left to another restaurant.", "rating": 1, "date": "1/17/2021"}, {"text": "Absolutely awful service one of the worst dining experiences in a long time. Me and my party of 9 went to celebrate a friends birthday and our server Sinai was cold and ignored us all night waited 20 minutes on water refills  cocktails were melted by the time they were dropped at the table. <br&gt;Food took an hour for some and 90 minutes for others and all of it was cold <br&gt;<br&gt;I sent back my food and it was returned to me nuked in the microwave. At no point after sending my food back was a manager brought by to check on me <br&gt;<br&gt;Afterwards the desserts and togo boxes took over 50 minutes to come. After being fed up with the way we were handled we decided to adjusted the auto added gratuity. She confronted us about it and demanded we leave more money which is a huge red flag.<br&gt;<br&gt;I and everyone at my table was in the service industry none of us would dream treating a table like this and I&amp;#39;m frankly disappointed in Cheesecake Factory tonight.", "rating": 1, "date": "6/12/2020"}, {"text": "Love this location, great service, friendly staff, and fantastic food. Our waiter made our anniversary date super nice. The location was really busy, but we had reservations and did not wait long. We have been in locations in the Midwest and on both coasts, this is our favorite.", "rating": 5, "date": "11/5/2020"}, {"text": "I have been coming to cheesecake factory since dating my husband and it never fails me. The food is always on point. I love going to a restaurant that is consistently good. I hate going somewhere and the food is good  1 time then the next time it sucks.  The restaurant is a chain but  always good. The staff is usually nice and friendly.  The restaurant is clean and the decor has a Tuscan look very inviting. There is always a wait to get in so be aware especially on holidays wait can be from 2 hours. Usual wait time is 15 to 30 minutes. Now portions of the food is very good. I never get a chance to get dessert because I&amp;#39;m always full from my entree. I usually do an appitetizer then a cheesecake in order to taste the desserts. I love the cheesecake factory only 4 stars because waiter forgot somethings we asked for and the wait time but  it was new years day so he will get a pass.", "rating": 4, "date": "1/1/2020"}, {"text": "Visited THe Cheesecake Factory in Pines today. It wasn&amp;#39;t our first time to this location but wanted to comment on the service by Melissa C.   She was great and making sure we had a wonderful experience.", "rating": 5, "date": "11/22/2020"}, {"text": "Visited on a weekend &amp;amp; I haven&amp;#39;t dined here since before covid. Some social distancing in the patio was nice. Alex b. was a kind server &amp;amp; gave me a nice drink suggestion/pleasant experience. Interested in trying cheesecake&amp;#39;s brunch soon", "rating": 5, "date": "11/29/2020"}, {"text": "First of all, shoutout to Brandon our server whose literally a boss at his job. We&amp;#39;ve never been disappointed at this location, but Today was such an awesome experience. We got there with little time before work and I honestly thought it was going to be a 2 hour and 30 minute ordeal. From the time we left the car, ate, and left it was 1 hour.<br&gt;<br&gt;Our drinks &amp;amp; appetizer came out in a timely manner, we destroyed the calamari. I kid you not, we left crumbs. I love that they have cocktail and a garlic sauce and not marinara like other places. <br&gt;<br&gt;We then ordered chicken chipotle pasta and Chicken Parmesan with angel hair. The chicken in the pasta was a little overdone, but the sauce and ingredients... AMAZING. The chicken Parmesan was so out of this world, moist, cooked properly and seasoned to perfection. We then finished with an Oreo cheesecake. Delicious.<br&gt;<br&gt;I have absolutely no complaints about this place. It makes sense why it gets so packed.!", "rating": 5, "date": "7/25/2019"}, {"text": "Great food. Great service. The waiter was very considerate in explaining vegan, gluten or dairy free options.", "rating": 4, "date": "1/11/2020"}, {"text": "Last time I come here.  Customer service is out the door.  We purchased a great deal during Covid, and their app is horrible.  The online didn&amp;#39;t go thru and the girl at the restaurant didn&amp;#39;t see it.  So my wife submitted again, and when my son went to pick it up, they had 2 duplicate orders for me.  They charged me twice, total of 4 sandwich purchases.  The order was for 2 sandwiches.   We spoke to the manager and she was.not helpful.  She only gave us a credit for 1 sandwich, not two.   Poor customer service !!!!  Never again !!!", "rating": 1, "date": "11/25/2020"}, {"text": "Love going to this spot for dinner or lunch! The service is always amazing and the food is so fresh. The menu has something for everyone and the desert variety is out of this world! Two things that I could live off for the rest of my life are pasta and seafood, so needless to say I ordered something that involves both. The Bistro Shrimp Pasta  is to die for. It&amp;#39;s so creamy and flavorful and perfect for those that are not a fan of &amp;#34;red sauce&amp;#34; pasta!", "rating": 5, "date": "12/21/2019"}, {"text": "Good variety and always very consistent. Thai lettuce wraps are my favorite! Their Cheesecake Factory merlot was very good.", "rating": 4, "date": "12/27/2020"}, {"text": "It really helped having a reservation for 6:00 dining on a Saturday. The restaurant was totally crowded when we arrived but we hardly waited at all. Our server Oscar was outstanding every thing came timely and was delish!", "rating": 5, "date": "10/17/2020"}, {"text": "I love cheesecake and it&amp;#39;s a nice place sometimes for a quick meal.  When the restrictions from Covid was lifted slightly I did notice there&amp;#39;s procedures for social distance &amp;amp; cleanliness was not being followed once I advised the Manager she immediately handled it so great job.  My waitress Diva is always pleasant and on point.", "rating": 5, "date": "11/6/2020"}, {"text": "I&amp;#39;ve always come for lunch and dinner, but not for brunch. Got here right at 10am and we were sat immediately. We were greeted by our server right away and got ready for my wife&amp;#39;s birthday brunch. My wife ordered huevos rancheros, I ordered chicken and waffles Benedict (amazing), and the others had chicken and waffles, and someone had the monte cristo, another great dish. Definitely recommend this place, but like all Cheesecake Factory&amp;#39;s, get there early!", "rating": 5, "date": "10/5/2019"}, {"text": "My sister and I made a trip to the Sephora in Pembroke Gardens After our shopping spree we were famished from carrying around all of our make up lol...so we decided to get some lunch. We walked over to the CheeseCake  factory there was no wait for lunch and we were seated immediately in a comfortable booth. The restaurant was clean and orderly and wasn&amp;#39;t too loud. My sister ordered the avocado toast that had a beautiful presentation and my sister said that it tasted wonderful. I had the chinese  chicken salad the lunch portion and the dressing was extremely flavorful! Our booth had half walls on three sides so it was very private which made it a nice visit with my sister. Our server was amazing we never had to wait for a single thing but he also didn&amp;#39;t come over too much and be a bother. It was the perfect amount of service for all these reasons I would highly recommend the Cheesecake factory in Pembroke Gardens.", "rating": 5, "date": "3/7/2020"}, {"text": "This was my first time visiting this location. I normally go to their locations in Sawgrass Mills or on Las Olas so much expectations were based on those past experiences. Since we are currently in the middle of a pandemic every restaurant that I&amp;#39;ve visited has a pretty specific set of guidelines they&amp;#39;ve enlisted. The usual things such as face masks and social distancing are &amp;#34;required&amp;#34; here as well. Based on what I saw I&amp;#39;d have to say that they are very slight suggestions. <br&gt;<br&gt;Based on signage there is supposed to be one way in and one way out. At the entrance there was a young woman wearing a mask taking reservations. I gave her my name and number and proceeded to wait for an outdoor table. While I&amp;#39;m waiting I see plenty of people walk right by the young lady and go right inside. I&amp;#39;m assuming they will be sent back outside to put their names on the list but no one is sent back out. Also, the door clearly labeled &amp;#34;Exit Only&amp;#34; was used as an entrance multiple times and there was no one stopping people and sending them to the young woman to make reservations. That was bothersome to watch.<br&gt;<br&gt;Fast forward and we are escorted to an outside table. The table was kinda clean but it looked as though every single crumb and leftover piece of food that was on the table was just wiped onto the seat. They were pretty easy to see since my 7 year old was the one that pointed it out to me. We waited a bit for someone to come and wipe off the seats which got me thinking about dirty surfaces. I asked the buss boy that came how often they wiped down menus and stuff and he told me after every new guest. I also asked my waiter and he said the same thick, which was very encouraging until I put it to the test. When I received my menu it was pretty nasty to say the least. I&amp;#39;ve gone to multiple restaurants and everyone uses paper menus. Now I know Cheesecake Factory has a pretty extensive menu so that might be a challenge but they aren&amp;#39;t a mom and pop operation and this isn&amp;#39;t some low budget fast food restaurant so whatever the case may be this needs to be addressed. If you can&amp;#39;t have someone actually wiping down these surfaces then you should be offering paper menus or at the very least give people a link to view it on their phones. Yes, having someone dedicated to wiping down menus or investing in paper menus is an added cost but I believe it can be done efficiently and effectively if taken seriously. Paper menus and plastic utensils should be an option.<br&gt;<br&gt;IMO, it felt as though management was just pulling a PR move with the exit/entrance only, we wipe down all surfaces after every customer, etc. because I heard it all but I didn&amp;#39;t see anything in action... it was all a facade.<br&gt;<br&gt;I didn&amp;#39;t see much inside so I can&amp;#39;t comment on that but they were following social distancing guidelines outside. Every other table had been closed off. My waiter was wearing a mask and gloves. He was very professional and made great efforts to help me and my family remain comfortable. The outdoor seating was comfortable. It was very humid which made me realize that they didn&amp;#39;t have any fans or they didn&amp;#39;t have any fans on. The location in sawgrass always has them on.<br&gt;<br&gt;Their portions are always excellent. I always leave with a doggy bag. The food was good. My son had the kids grilled cheese which he said was very cheesy lol. Not sure which way to go with that but the fries tasted good to me. I got the orange chicken which was very orange-y. I can&amp;#39;t blame the restaurant but I&amp;#39;m used to eating orange chicken with a slight teriyaki mix. The brown rice was good. I wish I could remember my server because he did an excellent job and deserves a shoutout.<br&gt;<br&gt;All in all, my server and the food were both good. I felt a bit uneasy with all the social distancing errors I watched. This isn&amp;#39;t the first week things have been open so I&amp;#39;d assume that management has had enough time to fix the things they actually intend to fix which leads me to believe that this issues I stated won&amp;#39;t be addressed. I&amp;#39;m not sure if the problem resonates from the location or the chain overall but if it&amp;#39;s the latter then I&amp;#39;m just going to have to bypass them until I&amp;#39;m able to let my guards down. <br&gt;<br&gt;Seeing as Florida set a single day national record for COVID cases (worse then NY) on the same day I visited this location and witnessed all of this I&amp;#39;m not sure how long that will be.", "rating": 3, "date": "7/13/2020"}, {"text": "This business is not doing their best during Covid.  Walked in took my number and was told we would text you. As 30 mins went and tables that showed up after me was promptly sat. I told the hostess look tables are clearly passing me up and she told me to wait the system was not broken. Ok waited another 15min I&amp;#39;m enraged at this point and asked for a manager who then quickly sat me. Oh it gets better, as I sat I was given my food with no setups nor napkin. I asked for these things only to be handed my utensil and one paper napkin while everyone around me had setups and cloth napkins. This place goes out of their way to not make you feel welcome. I guess I was the lucky one today. No worries Sawgrass is far better even Aventura in Miami has them beat. Remember the Hostess can be responsible for ruining your whole meal. They can at least be more welcoming and accommodating.", "rating": 1, "date": "10/12/2020"}, {"text": "I have a tendency to order 3-4 appetizers for my entree because I can&amp;#39;t commit to eating 1 thing. The buffalo blast is something we order every time we got. It have buffalo chicken and cheese inside wonton skin and fried to perfect crisp. The Korean fried cauliflower is my other favorite. It doesn&amp;#39;t event taste like cauliflower! It taste like boneless wings with sweet and a airy sauce. A must try. And the loaded tots is a perfect side of carbs. Itexplodes in your moth with all the flavors of mashed potatoes <br&gt;FOOD: A+++<br&gt;CUSTOMER SERVICE: always attentive and friendly <br&gt;COST: $$ per person <br&gt;SERVING TIME: food comes out in 15-25 mins. Waiting time during peak house (weekends) could be a a long as an hour <br&gt;AMBIANCE: semi upscale - high end casual <br&gt;OUTDOOR seating: yes- covered <br&gt;PARKING: plaza parking or valet", "rating": 4, "date": "4/28/2019"}, {"text": "So to start, our server Alex was a sweet heart and my friends fish and chips were good. My spaghetti and meatballs ball on the other hand were aweful. Firstly they came out cold and I sent them back, when they can back out they were just warm, but my friend was almost done eating and I was hungry so decided to eat.  The meatballs tasted funny so I had a little of the pasta which was also like warm so decided not to eat anymore. When Alex returned and asked if I wanted a box I said no, and that the food was not good.  At no time did the manager appear and apologize and I was billed for all the food.  On my way home I had to pull over and throw up and am now in bed. Have called and let them know they should maybe take the meatballs off the menu today and Mike the manager has given a refund, and was very polite and professional, maybe one day we will go back!", "rating": 4, "date": "12/18/2020"}, {"text": "I have not been to this Cheesecake in over 6 years. In fact, I have not been to a Cheesecake Factory since 2015. It was a late Saturday night when we decided we wanted food. Unfortunately, at 10pm at night, your only options are fast food. I was shocked when I saw all the local locations are open until 12:30am! So we ventured.<br&gt;<br&gt;As usual, we decided to sit at the bar. It was pretty crowded but most empty chairs were occupied of purses by inconsiderate people. Luckily we found 2 seats together at the end. There were 2 bartenders, who were both busy when we sat. One said he will be right with us but the other wound up assisting us. I ordered the cucumber martini and hubby ordered some tiki punch. Both drinks were really good. Unfortunately, we peeked at the receipt and my drink was $14 and his was $11! So I ordered a glass of Riesling and hubby ordered a beer for the next round.<br&gt;<br&gt;I ordered the chipotle pasta. It was described on the menu with a spicy cream sauce but the sauce was more tomato based. I used to order a pasta dish that was like this but more creamy and with farfalle pasta instead of penne. The bartender said the Cajun pasta was like that. Whatever, it was still good. Hubby ordered chicken fajitas and he enjoyed it. I always order the vanilla bean cheesecake for dessert. For some reason, it did not taste the way I remember. <br&gt;<br&gt;The service was mediocre. Our bartender asked us if we wanted bread and it took him like 3 times to remember. They were professional, unlike many places around and did not appear to be messing around a lot. I do still like their food and will be back.", "rating": 4, "date": "1/12/2019"}, {"text": "Ordered summer burger deal for takeout, overall great value for quality and quantity of food. Double burger, fries and slice of Oreo cheesecake. They also threw in a half loaf of hot bread.  I ordered online, waited about 2 minutes and they brought out our order. Food hot and fresh, thx CKF.  Will go back again to this location. <br&gt;<br&gt;A couple demerits, no plastic ware or napkins. One of fries not properly sealed, dumped out in bag.", "rating": 5, "date": "7/1/2020"}, {"text": "I was not impress by the service at all.. it was my moms bday and the waiter told me I had to &amp;#34;remind him&amp;#34; which I found to be very rude. My friend did not like the chicken Alfredo at all. Over priced for no reason..", "rating": 2, "date": "12/16/2020"}, {"text": "A classic place where you know you will find a very ample menu with options for every one.<br&gt;We went for a business lunch and enjoyed every minute of it.<br&gt;Their menu now has many Gluten Free options and that includes an indulgent Godiva Cheese Cake.<br&gt;The Grilled Salmon I ordered,  was cooked to perfection. There was a confusion with the sides but, hey! we are humans and it was solved immediately.<br&gt;The best of all was the outstanding service provided by Jessica our waitress. She really is excellent, and we mentioned to the manager before we left.<br&gt;We will definitely come back here.", "rating": 5, "date": "9/5/2019"}, {"text": "Is so shameful in what the service industry has turned into you guys have a terrible le hostess in the front I know that is hard to get people this days but at least trained her she is mistreating your costumers , this is my neighborhood cheesecake and of course I will be back but never ever order pick up again I felt like I committed a crime and the hostess was punishing me for that , one star to you pick up service because can&amp;#39;t give you less change that girl or trained her she doesn&amp;#39;t say hi or thank you basic stuff! <br&gt;HORRIBLE", "rating": 1, "date": "8/15/2020"}, {"text": "The cheesecake factory is the cheesecake factory. I think when people go here they know what they are getting. For a cheesecake factory it&amp;#39;s average. The positive of this place is that there is something for everyone.  However I did have a problem when I was there where we had been waiting for a table for a long time and there was this one party sitting there who had been there for hours as the hostess told us. They did nothing to hurry them along. I understand that they can take as long as they need and don&amp;#39;t have to leave but I feel like the restaurant could have said hey We have a group of people who have been waiting here for a long time and they are a big group so the only place they can sit is here. They could&amp;#39;ve offered them a drink or some sort of a voucher to get them moving along but they did nothing.", "rating": 3, "date": "3/7/2020"}, {"text": "The manager is an older lady with a military style disposition. If you want to get yelled at right before dinner then come to the Cheesecake Factory @Pembroke Gardens. Please do better Cheesecake Factory. During these difficult times we need to be more merciful with each other. This is why my review will be short tonight.", "rating": 1, "date": "8/7/2020"}, {"text": "Cheesecake Factory restaurants are always packed, and this one is no different. In the outdoor shopping center of Pembroke Gardens, this has to be one of the more popular restaurants as you will always get a wait time, especially on the weekends. They do do their best at getting you seated as quick as possible.<br&gt;<br&gt;The service is always great and this time it was no different. Our waitress was very friendly, always checking in on us and making sure our glasses were always filled. <br&gt;<br&gt;We both decided on the Farfalle pasta with chicken and roasted garlic. Wow, I was so surprised at how tasty it came out. It&amp;#39;s rich and creamy, with mushrooms and peas. I was happy with my order, only a little disappointed that they accidentally made mine with penne pasta instead of farfalle, but it wasn&amp;#39;t a big deal. <br&gt;<br&gt;Always a good idea to go to Cheesecake Factory!", "rating": 4, "date": "11/26/2018"}, {"text": "Chessecake factory is one of those chains that has a menu 30 pages long so I&amp;#39;ve never been a big fan. Food is always good, but nothing stands out. This time the one thing that really stood out was the service. <br&gt;<br&gt;We walked in and there was only two of us, but anybody who has been to this location knows there is always 100 people outside waiting so we expected a 25-40 min wait, but to our surprise we sat right away. Lucky for us we sat in Bryant&amp;#39;s section.<br&gt;<br&gt;He came over within a couple mins and took our drink orders. He came back after a few mins with the drinks and some bread. We were pretty hungry so we scarfed down the bread which always leaves crumbs everywhere. Bryant came back a minute after we finished, took the plates and even took out a tool to make sure the table was crumb free, my wife was very appreciative.<br&gt;<br&gt;He gave us a few moments to look over the menu (you typically need 30 mins to decide) and we put in our appetizer and entree order at the same time. We ordered the cheeseburger egg rolls which were fantastic. A little greasy, but the flavors and the dipping sauce were delicious. <br&gt;<br&gt;I ordered the gumbo with white rice. Lots of flavors everything well cooked. Good solid meal. My wife got the chicken costoletta, she gets it every time. It&amp;#39;s thing crispy chicken with mashed potatoes and she subs corn for asparagus. She loves the sauce that comes with it so when she asked for extra we expected a small side but out came a small boat, again she was very pleased. All during the meal Bryant consistently swapped out our beverages without even asking. He made it very easy and pleasurable to dine there.<br&gt;<br&gt;As we were wrapping up (i was done and my wife was just pushing what was left around) Bryant showed up again and took my wife&amp;#39;s food away to box as well as got her cheesecake order. He came back two minutes later with her food boxed and let us know the cheesecake was coming. It arrived within 2-3 mins.<br&gt;<br&gt;The whole experience at the restaurant was great. Again, it&amp;#39;s a chain restaurant where the food will be good, but nothing standout, but with service like Bryant provided i would go back again and again!", "rating": 4, "date": "1/6/2019"}, {"text": "This Cheesecake Factory has the longest wait time. The last time we were here was when we had family visit from out of town  I know the drill. It takes forever to get a table. Food takes a long time to come out as well. Portions are huge so be prepared to share or take home leftovers. <br&gt;<br&gt;I always get the Thai lettuce wraps. They are seasoned just right. It&amp;#39;s a light entree in case you want to save your appetite for cheesecake.<br&gt;<br&gt;My son likes the Oreo cheesecake so I always get him that. The pieces are huge. They are truly a meal on their own. I like plain cheesecake or with fresh strawberries the best. Their coffee is a good finish to the meal. <br&gt;<br&gt;The staff do their best to care for guests. I&amp;#39;ve always had good service here. The managers usually  come by to check on things.", "rating": 4, "date": "11/4/2018"}, {"text": "It&amp;#39;s rare... but I think I just found one of the best waitresses in the world... Sara was super friendly, funny and accommodating, I can&amp;#39;t say enough great things about her.<br&gt;<br&gt;We stopped by for a late lunch, I ordered an Old Fashioned, while we got the Avocado Egg rolls for an appetizer.  The avocado Egg Rolls are our go to appetizer here.  We always get it, it comes with a tamarind sauce.<br&gt;<br&gt;The menu at Cheesecake Factory is huge as any past guest knows.  I took a chance and went with something new, the Louisiana Chicken Pasta, which was good.  One of my friends got the Chicken Alfredo Pasta, which was definitely better though, but both good choices.<br&gt;<br&gt;My wife got the Chicken Littles which is another favorite of ours, it came with a mountain of chicken tenders, and will be used as tonight&amp;#39;s dinner, LOL.<br&gt;<br&gt;All in all, a good meal and experience.", "rating": 5, "date": "11/3/2018"}, {"text": "Awesome staff and restaurant. Did their best to accomodate everything despite the pandemic. Great job!", "rating": 5, "date": "11/29/2020"}, {"text": "My husband and I would always eat at the Cheesecake Factory in Pembroke Gardens, Pembroke Pines, Fla. before Covid19 , and would enjoy the foods. However, Sunday, April 12, 2020 we decided to do a take out order of Angel Hair Pasta with Shrimp. BIG MISTAKE!<br&gt;The food was horrible....... the pasta was dry, no kind of sauce or flavor. Four shrimp and a can of  diced tomatoes smeared over the top. Have the quality of food from this restaurant diminished due to  the &amp;#34;virus&amp;#34;? <br&gt;Please....... We will never eat from there again.......", "rating": 1, "date": "4/15/2020"}, {"text": "We have a love-hate relationship with The Cheesecake Factory, but it wouldn&amp;#39;t be fair to generalize this location. I recently visited the Pines restaurant with my daughter. The restaurant was not full, so there was no wait at all. The hostess, however, barely acknowledged us as we stood right in front of her. No greeting, no eye contact, no smile, no nothing. She pretty much seemed bothered that we were there. She basically glanced at us and waited for us to tell her what we wanted. Not a very good first impression. <br&gt;<br&gt;Fortunately, our server turned that around. He was friendly, polite, and welcoming. He was also knowledgeable about the huge menu, which no matter how many times we go, we still find it a bit daunting. <br&gt;<br&gt;The food was good and as expected. Nicely presented and served at the appropriate temperature. I always have the 30th Anniversary Cheesecake and was sad to learn that it will no longer be available. <br&gt;<br&gt;All in all, it was a good visit that was definitely made better by our friendly server, that totally turned our initial first impression around.", "rating": 3, "date": "9/12/2018"}, {"text": "I&amp;#39;ve eaten at this Cheesecake Factory many times and this by far is my favorite dish from all the menus. I&amp;#39;m a lover of mushrooms and the combination of sweet from the balsamic drizzle and savory from the cheese created bliss in my mouth. Loved every bite. It&amp;#39;s cheesy but not overwhelming. The crust is soft yet crunchy, I must say I was pleasantly surprised but pleased.", "rating": 5, "date": "5/24/2019"}, {"text": "I was so excited to come and grab dinner as I have not been here in a long time and left very disappointed. As like most nights on the weekend, there was a lot of people waiting to be seated. When I went to the counter to leave my name, for a party of 2, I was told the wait would be 30 minutes. We waited and were called after 30 minutes. We were seated and our waitress was very pleasant and attended to us right away. We placed our orders and waited, waited and waited some more. The waitress checked on us and said the food will be out soon. 30 minutes later, the manager checked on us and apologized for the wait and said our food will be out very shortly. After one hour, our food had not come out while food came out to the surrounding tables that were seated  after us. Another waiter saw us still sitting there and came over to ask if we were Ok, at that point my husband asked to speak with the manager. The manager came over to apologize but we never really got an explanation for the delay. The food came out and was Ok but by this time we were so annoyed with the wait that we couldn&amp;#39;t really enjoy the food. Very disappointing.", "rating": 1, "date": "12/29/2019"}, {"text": "Their was minimum wait to be seated but the only reason I do not give 5 stars is because it took the server about 15 minutes to great us while we just sat their. Not sure if he wasn&amp;#39;t aware that we were their but after he treated us he was very attentive, our food was out quick and it was delicious. Mac &amp;amp; cheese was a bit distasteful but excellent service overall, I wish I could remember the servers name.", "rating": 4, "date": "3/1/2020"}, {"text": "I&amp;#39;m a huge fan of this chain, primarily because they have an encyclopedia sized menu.  Of course you come here for the cheesecake as well.  Just about everything I&amp;#39;ve ever had has been pretty much above average.  I love the avocado egg rolls (a meal in itself) and the Korean cauliflower.  Vegans, vegetarians and carnivores should leave happy...and the Marmaduke sized serving portions offer that bang for the buck as well as mighty good taste quality.  There is enough outside seating to make things interesting.  Parking at this location can get a bit tricky during high traffic days and times.  Love the passion fruit flavoured ice tea.  The staff is usually young and they seem to know what they are doing.", "rating": 4, "date": "10/27/2019"}, {"text": "I have to say Cheesecake Factory isn&amp;#39;t my first choice. My husband&amp;#39;s cousin wanted to meet there for dinner and I had a gift card so there we were on a Saturday night. We met early (which was great...when we left it was CRAZY busy). <br&gt;<br&gt;We were told 30 minutes but were seated in about 10 minutes. One of our party was both there, but they still seated us. We ordered some apps while waiting and our friend arrived just after we ordered the apps. So everything worked out well. <br&gt;<br&gt;We started with the edamame. They were cooked perfect and had the right amount of salt. We also had the roasted artichoke. It comes in 2 sizes. We ordered the larger one. Perfectly cooked. Not overly oiled and was tasty. I do eat vegan(ish) so I did taste the garlic aioli that came with it. It was very tasty. <br&gt;<br&gt;Food:  my daughter had the spaghetti and meatball.  I would have preferred 1 more meatball and less spaghetti but my daughter loved it. <br&gt;<br&gt;My husband and cousin had the burrito. It is HUGE. They both loved it. It came with beans, guacamole and sour cream on the side. <br&gt;<br&gt;My friend had breakfast all day. He had a build your own omelet made with egg whites. He asked for 3 special requests. He only wanted a sprinkle of cheese and wanted his bacon well done. Omelet came out PERFECT!  <br&gt;<br&gt;I had the avocado toast.  I have to say my picture doesn&amp;#39;t do it justice. It was super pretty. The avocado was tasty and the bread was edible.  Some times the bread used for avocado toast just isn&amp;#39;t easy to eat. This was perfect. The flavor was perfect. It was pretty. <br&gt;<br&gt;Dessert:  my friend and I shared the Hershey cheesecake, it was worth the calories. I will leave it at that. My daughter had a scoop of vanilla. My husband had the Oreo milk shake. He said it was a little thin but tasty.  <br&gt;<br&gt;All in all our service is wonderful. Food was delicious. Parking at Pembroke Gardens is horrible, but we valeted for $6 which was worth it. They text you your number so you don&amp;#39;t have to worry about losing your ticket. <br&gt;<br&gt;I think Cheesecake Factory may be in my rotation of places. They have a few options for me as a vegan eater and the kids&amp;#39; menu also had a nice selection of choices. Looking forward to my next visit.", "rating": 4, "date": "6/24/2018"}, {"text": "Located in an outlet mall. The Cheesecake Factory has one of the best happy hours! So happy, no wonder why you cheesing :)<br&gt;<br&gt;From 4-6pm sitting at the bar area, appetizers and specialty cocktails are 5.95. While beers are 4$. No matter what appetizer you order; the portions are a good amount and shareable. The cocktails like the mojito I got was placed in a bigger cup than most the places I&amp;#39;ve been to! Seems like they do it bigger and better at the Cheesecake Factory. They even give you complimentary bread and butter before you start your meal<br&gt;<br&gt;Also, upon request I got the happy hour burger. It was a double patty burger that was gluten free. I didnt think anything of it. I was much more happier getting the appetizers (probably better off getting the sliders). I was also charged 2$ more for fries without the server telling me.  Service was alright. We didn&amp;#39;t get refills until the end of our meal. Everyone was done with our drinks for awhile anticipating a refill...but nonetheless she refilled our drinks without us asking for it", "rating": 4, "date": "6/26/2018"}, {"text": "I had not been a very long time since I stepped in a Cheese Cake Factory.  Not smart, since they have an awesome menu.  I couldn&amp;#39;t believe how many different were one it.  <br&gt;<br&gt;We started with some edamame and the grilled artichokes,  both were delicious.<br&gt;<br&gt;For dinner I had the grande burrito. It is served with sour cream,  guacamole and black beans on the side.  It&amp;#39;s a wet burrito,  it&amp;#39;s not overly drenched in sauces or cheese.  Although I prefer a dry burrito it was very tasty and not over stuffed with rice.  The guacamole was really good too, I with I would have got extra.<br&gt;<br&gt;My wife had the avocado toast.  It was topped with tomatoes and water crest. She said it was&amp;#34; out of this world good &amp;#34;<br&gt;<br&gt;For dessert we got cheese cake,  it looked so good,  since I don&amp;#39;t like cheese cake, I got an oreo milkshake.  It could have been a bit thicker, but it was very good.", "rating": 4, "date": "6/26/2018"}, {"text": "What with the ever growing list of great places to eat in SoFlo, chain restaurants have taken somewhat of a back seat for me lately. With that said it&amp;#39;s very hard to go wrong at The Cheesecake Factory, if you look long enough in the encyclopedia sized menu, it&amp;#39;s pretty much guaranteed you can find something you fancy. That would actually be my only complaint about The Cheesecake Factory, the never ending menu that leads to far too much reading, time that could be spent eating! I actually counted 21 chicken dishes alone, and that didn&amp;#39;t include pizzas or salads with chicken in them! <br&gt;<br&gt;Started with the firecracker salmon rolls which were delicious; 4 fried egg rolls stuffed with salmon and served with a Thai chili sauce and red cabbage coleslaw. <br&gt;The Chicken Marsala was next and was large and tasty but rather routine; a large piece of chicken served on a bed of bow tie pasta with a marsala and mushroom sauce. <br&gt;Drinks are also usually good here as is the bread you receive before your meal. <br&gt;<br&gt;Expect long waits in the evenings, especially on the weekends, I usually head straight to the bar area and try to snag a high top on my own, avoiding the wait, probably a bit naughty but it worked like a charm on this night and the wait staff rarely have an issue.", "rating": 4, "date": "6/2/2018"}, {"text": "Went here on a Sunday night and the place was packed. Only went in for a quick dessert. Line had 3 people in front of me and once I ordered it took over 10 minutes to package and give me one slice of salted caramel cheesecake...it was hard to tell who was in line because the register is literally next to the door. I like the fact that all calories are posted, but what you don&amp;#39;t know won&amp;#39;t hurt you! All of the selections are packed with high calories, but everything is super delicious! Can&amp;#39;t go wrong with a slice of cheesecake after a delicious dinner!", "rating": 3, "date": "3/18/2019"}, {"text": "Enjoyed a birthday celebration here, thank you to the host staff and our waitress Natalia for wonderful service. I will definitely be back to this location. The food was delicious and came out on time. Same wine selection but great for small groups.", "rating": 5, "date": "11/5/2020"}, {"text": "Cheesecake Factory in general is a hit or miss depending where and when you go. I came to this location because it is easier to get a table here than the location at the Sawgrass Mills mall in Sunrise. Came for their happy hour during the weekdays at 4-6 p.m. and to use a free cheesecake card we had when you purchased a gift card (this promo normal available for purchase during holidays). JI was told to sit anywhere in the bar area to be able to get the happy hour menu. The menu had a lot to choose from, drinks, appetizers and small dishes. Price range drinks $3-$6 and food is $5-$8, that&amp;#39;s a price that can&amp;#39;t be beat especially at this restaurant! <br&gt;Since we were told to sit in the bar area we ended up waiting for a server. Which was strange because 5 servers pass the table yet no one informed our server we were there. After 10minutes of waiting I went back to the hostess to asks how can we get a server, her response was rude telling me that the bar is a seat yourself, I questioned her saying what does that mean. And informed her that she should inform service to that area or I&amp;#39;ll ask someone that could help me. Still she did not get a server. So I waited another 5 more minutes and then finally a server showed up. And they were not in the mood that day. <br&gt;Luckily with the time that we waited to be served we already knew what we wanted, so we can enjoy this happy hour. We order pretzel with cheese dip, crab dip, fried spicy shrimp, potstickers, and Korean cauliflower. Just remember you&amp;#39;ll be served bread while you wait for your food. We enjoyed the pretzels, cauliflower and shrimp. The potsticker were not what I expected it just seem like I had a sliced chicken breast that was wrapped in a wonton, there was no seasoning and just sitting in ponzu sauce. The crab dip also was plain lack flavor . <br&gt;Overall we had to take our cheesecake home, hazelnut cheesecake and red velvet chessecake,  because we were full. and it was the bread we ate because we had to take some food home so be careful and remember that there is bread to eat. We probably come back to eat regular entrees.", "rating": 3, "date": "2/28/2019"}, {"text": "The service was great but the food was bland!!<br&gt;We were seated immediately. I didn&amp;#39;t catch the waitresses name but she was wonderful!<br&gt;Mai tai drink- Very good <br&gt;Pineapple chicken &amp;amp; shrimp/white rice- Bland <br&gt;Honey chicken- Ok<br&gt;Mac and cheese- Watery and Bland<br&gt;Banana Cream cheesecake- Very good <br&gt;Calamari- Good<br&gt;Bread- Always good", "rating": 3, "date": "5/21/2019"}, {"text": "I had such a great experience at this Cheesecake Factory.  This isn&amp;#39;t my first time at cheesecake but this was first time at this location. Let me tell you it was very nice!   There was a wait, but that was expected on a Saturday night. Every so, the hostesses were very nice making sure we had been helped and kept us informed.  When we finally got seated our server was very prompt on greeting us and making sure we were tended too. We got our food very quickly for the volume of people being there. <br&gt;I ordered the chicken and biscuits. I was nervous because I haven&amp;#39;t been here in a while and did not know what to order. This was a great choice! The chicken when it first came out was mixed in with the veggies, and at first I thought it wasn&amp;#39;t enough meat, but it was a perfect mix.  I really loved the flavors and how they incorporate the sweet and warm biscuits to top it off.  Definitely going back here when I come back to visit my family in Miami. <br&gt;Great restaurant!", "rating": 5, "date": "10/28/2019"}, {"text": "Visited this location with family for my birthday celebration. Waiter was very nice and accommodating however our food was horrible which was a first ever.<br&gt;No flavor what so ever my family member was highly disappointed returned order of shrimp scampi with steak diane for fried shrimp platter for sure this would be better. Negative shrimp had no taste along with the lemon garlic shrimp with angel hair shrimp was undercooked. <br&gt;The only items which were tolerable were kids mac n cheese, breads, oreo cheesecake.", "rating": 2, "date": "3/2/2019"}, {"text": "I enjoyed coming to the cheesecake factory it is one of my favorite places I love the atmosphere I love the food , the menu is a great selection and variety, the cheesecake deserts are amazing everything is awesome, definitely coming back with my friends and family. Highly recommend this place!!", "rating": 5, "date": "7/29/2019"}, {"text": "I ordered an Ahi Salad from the under 590 calories menu, not sure what happened but the manager came out to tell me they were unable to serve it. It wasn&amp;#39;t okay for me to eat it. So I went ahead &amp;amp; ordered a shrimp salad instead which was delicious. But it was an annoying situation to have to watch 4 tables who arrived at a similar time than us receive their food, eat it and pay all while we still hadn&amp;#39;t received ours. At the end, I wasn&amp;#39;t charged for my salad which I am thankful for BUT honestly for the wait... I&amp;#39;m not quite sure it was worth it. I think as a manager he should have asked if we wanted a cocktail meanwhile we waited? Or if we wanted an appetizer meanwhile we waited? Just so it didn&amp;#39;t make waiting feel so long! <br&gt;<br&gt;I think they handled it well but it could have been handled much better. Thank you to our waiter, I know it&amp;#39;s out of your control but indeed, management could have provided much better service. <br&gt;<br&gt;In response to the comment from the Cheesecake Factory, I am not an employee there let alone a manager there so I will not tell someone how to do their job. This is something they should already know and take care of impulsively.", "rating": 3, "date": "2/11/2018"}, {"text": "Tons of options. Great portions. Consistent service and food. Cheesecake factory has the best restaurant biscuits I have had in a while. I love their chicken and biscuits. Also their cucumber lemonade is so delicious. I took some to go. Will definitely be back.", "rating": 5, "date": "9/23/2019"}, {"text": "You can never go wrong with Cheesecake Factory...so many options for all different likings. I love this location because of the mall itself.  I don&amp;#39;t come here often due to the distance...it&amp;#39;s far for me. I love the outside mall it&amp;#39;s welcoming and there are benches in every corner.  The mall it&amp;#39;s well maintained - clean, garbage cans everywhere, building&amp;#39;s paint is fresh. <br&gt;Back to Cheesecake...I love they have so many satisfying options, the cost is reasonable, plenty of seating area including outside and service is quick.<br&gt;This last time I came for lunch with friends. I had the lunch special Santa Fe salad with chicken. My friend had the personal cheese pizza with Caesar salad and my other friend had the wellness salad. Everything was yummy! My friend&amp;#39;s daughter had the kids chicken tenders and fries which btw it&amp;#39;s a reasonable amount. I think two 3yrs old kids can share the plate.<br&gt;Sometimes the hardest thing to do when eating at Cheesecake is picking an entree due to their vast diversity of food. One of my fave is their lettuce wrap under appetizer menu. You can have it as entree like I do at times.", "rating": 4, "date": "12/18/2018"}, {"text": "Super packed for a Tuesday. Although our waiter was really nice, attentive and made great food and drink suggestions, I felt like we were being rushed. And what made it worse, our food and drinks took forever time. By the time my dinner arrived, I had forgotten what I ordered. My Whiskey Smash was definitely amazing. This restaurant is in a really nice plaza.", "rating": 3, "date": "2/13/2019"}, {"text": "It&amp;#39;s always a good experience when I come to the Cheesecake Factory. <br&gt;<br&gt;For such a large chain and one that offers such a big menu with so many options, they always delivery great quality food. I don&amp;#39;t recall a single time I haven&amp;#39;t enjoyed a meal here. And it&amp;#39;s without say, their cheesecake is absolutely divine.", "rating": 4, "date": "12/15/2018"}, {"text": "I make the Cheese Cake Factory a mandatory stop when I&amp;#39;m bar hopping during happy hour at Pembroke Gardens. The bar tenders are professional and make good quality drinks. I usually get the mojito, it&amp;#39;s really good. The nachos are a real value, it is definitely sharable. Their Happy hour is from 4 to 6, I think it ends earliest out of Pembroke Gardens restaurants so hit it early.", "rating": 4, "date": "6/27/2019"}, {"text": "Usually I love this place. I ordered the Parmesan chicken Romano with white sauce to go. The chicken was cooked to perfection but my noodles were not done at all. Also putting the chicken on the bottom made it soggy in some spots. The noodlwere super hard and it was very disappointing. The chicken was the only edible part. <br&gt;<br&gt;I would have loved to taken it back or said something was wrong but my order was to go and it was 30 min round trip to get and I had to wait 40 min to get the order. I wasn&amp;#39;t going to take it back on a Saturday at the mall and wait another 2 hours.", "rating": 1, "date": "3/12/2019"}, {"text": "I had really high expectations of the place, but they were really not met. I ordered a fettuccini alfredo and what I got it was pasta with the saltiest sauce ever. The pasta was undercooked and there was abnormal quantity of salt. There was no overall flavor and was no different to making pasta in my house. Deeply dissatisfied.", "rating": 1, "date": "9/13/2020"}, {"text": "You can never go wrong here. Absolutely my favorite spo and definitely my go-to whenever I&amp;#39;m hungry! Cheesecake never lets me down!", "rating": 5, "date": "9/11/2020"}, {"text": "Thursday night....not so crowded. Seated fast and our server was great. Tried their steak from the SkinnyLicious menu. Was a hit not only with me but with fam. Will go again.", "rating": 4, "date": "5/18/2019"}, {"text": "The ol faithful.  The tried and true.  Cheesecake is a solid go to chain restaurant.  They have their recipe of ambiance, customer service, food and drinks down to a science.  <br&gt;<br&gt;The pembrooke location is a guaranteed good experience.  I LOVE their tamale cakes appetizer.  I could eat it once a week amd never tire of it.  I also love their lettuce wraps.  Its a spread of carrots, cucumber, bean sprputs, noodles, peanut chicken and butter lettuce.  You customise your wrap and it is fresh and crunchy.  <br&gt;<br&gt;I can count on this place for a good cocktail and meal .", "rating": 4, "date": "10/9/2018"}, {"text": "i always have a good time at the cheesecake factory. i always order something different since the menu has a lot of options, and every time the food is on point", "rating": 5, "date": "11/23/2020"}, {"text": "Great service, thanks to the General Manager Michael. Kudos to you and Alex. Everything came out hot and fresh, the food was delicious.", "rating": 5, "date": "8/22/2020"}, {"text": "Not ideal for any group outings larger than 6ppl. If you have a party larger than 6  you have to show up  and hope they have space for you  to be seated. Words direct from tonight&amp;#39;s manager when trying to book  ahead.", "rating": 1, "date": "2/8/2020"}, {"text": "Today I left with a sour taste on my palette it was HORRIBLE!!!!!!! It left me running to the ladies room. I ordered the Shrimp pasta with angel hair and it arrived within Reasonable time very visually pleasing so I dove In eagerly to be disappointed once I bit into a Shrimp it tasted like sampling mop water with vinegar when I made the waitress aware of my distain she offered to get me a fresh batch of Shrimp to replace these awful ones but those were bad also. She brought out the check after finally bringing me some grilled chicken to top my lackluster Shrimp pasta but she was still trying to justify charging me for the inedible SHRIMP PASTA then she had to get her Manager to remove this charge and I was a tad relieved still  upset I couldn&amp;#39;t enjoy my seafood dish i wanted. I LOVE SEAFOOD ESPECIALLY SHRIMP OR SALMON it&amp;#39;s a go to dish whenever I visit this place you&amp;#39;ve got to do better.", "rating": 2, "date": "6/9/2019"}, {"text": "We ordered takeout &amp;amp; while my ALMOND-CRUSTED SALMON SALAD (Pan Seared and Served Over Kale, Shaved Brussels Sprouts, Arugula, Avocado, Quinoa, Cranberries and Radishes. Tossed with Our Vinaigrette) was delicious, the appetizer, KOREAN FRIED CAULIFLOWER (Crispy Cauliflower Tossed with Sweet and Spicy Sauce, Toasted Sesame Seeds and Green Onion) was SO BAD! The texture, the flavour, just bad. My friend&amp;#39;s HOT SPINACH AND CHEESE DIP (Spinach, Artichoke Hearts, Shallots, Garlic and a Mixture of Cheeses. Served Bubbly Hot with Tortilla Chips and Salsa) was ok but I&amp;#39;ve had better. Her CHICKEN, MANGO AND AVOCADO SALAD (Mixed Greens, Fresh Pineapple, Tomato, Cucumber, Red Peppers, Onion, Crispy Wontons and Almonds. Tossed with Vinaigrette) was HUGE  &amp;amp; looked really good but since I don&amp;#39;t eat chicken I did not try it. She assured me it was great. For dessert, we split a slice of the CHOCOLATE HAZELNUT CRUNCH CHEESECAKE (Chocolate Hazelnut Cheesecake Topped with Hazelnut Crunch and Nutella®) &amp;amp; it was just as delicious as it sounds. All in all, pretty decent", "rating": 3, "date": "5/12/2019"}, {"text": "We decided to visit Cheesecake Factory in Pembroke Pines at the Pembroke Gardens Shops. It was a great lunch, like always food was delicious. They have a great kids meal, includes burgers, chicken, and pasta.  My wife and I had a salad very filling.  Typical plate at Cheesecake Factory is large so you can share if you feel you have the appetite for sharing. We had outside seating that was nice for the weather. However, if it is hot outside I would stay away from outside seating. <br&gt;<br&gt;My only complaint is the service was very slow and at times forgetful.  My daughter had to ask for ketchup a few times and requesting additional napkins took some time also. <br&gt;<br&gt;Parking: You have valet parking right at front for a fee and then throughout the exterior (free)", "rating": 4, "date": "11/5/2018"}, {"text": "The crust salmon with mash potatoes and asparagus was great! Also I tried the white chocolate macadamia nut cheesecake for the first time and I would recommended", "rating": 5, "date": "3/14/2020"}, {"text": "Not only was it a half portion of rubbish<br&gt;Pasta was ROCK HARD<br&gt;HEAVILY UNDERCOOKED<br&gt;<br&gt;As always a huge disappointment.", "rating": 1, "date": "9/14/2019"}, {"text": "Cheesecake Factory never lets me down. The food is amazing. I love going and getting a bunch of<br&gt;- small plates and appetizers. They have such a large variety it is difficult to choose.", "rating": 5, "date": "3/4/2019"}, {"text": "This restaurant is located in a cool shopping square, for good retail options during the day, and happening night life! I went here with a group of about 12 persons on a very busy night. Service was great and friendly. It was not very quick, but we were a large group and it was a full house so no complaints there... Our server was very timely and checked on the table often, refilling waters and meeting other needs. All the entrees that were ordered looked nice and were well prepared. I just wish the lighting was a little better in here than it was outside at night!  Otherwise a good experience, a good option for lunch/dinner, great decor and location. Food is good, stays true its the restaurant chain quality and options.", "rating": 4, "date": "9/1/2018"}, {"text": "Came here on a Sunday night, thinking the wait would be long but for a party of 7, it was quite fast! Once we were seated, the waiter attended us pretty quickly and took all our appetizer orders with no problem. I ordered the avocado egg rolls and they were delicious! When ordering the entree, I was a little conflicted on what to order because I usually order the basic chicken Alfredo but I wanted to try something new. The waiter recommended me the chicken bellagio and I decided to go with it. Definitely no regrets! I devoured the entire thing! Every dish on the table looked amazing as well. My boyfriend ordered the chicken Alfredo, a friend of mine ordered a filet mignon, and another ordered orange chicken. The rest was variations of pasta which also looked amazing. I&amp;#39;ve been to this cheesecake a couple times before and it never disappoints. My next goal is to try to brunch menu", "rating": 5, "date": "9/1/2018"}, {"text": "Not keeping the people and staff safe. People in line not wearing masks and rude to workers.", "rating": 1, "date": "8/8/2020"}, {"text": "I had such an amazing dinning experience tonight! (12/1/19) And it was all thanks to Bryant! From greeting us  so quickly, noticing we were short utensils, bussing our breaded plates to make room for our meals , bringing my red paper flakes/condiments prior to our dishes arriving to refilling our drinks without us even asking! Great great service! <br&gt;<br&gt;Even though it started off a little rough when I stood in front of the hostess stand for a good 3 minutes, and was not greeted by the 3 hostess nor manager...but Bryant made it all better. Thank you Bryant!", "rating": 5, "date": "12/1/2019"}, {"text": "I have to say cheesecake is one of my favorite restaurants due to the farfalle pasta. This visit I wanted to try something a new. The New York strip was at best average but everything else was phenomenal. Drinks were great. The Cheesecake Factory is a perfect ambience to celebrate a birthday.our server was amazing 0 complaints and was amazing at not feeling pressured or rushed when my family took a while lol.I highly recommend this place. You will enjoy it. Until next time cheesecake", "rating": 4, "date": "2/1/2020"}, {"text": "I love The Cheesecake factory but this location has let me down today.  I usually come for dinner.  Today I came for lunch.  Spoon was dirty. The salad I ordered didn&amp;#39;t taste fresh as the lettuce was wilted and the chicken I requested to be hot off the grill came cold. I understand that these experiences will happen but what added more to the unpleasant experience was a non- service dog that was in the restaurant.  It ran from it&amp;#39;s owner.  It barked several times and I think it&amp;#39;s very unhygienic to have a dog in a restaurant.  Honestly,  I was very disgusted from the dirty spoon to the dog running free. Fur can easily fly everywhere considering how fluffy this dog was and the cold chicken just didn&amp;#39;t help. I believe this location needs better management.", "rating": 2, "date": "4/17/2018"}, {"text": "Good things come to those who wait....and you can usually expect to wait for a table when you arrive here. That being said, the food is worth it and the cheesecake even more so. <br&gt;My latest trip here was  to pick up a whole cheesecake I ordered for a family party. They were super nice on the phone and had it held for me. Easy pick up! I recommend it whenever you need a dessert to impress and you don&amp;#39;t have the time (or perhaps talent) to bake it yourself.", "rating": 5, "date": "5/4/2018"}, {"text": "Cheesecake Factory !! Love love love !!! Came here tonight with a few friends , 20 min wait time to be seated, ordered appetizers (Thai lettuce wraps , nachos) took 30 min to arrive waiter did apologize, <br&gt;Dinner bang bang chicken delicious has a kick , curry , coconut, rice . We got salted caramel cheese cake for dessert, American coffee was cold <br&gt;The weird part was we got plastic forks with our dessert . This restaurant is above average price range for dinning . $16-$30 per person why do I get plastic forks with my cheese cake ? ( I had a spoon for my coffee from dinner services )", "rating": 3, "date": "6/13/2018"}, {"text": "We went out for a late lunch-- and chose stuff we don&amp;#39;t usually... this was the best idea ever!! Well, Cheesecake Factory never fails, imho. They are a good food factory! I never even make it to the cheesecake cause the food is soooo good!! <br&gt;So this time we went for appetizers: the 4 kind of eggrolls ... and we were pleasantly pleased!<br&gt;Well-- to be honest, we loooove the bread too! So bread and appetizers and iced tea... then I had my &amp;#34;low cal&amp;#34; salad- hahaha.<br&gt;Louisiana Chicken Pasta and I don&amp;#39;t remember the salad name-- but it was GOOOD!", "rating": 4, "date": "7/1/2017"}, {"text": "Usually no issues but our appetizers were delivered with our dinner. This made enjoying our leisurely meal a challenge as our table was covered with food all at once. <br&gt;<br&gt;Our waiter was friendly and the food tasted great but the experience was lacking.", "rating": 3, "date": "5/20/2018"}, {"text": "Always a pleasure coming to Cheesecake Factory. The staff are all super friendly and try to satisfy you as much as possible. Strawberry lemonade is one of my favorite drinks when I go there. Their salads are delicious and a good size. I also go for their pasta carbonara and it never disappoints. Going on a weekday night is so much better than the weekends whereas you are seated right away and don&amp;#39;t need to wait for a table. A huge fan of their chocolate tower truffle cake, definitely something you would share with another person!", "rating": 4, "date": "8/14/2019"}, {"text": "This location is very convenient! It is in the middle of Pembroke Gardens! However, the only downside is that the wait can take from 30 minutes to an hour. It is extremely busy during the weekend all day. But weekdays is very light traffic. There is an indoor and outdoor seating in this location. It can get pretty loud inside the restaurant. I only request to sit outside, if the weather is nice and not too hot or during sunset.<br&gt;<br&gt;I have never had any problems while dining at Cheesecake. The service is always good. The menu has a whole variety of food. They also have a skinny menu. The portions are extremely big! So prepare to have left overs for the next day. Also, YOU CAN NOT MISS THE BROWN BREAD or the pumpernickel bread. It is must that you must taste this bread while waiting for your food. When we come here, we usually order the Thai Lettuce Wrap as an appetizer. This appetizer is fairly big to share around the table. You can create your own lettuce rolls by adding anything you want in it. We ordered different entrees. The Chicken Bellagio comes with chicken bread over basil pasta and Parmesan cream sauce and topped with arugula salad. Also, if you can&amp;#39;t decide what you want to get, you can get the factory combinations! It comes with two items and mashed potatoes. We got the steak Diane and herd crusted salmon. All our meals were very good and came out by the time we finished our appetizer.", "rating": 4, "date": "2/28/2018"}, {"text": "Butter was cold but made an appearance to be melted. Bread if not warm. Food took a while but it was good. Service was average as the waitress never came back to check on us. Overall average place.", "rating": 3, "date": "3/5/2019"}, {"text": "This place is amazing! I&amp;#39;ve been coming here for a while, and it never fails me. The spinach and artichoke dip is AMAZING. You should definitely try it. I&amp;#39;ve had a couple iffy servers, but besides that the food is great and so are the food selection. Today is my first time trying the chicken Parmesan pizza and it&amp;#39;s definitely one of my favorite things now. Cheers!!", "rating": 5, "date": "3/25/2019"}, {"text": "I consider myself to be a woman who knows excellent service. If you ever have the opportunity to dine at The Cheesecake Factory in the Pembroke Gardens mall, servers Brian and Julio (Diva) will not disappoint.  I&amp;#39;ve been lucky enough to be served by one or the other every time my family has dined at the restaurant and level of service has always exceeded my expectations.  I, truly, am impressed!<br&gt;<br&gt;If I were the owner of a restaurant, I&amp;#39;d definitely want employees like these. They truly set the bar.", "rating": 5, "date": "5/5/2019"}, {"text": "I had a wonderful experience at the Cheesecake Factory. When I arrived around 1 pm it was packed but because we were only a party of two we were accommodated to a 2 seater booth. Our server names was Gibran who was absolutely wonderful. He had a great personality and excellent customer service skills. He was able to provide feedback on the menu. I ordered the classic Avocado Eye-rolls and the Soup of the Day. My friend ordered the Fish Tacos which she didn&amp;#39;t like. The breading on the fish was too thick and inside was a bit wet. We did share our feedback with Gibran who graciously provided us with another recommendation. My friend ended getting the Jamaican Jerk Shrimp which she loved! We also was greeted by the general manger Mike- who asked us to provide feedback on the fish tacos to improve the dish. We really appreciated the gesture Mike! This is what customer service is all about :) Overall I had a great experience and I truly appreciate the A1 Customer Service.", "rating": 4, "date": "11/24/2019"}, {"text": "In between Christmas shopping came for a bite. One thing I can say that this chain of restaurants offer consistency with the taste of their food . We had the beets with goat cheese and the Korean cauliflower. They seemed to have been a little skimpy with the goat cheese and we could barely make out the scant crumbles on our plate. I would suggest a tad bit more goat cheese to justify goat cheese being mentioned as part of the dish. Cauliflower was tasty but salty (but tasty). My rice was cold and my husband&amp;#39;s dish was misleading. Honey chicken something aka fried chicken breast in batter. It was okay but he was cutting off the crusted batter to make it to the chicken (I ate his carbs for humanity though). Of course we will be back eventually cause they are just convenient restaurants nationwide. Live and love!", "rating": 3, "date": "12/18/2018"}, {"text": "I have a love-hate relationship with the Cheesecake Factory. At this particular location, I had a lovely experience this weekend. We were out shopping on a Sunday and we wanted brunch food so we stopped by around 12pm. It was PACKED! But we decided to sit outside because there was no wait for a party of two and we were starving! I didn&amp;#39;t get our servers name but she was very attentive! As soon as we sat down she brought out their delicious bread and took our orders. I ordered a peach Bellini and my BF had an old fashioned. The Bellini was delicious and refreshing but my BF did not like the old fashioned. We stuck with the brunch options from the menu. My BF had the chicken and waffles and I had the eggs and potatoes. I ordered my eggs scrambled and they were cooked perfectly. The potatoes were so delicious and I added a side of bacon. My plate also came with toast but I didn&amp;#39;t like that they only toast one side. The chicken and waffles were amazing! The chicken was crunchy and delicious and the waffle was crispy on the outside and soft and fluffy on the inside. That waffle was one of the best Belgian waffles we&amp;#39;ve had. I have been to this location numerous times and besides the wait times I&amp;#39;ve always had good experiences.", "rating": 5, "date": "2/18/2019"}, {"text": "Always a good place to grab a bite. Just be prepared the menu has a lot of options which can be overwhelming at time. But if you&amp;#39;re not sure, here are a few options.<br&gt;Feeling Spicy - try the Cajun Pasta<br&gt;Feeling Seafood- try the miso salmon", "rating": 4, "date": "12/16/2018"}, {"text": "Love it all the way. Customer service, food, all of it. I usually eat here weekly, it&amp;#39;s that good.", "rating": 5, "date": "7/17/2019"}, {"text": "Typical cheesecake factory - great food and desserts. Overwhelmingly large menu but I rather that then limited options. Food arrived timely and service was good.", "rating": 4, "date": "11/10/2018"}, {"text": "Not the best Cheesecake Factory I&amp;#39;ve been to...<br&gt;<br&gt;My fiancé and I came here for brunch on a Saturday around noon. We were seated quickly but it took about 10-15 minutes for us to be acknowledged by our waitress. <br&gt;<br&gt;We got our beverage orders in and gave her our entree orders shortly after. My fiancé got the brûlée&amp;#39;d French toast with a side of bacon and eggs. I got the brunch combo which comes with eggs, bacon and pancakes. I asked for eggs over easy. She asked me if I wanted potatoes. I said I didn&amp;#39;t think they came with potatoes and she said &amp;#39;oh yeah you don&amp;#39;t get those. Never mind.&amp;#39;<br&gt;<br&gt;Ok so we waited for our entrees and when they came, my eggs were scrambled. I ate pretty much everything else and waited until she came back, which was about 10-15 more minutes later. Then she said &amp;#39;oh you wanted them over easy&amp;#39; and then proceeded to take my clean fork off my table and scrape them off my plate in front of me onto another plate to take them away. Seriously??? Then she walked away and came back a minute later to say &amp;#39;you wanted them scrambled right?&amp;#39; I said &amp;#39;what no I wanted them over easy&amp;#39;. She gave me the most confused look and then said &amp;#39;ok over easy then&amp;#39;. <br&gt;<br&gt;There was no apology no discount on the bill, nothing. I don&amp;#39;t usually expect discounts or anything like that but an apology would have been nice. We didn&amp;#39;t see her again until the bill was paid. I couldn&amp;#39;t help but notice some other people sitting nearby were also upset with their food. <br&gt;<br&gt;Save your money and go to a different location or restaurant.", "rating": 1, "date": "12/23/2018"}, {"text": "I&amp;#39;m writing this review primarily to request that Cheesecake Factory replace its plastic straws with paper straws.  American Airlines, Starbucks, Mc Donald&amp;#39;s UK and Hyatt, Bon Apetit have already banned plastic straws. <br&gt;<br&gt;If you agree please vote for this review.<br&gt;See <a href=\"/redir?url=https%3A%2F%2Fwww.google.com%2Famp%2Famp.timeinc.net%2Ftime%2Fmoney%2F5333715%2Fstarbucks-hyatt-ban-plastic-straws&amp;amp;s=d46e37c7e4fd63ed211e1f2661a67c4c89df45c64dc47f960c222b348fe5ceba\" target=\"_blank\" rel=\"nofollow\"&gt;google.com/amp/amp.timei…</a&gt;<br&gt;<br&gt;Many states, which likely have Cheesecake Factory locations, are in the process of banning straws. This includes: New York City, Hawaii, California, and Washington. Here in Florida, Miami Beach and Fort Myers are also tackling the issue. <br&gt;<br&gt;Thus, certain Cheesecake Factories will<br&gt;be required to either ban all straws or replace plastic straws with paper straws. I request that this ban or switch to paper straws also apply to all<br&gt;Cheesecake Factories. <br&gt;<br&gt;<a href=\"/redir?url=https%3A%2F%2Fwww.fastcompany.com%2F40580132%2Fhere-are-the-u-s-cities-that-have-banned-plastic-straws-so-far&amp;amp;s=7f99a645b71b7a124822f207295d9193e5e9070d2b2a0e2879f7bda898a290a7\" target=\"_blank\" rel=\"nofollow\"&gt;fastcompany.com/40580132…</a&gt;<br&gt;<br&gt;Cheesecake factories located in those states and cities will be effected and required to use plastic straws. <br&gt;<br&gt;I appeal to Cheesecake Factory in Pembroke Pines to join the movement and the other Cheesecake Factories to replace plastic straws with paper straws. <br&gt;<br&gt;Now to the review:<br&gt;<br&gt;Summary is that I come back again and again because the variety of the food is great for groups and it&amp;#39;s reliable. That being said, there is room<br&gt;for improvement. <br&gt;<br&gt;Cheesecake factories are a family restaurant so offering crayons and coloring to kids would be fantastic!<br&gt;<br&gt;Ambiance outdoor seating 3 stars (as long as the weather is good): loses points for view of parking lot; sometimes gets too hot in the middle of the meal <br&gt;<br&gt;Ambiance indoors 3.5 stars <br&gt;<br&gt;Bread Starter 5 stars<br&gt;<br&gt;Skinnylicous Chinese Chicken Salad - needed more dressing 3 stars <br&gt;<br&gt;Spicy Chicken Chipotle Pasta 3.5 stars<br&gt;<br&gt;Chicken Parmesan Sandwich 4.8<br&gt;<br&gt;Skinnylicious Veggie Burger 3 stars: it&amp;#39;s good enough and I appreciate the vegetarian option. I&amp;#39;d be on the fence about ordering again depending on the other skinnylicious veggie options which I don&amp;#39;t remember now. <br&gt;<br&gt;Customer service: 3", "rating": 3, "date": "1/3/2019"}, {"text": "It&amp;#39;s Cheesecake Factory, I can never complain. This particular location is nice, not as busy as the ones I usually go to so that&amp;#39;s a plus. Service is always good as well as the food.", "rating": 5, "date": "1/7/2019"}, {"text": "This is what every girls lunch needs... an endless menu, window table, cute server and good food.<br&gt;<br&gt;When you aren&amp;#39;t sure what you want, this is the place.  The menu has everything. The appetizers are all enticing, salads, sandwiches, entrees and don&amp;#39;t forget the dessert.  These are formulas driven and in my experience consistently serve good food in a fast pace environment.<br&gt;<br&gt;I do consider Cheesecake Factory an everyday go to stop.", "rating": 4, "date": "8/20/2017"}, {"text": "I really enjoy coming to this  particular Cheesecake Factory, today  we chose lunch instead of our usual Sunday Brunch and some very tasty and refreshing margaritas ( I ordered a Skinny Margarita at 100 calories tasted absolutely delicious!!) My husband ordered a passion fruit one instead but he agreed that mines tasted a lot better and wasn&amp;#39;t as sweet as his . As an appetizer we ordered the Mac &amp;amp; Cheese Balls- if you haven&amp;#39;t tried these you really need should. It is served as 4 lightly fried balls stuffed with Mac &amp;amp; cheese and placed on top of some marinara sauce  sooo good!!! (I know - nothing skinny about them but definitely worth indulging) For our main dishes the Skinny Factory Chopped Salad was my choice and my husband ordered the Mushroom Burger &amp;amp; my daughter ordered the lunch portion Fettuccine Alfredo Pasta. Everyone enjoyed their food . My salad was full of flavor and the burger was cooked perfect, the sautéed mushrooms added a great flavor to the burger.", "rating": 4, "date": "10/21/2018"}, {"text": "This is our go to place, me and my high school girlfriends.<br&gt;<br&gt;One of the best things about Cheesecake Factory, is there is something for everyone. Pasta, salad, burgers, fish, and obviously CHEESECAKE!<br&gt;<br&gt;Today I ordered the kale salad and opted for the fried calamari as my entree, not so healthy but calamari is my fave.  I always order the passion iced tea, passion is a good thing! The salad was nicely seasoned and had the right amount of dressing. The calamari could have been cooked just a tad bit longer, or possibly a bit less breading, but it was still yummy.  Nicely seasoned too.<br&gt;<br&gt;And since it&amp;#39;s November, PUMPKIN CHEESECAKE!! My girlies and I always meet up at this time of year to taste this baby. Geez, I thought I was going to explode. <br&gt;<br&gt;J got the beet salad (yes!) and the lettuce wraps, I almost traded plates!<br&gt;E started with the artichoke, great choice, and the greek salad, to save room for her pumpkin cheesecake.<br&gt;K had a side salad and the chicken pasta from the skinnylicious menu, WOW! <br&gt;<br&gt;Everything was fresh and tasty. <br&gt;<br&gt;Only sorta kinda gripe was the time it took to get the check.", "rating": 4, "date": "11/7/2016"}, {"text": "YUMMY! I went to The Cheesecake Factory for lunch and the food tasted so good! Parking was not hard to find. The hostess was very nice and we were seated quickly. The server was also very nice and friendly. Started out with a Caesar salad that tasted so fresh and good! My friend ordered Buffalo wings as an appetizer and it was delicious! I ordered a Ribeye Steak with Mash Potatoes and Asparagus. Just thinking about it is making me hungry all over again. I got it medium well and it tasted really good. The mash and asparagus was also tasty. The strawberry lemonade was also good! Finally we decided to try the Birthday Celebration Cheesecake. It was our first time trying it and it was AMAZING!!!! Overall, we had a really good experience and will be going back.", "rating": 5, "date": "10/27/2018"}, {"text": "Considering it&amp;#39;s a chain, service, food and drinks are always good<br&gt; We&amp;#39;ve been to several different locations and they are consistent in their brand. It&amp;#39;s great place for large groups, and couples . Portions enough for 2!", "rating": 4, "date": "9/22/2017"}, {"text": "The manger is kinda of a jerk but whatever lol. The food is great and so is the cheesecake.", "rating": 3, "date": "9/4/2019"}, {"text": "Back here at cheesecake.   It&amp;#39;s always a pleasure eating here<br&gt;<br&gt;I&amp;#39;m at Pembroke Gardens, which usually is packed today we were seated in 10mins. Pretty good<br&gt;<br&gt;Service was excellent and timely", "rating": 4, "date": "1/3/2019"}, {"text": "Great service today! I&amp;#39;ve been to this location numerous times and I am never disappointed. Food and service is always pretty good. I had the meatloaf today it was ok but the corn succotash and macaroni and cheese were amazing! They are always busy, but I&amp;#39;ve never waited more than 5 minutes for a table.", "rating": 4, "date": "6/13/2019"}, {"text": "Pros:<br&gt;Food is consistent  <br&gt;Service was good<br&gt;Atmosphere was nice<br&gt;Place was busy as usual<br&gt;Cons :<br&gt;But the Cheesecakes are expensive as usual and now they have made the slices of cheesecakes much smaller.", "rating": 3, "date": "8/9/2017"}, {"text": "Came here at 11:58 for brunch was crowded but not overwhelming as there were seats and the staff was on it.   Decided to sit at the bar.   Bartender was attentive and got our drink order quickly.   Well two orders of bread and over 25 minutes later we&amp;#39;re still waiting for our order - two orders of eggs Benedict.    Manager just walked over as I&amp;#39;m writing this so thanks.  Maybe they&amp;#39;ll comp the meal or drink - <br&gt;<br&gt;Update - the bartender got us an extra round - kudos to her!<br&gt;<br&gt;Photo caption reads &amp;#34;hungry&amp;#34; thank goodness for bread", "rating": 2, "date": "1/7/2018"}, {"text": "Food is good, kind of pricey. Had the steak tacos, girlfriend ordered a poke bowl and had a slice of cheesecake to go, 50$ not including tip. Come for the cheesecake not so much the food. Good and fast service though! The complimentary bread and butter is also very good.", "rating": 4, "date": "3/16/2019"}, {"text": "Lunch hour special 4-6 mon-fri! I got the hot spinach and cheese dip, factory nachos, and roadside sliders. All of the appetizers and a couple of drinks are under $6 during lunch hour. The portions are great for the price! The nachos were a little burnt and they just pop it in the oven. The spinach dip tasted alright and it was hot. My favorite part of the meal was the sliders, the bread was toasted perfectly and the chicken was crispy and juicy. They also have FREE BREAD!!! 3 different types served with butter. The service was spectacular, our waitresses informed us about the prices and lunch hour. She checked up on us multiple times and kept a positive attitude.", "rating": 4, "date": "6/27/2018"}, {"text": "Arrived around 6:30pm on a Thursday night and waited about 10 minutes for a table. They serve you their Famous Brown Bread and a french bread that are freshly baked and delicious. (Apparently you can buy these in some supermarkets now) The spread is real butter so it tastes better but is hard to spread. Honestly, the breads are so good they don&amp;#39;t really need anything on it. The Cokes where really good. Not everyone serves them this good. I ordered the Louisiana Chicken Pasta and it was completely amazing. It is made out of Parmesan Crusted Chicken Served Over Pasta with Mushrooms, Peppers and Onions in a Spicy New Orleans Sauce. Its spicy but not overwhelmingly spicy. Just a little kick to it. It is a really big plate that can be easily shared or turned into two separate meals. Seriously, I have an appetite and I just ate half of it. Overall, I was really surprised at the quality and taste of the food. Service was great too and though the server was brief, we didn&amp;#39;t have any needs that weren&amp;#39;t met in a timely fashion. Great job!", "rating": 4, "date": "6/8/2018"}, {"text": "Huge menu. Always a fun time with friends. Great spot for birthdays. You have to try the Oreo cheesecake!", "rating": 4, "date": "8/10/2019"}, {"text": "The main reason for the 3-star rating is the slow service you get 50% of the time. I totally understand  if the kitchen is backed up during the busy hour, but when the restaurant is less than half full it shouldn&amp;#39;t take half an hour to bring out two lunch entrees. The staff are relatively friendly for the most part, so thumbs up for that.<br&gt;<br&gt;There happy hour specials are awesome! My recommendation is the happy hour burger because you will get the most bang for your buck. It&amp;#39;s basically your standard double cheeseburger on a brioche bun. For $5.50<br&gt;<br&gt;Avocado eggrolls have a nice tangy taste to them and comes with a sweet Asian-pesto like sauce. Definitely worth trying.<br&gt;<br&gt;Cheesecakes are a little overpriced in my opinion. One slice goes about $7. That&amp;#39;s more expensive than getting a meal off the happy hour menu. In my opinion, desserts should definitely be cheaper than the actual entree itself for a even sweeter ending to your meal. My favorite is the tiramisu and white chocolate macadamia cheesecake.<br&gt;<br&gt;Mojito and Long Island iced tea are on par. Get those during happy hour.", "rating": 3, "date": "11/9/2015"}, {"text": "Service is always bad at this location. Servers barely care. Food is mostly always wrong. I had a to go order with a long strand of hair in it! Didn&amp;#39;t see it until I got home. Don&amp;#39;t expect good service at this location. Go to sawgrass mall!", "rating": 2, "date": "8/24/2019"}, {"text": "Finally I come around to this review. I&amp;#39;ll start off by saying that there were no complaints. Everything was delicious, service was great, and the wait wasn&amp;#39;t that bad. I believe we arrived around 9 PM so we probably only waited like 20 minutes to be seated in our table. They gave us a booth which is awesome especially with two little girls with us. The bread was amazing as per usual. To drink I ordered a mango smoothie, which was tasty and quite filling. Honestly from all the times I&amp;#39;ve ordered that drink it&amp;#39;s never come out bad lol. For my kids they had apple juice and both girls had the grilled chicken with fries. They loved it. My husband got I believe it&amp;#39;s called chicken Marsala with rice and he loved it. I was surprised he liked it because usually he&amp;#39;s picky but he loved it. I got a Margherita flat bread and it was awesome. I ordered that because I had already eaten a lot of bread, drank the whole smoothie, and I knew I wanted to order an epic cheesecake. Just thinking of the cheesecake I ordered is making me super excited and more hungry lol. I ordered the Oreo cheesecake. DELICIOUS. <br&gt;<br&gt;I&amp;#39;ve been to this location more often than the others because it&amp;#39;s close to where I lived and I&amp;#39;ve never had any complaints of this location. It&amp;#39;s actually my favorite from all the TCFs. With the others sometimes there&amp;#39;ll be a miss here and there but for this one I haven&amp;#39;t had one. So cheers !", "rating": 5, "date": "7/7/2018"}, {"text": "I came here while my car was getting serviced because I can&amp;#39;t pass up a Cheesecake Factory at a shopping center. I thought it was great service, friendly staff, and very good food. My chicken chili and Oreo cheesecake were very tasty.", "rating": 5, "date": "8/30/2018"}, {"text": "It&amp;#39;s a cheesecake factory, so the quality is pretty consistent with all other locations. However, the speed and service were not. The hostess was unfriendly at check in and the server was nice, but not easy to locate- including when we were ready to pay the bill. I don&amp;#39;t see this lasting in this location if they don&amp;#39;t get their staff some service training.", "rating": 3, "date": "2/10/2020"}, {"text": "Ordered take out for dinner. As I&amp;#39;m eating I realized there was a hair in my freaking food. I know it&amp;#39;s not mine because my hair is in a slick back low bun and my hair is blonde! This is gross and disturbing! This is my favorite restaurant but every single time I order take out there&amp;#39;s an issue. When will they get this together!!!! So annoying at this point! I&amp;#39;m such a regular that staff knows me by name", "rating": 1, "date": "12/27/2018"}, {"text": "Stopped by for drinks and dessert after dinner and had a lovely experience. Diondre was very polite and well mannered and ensured we had a lovely experience. Great way to end our night!", "rating": 5, "date": "1/31/2019"}, {"text": "Good service and great food! Extensive selection for all taste! <br&gt;Dishes should be washed better.", "rating": 4, "date": "9/2/2018"}, {"text": "Sloooow service Everytime we come. Bread arrives after the entrees. Plan to spend at least a 2-3hrs if you&amp;#39;re coming here. Try to get there early too because wait times are out of this world.<br&gt;<br&gt;Wish they had a reservation or call ahead system.<br&gt;<br&gt;Their food is mostly good and you really can&amp;#39;t go wrong with their humongous portions<br&gt;<br&gt;Favorites:<br&gt;<br&gt;Miso salmon<br&gt;Kobe burger with sweet potato fries<br&gt;Cucumber lemonade<br&gt;Frozen hot chocolate<br&gt;<br&gt;Brunch menu favorites:<br&gt;<br&gt;Eggs Benedict<br&gt;Cinnamon pancakes", "rating": 3, "date": "3/19/2018"}, {"text": "This Cheesecake Factory is the only one in Pines it the surrounding area, so it&amp;#39;s always packed and really hard to get a table on the weekends. The food is really good but a little bit over priced. The interior is very elegant and makes you feel nice. <br&gt;They have many many choices of cheesecake and makes good for a birthday dinner or celebration!", "rating": 3, "date": "10/27/2018"}, {"text": "After waiting almost an hour to sit, ordered Fried Calamari and Buffalo Blasts and they tasted HORRIBLE, with an aftertaste of burned old oil. Horrible experience, never this location again.", "rating": 1, "date": "1/5/2020"}, {"text": "Decided on eating at The Cheesecake Factory for an early dinner on a Tuesday afternoon.  We were greeted at the front desk and sat pretty quickly. The restaurant was not busy at all and plenty of open tables around. We were sat in the far back, out of sight. We were given menus from the host. After looking over the menu we realized it had been quite some time since anyone had come by. 15 minutes passed and we were never greeted, offered any water or drinks and never even met our waiter. Pretty sure no one even knew we were there. 15 min of sitting and not being greeted or offered drinks is unacceptable for a slow, Tuesday afternoon. We got up and left and decided this restaurant did not deserve our business this night. The hosts were pleasant and that&amp;#39;s about it. I&amp;#39;m truly disappointed with the service we experienced today.", "rating": 1, "date": "5/21/2019"}, {"text": "No matter how near or far I travel to a Cheesecake Factory I never have a bad meal. Their portion sizes are way too much and I&amp;#39;m not complaining for the reasonable price. I&amp;#39;ve been here probably 25x and I don&amp;#39;t think I&amp;#39;ll ever get to try all the menu items. My faves are the asian lettuce tacos and turkey sandwich from the skinny menu! I also love anything that comes with their signature mashed potatoes! Of course, the cheesecake is what it&amp;#39;s all about. Friendly staff and you definitely will take home a doggie bag.", "rating": 5, "date": "2/14/2018"}, {"text": "This place never disappoints when it comes to food, service, and drinks! My favorite is the angel hair pasta with shrimp. (The portions are huge.)The waiters are so friendly and attentive. And the mojitos are the best around!", "rating": 5, "date": "5/19/2019"}, {"text": "Always come to this location and enjoy the service and food. Enjoy the burrito and a slice of Oreo, Hersey of Reese&amp;#39;s cheesecake.", "rating": 5, "date": "6/29/2019"}, {"text": "Came by here for the third time for lunch since I&amp;#39;ve been in South Florida, and had another funky experience. <br&gt;<br&gt;Food was delicious as usual. I had the kale and quinoa salad and Americana burger. They actually  po it the right amount of parmesan cheese on the salad, which is typically my common complaint. The burger was done correctly, and as usual delicious. <br&gt;<br&gt;Customer service needed alot of work. The receptionists looked busy talking among themselves, didn&amp;#39;t bother paying attention or welcoming people walking in the door. And when we asked to be moved because the table was super small, it&amp;#39;s almost like I offended her. It&amp;#39;s almost like she forgets shes being paid until a certain time of the day to do her job and take care of customers. And then our waitress was my final deciding factor to leave this negative review. She was straight up rude. She obviously didn&amp;#39;t want to be at work, and was very impatient with the time it took us to order. She seemed upset with some of the questions I had about the menu items. Bad experience there unfortunately, and I blame the hiring managers. Look for hospitable and welcoming people to hire, not just anyone to fill the space.", "rating": 3, "date": "8/23/2018"}, {"text": "Let&amp;#39;s be honest, how many years have the Cheesecake Factory been around?  Pretty much a Very long time. <br&gt;<br&gt;When I was younger I went to the Cheesecake Factory in Aventura Mall for the first time, and being only a kid,  and  were all I cared for. But oh  boy what a horrible experience I had with what I ordered . I don&amp;#39;t remember what I ate (not sure if it&amp;#39;s repressed memory by now or I was just to horrified) but nonetheless, I remember telling my mom no hell No I&amp;#39;m not eating whatever crap was in front of me. Sent it back, remember the second meal being a burger and fries. Nope, didn&amp;#39;t happen. Didn&amp;#39;t like it, didn&amp;#39;t think it was normal; so we sent it back. I ended up telling my mom at a young age to never take me back to Cheesecake Factory EVER!!l (too cute, little old me)<br&gt;<br&gt;Being a real foodie means you LOVE  FOOD, you ENJOY  FOOD at any given moment, you SAVOR  flavors and you take your time to taste, inspect, and move on with the next bite before the waiter ask you is everything ok?! Yea, it&amp;#39;s serious business being a foodie. FAST FORWARD to 2027, In February I gave the Cheesecake Factory another shot for my grandmothers birthday, unfortunately I didn&amp;#39;t have a choice in the matter especially when have relatives from out of the country are in town. this time around changing my location and going to the newly renovated mall center near Pembroke Pines mall. <br&gt;<br&gt;My family and I walked in and of course we expected a time as anyone who goes out to eat in a Sunday. The wait was long nearly 1 hour, the place was so crowded, I&amp;#39;ve seen The Aventura location crowded before but this....this was a whole new level of groups and individuals just sitting and walking out waiting for their little machine to vibrate. Finally we were seated, the place is grande, spacious, elegant with high ceilings and the atmosphere was so different than i remember the Aventura location. Changing scenery did the job.<br&gt;<br&gt;This time. I ate like a champ, the experience was one worth enough for me to create a review on YELP (kind of reminds me of the South Park episode, when the whole town business was controlled by YELP reviewers I had the fried calamari and the Cajun pasta and we order pizza and salads and drinks, best part yet, this location has a mirror where a wall should have been separating the kitchen from the restaurants. Super clean, not quiet but the atmosphere is definitely one we enjoyed dining in.", "rating": 4, "date": "4/7/2017"}, {"text": "We love coming here. We have been here on multiple occasions, from birthdays to graduation dinners, as well as, just going out to dinner and dates. The ambiance is nice it gets pretty busy on weekends. It&amp;#39;s a bit noisy. Sitting outside is better if it&amp;#39;s not to hot because it quiet. The service has been really good.", "rating": 5, "date": "4/25/2019"}, {"text": "This Cheesecake Factory is located in the Shops at Pembroke Gardens outdoor shopping center. I like this location because it is perfect after a day of shopping. They have indoor and outdoor seating, and even on the busiest day I have never had to wait long to be served. The restaurant is spacious and clean, and the staff is friendly and professional.<br&gt;<br&gt;As with every other Cheesecake Factory, the bread is to die for! They have a very extensive menu where you can get whatever you are craving - pasta, steak, seafood, burgers, sandwiches, sushi, Chinese food, Thai food, Mexican food - they literally have everything! I recommend the Tex Mex egg rolls if you are in the mood for a Mexican appetizer. The orange chicken is delicious and so is the Bang Bang chicken and shrimp - my favorite dish. I highly recommend if you like curried food. <br&gt;<br&gt;Their drink menu is awesome because they have a lot of strong and fruity cocktails which I am a huge fan of. You can&amp;#39;t go wrong with the Mai Tai! <br&gt;<br&gt;They also have a skinny menu for meals and drinks if you are watching your weight, and they let you know of their product is gluten free or began friendly. <br&gt;<br&gt;The cheesecake here is delicious and the serving size is enough to share. My favorites are the white chocolate caramel, the oreo cheesecake, and the strawberry cheesecake!", "rating": 4, "date": "12/12/2016"}, {"text": "Variety, variety! This Cheesecake Factory now has the impossible burger! Also, if you&amp;#39;re Caribbean, you&amp;#39;ll love the fried plantains, they&amp;#39;re better than most :) m<br&gt;<br&gt;Cheesecake Factory is always a good go to. Anything you&amp;#39;re looking for, they usually have it, in their booklet of a menu :D <br&gt;<br&gt;Brunch is good, but is only on Sundays, And of course the cheesecake is amazing.", "rating": 5, "date": "10/30/2018"}, {"text": "Other than than the wait, which wasn&amp;#39;t actually all that bad given that it&amp;#39;s Fathers Day and the restaurant was packed, the service and food were absolutely excellent. Mimi was our server and she was absolutely awesome. Extremely attentive, courteous, kind, witty and energetic.", "rating": 5, "date": "6/16/2019"}, {"text": "This has never changed. It&amp;#39;s sort of a bad food emporium for shoppers too desperate to go elsewhere. The service may be the worst in this capital of rude, non English speaking help (). <br&gt;They eventually bring several menus full of the most unhealthy garbage I&amp;#39;ve eaten in years. I was at a Cheesecake Factory a few years ago because it was next to an Apple Store and it was very much like this experience. I stupidly thought that some of the Apple might rub off, but no and this is exactly the same unpleasant experiment.<br&gt;What really gets me is that they are too cheap to install WiFi. Oh well, it gives me an opportunity to jot down a few thoughts; I&amp;#39;m sad to say they are all bad. When I asked for lemon I got NO LEMON for the oh so so sweet dumplings. Yuck! Nevermore quoth the raven.", "rating": 1, "date": "8/31/2017"}, {"text": "The food here is great and the menu selection is vast, but the service is not on par! Our table was a party of 5 but we might as well been 15, because our food took forever, the drinks and refills were slow and the server was no where to be found. The manager never came up to apologize to us about what was going on, and this wasn&amp;#39;t even the weekend, it was a Friday afternoon for lunch. I would hate to see how it is during busier hours!", "rating": 3, "date": "4/16/2018"}, {"text": "I&amp;#39;m not exaggerating when I say this is my favorite restaurant and I come here at least every other week. This one is close to home but I&amp;#39;ll go to any Cheesecake Factory in any state the food is just so versatile and you never get tired of what&amp;#39;s on the menu. I also enjoy happy hour here. The prices are very affordable. There has yet to be a meal I haven&amp;#39;t enjoyed and the bread??? Everyone loves the bread", "rating": 5, "date": "3/31/2019"}, {"text": "Food came quickly and I had a great time. Service was great and the pasta was al dente. The nachos were tasty and the toppings were on point.", "rating": 4, "date": "5/19/2018"}, {"text": "It is always an amazing experience of flavors and taste. The service is excellent. Might need to wait to be seated 30 minutes in a Saturday night, but it is completely worth it.  Favorite plate Hibachi Steak, Favorite appetizer Tex mex Egg rolls", "rating": 5, "date": "12/9/2019"}, {"text": "Good love the red velvet ! Haven&amp;#39;t really tried any other kind. This is one of my favorite places to hangout at.", "rating": 3, "date": "9/6/2018"}, {"text": "The food is always great. However, the service is not great; we did not appreciate how rude the waiter was last time we went there. Furthermore, any alcoholic drink will have more ice than liquid.", "rating": 3, "date": "5/14/2019"}, {"text": "Wasn&amp;#39;t a big fan of this place however glad I gave it another try. Food was better this time around.", "rating": 4, "date": "8/11/2018"}, {"text": "The avocado toast is absolutely divine. I have never had such delicious avocado toast in my life. It was so flavorful and the bread it came on was steaming hot and fresh, it was absolutely amazing. The customer service was just as good as my food; the manager checked up with us a couple of times as well as our waitress. Will definitely be going back for more avo toast :) #vegancertified", "rating": 5, "date": "5/12/2018"}, {"text": "I&amp;#39;m really not a big fan of chain restaurants, however, I have never had a bad foodie experience in this Cheesecake Factory location.<br&gt;<br&gt;Yesterday we had a farewell party for our co-worker. We had a big party, about 25 people, and I am impressed how well organized the whole process was. Especially, that they split checks for each and every individual that was seated. That&amp;#39;s a huge plus for big parties. They sat us near the bar area so that was convenient. They have great happy hour specials and an array of cheap apps and salads that are included in the happy hour menu. Happy hour is from 4-6pm. <br&gt;<br&gt;I ordered the Vietnamese Shrimp Summer Rolls for $5.50. It was an amazing deal and I got very full from just that alone. The roll is filled with vegetables, shrimp, and rice noodles. Its wrapped in rice paper and it comes with a peanut and spicy chili dipping sauce. The spicy chili was my favorite! I also ordered the fried avocado rolls. I cannot even begin to describe the amount of joy I had eating this amazing appetizer. You know the section of yelp that asks what the last food you were to eat if it was your last day on earth? I have to add this app in there. It was THAT GOOD! <br&gt;<br&gt;I could not for the life of me leave the Cheesecake Factory without having a cheesecake. So I had one slice of the Chris Outrageous Cheesecake. Anyone that knows me knows that I ALWAYS leave room for dessert. This cheesecake has to be the best cheesecake I HAVE EVER HAD!!! This cheesecake consists of a Layer of moist chocolate cake, a layer of Brownie, Toasted Coconut-Pecan Frosting and Creamy Chocolate Chip Coconut Cheesecake. Who created this??? Was it Chris? I want to meet this guy and hug him! And also curse him for creating such a heavenly sensation filled with a week full of calories, fat, carbs, and sugar. Oh well, It was worth every bite. I enjoyed immensely. Total euphoria. <br&gt;<br&gt;Trust me...order this cheesecake and you experience a slice of heaven! <br&gt;<br&gt;PS. The cheesecake factory has $6 valet which is worth it so you don&amp;#39;t have to park 2 miles away. Or maybe after eating here it&amp;#39;ll be worth parking far to burn some calories. LOL!", "rating": 4, "date": "6/9/2016"}, {"text": "This is horrible 1 hr wait then goes to sit us next to people when we have a small child then the hosted gets disturbed because we want a booth ridiculous then another 45 min wait. Never again", "rating": 1, "date": "10/27/2019"}, {"text": "Never have anything bad to say about The Cheesecake Factory, this was my first time visiting at this location. Everything was great from the food to the service! Look forward to coming back", "rating": 5, "date": "7/17/2018"}, {"text": "I came last night for my birthday. I rarely go out mostly cause I can be impatient. The wait time, the waiting for a plate, the waiting for the check. <br&gt;<br&gt;The piña colada was weak, I barely tasted the alcohol. My plate was a cup of angel hair with 6 large shrimps. I was beyond disappointed cause I wanted to bring some home. It had a great taste but I really was hoping the portion would&amp;#39;ve been enough to take home. <br&gt;<br&gt;On the bright side on my birthday they had the cheesecakes on half price. The Godiva is super sweet but is awesome with milk (bought it home)<br&gt;<br&gt;I honestly won&amp;#39;t be returning. First impression matters.", "rating": 3, "date": "7/30/2016"}, {"text": "I love the Cheesecake Factory! It is one of my favorite places to have brunch and dinner. I like this location in particular because it&amp;#39;s closer to my job and more convenient to access from where I live. Service is consistently great regardless of when I visit, whether it&amp;#39;s alone or with family and friends. Can&amp;#39;t wait to come again!", "rating": 5, "date": "1/26/2019"}, {"text": "I love the food and order the long island iced tea everytime. The staff is normally very nice so no problems there. <br&gt;<br&gt;One issue that I have is the outdoor seating. I only sit outside when I come here (1/month). I love the atmosphere of the shopping center. The smaller outdoor area however is very very hot. I dont mean beacuse of the sun. Their fans are only on one speed and it does not keep you decent. I know it is outside but, this is FL. Though I don&amp;#39;t expect cool, it was a breezy day today and I could still feel my body temp rising. My 2 yr old was miserable. When asked if the fan near could be turned up was told it only has one speed. The other area does not have a temp issue. This is the second time sitting on this side and had the same issue. I would ask to sit somewhere else if they give you this side.", "rating": 4, "date": "2/25/2018"}, {"text": "We were a table of 5 plus a high chair. They broke glass and it shattered a jumped everywhere and hit my nephew- which I understand that wasn&amp;#39;t done on purpose, but cmon -_- <br&gt;I had a 4 cheese pasta..... idk about you, but wouldn&amp;#39;t you imagine the pasta to have white sauce?? Not red? Then I find out the serve is supposed to ask what sauce. She just automatically assumed I wanted red. The pasta came with exactly 5 small pieces of chicken.... yes, I ordered the lunch portion. But 5 pieces of chicken? To pay for a plate that&amp;#39;s $18, only 5 pieces????", "rating": 3, "date": "4/8/2019"}, {"text": "My Grandma and I went for lunch as soon as we walked in we were able to be served. Our waiter was nice and allowed us to look around before asking us what we wanted. we settled in and ordered the avocado egg rolls for our appetizers and after ordered our entrées. I had the chicken lettuce wraps and she had a well done hamburger. <br&gt;it was so good that we even took half of our meals home.", "rating": 5, "date": "9/16/2016"}, {"text": "My husband and I visited yesterday with our toddler and it will unfortunately, after MANY visits, will be our last. We arrived around 4:30 PM for an early dinner (or so I thought), expected to wait as we typically do at this location. We check in and are told wait time is 15-20 minutes. Its borderline no can do with a toddler, but he was in a good mood and  judging by the size of the crowd, it seemed the hostess got her estimate right. Flash-forward 30 minutes later, our toddler is well-past melt down mode, I have my husband check in to see approximately how much longer for us. Not only did the hostess have our party size wrong (said we were 4 and a high chair when we were clearly 2 and a high chair) she told us we had only been there 10 minutes and it would be another 30!!!! I almost lost my damn mind. Ask my toddler if weve only been here 10 minutes!! Having been a hostess myself years ago, i understand the stress-fullness of the job and coordinating tables, especially at a restaurant like Cheesecake. But do not tell me I have been only waiting 10 minutes when its pushing 30! Time estimating is the hostesses most important job in this place, if you cant get it right, simply dont do it. They have an issue with this, as this is the 2nd time in a row this has happened to us. <br&gt;<br&gt;Needless to say, we put the beeper back on the hostess table and left, PO&amp;#39;d, hungry, and with a crazy toddler. Thank God theres plenty of other places to eat here.", "rating": 1, "date": "9/30/2019"}, {"text": "I don&amp;#39;t normally go this location due to the distance but when I do, they don&amp;#39;t disappoint. I went on a Sunday &amp;amp; it was crowded but we got seats for 7 people in less than the wait time we were told which was 40-50 mins. Got a table outside and our waiter was very nice. Our water was quick to get refilled &amp;amp; all the food came out hot. The bill came out in one check but our waiter didn&amp;#39;t mind splitting it up &amp;amp; did so with a great attitude. This place is so convenient as the parking (if you&amp;#39;re lucky) is literally a couple steps away from the entrance &amp;amp; there&amp;#39;s shopping all around before or after your meal!", "rating": 5, "date": "7/30/2017"}, {"text": "Waiting time for first como first 45 to 50 minutes <br&gt;Delay at the entrance dish came with all together. The waiters was wonderful all time . I do appreciate that i will be back soon", "rating": 4, "date": "11/20/2016"}, {"text": "I&amp;#39;ve never been a fan of The Cheesecake Factory but no doubt, they make the dopest desserts. I decided to give TCF two tries, once for dinner and a few days later for their Sunday brunch at this same location, and neither of these visits disappoint. On one of my visits I ordered the Four Cheese Pasta which comes with penne pasta, mozzarella, ricotta, romano and parmesan cheese, marinara sauce and fresh basil (you can add chicken). I was delightfully surprised this dish didn&amp;#39;t taste overly cheesy. It was a nice comfort food that hit the spot. I kept hearing about their Sunday brunches so we decided to come back a few days later and I ordered a Cinnamon Roll Pancakes and O...M...G... So good! I think brunch was the biggest hit for me, along with their signature cheesecakes.", "rating": 4, "date": "6/26/2018"}, {"text": "This is by far the WORST !!!!! We spend more than an hour waiting to be seated , the hostess giving us every attitude. When we tried to speak to them to see another alternative they just didn&amp;#39;t care or wanted to help . We were a party of 9 with four kids .", "rating": 1, "date": "9/13/2019"}, {"text": "Me and 5 coworkers hit this location up. We were all pretty pleased. The portions were a nice size and we made happy hour so the drinks were on special and really good. We did the avacado roll, spinach dip and stuffed mushroom. No complaints. I had the 4 cheese pasta which was okay being Italian I should of known that pasta isn&amp;#39;t their specialty so no blame there. My friend had the chicken with cheese and asparagus now thats what I should of done! It was very good. The best part was the cheesecake...dolce de leche! It was ridiculously good! Espresso was blah...order American coffee. The server was very good! Im sure Ill be back.", "rating": 4, "date": "12/4/2018"}, {"text": "Always a good place to eat, but why don&amp;#39;t they offer a dairy free cheesecake?! So many places have that option. Could have been a 4 stars if only.", "rating": 3, "date": "2/9/2019"}, {"text": "3 stars today as food was great but service severely lacking.  Took much too long for food to arrive &amp;amp; when it did, 1 Order was wrong.  Took an additional 10 min for corrected order to arrive.  Manager couldn&amp;#39;t be bothered with checking on diners as he walked the floor.", "rating": 3, "date": "8/10/2019"}, {"text": "Delicious food but service not what it&amp;#39;s like at other locations.<br&gt;<br&gt;I love food, which makes it easier to love the Cheesecake Factory. Who in their right mind doesn&amp;#39;t love cheesecake?! Even people with dairy intolerance love the stuff, but today&amp;#39;s visit left me wanting better service.<br&gt;<br&gt;Our party of five arrived, placed our orders... Every one got their food except for me, I waited 10 mins till I was finally bright my food. The chicken piccata is my favorite, it always gives me a smile on my face and in my belly.<br&gt;<br&gt;When dessert time came around I ordered a cappuccino to go with my cheesecake... Again, everyone received their drinks, I waited... And waited till I was able to flag down the waitress to remind them I didn&amp;#39;t receive my cappuccino. We finished the cheesecake before my cafe con leche arrived pipping hot, so hot I burned my tongue... Lucky for me I was able to enjoy the cheesecake while I still had taste buds.<br&gt;<br&gt;We informed the waitress that we didn&amp;#39;t receive the cappuccinos we ordered but instead cafe con leches, she change our bill &amp;amp; took mine off (I left almost all of it since I didn&amp;#39;t want my party waiting for me to finish the cup of lava I was served)", "rating": 2, "date": "11/18/2015"}, {"text": "In the past I was never the biggest fan of this restaurant but maybe I was not choosing the right plates.<br&gt;<br&gt;I came this time to celebrate my best friends birthday and I will admit I really enjoyed it.<br&gt;<br&gt;I ordered from the Skinnylicious menu, the avocado and chicken sandwich which came with a salad. My best friend has pasta and she also ordered some avocado rolls which were really good. I was very happy with what I ordered, it had so much flavor and the avocado was fresh.<br&gt;<br&gt;We also ordered dessert. Oreo cheesecake!!! It was to die for. I dont nornally do cheesecake but this was just way too good.<br&gt;<br&gt;I think I will give this place some more chances and try new things more often.", "rating": 4, "date": "8/15/2016"}, {"text": "When you have the dish in the name of your chain, you really only need to do that one dish properly to keep people coming back.<br&gt;<br&gt;The Pembroke Pines Cheesecake factory does this EXACTLY.<br&gt;<br&gt;PROs: Red Velvet cheesecake was AMAZING per usual. <br&gt;<br&gt;-They were even kind enough to split a slice so I could share it with my coworker. I don&amp;#39;t know if this is a company wide practice as some sites will do it without a problem but others end up being a bit confused when I request it.<br&gt;<br&gt;Cons: Other foods were disappointing.<br&gt;<br&gt;-I was dining here with some coworkers. I got a sandwich and fries while they ordered more complicated dishes. One coworker got the fried mac and cheese as an entree. They did arrive with the other entrees but they were cold. While I have no proof, I assume that they were prepared to be sent as an app, read the ticket and kept the dish back and sent it out with the other entrees. My other coworker got a salmon dish that was unmemorable other than the fact that the taste of the salmon was completely masked by a mess of &amp;#34;herbs&amp;#34; and butter. (I tried A bite and didn&amp;#39;t ask for more. She did not finish it either.)  <br&gt;<br&gt;As a prologue, I REALLY HOPE THAT THIS HAS BEEN FIXED BY THE TIME THIS IS POSTED:<br&gt;-I went to the restroom. In the ladies&amp;#39; room, there were 2 stalls. I opened the door to the handicapped stall and saw it was occupied by an older woman with a walker. I tried to apologize and she said it was ok as the lock was broken. I have to wonder how long it had been like this without any one noticing such an easily fixed problem.", "rating": 3, "date": "5/11/2016"}, {"text": "Super disappointed at this place. I&amp;#39;ve been to other cheesecake factory and food was delicious. At this location, portions were tiny and super greasy. I have the alfredo pasta and it was a bath of oil. Chicken was dry. Tuna was nicely cooked but there were 4 small pieces. Please go to others cheesecake factories since they are so many in FL. The mall is nice, a beautiful strip with stores on the side. Nice for a stroll.", "rating": 1, "date": "7/7/2017"}, {"text": "We had a Great happy hour experience. Drink and apps  for $5.50 4-7pm and the drinks are strong! The waitress was awesome, we only had an hour til our movie started and she got us in and out with 15 mins to spare! Will be hitting this spot up a lot more!", "rating": 5, "date": "4/21/2016"}, {"text": "I have been at the location since 7:30 it is now 9:12 and I still have not received my order. I told<br&gt;My server Adam that I would like a a New York strip steak and a side of shrimp scampi. He first came<br&gt;Out with a bowl of scampi sauce and I asked what it was for. I told him again that the shrimp scampi doesn&amp;#39;t come like this. He cut me off and said I got u I got u. He then brings my meal out with scampi sauce all over my steak. I smiled nicely and said no this is not what I asked for. He then said do I want this or should he take it back and make it all over. I said this isn&amp;#39;t what I asked for so I&amp;#39;m<br&gt;Not going to eat it. The manager comes out very aggressive trying to confirm my meal and says NY strip with grilled shrimp with scampi sauce. I tell her that is incorrect I don&amp;#39;t want it grilled. She then says that&amp;#39;s how it comes I said no it isn&amp;#39;t I come here all the time and you guys make it happen. She then says well that&amp;#39;s gonna be $30 is that ok? If I said I come here all the time I&amp;#39;m pretty sure I know the cost. I would just like my food. It is now 9:20 and still no food. This is absolutely outrageous. I have been very patient waiting here for my food. My family ate their entire dinner without me and I was the one who suggested this place. Definitely will think twice about coming back with the service I received today.", "rating": 3, "date": "7/17/2019"}, {"text": "Good place but for some reason sometimes is great and other not that much (talking about the food and service)", "rating": 3, "date": "11/18/2018"}, {"text": "Cheesecake Factory please make the French onion soup the way it&amp;#39;s supposed to be made! What you are serving is not French onion soup but simply sauteed onion soup. There&amp;#39;s nothing French about it!", "rating": 4, "date": "8/6/2019"}, {"text": "What can I say that everyone doesn&amp;#39;t already know about Cheesecake Factory, majority of the plates are enough for two people, to eat the dessert first or you won&amp;#39;t have enough room, which would defeat the purpose in going to a place that has some of the best cheesecake. #redvelvetcheesecake", "rating": 4, "date": "10/4/2018"}, {"text": "Came here for a date night and really loved my pasta and drink! the wait was a little long but that&amp;#39;s to be expected, overall I really love the cheesecake factory and recommend for couples or families for a nice night out!", "rating": 4, "date": "10/28/2018"}, {"text": "Always a great place to go for whatever reason. Great for the wife and kids, weekends, the in laws.", "rating": 4, "date": "1/13/2019"}, {"text": "When I have birthday party to celebrate I go there, love the chicken marsala, the pasta and the service excellent. Love the decorations and everything there. Good food", "rating": 5, "date": "1/8/2019"}, {"text": "Service here is getting lax and the food is getting inferior and costly for the wait time. My food was mediocre, however the patron next to me waited almost 45 minutes for chili. You know that&amp;#39;s not happening. I got the gumbo on rice and was disappointed; it used to be tasty, now if just bland. No longer worth the wait time too many other places to compete for my dollar.", "rating": 2, "date": "7/21/2017"}, {"text": "Having a great time at Cheesecake Factory,  Pembroke Pines!  our server Jennifer is been outstanding!! Best ever!!", "rating": 5, "date": "10/8/2018"}, {"text": "I love eating here. One of my favorite things to order is the chicken potstickers. This time one of the things I ordered was a Greek salad with the olives on the side &amp;amp; when they brought our food the olives had been mixed in, when we revived the salad remake there were no olives (olives on the side) at all.", "rating": 4, "date": "1/10/2019"}, {"text": "Yes the portions are ginormous and tasty, but the service is why I give this Cheesecake Factory five stars. We received genuine hospitality. First our table was too small; no problem whatsoever. It was taken care of pretty quickly. Then our one and a half year old was becoming super cranky.  I was ready to take her outside when a manager came over and offered a cookie to help us calm her down. She was super sweet and it was completely unexpected. Thank you for making our experience great!", "rating": 5, "date": "11/20/2018"}, {"text": "I came here this past week with my family to celebrate my nephews 12th birthday. Although the food was good and the waiter was great. I was embarrassed by the fact that the waiters put absolutely no type of effort in singing happy birthday to him. They sang happy birthday and just blew it off, walking away immediately as if it didn&amp;#39;t mean $#!+ to them. I know sometimes this task could be burdensome but I feel like sometimes you have to fake it for the customer. I feel like next time if it&amp;#39;s somebody&amp;#39;s birthday, you should gather the ones who would put a little bit of more effort and make it more meaningful.", "rating": 3, "date": "11/10/2018"}, {"text": "I absolutely love this restaurant. I always want to go here. But i am very disappointed with the false advertising of this yelp profile. My husband was trying to step up a dinner for my 30th birthday and we have a very big party and when calling he was told that you do not accept reservations. We have a party of 15+ people and this profile states that one of the features of this restaurant is reservations that is obviously false. Very disappointed.", "rating": 2, "date": "10/27/2018"}, {"text": "The Pembroke gardens location always has a wait on weekends but it&amp;#39;s usually half the time that they estimate upon arrival. Went for Sunday brunch In a group of 5 - the food is consistently good, the service was sufficient considering it was busy, and all of the orders came out correct.", "rating": 4, "date": "7/1/2018"}, {"text": "Food is pretty good but will not return due to the rudeness of the staff. The hostess give you incorrect wait times then get upset when you ask about the wait time. Was told I would wait 1 hour and a half and ended up waiting closer to 3 hours.", "rating": 2, "date": "6/25/2018"}, {"text": "Out of all the food chains restaurants, The Cheesecake Factory is definitely my favorite. This particular location is located in Pembroke Gardens Shops where you can grab a bite or a drink after a day of shopping. I think this location is also good for any occasion, like a family gathering. There is always a line, expect to wait about 30 minutes to an hour. <br&gt;I feel that every single item at Cheesecake Factory is good, no matter what you order. I&amp;#39;ve had many items on their menu and they&amp;#39;ve amazing. I&amp;#39;ve tried their mac and cheese balls, one of my favorites, small portion good enough for 2. I&amp;#39;ve tried their egg roll sampler, seared tuna, nachos, burgers. As far as entrees, my favorite are the steak Diane with mashed potatoes. The steak is like a filet, it&amp;#39;s so soft and tender and the sauce is amazing. I&amp;#39;ve also tried many of their pastas, carbonara, jambalaya, shrimp pasta, and even spaghetti with meatballs. I haven&amp;#39;t had any complaints, food is always solid good. I&amp;#39;m giving them 4 stars because of the wait times, service really depends on your server, and parking is so limited.", "rating": 4, "date": "3/16/2017"}, {"text": "I&amp;#39;m here at the restaurant with my wife celebrating our anniversary of marry and with sat down to enjoy a nice dinner and the food came to the table and my wife meat was wrong with ask for medium and the brought it medium rare with ask the server to fix it they take the plate to the kitchen we wait like 15 minutes and they brought the food back to the table and they didn&amp;#39;t to anything to the food I&amp;#39;m a chef and I know how to cook and they didn&amp;#39;t do ANYTHING to the plate and was cold not right. We spoke to the manager and she said that for that Steak awill take 15 minutes for a hibachis steak come on and then with wait 20 minutes more for them to bring the right food. I will no come back to this location the made my celebration a nightmare.", "rating": 1, "date": "10/11/2018"}, {"text": "Cheesecake has a huge menu, as you know. Something for everyone. <br&gt;<br&gt;This particular one i came to around 10pm on a Thursday. place closes at 11pm. The hostess didn&amp;#39;t even make eye contact with us while talking and checking her phone. Inside was bit too cold for my linking. The menus were greasy and dirty - with so many pages and so many menus, I would expect they rarely get cleaned - and when they do, it&amp;#39;s probably with dirty rags. that part alone disgusted me. <br&gt;<br&gt;The food was... meh. Cheesecake Factory food. Same ol same ol. Not one of my favorite places. Cf is a cheap-date, at-least-I-know-what-I&amp;#39;m-gettng place. <br&gt;<br&gt;The cheesecake is good though! Go for that!", "rating": 3, "date": "11/18/2016"}, {"text": "I give you 1 stars do to the fact the we ordered for take out and I got there before time so my food can be fresh. Well the aguacate egg roll  was soggy and nasty <br&gt;My steak Diane had no flavor so mushroom and sauce  was extra watered down the meat had no flavor maybe it was my fault for no looking in the bag before departing the restaurant.but I will  NEVER ORDER FOR TAKE OUT AT THIS LOCATION ITS HORRIBLE ..  $70.00 just wasted ..", "rating": 1, "date": "2/14/2017"}, {"text": "I went to Cheesecake Factory in Pembroke Pines for lunch on a rainy day spending $17 keep in mind the day before i spent $26.00.  I placed the order online and pay for faster pickup. when i arrived the server at the pickup desk stated it will be $5 more since i modified my order per his manager Chelsea who was close by.  Now i have no issue paying extra if i was notified upfront however Chelsea the manager showed no empathy just proceed to ask for the additional $5 which immediately ticked me off so i told her no thanks and left without considering how my refund would be processed. i called the store spoke with her in all the conversation she stated she did not mean to upset me put i can place another order that i am financially comfortable with ooooookay (just tick me off even more) so she expected me to wait another 30 minute for a meal don&amp;#39;t think so!  As a leader she SACRIFICED a good customer experience + $17.00 for $5.00.  (i recommend your employees to read &amp;#34;The 6,000 Egg by I went to Chik Fil A and spend $9 got a quick lunch and GREAT CUSTOMER EXPERIENCE", "rating": 1, "date": "5/6/2019"}, {"text": "Lazy managers, lazy order takers, lazy chefs. Greek salad by CF menu is GREEK SALAD 380 cal 6.95<br&gt;Feta Cheese, Tomato, Cucumber, Kalamata Olives, Red Onion and Vinaigrette<br&gt;<br&gt;Where do you see Greek salad FULL of lettuce? There is NO Greek horiatiki salad with lettuce. <br&gt;But the chef insists on pumping up the already tiny portion of Greek salad with lettuce. You see it is less expensive than the other ingredients. And of course if you ask them not to put any lettuce in - they will. Lazy order taker, lazy manager who does not oversee and lazy kitchen who do not learn. Thank you once again for nothing.", "rating": 2, "date": "9/27/2018"}, {"text": "Good food and service...the wait time was shorter than normal, only about 20 mins. Drinks were on point too!!", "rating": 4, "date": "8/3/2018"}, {"text": "Well it&amp;#39;s a chain and I&amp;#39;m not big into chain restaurants but their  food is pretty good. I can&amp;#39;t say I&amp;#39;ve always had a great meal, there was one time I ordered chicken enchiladas . They were just ok, not something I would order again. Everything else has been really good, the dish I love and order often is the Tuscan chicken. My favorite. <br&gt;<br&gt;The service has always been good, they are usually very attentive and friendly. They also are well versed on the dishes and able to answer any questions I&amp;#39;ve had. <br&gt;<br&gt;This last trip I tried their cheesecake, I know it&amp;#39;s called Cheesecake factory and after 5 visits it&amp;#39;s the first time I ordered their cheesecake. Omg it way heavenly, rich but delicious. <br&gt;<br&gt;Cheesecake factory has an insane amount of items, I&amp;#39;m not sure how they pull it off but they really do a great job.", "rating": 4, "date": "2/1/2016"}, {"text": "I love their mango &amp;amp; chicken avocado salad. Out of the ten (or more) times I&amp;#39;ve ordered the salad, something is always missing. Either there&amp;#39;s no avocado  or there&amp;#39;s no bread .  I&amp;#39;m not sure why they are always cheating me of something (by not giving me everything I&amp;#39;m paying for), but it makes me wonder what else Cheesecake Factory skims customers on. <br&gt;While I enjoy their salad, I wouldn&amp;#39;t recommend this store. <br&gt;If I already know before checking the bag that not every thing I ordered is in it, then this is clearly not a good store to buy from.", "rating": 1, "date": "5/6/2017"}, {"text": "A bit pricey. But the portion are more than filling. The place always seems to be clean and the service is fast. The lighting is a bit dark but overall, the place is nice. <br&gt;<br&gt;They are always busy. Apparently, the cheesecakes are the only thing that comes frozen. I still think they taste better great. The Oreo cheesecake is my favorite (it might be called cookies and cream).", "rating": 4, "date": "1/22/2017"}, {"text": "Normally....I&amp;#39;m not a fan of big chain restaurants, today was the best service and food at cheese cake factory, Oh yes you heard right. Our server Sarah was exceptional and attentive. Our food (based on her recommendations) was phenomenal. Definitely returning and asking for her!", "rating": 5, "date": "4/28/2019"}, {"text": "I used to remember when the Factory actually put all passion and love into making cheesecakes but over the years it&amp;#39;s gone down the drain. When I visited I would always order the Lemoncello torte (cake) which always come with a side of juicy sliced strawberries and rip cream. I would always mix the cake rip cream and straw to get a savoring flavor that I would never forget. But over time their quality in food drastically decreased. They not only cut smaller portions of the cake for the same price but they serve less rip cream and even stopped cutting their strawberries. I actually had to take a knife out and start cutting them myself. The strawberries weren&amp;#39;t even juicy anymore they had been completely dried out; I assume the company does this to make the fruits last longer and save more money, but overall Cheesecake Factory isn&amp;#39;t as good as it used to be one star. PS here&amp;#39;s a before and after picture of the cake I usually order. In the after picture I had to cut the strawberries myself.", "rating": 1, "date": "1/26/2019"}, {"text": "The service and food is always great every time I come. However, I have one small complaint...I wish they would just soften the damn butter!!", "rating": 5, "date": "10/9/2018"}, {"text": "&amp;#34;Cheesecake&amp;#34; is one of our go to places. We can usually count on the good and service to be top notch. Yesterday, this was not the case. When we arrived, we got a table immediately. The hostess told us that was because it was cold out. <br&gt;Our server was a guy that seemed in a rush. Both my son and I emphasized that we like our French fries brown/well done. I got the feeling he wasn&amp;#39;t paying attention. After a half hour we still didn&amp;#39;t have our food, but we had received two bread baskets. A woman came to our table to say she would take over our table. She reeked of cigarettes. We hate cigarette smoke. We asked if the order had been put in and she told us that was the case. We still waited, and after a while some food arrived. The fries looked like fast food fries. Not to Cheesecake Factory standards, and definitely not brown as requested. We asked the server to get them browned a little more, and also for the other ones to come out brown. When two more servings of fries came out, they were not well done...<br&gt;There were more mistakes and more waits. We ended up waiting for the check over 20 minutes. What a disappointment. They probably had the B team working.", "rating": 2, "date": "1/5/2018"}, {"text": "We waited way to long for food and that would be fine if our server would had come and accommodated to us. And we ask for our pizza to go and it still took forever. Ruined my date night with my husband.", "rating": 3, "date": "6/23/2018"}, {"text": "Amazing like always! Love the pasta and bread from here! Took my co worker here for her first time and she had an amazing time! I hope to come back soon!", "rating": 5, "date": "8/11/2018"}, {"text": "Service can be spotty but overall it still offers the widest variety of choices, decent portions and top quality ingredients for generally reasonable prices. <br&gt;I had an excellent turkey burger on a great brioche bun. Not the most imaginative selection but it&amp;#39;s safe to say if you want any type of burger you&amp;#39;ll be satisfied with the results here.", "rating": 3, "date": "2/26/2017"}, {"text": "The salmon crusted salad is bomb when it&amp;#39;s made right... the only reason I&amp;#39;m giving this location any stars is because the take out ppl are so kind... but anyways so I have ordered the same thing everytime at this location because it&amp;#39;s the only thing I really love and fits my health needs... every time I order this salad it&amp;#39;s missing ingredients like the chef just doesn&amp;#39;t know what comes on the salad... or they are out of stuff and try to pull one over on you. This is almost 20 dollars for a salad there should be no reason why half of my ingredients are missing... every single time... you&amp;#39;d probably say stop coming to this location but it&amp;#39;s literally the healthiest thing I can get near my job... smh... someone please help because the other Cheesecake Factory&amp;#39;s DONT PLAY ABOUT QUALITY...", "rating": 2, "date": "6/11/2018"}, {"text": "There were so many people waiting outside, I thought for sure there would be a long wait. But the hostess said for 2 it would be 15 min, and then we noticed an open table at the bar so we grabbed it-no waiting! Awesome, server promptly brought menus, took drink orders, and within 5 min I had my wine, ice water and bread. We decided to try &amp;#34;fried macaroni and cheese balls&amp;#34; sounds a little insane, but my daughter wanted to try it so we ordered it. Four big balls of Mac and cheese, coated with breading and fried, served with a cream tomato sauce, not too bad.<br&gt;<br&gt;For our entrée, decided to split the teriyaki chicken, substituting mashed potatoes instead of rice. Omg those potatoes are amazing!! Perfect consistency and texture. The chicken was cooked perfectly, and the teriyaki sauce was just sweet enough!  So filling, had to pass on the cheesecake dessert! Oh well, maybe next time!", "rating": 4, "date": "5/31/2014"}, {"text": "I usually love the food at the Cheesecake Factory, but this one is just not as good as others around town. This place is always super busy so plan ahead if you are coming here. Thankfully we arrived before the dinner rust and didn&amp;#39;t have a wait. The staff was great and the service was great.", "rating": 4, "date": "7/29/2016"}, {"text": "This place isn&amp;#39;t what I remembered it being. Most of my favorite items are gone and items that are still on the menu tastes completely different. Having a waiter like our waiter today didn&amp;#39;t help either. Never once did she check up on us. Or refilled our water.", "rating": 2, "date": "3/5/2019"}, {"text": "So we sat at the bar , had to come too the area for a gift. So we decided to eat here . When we arrived Lindsey was here . She was fantastic attentive sweet and fast!!!! We like coming here the food is usually really great today they&amp;#39;re really off. My neighbor at the bar order chicken sliders from happy hour and said they tasted like the fish batter , my scampi wasn&amp;#39;t as lemony as it usually is . Want a great time today . Lindsey left and Jill is pleasant but too busy for one bartender at happy hour !!!!!!! Gonna give it a break .", "rating": 3, "date": "3/4/2019"}, {"text": "After shopping in the heat all we wanted was some air conditioning and food and beer.  The Cheesecake Factory has such a huge menu even when I have know idea what I am in the mood to eat I can find something here. This location seems to be one of the better ones.  Every single staff member was super friendly and they were working so hard non stop.<br&gt;<br&gt;Our server was great. We started with some beer and we ordered an appetizer of zucchini, mushroom and avocado fries which came with two sauces. They were delicious.  I think I would come back just for these again.  Super fresh, very lightly breaded and the two sauces were excellent.  One was a garlic aioli and the other had a spiciness to it. <br&gt;<br&gt;Then I ordered the cheese steak sandwich and my daughter had the spicy chicken sandwich.  The cheesecake sandwich was bland, no real flavor and the meat was quite tough. I took plenty home for hubby to eat.  My daughters chicken sandwich was very good.<br&gt;<br&gt;The prices are fair, portions are huge, and the food is fairly good. Thumbs up for the staff here, they give great service.<br&gt;<br&gt;I am not a cheesecake fan but walking past the case of all the fresh cheesecakes almost had me ordering one.  I didn&amp;#39;t but they had some very pretty looking cheesecakes.", "rating": 3, "date": "5/9/2014"}, {"text": "Came in to use our gift cards. Ordered today and was pleasantly satisfied  with our orders<br&gt;<br&gt;Avocado,zucchini,mushroom fries. Great  appetizer. Diane steak medium , amaze balls! And teryaki chicken. We left content and sadly with no room for dessert this time.<br&gt;<br&gt;Also the decor and restaurant are lovely.", "rating": 4, "date": "6/26/2016"}, {"text": "Our server was good, a nice young lady but I was disappointed in the fact that we sat down before two table that got served and left before we did. But the food was good we definitely enjoyed that just not the service entirely.", "rating": 2, "date": "8/9/2018"}, {"text": "Oh Cheesecake Factory....I haven&amp;#39;t really been disappointed by you on prior visits, but today was no good. <br&gt;<br&gt;My sister and I decided to visit for lunch (normally I go for dinner). I ordered the factory nachos and my sister ordered the orange chicken. My sisters orange chicken was very good-served with veggies and brown rice. Great flavor. <br&gt;<br&gt;Now, lets talk about the nachos.....when the waiter put the plate in front of me I was hit with a horrible stench of stinky cheese (and I love cheese). The nachos were burnt and the chicken, which costs extra, was sparse. Omg it was bad. I am not the type to turn a plate away but this was so bad I had to call the waiter to please take it away-and FAST! <br&gt;<br&gt;I asked for a turkey bacon avocado club sandwich instead and was much more satisfied. <br&gt;<br&gt;By the way their strawberry lemondade is fantastic!", "rating": 3, "date": "12/22/2016"}, {"text": "Love this place <br&gt;This is what you call a 5 star restaurant. Had a great time during happy hour, service was a little slow but it was packed so it was expected <br&gt;Will be back", "rating": 5, "date": "5/31/2018"}, {"text": "I had the Grilled chicken tostada salad. If was awesome!. It actually has two chicken tostadas under the large bed of greens! . It is delicious and very large. Highly recommend this salad. It has perfect amount of a light and delicious dressing.", "rating": 5, "date": "2/24/2017"}, {"text": "We went their for a celebratory lunch, there were 6 of us.   The service was extremely slow. Not to mention that they missed bring out one of the orders.   The food was fine but they could have been more attentive to water and utensils.", "rating": 2, "date": "3/24/2019"}, {"text": "The waiter charged my card MORE tip than I had initially put. His service was very sloppy. He was supposed to split the bill between my friend (who paid cash) and I, but instead he ended up charging my card for the entire transaction and took my friends cash as his tip. When we told him about it, he looked clueless and corrected the mistake, but he also gave himself an ADDITIONAL tip on my credit card that I did NOT authorize. <br&gt;<br&gt;When I called to complain to the manager, he said they would refund my money and another manager would be contacting me. However, I never received that refund and no one has contacted me since. Very very disappointed.", "rating": 1, "date": "3/16/2017"}, {"text": "Went here friday night and our server was Barry, he provided us with amazing service! What an amazing guy, give him a raise! Food was amazing and delicious. Would definitely recommend", "rating": 5, "date": "3/9/2018"}, {"text": "I like going here because it&amp;#39;s super close to home, the wait isn&amp;#39;t usually very long and the cheesecake of course is to die for. My last time there this past Friday kind of ruined it for me, the service was adequate but the food always seems to fall short. My husband ordered the Louisiana Cajun pasta and I feel like the cooks are drowning the food in oil because when his big bowl of pasta arrived it was like we were eating liquid grease out of the fryer. I ordered a side of Mac &amp;amp; cheese, the quality of the cheese must be extremely trashy because again oily and greasy. Also had the fried avocado, zucchini, mushroom fries, and they had a nice crisp crust thankfully. After such a disappointing meal I had no desire for dessert and won&amp;#39;t be going back to waste anymore money on oil for dinner.", "rating": 1, "date": "3/22/2016"}, {"text": "So, we always have a problem with where to go on Sunday&amp;#39;s as everything is packed. My wife suggested The Cheesecake Factory. I didn&amp;#39;t even know they have breakfast. We arrived just as they were opening, was seated right away, and didn&amp;#39;t have to wait long for Breakfast. The meals were plentiful, hot, and very tasty.", "rating": 5, "date": "1/21/2018"}, {"text": "For some reason,  everything we ordered was horrible.  My Cobb  salad was wilted and brown,  my friend dynamite shrimp was soft and tasted rubbery.  The service was ok.  Overall,  not pleased and I&amp;#39;m hungry.", "rating": 2, "date": "8/31/2016"}, {"text": "I arrived early and asked for a table. They gave me a beeper... when it&amp;#39;s sounded I was late 5 minutes and they told me I have to wait additional time or longer even after I waited close to one hour once the beeper was given to me on the beginning ..... I believe this was unfair especially when I was coming with my grandmother to dine in.....The person on the front desk call her manager which had a terrible customer service and with a very unpleasant attitude.... I would re-educate in customer service the person who manage the front desk of this Cheesecase Factory at the Shops in Pembroke Pines....  very disappointing as I am or were a regular customer here.... with so many options I will take my business elsewhere.", "rating": 2, "date": "2/18/2018"}, {"text": "After hearing rave reviews of The Cheesecake Factory, this New York native finally got to taste and see what everyone has been crazy about. Too bad, I had to go all the way to Florida to make this visit happen. I hate the pages and pages of menu items. As a first-timer, it took way too long for me to browse and decide. I mean, really? If your menu is not between 2-4 pages then we have a problem. Then again, I guess it is a &amp;#34;factory&amp;#34; right, but not just for cheesecake. <br&gt;<br&gt;The bread was yummy. I ordered the island grilled chicken which was delicious. When it comes to grilled meat, you usually run the risk of winding up getting served a piece of meat that is dry. Luckily, the kitchen staff know what they&amp;#39;re doing, because my chicken was still moist and flavorful. As a Caribbean, I wasn&amp;#39;t too happy with the small spoon of brown rice on my plate. However, they do tell you what to expect in the description. We were stuffed. Since we arrived just an hour before closing time, there was no room or time for dessert. The prices were reasonable too.<br&gt;<br&gt;The decor in the restaurant and the bathroom were divine. It&amp;#39;s a great place to dine and host events. Very elegant and classy. I will definitely be back for more.", "rating": 4, "date": "6/19/2012"}, {"text": "My family and I sat down to eat here this evening, after a long time of avoiding the restaurant due to our previous visit. This time around we had a wonderful time. Service was fast, and we had a great dinner. The chicken carbonara was delicious! I highly recommend it.  We all tasted different cheesecakes.  We loved them all, except for the original one which had a top layer of cream cheese. We scrapped the top layer off, and then the rest of it was fine.", "rating": 5, "date": "2/2/2018"}, {"text": "Don&amp;#39;t really come here for the food often but I admit the cheesecake here is phenomenal. The take out line takes forever on weekends so try to come during the week to avoid all the waiting. I like it that they have a &amp;#34;skinny menu&amp;#34; where you can order food that&amp;#39;s easy on calories.", "rating": 4, "date": "4/9/2016"}, {"text": "If your order take out be prepared to wait at least 45mins - 1 hour. I&amp;#39;m not sure if they don&amp;#39;t care about take out at this location or what but it is a very long wait compared to other Cheesecakes around the area.", "rating": 2, "date": "11/18/2016"}, {"text": "Just had dinner here, Abraham was my server. He was great! I work in the service industry and his hospitality and service was exceptional! The food was great! Had a lovely little dinner !", "rating": 5, "date": "4/24/2017"}, {"text": "I love this place. It&amp;#39;s a restaurant you go to when everyone in your group wants something different. The menu is huge and there is a wide variety of foods to choose from! My favorite is the chicken and biscuits.", "rating": 4, "date": "1/21/2018"}, {"text": "Whatever the people at Cheesecake Factory corporate are doing to have this chain of excellent restaurants succeed the way they are, they&amp;#39;ve succeeded again. <br&gt;<br&gt;Yeah, you&amp;#39;re going to pay a pretty penny for some good food. But it&amp;#39;s worth it every time. Given that the menu can and has always been overwhelming with the almost endless selection of dishes, it makes it difficult to choose. But overall, they hit it on the mark with great service, food, drinks, decor and atmosphere.", "rating": 4, "date": "8/27/2015"}, {"text": "I like Cheesecake Factory, the food Is good and you can enjoy a Yumi yumi cheesecake of whatever you want. The place is nice, but not for children I think.", "rating": 5, "date": "3/2/2017"}, {"text": "Can never go wrong here. A wide selection of food.  The desserts are amazing.  Around the holiday the pumpkin pecan is a must", "rating": 5, "date": "2/14/2019"}, {"text": "We went on Fathers Day and it was a 2 hour wait! We did have a place to sit while we waited and there were stores around to shop in so it actually wasn&amp;#39;t to bad. We were seated and our waitress was very tentative. We had a large party and she was able to keep up with the entire tables needs. I hadn&amp;#39;t been to the Cheesecake Factory in so long and the menu has changed I was able to still order one of my favs shrimp scampi even though I didn&amp;#39;t see it in the menu. The food was great and of course the cheesecake was awesome!", "rating": 4, "date": "6/29/2016"}, {"text": "This was a good find I was meeting a friend in Pembroke Commons for lunch. I noticed there was a cheesecake factory that popped up on my yelp. I went for lunch there was a ton of parking available. The service was good, and I like how they have lunch size portions.  Since this area is full of chain restaraunts that are all fairly average I figured I couldn&amp;#39;t go wrong with a classic like cheesecake factory. Although, one thing I noticed there salad dressing over The years has changed it is definitely not as fresh as they used to be. They defiantly are buying they already made.", "rating": 3, "date": "7/1/2015"}, {"text": "Food is always great here and David, our waiter was extra friendly and helpful.  However we waited over an hour for a table and we were with my grandma who is 90 and in a wheelchair.  And still they made us wait, and wait and wait. <br&gt;Parking was hard to find. Next time I will go to another location", "rating": 4, "date": "5/29/2015"}, {"text": "I love this place but the last two times I wasn&amp;#39;t to happy. Three week ago I wasn&amp;#39;t happy with food at pembroke mall and yesterday at sawgrass they took forever for the food. The service is amazing", "rating": 4, "date": "11/15/2017"}, {"text": "So we had a dinner night with the wife and the kids. There was an obvious wait that they said would take about 20 min. It only took about 10 minutes. They took us to our table and we were introduced by sebastian and his new trainee Carlos.  He took our order fairly quickly! My daughter ordered a Shirley temple, that did not taste right so they had replaced it. Carlos came back to check on us all the time and he was wonderful and a great server. He was very professional and he will be a great asset to this business. Great job to him, i see him with great potential! Thanks", "rating": 5, "date": "8/25/2016"}, {"text": "Other than the usually long wait, I love every single thing about The Cheesecake Factory. They have great appetizers, great entrees, delicious cheesecake and good service...and great free bread. <br&gt;<br&gt;Favorite appetizers: Tex Mex Eggrolls, Avocado Eggrolls, Fried Mac &amp;amp; Cheese, Buffalo Blasts, Thai Lettuce Wraps and Sweet Corn Tamale Cakes. <br&gt;<br&gt;Favorite Entrees: Chicken Di Pana, Caramel Chicken, Orange Chicken, Spicy Cashew Chicken and the Monte Cristo Sandwich. <br&gt;<br&gt;Dessert: Any and all cheesecakes. <br&gt;<br&gt;You just can&amp;#39;t go wrong here.", "rating": 4, "date": "7/11/2015"}, {"text": "Our host was wonderful! We sat outside and I had the tomato basil and mozerella cheese pasta, which was yum!", "rating": 5, "date": "1/25/2018"}, {"text": "If you&amp;#39;re trying to come here for a fast business lunch - make sure you tell your server so they can rush the orders... it doesn&amp;#39;t hurt if your party already knows what they want too. This place is in a busy strip mall and it can get packed fast.<br&gt;<br&gt;This Cheesecake Factory isn&amp;#39;t anything different than any other one. Good food, good drinks, good service. Can&amp;#39;t really say anything bad about this place.", "rating": 4, "date": "12/20/2013"}, {"text": "We met friends here Sunday for Brunch <br&gt;Got there at about 10:30. No wAit at all<br&gt;Our server was fantastic!!<br&gt;I ordered Eggs Benedict opted for the spinach and tomato version <br&gt;DELICIOUS!!!<br&gt;Did I mention the best tasting coffee??<br&gt;We will definitely go back and try another tasty treat!!", "rating": 5, "date": "11/15/2017"}, {"text": "Cheesecake anyone ?!?! <br&gt;<br&gt;The food is okay, the typical assorted American/italian/ healthy plates, but those cheesecakes are fire! There&amp;#39;s not one I have tried that has disappointed me. We like to order the spinach dip- it&amp;#39;s one of the best ones I&amp;#39;ve had. If you&amp;#39;re a fan of chicken Marsala stay away from it here, the sauce is to acidi (hope that makes sense). <br&gt;The pork chop plate and seared ahi tuna are both delicious: highly recommend to try it.<br&gt;<br&gt;Normally, I go to the location in Pembroke shops, but it doesn&amp;#39;t matter which one you go to it&amp;#39;s always super busy. The restaurant is big with a wide range of outside seating. One comment would be for the amount of capacity the restaurant sits, the bathrooms should be bigger. <br&gt;<br&gt;To end your dinner on a happy note, try the white chocolate raspberry cheesecake it&amp;#39;s a crime LOL!", "rating": 4, "date": "6/6/2015"}, {"text": "I have been to this restaurant a few times and this last time I was not a fan. We were place out side to dine which was fine. However the sun was blinding anyone facing the sun and when the shade was adjusted, the people not facing the sun backs were burnt by the sun. This is a poor design. The waitress was very nice and tried to accommodate us but there was nothing she could do. They need to resign the shade/awning to keep their patrons from dealing with the sun. The food is ok. I will say the drinks were good.", "rating": 2, "date": "1/30/2016"}, {"text": "Poor service! Took an hour for the food to be served for a small party of 5 and the the quality of the food was definitely NOT worth the price. Even after we complained to the manager, he did nothing to make up for this horrible experience. Shame on this establishment for this lack lust experience!!!", "rating": 1, "date": "12/28/2017"}, {"text": "The Cheesecake Factory can never go wrong. Disregarding the extensive wait on a busy night, Cheesecake&amp;#39;s menu can satisfy any taste buds. In all effort to comply with dietary needs, food choices range anywhere from steaks to burritos. With so many options to chose from you will find yourself coming back to devour the menu.", "rating": 4, "date": "12/26/2017"}, {"text": "Writing this as I&amp;#39;m still dining in! Came in tonight, a Thursday night with my family of 5 around 7:45 and was sat pretty quickly. I&amp;#39;m just blown away by our server Tatiana! She is so attentive and on point with everything. I&amp;#39;m in the restaurant business myself and when I see great service I truly appreciate it. Definitely give Tatiana some praise and a raise! Lol thank you cheesecake of Pembroke gardens.", "rating": 5, "date": "8/4/2016"}, {"text": "I used to love this place for their huge selection of good items and prices . It seems that there was something for every taste . And their desserts oh my , oh my cheesecakes and more cheesecakes . Now I must say there food quality and flavor has declined and not just a little . What a shame ! Their service is also questionable , I usually go to the one in Boca and it seems that if you come during Happy Hour  you won&amp;#39;t see your server again  after your first drink and apps . I might give it another chance but it&amp;#39;s been miss, miss, miss the last three times I have been here . Like I said what a shame I really used to like this place .", "rating": 3, "date": "5/23/2017"}, {"text": "In a flash: GREAT, I love their cheesecakes! Kind of overwhelmed with the diverse menu, but food was still good quality. Service definitely fluctuates from the times I&amp;#39;ve been here. <br&gt;<br&gt;Top favorite cheesecakes: Red Velvet, 30th Anniversary, Kahlua, Oreo, While chocolate raspberry and banana cream pie. <br&gt;No matter which Cheesecake factory I go to, the quality of their cheesecakes has always been consistent.<br&gt;<br&gt;Come here for the cheesecakes and get it to-go.", "rating": 3, "date": "3/23/2015"}, {"text": "Had the chicken and biscuit meal and I loved it. The place is clean and spacious. Will go often.", "rating": 5, "date": "1/16/2017"}, {"text": "This place gets better and better,,, fuller and fuller! Billy Ray was fantastic! Had the Chinese chicken salad that was awesome.. but those skinnylicious lettuce wraps get an A+!!!! That brown oat bread... keep away if you are watching your weight!!! Once you eat a piece. . Its all over!!! You can easily eat a whole loaf!!!", "rating": 5, "date": "8/8/2015"}, {"text": "Awesome experience our server was attentive to us.<br&gt;Food was great but the best part is always the delicious variety of cheesecake", "rating": 5, "date": "6/15/2016"}, {"text": "I love Cheesecake Factory and this one is good for location and convenience. The food is always delish and same decorations as others since its franchise, however, the service here is okay compared to others. Staff has improved with service, efficiency and politeness. It is always packed here weekdays and weekends. A 3-star as it is Cheesecake Factory, nothing fancy or extraordinary.", "rating": 3, "date": "1/2/2016"}, {"text": "Good service and good food. Consistent in all of their locations. We always get tamales, and salmon and salads. The black bread is amazing and dulce de leche cheesecake to die for.", "rating": 4, "date": "10/18/2015"}, {"text": "Visited the Resturant on a busy Friday afternoon, I haven&amp;#39;t been here in a long time and there was absolutely no parking space. Literally all of the spots were taken, so after driving around hunting for a spot I dropped of my gf at the front door. Finally found a spot and the place was slammed. We found seats at the bar and we were debating wether or not to wait for a table and I&amp;#39;m so glad we decided to stay at the bar. We met Marissa she&amp;#39;s the bartender of the night and let me tell ya she was on fire. She attended everyone and every drink order that was being placed. She handled every request swiftly with accuracy. <br&gt;<br&gt;She immediately got our drinks, that amazing bread and put the baseball game that we requested. She was a little energizer bunny, TFC you have a very valuable asset and it was a delight watching her perform. Extremely friendly, we got to know that she&amp;#39;s an eagles fan, recommended the specials for the night and made sure our drinks were topped of. Again all while this place is slammed with people everywhere. <br&gt;<br&gt;Moving on to the app we went with the avocado rolls, much better than the ones from bj&amp;#39;s. Not spicy and they deliver the taste. For the entree I went with the Caesar salad and my gf went with the steak tacos. We asked for extra cheese on the side, a few lemons and balsamic vinaigrette and the girls in the back were also on their game.<br&gt;<br&gt;I will be coming back and recommend this place very highly for their service/quality keep up the good work, and make sure to take care of Marissa even though she&amp;#39;s not a dolphins fan ;)", "rating": 5, "date": "10/11/2015"}, {"text": "Great place to have a meal, but careful with with the white bread you may break a tooth, waitress was so nice ! Jan 5 2015.", "rating": 4, "date": "1/5/2016"}, {"text": "I come in here for lunch EVERY Monday with my co worker and always get the chicken Alfredo and it&amp;#39;s so delicious! Who ever the pasta cook is on Monday is amazing because I&amp;#39;ve been there on a Tuesday and it&amp;#39;s definitely not the same. Can you release the name of this cook?? I&amp;#39;d love to have them be my private chef..the pasta always looks so pretty when it&amp;#39;s served which is a nice touch also. Love this place", "rating": 5, "date": "11/10/2018"}, {"text": "I enjoy dining at this Cheesecake Factory after church for Sunday breakfast. The service is really good and the food is great. My son enjoys the blueberry pancakes. My daughter enjoys the pasta and I&amp;#39;m always switching it up. Everything is always on point and the Manager is really cool!", "rating": 5, "date": "12/21/2014"}, {"text": "Our server Abraham was awesome we told him we had to be out by 430pm and he got us out by 430 pm his recommendations were excellent and the service was great. Even with the rude male hostess everything was amazing.", "rating": 5, "date": "3/25/2017"}, {"text": "Love this Restaurant!They give nice warm multi-grain bread, have great fresh food that has labeled the calories your getting. I love the skinny menu, my fiance loves the Alfredo pasta they serve with added cheese by the server in front of you. The cheesecake factory is great for a romantic night out, birthday, or special occasion. Lovely outdoor tables with accent candles. The bar has a great selection of drinks :) And of course my favorite cheesecake is the red velvet and  some strawberry&amp;#39;s on top. Yummm<br&gt;<br&gt;If you haven&amp;#39;t been here it would be worth your time.", "rating": 5, "date": "1/5/2016"}, {"text": "This restaurant is always busy and you have to wait for 30 minutes to dine, but the food is good and the service is exceptionally.", "rating": 5, "date": "12/12/2015"}, {"text": "One thing I do hate is how I always get too full to even be able to eat any cheesecake! My advice, order dessert first! <br&gt;<br&gt;This is a great place to go out and celebrate, just be prepared to wait on the weekends.", "rating": 4, "date": "7/2/2015"}, {"text": "Besides the scrumptious, oh so delicious cheesecakes,   the food is tasty and the service is awesome.", "rating": 5, "date": "1/21/2015"}, {"text": "The Cheesecake factory is a chain restaurant and a good one.  The menu is gigantic which means there can be really long waits for ordering, especially in big parties.  Good place, good food, good service! also it probably goes without saying, but try the cheesecake.", "rating": 3, "date": "11/23/2016"}, {"text": "We came after church on Sunday and I was elated that they had brunch!! It was good, I had the crab hash. It was just good though. My bf and his mom got the eggs Benedict and they said they would have liked if the eggs were a little runnier bc otherwise the dish was a bit dry. My mom got the Baja Chicken brunch option, and it was good. Their mint tea was so refreshing. Our waiter was super attentive and kept bringing me refills.  I&amp;#39;ve been here two other times and always think it&amp;#39;s good but never understand why they are always so packed. I loved the Oreo cheesecake, a definite must try! Overall everything was good. It&amp;#39;s worth checking out but there&amp;#39;s always a wait so if you&amp;#39;re really hungry, you&amp;#39;re better off hitting up Fuddruckers or something else.", "rating": 4, "date": "6/29/2015"}, {"text": "Service was ok. As usual.. The place is very loud. It&amp;#39;s difficult to have a conversation with the person across from you.<br&gt;<br&gt;Food wasn&amp;#39;t bad but wasn&amp;#39;t great either. My shrimp in the lemon and Garlic skinny pasta were very overlooked. My husband had the Asian salad and the chicken was missing. There were maybe three thin slices of chicken.. Deli chicken.", "rating": 2, "date": "8/10/2015"}, {"text": "Everyone knows the Cheesecake Factory is where it&amp;#39;s at! Amazing!! The cheesecakes, even better!!<br&gt;However, because it&amp;#39;s always so packed, the wait sucks and the service isn&amp;#39;t that great since the waiters aren&amp;#39;t very attentive. If they up the service, it&amp;#39;d be perfect", "rating": 5, "date": "5/15/2015"}, {"text": "After waiting for 2 hours because we had such a big group, once we sat down we were with an amazing waiter Jamie she gave great service!! I definatley do recommend to come!! <br&gt;Even with the 10 other tables she still gave us the best service she can", "rating": 5, "date": "8/11/2017"}, {"text": "This place is delicious everything on the menu is great and everything is served fresh. I go here all the time for lunch and dinner but my favorite is the sunday brunch. Great location accessible to shops nearby you can make a day of it at this location. The staff is exceptional!", "rating": 5, "date": "1/13/2017"}, {"text": "Shitty place almost slipped and fell twice when I walked in! Told the hostess who said &amp;#34;oh sorry I know&amp;#34; what&amp;#39; the hell ?! Then when we were seated at our booth there were flies at the table from the dirty table next to ours. Disgusting! The utensils were on the table and didn&amp;#39;t looked washed. As we were walking out the floor was Slippery (no surprise) told our waitress Jamie who didn&amp;#39;t seem to care that anybody can slip and get hurt. <br&gt;<br&gt;Should&amp;#39;ve gotten up and left and when we got up to leave had to hold on to each other and walk out. I don&amp;#39;t know why we even stayed. I&amp;#39;m pissed and the cheesecake even though it was delicious couldn&amp;#39;t even make up for it. Aventura location does not disappoint from what I can remember.", "rating": 1, "date": "7/27/2014"}, {"text": "Great good, great service.<br&gt;Love the chicken Madeira and Chicken Picatta<br&gt;I want to try the whole dessert menú lol", "rating": 5, "date": "8/2/2017"}, {"text": "The steak tacos were really good, I&amp;#39;m not a fan of Cheesecake Factory but I was surprised I actually enjoyed the food. Prices are ok.", "rating": 4, "date": "4/21/2017"}, {"text": "Great for &amp;#34;HAPPY HOUR&amp;#34; Strawberry Martini / Tuna Tartar and Crab Bites ! Get in early to beat the dinner crowd.", "rating": 5, "date": "7/8/2015"}, {"text": "It&amp;#39;s hit or miss, sometimes it&amp;#39;s great other times it&amp;#39;s okay. I had the sante fe chicken salad it was okay. The waitress was friendly.", "rating": 3, "date": "7/2/2015"}, {"text": "The 2  hostess they have working are horrible for seating arrangements.  We are a party of 3 and we&amp;#39;re passed over several times.  When I asked them they said, &amp;#34;we seat bigger party&amp;#39;s first&amp;#34;.  I told them it&amp;#39;s not fair that we were told 20 minute wait and it took 54 minutes to seat us; only after in requested to speak to the manager.  The food is consistently good and service was average.", "rating": 2, "date": "5/21/2017"}, {"text": "Awesome place, with excellent food, great skinny menu (lighter fare) and cheesecake to die for, but THEY DO NOT TAKE RESERVATIONS!!! They seat you in the order you check in, so if it looks busy, either valet that car or drop someone off to put your name in!", "rating": 5, "date": "5/17/2017"}, {"text": "The date was friday 9/19/2014 the purpose of the visit was to celebrate a friends birthday. I expressed this to my waiter and clearly stated to him that i would like for him to sing to her, who did not sing to her or even wish her a happy birthday.   before I left I told him when we decided to leave I asked hey did you forget my request  he said yes without any apology or remorse.  <br&gt;<br&gt;This is/was my all time favorite restaurant.  Whenever I visit I know what I will eat i ordered the Jamaican black pepper shrimp dish it comes with plantains, they failed to put it in my plate so I asked for it,  the waiter  brought it out 10min later. The beans were cold so he brought new ones those were so salty I was unable to eat. <br&gt;<br&gt;The poor service and quality in food preparation of this establishment is very discouraging and frustrating.", "rating": 1, "date": "9/20/2014"}, {"text": "I used to love Cheesecake Factory but now they are ripping customers off by making their cheesecake slices smaller. I got a small slice of cheesecake for $8+ which is ridiculous.", "rating": 2, "date": "7/1/2017"}, {"text": "Ordered the steak medallions for takeout; what I received was extremely disappointing and unappetizing. Would not recommend.", "rating": 1, "date": "6/22/2017"}, {"text": "Food is delicious and never a disappointment. I recommend the factory burger, Cajun chicken littles, or the steak medallions from the skinny menu. <br&gt;<br&gt;For appetizer you must try the avocado egg rolls or hummus :) <br&gt;<br&gt;I&amp;#39;ve honestly never tried a dessert I didn&amp;#39;t like here! <br&gt;<br&gt;Took off a star because service is always lacking.", "rating": 4, "date": "7/1/2014"}, {"text": "Ive been to many cheese cake factory reasturant locations.  This one has always been tge best in wait staff, freshness of food, and preparation.  The patio can be a bit sunny at the end of the day, and tgeres a tendency for pigeons. <br&gt;I had the Farfalle with chicken and garlic. Its the best pasta dish on the menu!", "rating": 5, "date": "4/30/2014"}, {"text": "I love The Cheesecake Factory and I love this mall. So every time I have the chance to come I really enjoy myself. Good food, nice place.", "rating": 5, "date": "2/10/2017"}, {"text": "Where do I begin? The floor was so greasy it was like walking on a Slip n Slide. Not greasy in one spot - nasty greasy from the waiting area all the way to the table. While the service and appetizers were good, it took forever to get our entrees. One of our drink refills  had to have something in it because the server made a face  just as he was going to set it down on the table, said it looked funny, and took it back to the  kitchen. Two meals were cooked improperly and were taken back to the kitchen, so two of us sat there and watched our companions eat their dinner. Our food came out after everyone else was done eating. The only bright spot here is they offered a few complementary slices of cheesecake to make up for all of the mistakes. The cheesecakes were absolutely divine.", "rating": 2, "date": "4/1/2017"}, {"text": "The last time I was here the guy took our order and never came back till he brought the food which was like 40 minutes or so later . One of the people we went with his water had finished and this guy just disappeared. The service is not the great . This is why I barely come here but my daughter insisted to come . They need their waiters properly trained maybe they should ask lime  because their service is amazing by their staff . I&amp;#39;ve never had any complaints and always wondered how they train their staff because of the great service ...", "rating": 2, "date": "12/11/2016"}, {"text": "Julios, was an excellent server. He recommended new items and was very attentive.  I hope I spelled his name right.  Anyway it took us about 30 minutes to get a seat but once we sat down the servicing to pretty quick for men. My son had the BBQ Burger and I had the four cheese pasta with chicken. The meal was pretty standard despite the prices. You can always expect if you&amp;#39;re going to The Cheesecake Factory that the prices are going to be pretty steep the portions are pretty huge so you get what you pay for however if you want to save on cost split your meal. There&amp;#39;s enough for two people when you order so this should be simple we had the crab bite appetizer now let me tell you this was the first time that I had this appetizer and it was delicious I will definitely order this again. I think in the future if I go to Cheesecake Factory I will just stick with appetizers I would not get a whole meal I never eat the whole thing and I usually always end up caring take out containers. If you never been the cheesecake before please expect to bring your wallet and at least spend $70 for two people if you&amp;#39;re ordering appetizers and a drink you can cut the cost and make it about 60 if you take the drinks out LOL. Cheesecake is a great go-to restaurant however Pembroke Square Gardens where it&amp;#39;s located is overcrowded and hard to find parking but I guess it&amp;#39;s all apart of the package.", "rating": 4, "date": "12/20/2017"}, {"text": "Always a good spot for a small plate menu item or try one of their entrees. You won&amp;#39;t be disappointed. Just make sure to keep some room for the delicious cheesecake. My favorite is the dulce de leche with extra whipped cream and brickell ( not sure how it&amp;#39;s spelt) enjoy!", "rating": 4, "date": "11/18/2016"}, {"text": "In reviewing the Cheesecake Factory, what can I say that hasn&amp;#39;t been said by anyone else in the world? <br&gt;<br&gt;I almost got it.... nope can&amp;#39;t do it! <br&gt;<br&gt;This chain restaurant delivers good food. There isn&amp;#39;t anyone that can argue with that. The menu is massive and they give their customers the opportunity to choose what they would like to indulge in.  Like one of my fellow yelper stated in her review, other than there phenomenal cheesecakes the food isn&amp;#39;t enough to make you come back. But I find it so interesting that everyone comes to celebrate something here. It has to be the dessert menu!", "rating": 3, "date": "8/23/2014"}, {"text": "The most disgusting greasy floor! As you get seated you will noticed trying to balance yourself from not falling due to the grease floor your walking on. What a hazard and liability this place bringing my family and kids! Is your kitchen in the dining room? Management should be fired for even allowing this. I can only imagine how your kitchen is. You guys want 15% tip? I&amp;#39;ll give u a tip &amp;#34; Clean your disgusting greasy floors&amp;#34;!", "rating": 1, "date": "5/11/2016"}, {"text": "Love coming here, the food is always good. Great service. Nice place and really nice ambiance. The only thing is the wait is pretty long but once the food comes, its definitely worth the wait. Everything on the menu is amazing.<br&gt;<br&gt;My favorite thing to order are the chicken pot stickers", "rating": 5, "date": "4/14/2014"}, {"text": "The service isn&amp;#39;t best. The quality of food is definitely not as good as the aventura location.It could&amp;#39;ve been better,disappointed.", "rating": 2, "date": "2/24/2018"}, {"text": "I went to The Cheesecake Factory with my fiancé and was there for 2 hours while all it took us to eat our food was less then 20 min. They took forever to give us our appetizer I understand it is the kitchen that taking long but they could have told us 20 min into it that it was gonna take a while. They then brought the main course to us fast because it was already done waiting for us. Once we were done eating it took 30 min for us to see our waiter. I was not even in a bad mood this was just bad service. The manager even came to talk to us about the food taking long and they did not even give a type of discount. I will not be coming back and I will worn everyone I know of this bad service.", "rating": 1, "date": "1/7/2017"}, {"text": "Do you know typical commercial stuff you get what you pay for massive amounts of cheesecake selections for the better of the commercial food chance I guess", "rating": 4, "date": "1/2/2017"}, {"text": "I love their menu, the cheesecakes are amazing (pumpkin pecan is awesome)  I usually go for pasta dishes, absolutely love the chicken romano pasta.  The bread is really good, my favorite is the brown.  The only drawback with this place is that it usually has a long wait time and they don&amp;#39;t accept reservations.  However, at this particular location I always end up visiting the near by stores while I wait and this makes time fly by.  Overall have had a good experience at this location.", "rating": 4, "date": "11/5/2014"}, {"text": "I do not recommend the Cheesecake Factory in Pembroke Pines.  The food is terrible. Years ago I visited this location for the first time for a birthday event.  I ordered a dish that I typically order at the Aventura location.  When the food came, it was disgusting.  I swore off this location.  Recently, however, I was in the area and had a craving for Evenlyn&amp;#39;s Favorite Pasta (which I have had before at Aventura and loved it).  I decided to get it at the PP location out of sheer convenience and because I figured that enough years had passed that perhaps the quality of the food had improved.  I was wrong.  By comparison to the Aventura location, it was again terrible.  I will never buy food at this location again.", "rating": 1, "date": "8/28/2017"}, {"text": "I love the Cheesecake Factory... It&amp;#39;s pretty consistent every where you go. Went here for a graduation dinner with a party of 10. It took about 2 hours to be seated so we walked around the mall. If you know you&amp;#39;re going to have a large party, be sure to come two hours in advance to get your name on the list.<br&gt;<br&gt;The kids menu is pretty large but only has one healthy option.<br&gt;<br&gt;If you are trying to watch your weight or eat healthier, the Skinny Menu is amazing.", "rating": 4, "date": "6/17/2012"}, {"text": "Had our anniversary brunch and it great . It was called the brunch combo served by Juan. He was very professional &amp;amp; attentive. highly recommend the pancakes. The space is. If ever you are in Penbrook Pines I strongly recommend you check them out", "rating": 4, "date": "6/1/2014"}, {"text": "Steak Coulette with Sweet Potato fries... Great seasoning and good size portion for a healthy meal. Good customer in a great location were parking can be challenge but at least you don&amp;#39;t have to pay for it.", "rating": 5, "date": "7/25/2014"}, {"text": "Arrive at the factory with a group of 3. It was very busy but it didn&amp;#39;t take long for our group to be seated.  Our waitress was great got our drinks immediately and took our order. I ordered the shrimp scampi, my teen daughter ordered the shrimp and sausage pasta. My friend had the soup of the day which was a chicken tortilla. My friend didn&amp;#39;t like the soup she said it was to salty when it arrived. My teen liked her pasta with the sausage and shrimp. My daughter and friend ordered a lemonade my daughter had the strawberry and my friend had a cucumber lemonade. They bother said it was extra sweet and had to get a cup of water to dilute it.  I like the service but didn&amp;#39;t like the food. My pasta on the shrimp scampi was dry. There was not enough sauce on the the plate to coat the pasta.  I was eating dry pasta and choking on it. I didn&amp;#39;t even eat 25% of the pasta because it was dry and choking to swallow. I didn&amp;#39;t like my meal. That why I gave this place a 3 star. The service was great.", "rating": 3, "date": "12/27/2017"}, {"text": "By far my favorite location,While Aventura is closer I&amp;#39;ll take the drive for better service. My waiter Monday Night was Issac he was great! Very attentive.  Food was  fresh &amp;amp; delicious.", "rating": 5, "date": "9/30/2016"}, {"text": "Place always busy, Great food light on the wallet 4 ppl with drinks 140$ bucks. I love the Classic burger and a mojito to go with it. <br&gt;You Won&amp;#39;t be disappointed..", "rating": 4, "date": "4/13/2014"}, {"text": "Loved the service and the food. My server was very attentive and even brought us hot towels.", "rating": 5, "date": "3/18/2017"}, {"text": "Cheesecake Factory food is always good.  I don&amp;#39;t like this restaurant at all because they always keep it too cold.  There is no reason the patrons have to be so cold that it is completely impossible to eat inside.  The temperature last night inside the restaurant was unbearable. I don&amp;#39;t understand management that allows that to happen.  Clueless", "rating": 3, "date": "1/1/2017"}, {"text": "I&amp;#39;m only giving this 3 stars because my food was amazing but I wish I could say the same about my server .. He made me feel rushed and gave horrible service. Not to mention when my pasta came he never asked if I wanted cheese on top", "rating": 3, "date": "10/9/2015"}, {"text": "Melanie and Nicole were awesome! All smiles and great customer service! I really enjoy this location and will definitely return.", "rating": 5, "date": "3/4/2016"}, {"text": "Food was pretty good but the short blonde bartender needs to check her attitude at the door.  2nd bad experience with her -- Not friendly at all !           Won&amp;#39;t be back anytime soon!", "rating": 2, "date": "3/6/2018"}, {"text": "Love this place, been coming for years. Could have sworn I did a review before but whatever. Anyway, this place is ALWAYS busy so be prepared to wait. The food is always on point ! And the cheesecakes are to die for ! I always get the tiramisu every time, can&amp;#39;t go wrong. I&amp;#39;m in love with their fresh guac &amp;amp; chips, also their Cesar salad is amazing as well.", "rating": 5, "date": "4/2/2016"}, {"text": "Pretty tasty food and great staff! Loveee the Mac and cheese balls delish! The wait wasn&amp;#39;t that bad either for a Sunday afternoon 20 minutes for two people.", "rating": 4, "date": "10/23/2016"}, {"text": "If you are willing to wait - and I mean wait - then this place is perfect. Great food, in the middle of a great shopping strip, and very friendly service. But, you will be here for hours.", "rating": 4, "date": "3/13/2016"}, {"text": "This cheesecake factory is always busy! The food is consistent but the service is not. Went in for takeout today and observed a manager texting on his phone for five minutes while the takeout area was overwhelmed with customers waiting.  I should&amp;#39;ve taken it as a bad sign when I called and was put on hold for five minutes just to place my order.<br&gt;<br&gt;Most corporate restaurants like the cheesecake factory usually have extremely high standards regarding customer service, it is unfortunate that this cheesecake factory seems to be lacking in that area.<br&gt;<br&gt;One other problem we have experienced at this particular location which is disgusting, is that the people who were serving the cheesecakes were not wearing gloves and were pretty much sticking their fingers into our desserts. My husband was picking up takeout watching this occurrence and he asked them if they could put on some gloves and pack up some new desserts for us, which they did without hesitation. But I don&amp;#39;t think a customer should have to ask for people to be sanitary when someone is handling their food.", "rating": 1, "date": "8/9/2016"}, {"text": "I&amp;#39;ve been compelled lately to give a few restaurants a second chance that have had a most unfavorable review in the past.  After my experience today...the first thought that came to my mind was &amp;#34;YES!  Now THAT&amp;#39;S the Cheesecake Factory that I remember!&amp;#34;  Wow!  What a difference!  My review is based on an experience on a Monday around 11:30 A.M.  My waiter was great!  He made sure that we not only had a good experience, but he also gave good suggestions.  It was a VERY HOT day and I wanted something frozen, lite, and sweet.  He recommended that I try the Mango Smoothie. I had no idea that Cheesecake Factory made smoothies.  The smoothie was perfection in a glass.  I could not stop talking about that smoothie.  It was everything that I wanted and so much more.  I had the avocado egg rolls for an appetizer.  They were fresh, well prepared, and creamy. Loved them!  I ordered the chicken piccata as my main meal.  It was really good.  I&amp;#39;m not sure if this location is under new management or if they have a new cook...but it was SO MUCH better this time around.", "rating": 4, "date": "7/20/2015"}, {"text": "What can I say, this place rocks.  Thy serve from salads, to pizzas and filet mignon.  Great for big parties with a variety of items in their menu", "rating": 5, "date": "8/21/2015"}, {"text": "Love cheesecake fac, can&amp;#39;t go wrong if your undecided, it&amp;#39;s the go to place.  Even on vacation somewhere, don&amp;#39;t know where to dine,  eat the cheese! Love the bread, love the apps, really good fish and chips actually.", "rating": 4, "date": "10/4/2015"}, {"text": "The avocado rolls are usually sure to please. They were sour tasting and not quite what I remember. The flatware was dirty with spots and fingerprints the 2 paper napkins I received had something gooey on them. On the upside I won&amp;#39;t get fat being tempted to eat here again.", "rating": 2, "date": "2/2/2016"}, {"text": "This place is one of my favorite restaurants to eat at. They have a very large menu and each item I get is very satisfying. I recently went there on the first day of school as I usually go somewhere every first day of school. My daughter Kayla loves their spaghetti and meatballs!!! My wife enjoys different appetizers which usually gets her very full. I always start out with a green mint tea which is soothing. I choose from the Fish and Chips, Cheeseburger, or one of my favorites Chicken Picatta.  I always try to save room for one of my favorite cheesecakes the vanilla bean!!!!!! That&amp;#39;s one good cheesecake especially with a cup of coffee. My family and I enjoyed the meal,and will mist definitely be back. I remember when they first opened up in Pembroke Pines back in 2011.  The food continues to be great and the service continues to be top notched. I look forward to coming back to Cheesecake Factory to try another delicious item.", "rating": 4, "date": "8/29/2015"}, {"text": "Disappointing meal. My wife ordered a burger very well done and it came out pink and cold. My daughter ordered tacos and they came out cold as well. Used to love coming here but not anymore.", "rating": 2, "date": "2/5/2016"}, {"text": "Got to restaurant at 1250. Told us wait was 20. Waiting 45. Sat down, 20 minutes to get water and bread. Gave us a bogus story about the decaf coffee. Ordered two waffles to make it easier. 40 minutes later nothing. Walked out. Get your customer service better people. Extremely upset pregnant women. Never coming back! Always the same thing with this place. Ridiculous. Either hire more staff or stop trying to over pack your restaurant. Clientele is far more important than the green. Greedy!", "rating": 1, "date": "3/27/2016"}, {"text": "Consistent, good food, perfect portions, and a friendly waitress that gave us all the time we needed to catch up while trying to choose from the menu that is actually a spiral bound book of delicious meals to choose from.  Bread basket of sour dough and sweet wheat.  I had the full portion Carlton salad it was fresh, tasty, and exactly what I was in the mood for during our lunchtime visit. My friend had the creamy Chipotle pasta with vegetables.  We saved room for dessert, and wow, the tiramisu and white chocolate raspberry cheesecake slices were dreamy.  Try the passion fruit iced tea, it&amp;#39;s refreshing.", "rating": 4, "date": "7/12/2013"}, {"text": "Came here tonight before s movie , we come here at least once a month. But tonight the service was a bit off. We had the same waiter as last time we were here figure to give him a second chance. He&amp;#39;s not very attentive and he always seems very rushed when it not even that busy. I ordered my usual garlic noodles with chicken. Tonight it came out with bite size pieces of chicken rather then the usual chicken on the bone. So I sent it back, waited about ten minutes later for it to be made, brought it to me with no apology, no discount nor checked on me after that. An apology would have been nice but he totally disregarded the situation. Other then that the food is always good here so we come back, just next time I hope I don&amp;#39;t get him again. Everybody knows the food is good here and prices are a it pricey but the food is so worth it. The chicken potstickers are also amazing.", "rating": 2, "date": "10/21/2015"}, {"text": "Went and had dinner here... I have eaten at other Cheesecake factories before and have never received the sub-quality food that was provided at this restaurant.<br&gt;<br&gt;I ordered the teriyaki chicken &amp;amp; the rice was cold &amp;amp; hard... Literally... I could not cut through the white rice with my knife.... After complaining to the waiter, she brought me some &amp;#34;fresh&amp;#34; white rice... However, sadly to say it must have come from the exact same batch.  I was extremely disappointed &amp;amp; will not be visiting there again... At least not for anything other than the desserts which were good.", "rating": 1, "date": "3/11/2015"}, {"text": "Ordered the Four Cheese Pasta with chicken. It came out with 2 chunks of chicken and had the waitress take it back. The next plate arrived and it looked delicious and actually had an abundance of food. When I took the first bite, it had a freezer burn taste. The manager came to the table and I explained the problem. He defended his restaurant by saying nothing is ever frozen; completely missing the point of the food having an odd taste. Another person in my party had the same dish and it tasted completely different from mine. The manager continued to explain how nothing is ever frozen, again missing the point. Horrible experience.", "rating": 2, "date": "4/11/2017"}, {"text": "Our server was great!!! But the floor was rather slippery and hard to walk and the entrees came out too soon while we were still having the appetizers. The food as usual delicious, but we have to work on the timing and the floor is an accident waiting to happen", "rating": 3, "date": "3/17/2016"}, {"text": "What can I say this place is still pretty damn good despite being a big chain. ask for daniel W waiter his great. try the shrimp scampi/ steak diane AMAZING best dish on the menu", "rating": 5, "date": "4/12/2013"}, {"text": "Food is hit or miss. Overdone or too salty. Wait is hours long. Two bathroom stalls for a huge restaurant is ridiculous. There are plenty of other places that are better.", "rating": 1, "date": "8/10/2017"}, {"text": "You can never go wrong with the Cheesecake Factory! Talk about not knowing what to chose, a million and 1 things on the menu it feels like. Any cheesecake factory is always crazy packed but always for a reason, this place is good stuff. Service is always quick and everyone is nice, especially my Server Michael! What a sweet guy! I love lemon drop Martinis and they always make a yummy one, happy hour is good stuff too! What I love the most is the Skinny menu, they actually have a whole menu dedicated to low calorie low fat meals, that is my all time favorite thins about the cheesecake factory! Overall this place is great food is good service is good and location is great! Shop for a bit and eat eat eat! <br&gt;<br&gt;P.S <br&gt;My favorite thing on the appetizers is corn fritters TO DIE FOR!", "rating": 5, "date": "1/11/2013"}, {"text": "Cheesecake Factory never disappoints! Their menu can be overwhelming but there is something for everyone! Light plates are my Fav ESP the lettuce wraps (a healthy option). Kids corn dogs are a hit for the little ones and plenty other options for them. <br&gt;<br&gt;Expect to wait at any time of day it is always busy but they have call ahead!<br&gt;<br&gt;Consistency is the name with this chain restaurant. The food, atmosphere, drinks and of course desserts are a delight. If you haven&amp;#39;t been here at least once do yourself a favor and stop in for a drink and bite you won&amp;#39;t be disappointed (remember this place is busy almost all the time so plan accordingly).", "rating": 5, "date": "10/9/2013"}, {"text": "We got there at about 9pm so it was pretty dark as you can imagine. We chose to sit outside because that was the shortest wait but I really regret it now. The lights they had outside were tiny so they didn&amp;#39;t do much to illuminate  but that wouldn&amp;#39;t have been so bad if they actually worked. I looked all around and half of the lights weren&amp;#39;t working at all. We had to use our phones to look at the menu. We told our waiter and he said he couldn&amp;#39;t do anything about it. Okay but can you move us to a table with working lights? Or inside? I didn&amp;#39;t make a fuss about it because I was with my family but I can&amp;#39;t believe management at this location would be so careless. Oh and it was raining hard. They did lower these curtains to keep the rain out but our feet still got wet even when it was all the way down. I also felt like the staff took longer to serve us maybe because they forgot about us? Don&amp;#39;t eat outside guys.", "rating": 2, "date": "8/1/2017"}, {"text": "I really like CF but this one is always so packed. The one thing I really like is that the service is always good, which I really appreciate. Overall I would say that its a good food option and always get good food.", "rating": 3, "date": "1/27/2016"}, {"text": "I&amp;#39;ll start by saying I love the Cheesecake Factory. The food is delicious and portions are very generous. However this location is very busy and its its own worst enemy. Wanted to have dinner on a Tuesday evening, we called earlier in the day and were told that they don&amp;#39;t take reservations. Ok, Tuesday night, not Friday or Saturday, maybe it doesn&amp;#39;t get that busy. We got there around 7pm and were told we&amp;#39;d have a 2 hour wait time! No thank you. It&amp;#39;s not that good. We ended up getting a slice of cheesecake to go (which still took 10 minutes) and went to another restaurant in the same complex. A restaurant this busy needs to take reservations", "rating": 2, "date": "7/18/2016"}, {"text": "I love coming to Cheesecake Factory - it just never gets old for me.  My favorite entree to order here is the Pasta da Vinci. The portion sizes are very big so you can share and still get pretty full. Last time I ordered the Sheila&amp;#39;s salad lunch portion and it was delicious. This is a great place for lunch or dinner.", "rating": 4, "date": "5/20/2015"}, {"text": "If I could give it zero stars I would. Tonight at this location I ordered the lemon-herb roasted chicken which I have ordered dozens of times before. They gave me chicken breasts covered in a sauce. This is not what the dish should be at all. It should be half a chicken roasted. I called the waiter over and his response was &amp;#34;I have no clue what that is&amp;#34;. That is not exactly something you want to hear from your waiter at all. The manager came over and apologized and offered to make me something else. So I ordered the chicken piccata which my sister also had. It was pasta and chicken drench in this oily mystery sauce instead of its normal lemon sauce. They also did not offer to take my plate off the bill after the entire issue. After returning home, my sister ended up getting sick because of the food. This is possibly the worst experience I have had at a Cheesecake Factory and I will not be returning.", "rating": 1, "date": "11/25/2017"}, {"text": "I always enjoy their pasta and appetizers. My favorite is Red Velvet Cheesecake. Great service.", "rating": 4, "date": "5/1/2013"}, {"text": "Love the cheesecake selection! ....and that&amp;#39;s about it.  If it wasn&amp;#39;t for the cheesecakes, this would just be another rundown restaurant. The food selection is diverse, but most of the food lacks flavor. The prices are pretty high and the portions are just alright.  I like coming here, as the ambience is gorgeous and the servers are pretty nice. Other than that, it&amp;#39;s just ok.", "rating": 4, "date": "8/6/2013"}, {"text": "Bad service and experience. At this location parking is bad, the wait for a table was over an hour. After we were seated waiter shows up after 20 to 30 minutes. We placed our order, the appetizers were wrong and the main meal was wrong and cold. Plates were returned twice for both couples. Waiter would disappear 30 minutes or more. Food took for ever to reach our table. We arrived at 3:30 PM and we finally got our check at 6:20 PM. WILL NEVER GO TO THIS FACTORY. I give this location a ONE because there&amp;#39;s no ZERO.", "rating": 1, "date": "5/3/2015"}, {"text": "Very disappointing experience at the Cheese Cake Factory last month. We saw a live roach roaming on top of our table and on the wall next to our booth. The manager acted like nothing happened. Won&amp;#39;t come back.", "rating": 1, "date": "2/25/2016"}, {"text": "I do Love this place and whats up with these people REALLY? I been in a few states I have did try on and its a HUGE line in the North Bay of SF CA or Marin CA or East Bay CA!", "rating": 5, "date": "8/27/2016"}, {"text": "Tremendous. Outstanding. Delectable. Chicken Marsala...thai lettuce wraps...and Smores cheesecake...maybe some strawberry lemonade too. Never disappoints. Go early because it gets packed but for GOOD reason.", "rating": 5, "date": "5/26/2016"}, {"text": "Very bad service, how they can said they do not have bread to serve, and food took more than 30 minutes to come. We just decide to leave and eat in other place. Very disappointed!", "rating": 1, "date": "2/8/2015"}, {"text": "I have a special love for Cheesecake Factory!  <br&gt;<br&gt;Good food, great atmosphere for a girl&amp;#39;s lunch, birthday celebration, a date night...just about anything Cheesecake fits the bill!", "rating": 5, "date": "7/4/2013"}, {"text": "The food was delicious! The service was terrible. We sat outside (it&amp;#39;s so nice out). Our waitress was HORRIBLE. Her &amp;#34;friend&amp;#34; also sat outside l and most of the waitress&amp;#39;s attention was on the friend.  She never introduced herself, messed up the food order, and drop the check on the table as if she wanted to be fired. Her and her friend talked it up as if they were on the beach. The server ate from her friends plate and held chunks of food in her mouth. Professionalism is no longer required to work at Cheesecake Factory at The Shops. Go for the food.", "rating": 1, "date": "5/1/2016"}, {"text": "Went in for a late lunch date for my girlfriends birthday around 4:30pm on Wednesday so the place was fairly empty compared to the usual busy crowd on a Friday night or even the weekends. We were sat down quickly and attended to on a regular basis which was nice, since the service can usually take much longer depending on the time of the day. We ordered the fried mac and cheese balls as an appetizer and got them cheap since it was happy hour. They were delicioussssss, it brings 4 balls so we split two a piece, nice crunchy outside layer with the gooy goodness of the mac and cheese (P.S make sure to have them with the marinara sauce on the plate). For our late lunch she ordered the four cheese pasta w/o chicken (optional) and I ordered the fettuccini alfredo w/o chicken (optional as well). Let me say the food was delicious! A nice creamy and silky fettuccini pasta with the perfect mix of alfredo sauce, scrumptious. The serving size could seem a bit small to a person with a huge appetite but it filled me up. Now for the four cheese pasta, it&amp;#39;s served with a ball of ricotta cheese so it is recommended to stir it up in its entirety as the plate of pasta is steaming hot. The four cheeses were definitely present in the pasta and the flavouring was perfect.", "rating": 5, "date": "6/16/2017"}, {"text": "Great service! Great food! I am alwayas amazed at how you can eat at different cheesecake factory restaurants and if you order the same plate, they will be almost identically. This one is very spacious, it gets crowded, but only on weekend nights, abd it has tables inside and outside. The shopping center is very nice also. <br&gt;<br&gt;I always try a new plate, this time I tried the skinnylicious three soft chicken tacos, if you&amp;#39;re not too hungry is an excellent choice, they are great and are a healthy option. <br&gt;<br&gt;As always the food is excellent, the portions are huge, the prices are great, and the service is fast and friendly. <br&gt;<br&gt;Recommended!", "rating": 4, "date": "10/17/2013"}, {"text": "The cooks at this location are noticeably bad compared to the other cheesecake factories. However I do want to say that the service is outstanding. If they found a way to get their chefs to be as talented as their waiters, this place would be a 10/10 no doubt.", "rating": 3, "date": "4/10/2016"}, {"text": "If you want to wait a lot and be treated poorly. Come to this restaurant. I&amp;#39;ve been in other Cheescake Factory and all are good, but this is horrible service.", "rating": 1, "date": "9/7/2015"}, {"text": "The wait for pretty long but it was the day before valentine&amp;#39;s day. They it said over an hour but it was less :) we sat at the bar and had a drank while we waited and it was nice.<br&gt;I got the steak and salmon combo, it was a good enough portion to have leftovers, too.<br&gt;MELVIN was our waiter and he was really nice and made sure we had everything we needed. <br&gt;It was a good experience.<br&gt;I love cheesecake factory!!!", "rating": 5, "date": "2/14/2016"}, {"text": "Great portions of food and everything is made fresh. I highly recommend the Thai Lettuce Wraps!!!", "rating": 5, "date": "6/23/2015"}, {"text": "Thai lettuce wraps are to die for!!! Oh, and the stuffed chicken tortillas as well!! The plates are huge, so I always share", "rating": 5, "date": "6/23/2015"}, {"text": "Excellent service and wait staff.  Had  the seared tuna tataki salad and glass of chardonnay.  Of course, had to splurge with a yummy mango key lime cheesecake.", "rating": 4, "date": "9/26/2012"}, {"text": "I love the decor and atmosphere but it is very busy and noisy. The menus are super decent. I love the miso salmon. I crave it couple times a year. And the passion fruit tea is a 5 star tea! I come here for the tea and couple of entrees that bring my cravings back here again and again. Waiters and waitresses are friendly!", "rating": 4, "date": "6/2/2017"}, {"text": "I came with a party of 10 for a surprise dinner for my friend. We got here at 4:10 and said it would be at 5 and were told they don&amp;#39;t take reservations, but it would be 45-50 minutes so it would perfect. They called at 4:40 and we were walking in from the parking lot. By the time we got inside they gave our table away and were told we had to wait another hour to an hour and a half even though we said we were walking in. The manager, kelly, was extremely rude. She would not accommodate us. One of the hostess, Christine, was super nice and tried her best to accommodate us. If it wasn&amp;#39;t for her we would have left. As for Kelly, she was unprofessional and ride and should not be manager.", "rating": 1, "date": "8/3/2014"}, {"text": "Extremely disappointed. We came here on half price cheesecake night because we love their cheesecake. We were (surprisingly) seated right away but soon realized that it was because, contrary to their &amp;#34;half price cheesecake&amp;#34; rules, you really didn&amp;#39;t need to dine in to get the deal. There was a long line of people at the cheesecake counter throughout the duration of our meal.  When it came time for us to order our cheesecake from our waitress (who was very nice), they apparently sent her to the back of the line of about 40 or so people waiting to get it. After about 15 minutes she came back and apologized for the delay, citing how busy they were. Then, when the cheesecake finally arrived, it was about half the size of the cheesecake we are usually served in this restaurant. Now I understand half price cheesecake day. I guess you get what you pay for.", "rating": 2, "date": "7/31/2014"}, {"text": "We enjoyed our food and the atmosphere. I would not recommend this place to families with small children as both my best friend and I have little girls. There was nowhere for us to change their diapers in the bathroom. They should think about whether they&amp;#39;re going to be a family oriented restaurant or not and should make it clear that they don&amp;#39;t have changing stations in the bathroom before you sit down!", "rating": 3, "date": "5/2/2015"}, {"text": "Sat down the waiter asked us what we wanted to drink and never brought the bread also I ordered chicken Alfredo and got shrimp Alfredo twice and gave us mean look", "rating": 3, "date": "4/19/2015"}, {"text": "I ate here for my father&amp;#39;s birthday and the food was fantastic and the service was even better. They had my favorite cheesecake and the price was very reasonable. I am going back for my birthday that&amp;#39;s for sure.", "rating": 5, "date": "12/25/2015"}, {"text": "It&amp;#39;s The Cheesecake Factory...you should know what to expect.  I got the Fresh Vegetable Salad with Chicken, and it was exactly what a expected.  It had a good mix of atypical salad vegetables with pomegranate salad dressing.  The service was good, and I have no complaints about this place.  I would definitely get this salad again.  The serving size was perfect and it&amp;#39;s only $13 dollars with the chicken.  It&amp;#39;s a good lunch time meal before or after a day of shopping.", "rating": 4, "date": "4/30/2014"}, {"text": "Love the shrimp and chicken gumbo! Must try the newest cheesecake flavor, Lemon Meringue! My new favorite!", "rating": 5, "date": "3/23/2015"}, {"text": "This place has always been good when I&amp;#39;ve gone but it does get busy! The wait usually isn&amp;#39;t too long for lunch on the weekends but I recommend making reservations no matter what time u go if you don&amp;#39;t like to wait.", "rating": 5, "date": "2/21/2017"}, {"text": "This was our first visit to a Cheesecake Factory. We are big fans of &amp;#34;The Big Bang Theory&amp;#34; tv show so were excited to finally make it here. It was a Friday night so, as expected, it was loud and crowded. Our wait was only 20 minutes which wasn&amp;#39;t too bad. The menu has a lot of items. I must say that the service was quite slow. Our server was very friendly but everything, including our water, took a very long time to reach us and we only got one type of bread because apparently they hadn&amp;#39;t baked any more. Of course every item we asked about, we were told was terrific.  Everyone in my group was less than excited about our dishes. The taste was plain and not well seasoned and for what we ordered was very overpriced in my opinion. I&amp;#39;ve had better in local diners. The only saving grace for this place is because all the desserts we ordered were fantastic. I ordered a Strawberry Shortcake which was huge and very good. I guess they should have just stuck to desserts. I will probably not return as it was a disappointment.", "rating": 2, "date": "5/3/2016"}, {"text": "I pride myself in saying that I try to stay away from big-box restaurants .. and instead challenge myself to find places that are a bit more unique or that I haven&amp;#39;t tried yet. But there&amp;#39;s something about The Cheesecake Factory that&amp;#39;s comforting...in a stuff-your-face-with-4,000 calories-kind-of-way.<br&gt;<br&gt;It&amp;#39;s really hard to find a place to grab a late (post-10pm) dinner in the Miramar/Pembroke Pines area.  The first time I tried that... the restaurant we ended up at had run out of most of the food, and served us cold dishes.  So it was back to square one.  We ended up at Cheesecake because out of 3 restaurants we checked in the Pembroke Gardens shopping area... it had the shortest wait.  Sorry, but it&amp;#39;s the truth.<br&gt;<br&gt;So glad it worked out that way.  Our big group could have a conversation (as opposed to the loud-as-a-nightclub RA sushi), and we didn&amp;#39;t have to wait over an hour (like at The Pub).  We had a great server... who kept really good tabs on all of our drink orders (and 2nd rounds).   We gorged on the fried mac-and-cheese balls (!!!!), avocado eggrolls and all sorts of main dishes.<br&gt;<br&gt;I will end it by saying that no matter what time of day it is, or what diet I&amp;#39;m on... I will always order a Peach Bellini with my meal at Cheesecake.  <br&gt;<br&gt;Trust me on this one.", "rating": 4, "date": "1/6/2012"}, {"text": "A standard Cheesecake factory. You can never go wrong with the food. I tried the chipotle pasta for the very first time and loved it, the waiter made a great recommendation. One of my friends at the table had to wait a long time for her food but the manager came out to apologize and comp&amp;#39;ed the item. That right there is a great example of service recovery. Other locations should take note of that. We would never complain for an issue like this but she went above and beyond to do something she didn&amp;#39;t have to. We came at 10 PM on a Sunday night, one hour before closing. At no point did we feel rushed and our server was excellent.", "rating": 5, "date": "4/26/2015"}, {"text": "The shops at Pembroke Gardens. Great food! We were there for my mom n dads anniversary and ours. It was quite late so we simply went for some quick appetizers-we had vietnamese shrimp and avocado  rolls. Great!  Also had original cheese cake,  carrot cake cheesescake n capuchinos. We have been there many times. Great service n great staff! Jessie was very friendly n took some pics for us. Great job!  Thank u.  Keep it up!  Maggie.", "rating": 4, "date": "7/21/2015"}, {"text": "My husband and I have been here a bunch of times. We&amp;#39;ve had good and not so good experiences but I&amp;#39;m basing this review off of our last visit. We went a few days ago (Sunday night), and it was pretty busy. We had to wait but it was less than 20 mins so not terrible. We had our son with us (toddler) so sometimes we avoid places with long wait times but we had a gift card we wanted to use. We sat down and our waitress was super attentive, unfortunately I can&amp;#39;t recall her name. We ordered pasta and fries for my son and it literally came out in less than 5 mins, I was shocked. My husband and I were like are you sure? Lol. Our food followed less than ten minutes later. Every thing was delicious and perfect. We had plenty of bread and refills as well. I just really appreciate a place that gets the children&amp;#39;s food out quickly, because a hungry toddler is a cranky toddler and it can make the whole dining experience frustrating. I hope our next experience is just as pleasant!", "rating": 5, "date": "1/24/2018"}, {"text": "I went today to pick up a Ligurian Pesto Pasta.. When I got to work i was disappointed for what I saw. I paid $15 for this?? Really???  Pasta was hard, and I ordered some chicken for $3 extra and I counted 5 pieces.. Ordering the food over the phone they hanged up 3 times.. I&amp;#39;ve been here before and service us great but today i feel sad because this is want of my favorite restaurants..", "rating": 1, "date": "7/4/2015"}, {"text": "I am not a cheesecake factory fan. However, in my side of the world there isn&amp;#39;t much to eat.  Being that it is a new place the hubby and I decided to give it a try.<br&gt;<br&gt;The first time I went, we got there as they were opening so we didn&amp;#39;t have to wait long.  I was impressed to know that they know have a 500 calories or less menu AND the food on this menu was actually good.<br&gt;<br&gt;However, I tried going again this past Sunday and the wait was 60-70 minutes.  REALLY?  On a Sunday at 3:00 pm?  Needless to say I did not wait.  This place better get it together with their wait times!!", "rating": 3, "date": "10/27/2011"}, {"text": "Cheesecake Factory never fails me!  I came here on a Wednesday afternoon and sat at the bar.  Our waitress/bartender Marissa was awesome!  She had a fantastic smile on her the whole entire time.  She was quick to everything.  The service was superb!  <br&gt;<br&gt;I ordered the Miso Salmon lunch portion, but I swear it&amp;#39;s a dinner portion. The salmon was cooked PERFECTLY!  I love love love the sauce with the salmon and the brown rice.  One thing I didn&amp;#39;t like was the snow peas.  They didn&amp;#39;t cut the top and the bottom of the snow peas.   I thought that was strange because I had to do it myself.  <br&gt;<br&gt;If you are on a diet, Cheesecake Factory has a skinny menu for healthy conscious people!", "rating": 4, "date": "7/26/2012"}, {"text": "Had lunch here with co-workers for our Secret Santa gift exchange. No matter which location I visit, they never disappoint. We numbered over 20 and they were able to accommodate us without a problem. The waitress was friendly, patient and pleasant. Enjoyed the original burger with jack cheese and fries...simple, traditional but delish!", "rating": 4, "date": "12/17/2011"}, {"text": "Sandra J was exceptional! Cheesecake Factory in General is usually such a hassle because too many people dine there, but the service I received with Sandra made my wait worth while. I ordered the Tuscan chicken, my mom ordered the Louisiana pasta and we had the guacamole appetizer! Food was perfect. I&amp;#39;m definitely coming back!", "rating": 4, "date": "3/16/2014"}, {"text": "Good place to eat. The fish tacos are great and so is the red velvet cheesecake. Great place to eat.", "rating": 4, "date": "4/12/2015"}, {"text": "Worst cheescake factory experience ever. I have been for over 3 hours, and have yet to get my food, i ordered a salad... A SALAD and pasta how long does it take to put some lettuce on a bowl, and boil some pasta?!. I made &amp;#34;reservations&amp;#34; and they still took long to seat us... dont come here if your really hungry, cause you will have to wait a long time...", "rating": 1, "date": "3/4/2017"}, {"text": "I can&amp;#39;t seem to get by that this is a chain. Training could be improved. What happened to just letting everyone eat and finish their meal before clearing the table? My poor husband eats slow as we all do..him more so,and the waitress interrupts<br&gt;Us all to ask if we are finished...do we want dessert..and etc....all the while he is still eating and we are trying to talk! RUDE..training needed people. Dinner for 3 was about $80. And I had a hair in my dipping sauce.  gross. I would think the mgr would have suggested taking the small plate of $6.00 off the bill but he did not. Bad training and once again bad customer service...it wasn&amp;#39;t my hair. I thought it ridiculous that I would have to suggest that they take it off our bill..didn&amp;#39;t want to embarrass my son on his bIrthday so it will just be reflected on my not visiting too soon or at all. There are lots of restaurants in Pembroke Gardens Mall that want the business.", "rating": 2, "date": "3/30/2012"}, {"text": "This is the newest Cheesecake Factory in South Florida - considerably smaller as it is located in Pembroke Gardens strip mall. The place in WAYYYY TOOO SMALL to have such a big chain there as the parking is a total nightmare. Nevertheles - we were excited to go to the barbi-doll sized Cheesecake Factory.<br&gt;<br&gt;Wow, wow, wow is all I can say. One would think that in such a successful chain - they might have some sort or pre-grand opening training in place? &amp;#34;DING-DING-DING&amp;#34; - &amp;#34;Wrong answer Johnny...&amp;#34; So being completely fair here (as ALWAYS)... it was friggen pouring for hours - so the hour long wait OUTSIDE was understandable. It was the chaos and hour plus long wait for the food that we are going to simply rip apart...<br&gt;<br&gt;So this time it was me, my lovely wife, and kids. (2 boys &amp;amp; 2 girls - the youngest is only 8 months). If you are a parent reading this - you will feel my pain of a 2 hour wait to finally get us all fed! <br&gt;<br&gt;The waitress - looked like she just stepped out of an MTV video from the 80&amp;#39;s with all kinds of bracelets and chachkas all over her wearing this neon pink lipstick and had strange murderous eyebrows highlighted by the gothic black eye shadow...<br&gt;<br&gt;Now for the fun part.. the sodas were all FLAT - the service continued to underwhelm us as it just took so long. I ordered soup and a well done English muffin (which never came). Also in her description of the soup she never said cold chopped tomatoes or soggy red peppers strewn about as a garnish. So the soup had cold dry chicken just thrown in as well as the artichoke hearts tasted mealy and certainly inedible... (SENT IT BACK) - still no English muffin - never mentioned again except for being charged for it (MY FAVORITE)...<br&gt;<br&gt;My 5 year old&amp;#39;s pizza arrived to the table late with a wonderful green slime around the part that was placed right in front of her, which she spots in an instant... The waitress says - &amp;#34;oh that&amp;#39;s only guacamole from another dish she had carried&amp;#34; - but was not from our table (NICE). So that went back - and it took forever and a week to get her pizza out again - by that time we were all ready to leave. This time the pizza arrives partially underdone - and it has thin spots on it - you can&amp;#39;t pick up half the pie... (AWESOME)...<br&gt;<br&gt;To be fair the Chicken Romano was enjoyed by my 13 year old son - $16.50 but the red potatoes were cold and not really appetizing for anyone. <br&gt;<br&gt;My wife&amp;#39;s club sandwich was yummy - she said, but the french fries we always ask for  well done like black... and as usual - soggy crapola...<br&gt;<br&gt;The sliders for my 11 year old son were fine - but then again he bearly can wait to finish to get back to his iTOUCH games - which he tried to sneak a game in underneath the table... No Game Playing while we are together in the Family Buzzom as I put it :)<br&gt;<br&gt;3+ hours go by and we are all spent - I am ready to get the hell outta HELL and while the wife is changing a poopy diaper I decided to pay the tab... and then it happened... I turned around to see the 80&amp;#39;s video extra and the check falls to the ground - while she is holding plates so I pick it up for her and she motions with her lips to place it in her apron pocket... I tried to but it would not fit, as there was another check book inside the pocket already - she then smiles weirdly and colorfully says &amp;#34;yeah a got a BIG ONE&amp;#34; - and laughs... <br&gt;<br&gt;Being that a joke like that usually would come from a drunk guy at a bar - i thought it was odd, yet par for her course with the entire &amp;#34;get-up&amp;#34;... Needless to say my wife wanted to place her face on a milkcarton :) <br&gt;<br&gt;So to top off the really long wait, really blah food and service - this was a HALF OF A STAR at best... Get your act together guys or you might end up with your CHEESE stuck out in the wind - at least at this location. There is Sawgrass and Aventura close buy - We probably won&amp;#39;t be going back for a while...<br&gt;<br&gt;UGH!!!!!!!!!!!!!", "rating": 1, "date": "9/5/2011"}, {"text": "I normally love the Cheesecake Factory, but this particular one has severely lacking service. The first thing we noticed when we first sat down was that about a third of the silverware and plates on our table had food stuck to them. Our waitress would constantly speed past our table and pretend to not see us when we tried to get her attention. I had to wait over 20 minutes for a refill on my drink. We had to wave down other servers when we needed anything. We are currently waiting for the waitress to come back to get the check. It&amp;#39;s been over 15 minutes. We are seriously considering walking out.", "rating": 1, "date": "9/28/2014"}, {"text": "Service is great and everybody nice but is not like it used to be, I&amp;#39;m no sure if they changed owner or what is it but the food was better before, cakes are still great", "rating": 4, "date": "2/15/2014"}, {"text": "I came here for my birthday and the food was &amp;#34;eh&amp;#34;. I had the enchiladas. They tasted a little better than Chili&amp;#39;s but I paid TWICE as much. The rice was crunchy and the black beans were not good at all. I will not be going back here anytime soon. $100 for a family dinner that was &amp;#34;just okay&amp;#34; feels like a waste of money to me. Such a disappointment. Spend your hard earned money elsewhere. The only reason they got the 3rd star was because our server was very polite and attentive.", "rating": 3, "date": "10/21/2016"}, {"text": "Hey Cheesecake Factory!!!!! There are a lot of restaurants around you. First impressions matter. Make sure you hosts/hostesses welcome customers. Don&amp;#39;t make us feel like we&amp;#39;re bothering yo", "rating": 2, "date": "10/15/2016"}, {"text": "Oh Cheesecake factory... Why do I love you so much? Is it your tasty Mai Tais? The incredibly fattening Chicken Bellagio.. or your delicious Tiramisu cheesecake? ... This place serves pretty much everything except Ribs.", "rating": 4, "date": "2/23/2014"}, {"text": "Said I wasnt going to go back, but I do live in Cooper City and to find a decent place to eat is like NOT going to happen soooo.... I went back after my eh review with my family. <br&gt;We tried the bar again and ordered a Mojoito from the bartender named Tiffany and LORD BLESS US AND SAVE US we have someone that can make a drink!!!!!!!!!<br&gt;We love Tiffany and will only drink at the CF when she is at the bar. <br&gt;We sat outside and the food was good but the service was SAAAAALOWWWWWW.<br&gt;<br&gt;Will go back. Only because we dont have many choices out here.", "rating": 4, "date": "11/29/2011"}, {"text": "Cousin&amp;#39;s night out! On my first night in town, after much debate, we decided to come here when we remembered that they have the most variety in terms of alcohol that is served. I had the veggie burger whereas my cousins split up several appetizer. I didn&amp;#39;t try too many of the appetizers but I did have a bit of the hummus and it was delicious. At the end, we split a slice red velvet cheesecake and it was amazing. Great service and good food.", "rating": 4, "date": "2/23/2014"}, {"text": "Fucking awesome dude !!! My waiter was totally the fucking man I think his name was Robert .. great experience will most definitely come again man", "rating": 5, "date": "1/2/2017"}, {"text": "I am a huge fan of The Cheesecake Factory and I have been to locations all over the country.  This location was smaller than other ones I have been to which did lead to a much louder than normal experience but the food was as always... very good.  <br&gt;<br&gt;If you are looking for a restaurant in which everyone can find something to eat then this is your place (over 10 page menu!)-I recommend the buffalo blasts as an appetizer.  I recommend going for lunch for the lunch portion meals or if you go for dinner split a meal because I promise you that you will not be able to finish your meal.<br&gt;<br&gt;And of course... you can never forget to finish the meal off with cheesecake- I am a fan of the classic cheesecake but I have had several others and they were all good just some too sweet for my taste.", "rating": 4, "date": "2/14/2012"}, {"text": "I come for the cheesecake, but not often, because of the wait.  Expect an hour or more on the weekends.  The food is typically better than Red Robin or TGIF, so I can&amp;#39;t say anything negative about the food.  Just come with some good apps on your phone or a book because you&amp;#39;ll be waiting.", "rating": 3, "date": "1/31/2014"}, {"text": "Always satisfied with the customer service and the food! My friends and I were more than happy enjoying our Thursday night here!", "rating": 5, "date": "11/23/2014"}, {"text": "Been here like many of you many times.. Pretty consistent every time I visit. Wife and I order some drinks and came our pretty quick and we&amp;#39;re very good. I ordered the chicken piccata which was great and my wife ordered pretzel crusted chicken and our waiter wanted to make sure she knew what she was ordering because he did he hadn&amp;#39;t had good reviews on it.. I really appreciated his honesty and my wife orders chicken sandwich instead..  She loved it. For dessert we orders the tiramisu which was also good. They get 4 stars because it is really good and not GREAT. Honestly I&amp;#39;m not sure how any big chains could do better...", "rating": 4, "date": "1/7/2014"}, {"text": "Had my family with me and my in laws from out of town, how disappointed that the manager in charge decided to close off the outside area with an hour and half left to closing time. We just wanted to have cheesecake and coffee since my in laws were from out of town and had never been. How disappointing, it wasn&amp;#39;t even a busy night. No efforts to be accommodating, at least it felt that way.  Very embarrassing for my husband and I.", "rating": 1, "date": "7/24/2014"}, {"text": "Horrible service! The manager Heidi was so rude. The food might be good but the service is not worth it. 2hr wait to get an attitude from the staff.", "rating": 1, "date": "10/29/2016"}, {"text": "If you think when you order you will get a small plate or portion you better ask for  a packaged box before hand. Diet Kill Warning. Delish, but a killer on your diet. Loved the food, will be back once I burn it off..", "rating": 4, "date": "11/25/2013"}, {"text": "I only come here during special occasions... I love their sweet corn tamales, firecracker salmon, bang bang chicken &amp;amp; shrimp, chicken madeira, red velvet cheesecake... Customer service has never been an issue. Due to the popularity of this place, you might end up waiting long; but no biggie for me, Pembroke Gardens is a nice place to do some people-watching.", "rating": 4, "date": "1/12/2014"}, {"text": "Flys all over the place and mostly seen flying around and landed on glass wall between kitchen and dining area. Extremely warm dining space. Looonf wait and poor service. Ugh", "rating": 2, "date": "3/31/2016"}, {"text": "the worst restaurant I have ever been. The food was awful. the server so slow. the floor was so greasy. I&amp;#39;ll never come back again.", "rating": 1, "date": "6/6/2016"}, {"text": "Great service! The entree I ordered didn&amp;#39;t taste like what it was supposed to so I sent it back and they were happy to fix it. Supposedly they hired new cooks.", "rating": 4, "date": "10/27/2013"}, {"text": "I love the Cheesecake Factory, but I&amp;#39;ve never reviewed it for some reason.  So I was there again this week for an early dinner with a business associate.  We both got the chicken piccata.  I think this is a dish they do really well ( I think they do all their dishes well).<br&gt;<br&gt;Very thin chicken cutlets are covered with a sauce containing lemons, capers, and mushrooms.  We deduced that the sauce must also contain heavy cream, a little wine possibly, and some butter, among other things.  It&amp;#39;s accompanied by a small mound of vermicelli.  What a dish!  It is just sooo good.  I&amp;#39;d be happy with this as a birthday meal, &amp;#34;a last meal&amp;#34;, or in lieu of a steak dinner.  Simple, tasty, and very filling.<br&gt;<br&gt;I also like to order their passion flower iced tea.  Reminds me of Hawaii and almost makes me feel like I&amp;#39;m eating my chicken piccata on a Maui beach.<br&gt;<br&gt;Ahhhh.  I love the Cheesecake Factory.", "rating": 4, "date": "9/26/2013"}, {"text": "Great dining experience!  Had a small issue but was overwhelmed by the response to make it right!!!  Heidi came and wowed us!", "rating": 5, "date": "7/17/2014"}, {"text": "Wow I&amp;#39;m glad they built a Cheesecake Factory in The Pembroke Gardens Mall because that&amp;#39;s one of the restaurants Pembroke Pines didn&amp;#39;t have.It used to be a humongous Gymboree store the size of a Cheesecake Factory.This location tends to get really busy during lunch hours but it&amp;#39;s worth the 45 minute wait.This location is nicer and cleaner than the one in Coconut Grove.Our Waitress was nice I wish I could remember her name.My Strawberry Cheesecake was delicious and so was my Burger yummy I will come back to this particular location yelpers u should go", "rating": 5, "date": "10/7/2014"}, {"text": "We are from N.Y. But visit  family in Pembroke Pines every 3 months. Went to the Cheesecake Factory and ate there.   The waiter was great, polite and attentive. the 3 dishes we ordered were all very good, and we shared a bit since the dishes are on the generous side. The pricing is good for the value although I find their appetizers somewhat overpriced...overall a very good choice, dependability with their food , very good service and good value for their main dishes. The only reason I didn&amp;#39;t give 5 stars is because of the noise factor which at times can be loud. Our wait that night was only 15 minutes ( for 3 people). <br&gt;<br&gt;Another night we ordered for take out to eat in our hotel room. The food was very good and they gave us everything we needed for the meal including the breads in the bread basket you get when seated at the table. We were not disappointed in any way. And enjoyed the meal even in our hotel room.", "rating": 4, "date": "7/7/2014"}, {"text": "I visited here this past weekend with my family for a Birthday dinner and the service was horrible! The wait time for our group was over two hours long. After placing our orders, our food took another 45 minutes to come out. I ordered pasta and it was cold and the noodles were clumped together. One of our servers had a horrible attitude and became upset because we didn&amp;#39;t like the service he was providing. Absolutely disgusting I wouldn&amp;#39;t recommend anyone to visit this location.", "rating": 2, "date": "7/4/2016"}, {"text": "I&amp;#39;ve said it once and I&amp;#39;ll say it again, you can&amp;#39;t go wrong with Cheesecake Factory. I always sample new items since the menu is so overwhelmingly lengthy. The only constant is the Godiva Cheesecake...of course, until the new S&amp;#39;mores Cheesecake comes out which I heard is soon. Can&amp;#39;t wait!", "rating": 4, "date": "7/20/2013"}, {"text": "Great experience and great dinner until I opened my leftovers at my house and found a rubber glove with my food, that was disgusting and unsanitary, never going back", "rating": 1, "date": "8/24/2014"}, {"text": "My wife,daughter and Grandauter took me to dinner for my birthday on 3-9-2015. We were seated at the first booth on the left side of the entrance, right hsnd side, on the other side is the kitchen. The service was good, food was ok, but unfortunately my wife, who sat by the wall side of yhe booth, was surprised  by a ROACH, about an inch big! I did not wanted to ruin the evening  by creating a scandal, nor did anyone  in my family. It was my birthday. We gave the roach to the waitress. The assistant  manager came and offered us a free  dessert and we declined as wr had a birthday  cake  at home waiting.  An apology was offered by him but nothing else more, like this was a small problem, an everyday  occurrence.  To this day we fell dissapointed by the whole  experience  and vowed never to return,  left me wondering, us being  so close to the kitchen, if the roach came from the kitchen and if the food had contamination,  bad dreams  later, regreted eating the food.", "rating": 1, "date": "3/16/2015"}, {"text": "Went here on a Sunday expecting it to be busy because it was a Sunday afternoon.  We were still suprised to see a line out of the door.  We already decided that we wanted to sit outside and noticed that no one else was sitting outside.  Now confident that we would probably not have to wait we went inside.  The hostess told us that the outdoor seating does not open up until later in the evening.  Their outdoor seating probably makes up 1/4 of all of their available seating.  We were shocked that with all of these people waiting that they wouldn&amp;#39;t open more seating/call in additional servers.  We asked her how long the wait was and she said 50 min.  WOW<br&gt;<br&gt;Seems like they don&amp;#39;t want to make money.... I&amp;#39;m not the type of person who will wait 50 minutes for ANY meal.  Weird way of doing business.... Won&amp;#39;t go back.", "rating": 1, "date": "8/30/2011"}, {"text": "1 star for the effort  I had been to several Cheesecake Factory restaurants in &amp;amp; out of Florida but this is unbelievably baddd!!! The rice was UNCOOKED!!! How can you serve uncooked rice??!!! My girlfriend &amp;amp; I ordered the same (Crispy Spicy Beef), the beef had heavy batter that you can taste the flour &amp;amp; needless to say, soggy and not crispy! The presentation was horrible, they just scooped the rice &amp;amp; it&amp;#39;s all unevenly plated!!! Cheesecake Factory, shame on you!!! Not coming back to this location, that&amp;#39;s for sure!!!<br&gt;UPDATE: Decided to give the place another chance, had brunch here &amp;amp; it was pretty good....", "rating": 3, "date": "10/6/2011"}, {"text": "I love this place. But it is a bit over priced for the type of food they serve. But it is delicious", "rating": 5, "date": "2/24/2013"}, {"text": "We love this location!!! The food is very consistent and the service is great!! I highly recommend this location!  We go every week as a family and we love it.", "rating": 5, "date": "8/19/2013"}, {"text": "Worst cheesecake factory experience last week. Said to my family, we would never ever go back to this restaurant under any circumstances. Everything came out super spicy. Stuff that never was spicy had spice in it that day. All the food came out just terrible. The service was no where to be found and uninterested. It seems like this location hires some of the worst people for the job. <br&gt;<br&gt;There was no manager to be found in the restaurant or i would have put up a fight.<br&gt;<br&gt;On top of that, i had stomach pains for a whole day after. <br&gt;<br&gt;AVOID THIS CHEESECAKE FACTORY AT ALL COSTS!!!!!!!!!!!!!!!", "rating": 1, "date": "4/27/2014"}, {"text": "We enjoy Cheesecake Factory for lunch and dinner but there Breakfast menu and food in the morning is Horrible Our wait staff as well was all over the place forgot half our food and then the food was not even average. I do definatly reccomend there tamale appetizer as well as the sliders and they have plenty of good dishes. And you can&amp;#39;t go wrong with there cheesecakes. The place will always be packed and service is hit or miss. We have found the bartendars are always  good .", "rating": 3, "date": "7/3/2013"}, {"text": "You can&amp;#39;t go wrong, overall, at this place.  Sure, you might get an ok dish here and there, but their menu is so huge that it suits all tastes.  Service is usually very good, as is the bar service.  It is what it is ... a lively, reasonably priced place with lots of options, most of which are great.  This particular location can get a little annoying with its wait time because it&amp;#39;s one of the smaller locales, but all in all, they do a good job moving it along, and I personally have never felt rushed.", "rating": 5, "date": "5/27/2013"}, {"text": "I love me some cheesecake factory, but this location is very small compared to every other cheesecake factory Ive visited before. Regardless of the size, the experience and the for is what matters. The menu is aways filled with variety. If you&amp;#39;re a picky eater, no problem. They have tons of great dishes to choose from. <br&gt;<br&gt;One of my favorite appetizers to share with a group is the deep fried macaroni and cheese. The servings are always large so it&amp;#39;s good to keep in mind that you might want to plan to share with other&amp;#39;s before ordering. <br&gt;<br&gt;Another great thing to look forward to is the bread they bring to the table. They usually bring two different types of bread with butter to hold you over until the food arrives. It&amp;#39;s so good, you may even want to ask if you can bring some of it home with you after the meal is over. <br&gt;<br&gt;As far as the cheese cake goes, I&amp;#39;ve always been way too stuffed to try any of their dessert. So I can&amp;#39;t have any opinion on the specialty cheesecake they have. <br&gt;<br&gt;Regardless of the size, this cheesecake factory tastes great.", "rating": 4, "date": "3/12/2012"}, {"text": "I was with my family for our wedding anniversary celebration. It was a long line as  expected. The receptionist told me it was an hour wait so i can go around themLl and cone back 25 mins prior to 1 hour, so we did wince we have2 toddlers with us. We came back 25mins prior to our 1 hour wait. She told me my name was called and i will be placed back to waitlist. So we waited, and waited.i see new people getting seated except us. When i approached her, she told me10 more minutes, I was  pissed! I told her next time not to tell customers to walk around and come back after such time because i ended us waiting almost 2 hours. I was not even done talking and she turned next to the person waiting and ignored me! So rude and so unprofessional! The least i would expect from somebody who works for such a big company.  Never eating to cheesecake factory again! Such a disappointment! Ruined our day completely!", "rating": 1, "date": "3/6/2016"}, {"text": "Never have I had such a bad experience like the one I had tonight. The night started with a friends birthday celebration party of 15. After waiting about and hour and a half, they sat a bigger party down before us when we had been there at least 30 min prior to them.  The bread that was put in our table was hard as a rock and not the least edible. Our drinks took about 20 min to order and then again another 20 min to order food. After a an hour and thirty min of waiting for food 5 dishes were returned as the pasta was hard. The manager was called and all the plates were returned to the kitchen, no more than 10 min later &amp;#34;Newly cooked&amp;#34; plates were brought out in hopes of fixing the error. All plates were returned  (Again) as the pasta was still hard and stale. By this point most of the party was done eating and 5 of us were out of dinner. When the manager came back to &amp;#34;fix&amp;#34; the problem, my husband ordered a Steak Diane to go. Desserts orders were taken and brought out and the steak was still no where to be found. Turns out it was forgotten about and had been sitting out for a while. Steak was over cooked and not to what was ordered. The manager did do his best and took care of our bill but still didn&amp;#39;t make up for our experience (hence the two stars.)", "rating": 2, "date": "7/14/2015"}, {"text": "Love Love Love!!!  Went on Sunday night to the Pembroke Gardens location. No wait.  Ordered the Chicken Enchiladas from the Skinnylicious menu and it was delicious. My daughter picked out the dessert (which is a must there) . This time we shared a Godiva Chocolate Cheescake and boy was it good!!!! Our waiter was excellent and will go back anytime.", "rating": 4, "date": "10/1/2012"}, {"text": "I had two bites of my meal and it was so bad. This is my last time trying this location. I never had a good experience here.", "rating": 1, "date": "2/11/2016"}, {"text": "Ordered my usual Seared tuna salad. It wasn&amp;#39;t the same tuna I always get. Thinly sliced, not seared on the outside. And when pointing it out to our waitress, she told me it was just the way the new chef cut it. Didn&amp;#39;t feel like sending my food back, or making a scene out of it. But when paying $19.00 for a salad at cheesecake, you would expect to get what you ordered. Waitress wasn&amp;#39;t very nice either. Just a disappointing night..", "rating": 2, "date": "10/27/2015"}, {"text": "I hadn&amp;#39;t ate at the Cheesecake Factory since I got food poisoning from Grand Luxe a few years ago. The only reason I broke my personal boycott of all Cheesecake Factory owned restaurants is because someone gave my dad a $100 gift card and my family decided Father&amp;#39;s Day is a good time to get rid of it. We anticipated having to wait at least an hour because that&amp;#39;s just how it is at Cheesecake Factories everywhere. You wait obscenely long periods of time for mediocre food. This location is no exception. My family and I waited for 45 minutes. Their pager doesn&amp;#39;t reach outside of the front door area so you&amp;#39;re pretty much forced to stay close by. Once they paged us, we were herded like cattle into the front of the restaurant to another waiting space in the path of the waiters. Smart. This is something I&amp;#39;ve never understood about Cheesecake Factory. They know that at EVERY location they&amp;#39;ve ever established, that there&amp;#39;s a long wait. Why not have a waiting room or a more advanced paging system so that people aren&amp;#39;t jam packed into a small area? One of the hostess&amp;#39; was far from friendly too. She clearly did not want to be at work this evening and her eye rolls every time she passed customers made it clear that she didn&amp;#39;t care who knew it. Once we got to our table and placed our orders, the food was brought out in a timely manner. The calamari was not very good however. It was pretty much just batter. My mom ordered the skinny salmon dish and she said the salmon was dry. My dad thought his salmon from the regular menu was average. I ordered the skinny lemon shrimp and the shrimp was pretty flavorless. The dish was nothing to remember. All in all, our experience left a lot to be desired. Needless to say, we won&amp;#39;t be waiting an hour at this place unless someone forces a Cheesecake Factory gift card upon us again (I pray to the heavens above that they don&amp;#39;t).", "rating": 2, "date": "6/15/2014"}, {"text": "I already love cheesecake but everytime I come to this location I&amp;#39;m extra happy. I believe my servers name was Stephanie? She was amazing! Thanks for an amazing time :)", "rating": 5, "date": "4/12/2016"}, {"text": "20 years ago, this would have been 5 stars. But there were far fewer locations then and much longer waits. These days, the food is okay at best. On more than one occasion, there&amp;#39;s been an issue with freshness/quality of ingredients. And cleanliness! The flatware is always dirty and the floors are covered in trash. That said, my daughter loves it, so we go", "rating": 3, "date": "4/9/2015"}, {"text": "I ate her before so the food is always the same (giant portions! people who have a salad for an appetizer just have it as a meal because its so big and has a ridiculous amount of calories).The only thing that bothered me was the waiter. She was not knowledgeable with her stuff. Messed up on some orders and when I asked for a white wine spritzer she goes &amp;#34;we don&amp;#39;t have that. I don&amp;#39;t even know what it is.&amp;#34; So I asked her to just tell the bartender and he even said he didn&amp;#39;t know what it was. It is literally wine with club soda! So then when she comes back with it it tasted so bad! The mojito that my friend drank tasted horrible too. What a bad bartender.", "rating": 3, "date": "4/7/2013"}, {"text": "Worst Cheesecakr Factory I&amp;#39;ve been too.  Server was slow and messed up the order.  They finally brought my husband&amp;#39;s entree 10 minutes after we had all finished eating.   On top of that, the manager came over to apologize offering a free cheesecake but refusing to comp the entree they messed up on.  I told her to keep her free cheesecake and she could keep the entree too.  Service was mediocre and the manager could use a refresher course on keeping repeat business.  She didn&amp;#39;t get it right with us.  We definitely won&amp;#39;t be going back to that location again.", "rating": 2, "date": "8/30/2015"}, {"text": "Yuck!  Don&amp;#39;t go here.  We gave them several chances, and it got worse each time.  Last time we were there, we received our food and it was uncooked.  It took 30 minutes to finally find our server.  We decided to just leave.  They even got our drinks wrong.  The manager did not charge us, but what a waste of time.  We ended up going across the street to the Tavern instead and it was very nice.", "rating": 1, "date": "1/5/2012"}, {"text": "i had best lemon drop martini  in my life at the bar alone  few weeks ago. <br&gt;after i got ton of makeup at sephora . <br&gt;i dont know her name but she was pretty nice .<br&gt;the reason i love cheese cake factory is great customer service and avocado spring roll.", "rating": 4, "date": "10/23/2014"}, {"text": "It would be a negative star if it were allowed.  Horrible food, even worst service.  Skip this pace ..drive to any other location, but avoid this one. Went recently for a birthday dinner... The horrible waitress told us lie, after lie.  (the manage confirmed that it was a lie)... So disappointing.", "rating": 1, "date": "3/17/2012"}, {"text": "A chain with fresh food. I have yet to go to The Cheesecake Factory and have what I would consider a bad meal. This particular Cheesecake Factory has opened near my home at The Shops at Pembroke Gardens. They introduced their new SkinnyLicious menu which includes alcoholic beverages under 150 calories, and salads and entrees which I believe do not exceed 800 calories which is commendable since they are known for serving SALADS THAT ARE 1500 calories!! I am no stranger to The Cheesecake Factory because it&amp;#39;s a nice &amp;#34;girls day out&amp;#34; Happy Hour spot. They have a really nice happy hour menu but it ends super early (6 pm) so you gotta rush to get there after work and then hope there is parking available. I recommend you try the avocado egg rolls, the mushroom lettuce wraps, and the Thai salmon.  The skinny menu is nice and has many options also. I&amp;#39;m sure no one is a stranger to the Cheesecake Factory as its a chain restaurant but if you&amp;#39;re into Happy Hour with the girls or just hanging out for lunch with your significant other, they have outdoor seating and it&amp;#39;s shaded. I think I might head over today for some crab cakes and a salad.", "rating": 3, "date": "3/24/2012"}, {"text": "Great customer service, decor, and delicious food at a great value. Negative: Long wait time.", "rating": 4, "date": "9/19/2012"}, {"text": "great happy hour five dollar long island ice teas but yOu have to sit by the bAr from four to six pm And then they have five dollar food. it wAs good service was excellent from Shana!", "rating": 4, "date": "4/17/2012"}, {"text": "When I first discovered The Cheesecake Factory, it was a treat to go there. The ones that were around were far from where I lived so it was a special occasion to go there. Then, as it&amp;#39;s gained popularity and the chains have increased in numbers.... it has become rather boring. In fact, the one in Aventural Mall is usually hit or miss. The food is good or it&amp;#39;s pretty bad. It seems like the quality ranges depending on the chefs that night [?]. Who knows... but we decided to give this place a try---the second night it was open! Needless to say, everything is brand-spankin&amp;#39; new and beautiful. The menu&amp;#39;s are not caked with sticky fingerprints and oily covers... the place was spotless. The wait was short [weekday] and the hostess was friendly. Our waitress was VERY nice! The pumpernickel bread was delicious, as usual. That&amp;#39;s my fix. Then the fried mac-n-cheese balls of course... hit the spot. By the time the main dish came around we were stuffed. The plates here, as with all Cheesecake&amp;#39;s, are ginormous and are easily 2 1/2-3 REAL servings. The all-american staple right there... HUGE plates of food. Anyways, we had the Fettuccine Chicken and Sun-Dried Tomato pasta. It was delicious but such a huge plate. I also had the house Merlot which is called THE CHEESECAKE FACTORY and it&amp;#39;s bottled by Robert Mondavi--- never knew this before! And we never got to the cheesecake as we were so stuffed from everything else. I&amp;#39;m always bumbed when I don&amp;#39;t eat cheesecake at the Cheesecake Factory.... I mean, it&amp;#39;s just the principle of it all.", "rating": 4, "date": "8/25/2011"}, {"text": "Food was great but the service was terrible. I am a Cheesecake fan but this store has issues. When I go out to eat its about the whole experience, not just the food. No matter how good the meal, if the service sucks, its not worth my time. Missed orders, lack of attention, and the non caring attitude of the server are enough to keep me from coming back to this establishment. On more than one occasion this has happened and not on days when it has been busy. Sad to report this but better restaurants very close by will be getting my business.", "rating": 3, "date": "4/10/2012"}, {"text": "Today was my first and last time visiting this location. I go to the Cheesecake Factory at Aventura mall all the time, but visited this one today with my family to try their brunch for the first time. We had a large party, so of course we had to wait a while to be seated and to receive our food. The problem came once I actually got my food. I ordered the brunch combo, which is just pancakes, bacon, and eggs. There were two pancakes and the top pancake was hard and crusty as a rock. I informed one of the waiters and he was very polite and let me know he would bring more to the table. Next, I decided to try my eggs. They were cold and hard as well as if they sat on the stove well after being done then sat on the plate until the other items finished. I decided to just eat my other pancake. After cutting it into pieces, I noticed a bug on the underside. At first, I couldn&amp;#39;t tell because it was so small. It looked like it may have just been a little rust from the grill, but after looking closely, I did see small wings and I knew that it was indeed a bug. I sent the plate back as my appetite was completely destroyed. The manager came over to ask if i wanted anything else, but I was done. I sat and sipped my drink while everyone else ate their food. When it came time to pay, the waiter went around collecting everyone&amp;#39;s orders again so that he could ring up the tabs. I asked him if my drink would be on the house (not necessarily being serious, but just giving it a try) and he gave me a stern &amp;#39;no.&amp;#39; Although I did expect to pay for my drink, part of me felt that they would have at least given it to me on the house because I was literally the only one that sat there without food because of an error on their part. I&amp;#39;ve never been one to write reviews, or speak to managers, or complain, I just simply choose not to return. However, I&amp;#39;ve been noticing that a lot of restaurants are starting to put their profit before their customers. Things that used to be done to retain customer loyalty and repeat business are simply not done anymore and it&amp;#39;s sad. Like I said, I wasn&amp;#39;t looking for anything free and I didn&amp;#39;t even make a deal out of it. I just won&amp;#39;t be returning to this place again.", "rating": 2, "date": "2/19/2017"}, {"text": "After boycotting this restaurant for a few months due to awful service and poorly/incorrectly prepared food, I decided to come back. Three visits now, I have found tiny bugs in my lettuce. Not only will I not return here, but I am now permanently disgusted by lettuce and salads in general bc of my experience here. They obviously do not care either, bc I have complained each time it has occurred! Thanks alot Cheesecake Factory.", "rating": 1, "date": "10/17/2013"}, {"text": "This location is awful. Our waitress was never around. We waited 30 minutes for WATER, then when it did arrive, the cups were dirty. Our food came cold and overcooked. While we were waiting for our check, we watched a busser wipe down the table with a dirty towel and then with that same towel, he cleaned the silverware. GROSS. I will never come back here. I feel sick after eating here. A huge disappointment from a restaurant with a good reputation.", "rating": 1, "date": "11/9/2014"}, {"text": "the wait is always long and the food portions are bigger than your head.<br&gt;<br&gt;its a great place to waste time, gain weight, and conceive early on-set diabetes.  enjoy!", "rating": 1, "date": "9/26/2011"}, {"text": "I love the CCF, but in this one for some reason the drinks are made for kids!!! Ok, I&amp;#39;m not a drinker but I was on my girls night out reunion and I wanted a Cosmopolitan, so I order it and unfortunately for me,  the bartender forgot the main ingredient ALCOHOL!!!!  ;-(", "rating": 2, "date": "11/20/2011"}, {"text": "The places is always packed so be prepared to wait. Once inside the place is nice, as is every other Cheesecake Factory. The menu has alot of choices and the food is pretty good. Yummy cheesecake of course!", "rating": 3, "date": "7/29/2014"}, {"text": "The food is fantastic and desserts to die for. We live close to the one in Pembroke Pines and would like to order take out, except they either never answer the phone or answer and put you on hold for 10 minutes.  We end up ordering elsewhere. I do not recommend take out there unless you are lucky enough to get someone to answer the phone.", "rating": 3, "date": "7/4/2014"}, {"text": "Would like to give 2-1/2 stars.....It&amp;#39;s packed. Long waits and then long waits once seated. It&amp;#39;s amazing how many people go to TCF as the food is ok at best. Cheesecake are the star but remember they are 1000-1500 cal each", "rating": 3, "date": "1/20/2012"}, {"text": "Typical cheesecake factory although it is way more packed and not very huge.  The crowds and lines on the weekend are simply not worth the wait.  The food is consistent to other Cheesecake factories.  The service was great the day I went but it was also a Tuesday night.  The wait was 20 minutes and it wasn&amp;#39;t packed at all.  I do like that another restaurant was added to Pembroke Gardens since it always seems the rest have astronomical weights.", "rating": 3, "date": "11/20/2011"}, {"text": "There is always a wait but the food and service is worth it.  Try the pineapple upside down cake cheesecake.  Its AmAZiNg! I am looking forward to trying the brunch menu!!", "rating": 5, "date": "1/2/2012"}, {"text": "The place is the most inefficient restaurant I&amp;#39;ve ever visited.  They tell you the wait time is 30 minutes and an hour later you are still waiting.  My wife asked the hostess twice why the long wait and was told both times &amp;#34;you are next&amp;#34;.  Several people that arrived after us were seated before.  The last time my wife asked the hostess why the long wait, I said &amp;#34;we are not eating here&amp;#34; and all of the sudden the manager was trying to apologize - WELL TOO LATE.  If you want disrespectful treatment then definitely visit this place.  I think all Cheesecake Factory locations are a joke and should be boycotted.", "rating": 1, "date": "2/8/2014"}, {"text": "The food is always great! No matter the location!!!  I have nothing bad to say about the Cheesecake Factory.  I always leave with a slice of Red Velvet cheesecake....", "rating": 5, "date": "9/26/2011"}, {"text": "The Cheesecake Factory is the Cheesecake Factory with the exception of one location in which if you have read my other Yelps, you know what I am talking about.  I had a gift card so my wife and I decided to try this location since we had only ordered carryout from here in the past.  We requested a table outside and we didn&amp;#39;t have to wait at all for one.  We were greeted promptly by Jerica.  Yes, her name was Jerica and she told us she was named for the character in Gem and the Holograms.  Can&amp;#39;t say I&amp;#39;ve heard that one before!  I usually order the Grande Burrito from The Cheesecake Factory; however, I wasn&amp;#39;t super hungry that night so I decided on the chicken and biscuits instead.  I asked a few questions about this dish and seeing where I was going with this, the waitress let me know that she thought this probably wasn&amp;#39;t a good dish for me to order since they put butter all over it.  She did check with the chef and he agreed and advised me to order something else since butter and I don&amp;#39;t get along too well.  I took a few more minutes and ended up with the crispy buffalo chicken sandwich and fries.  The sandwich was good, not great and I probably will stick to non-sandwich items going forward although the burgers are pretty good.  Jerica was an excellent waitress including refilling our drinks, bringing the bread, delivering our food in a timely manner and taking care of the check very promptly.  She was definitely one of the better waitresses I have had recently.  Will I go back?  Sure.  But I&amp;#39;ll make sure I am hungry and feast upon the Grande Burrito.", "rating": 4, "date": "4/29/2013"}, {"text": "Went here yesterday for a late lunch with my family.  We were seated immediately but that&amp;#39;s as far as the positives go.  We were seated on a pile of filth.  There was so much trash on the floor, seemed like no one has cleaned it ALL day.  Our waitress took our drink order and she just seemed like she had no want to be at her job.  We had no utensils or napkins.  I had to get up and take it from another table.  The bread was STALE! We didn&amp;#39;t eat it and sent it back.  The bread plates on the table were also dirty, I had to clean it with my napkins.  My husband and my food came out 15 minutes BEFORE our kids.  The waitress was no where to be seen.  Normally kids food comes out first.  My husband and I both order from the lunch menu and ordered the Crusted Romano Chicken.  The pasta was dry, barely had any sauce. I can see now why this place was so empty yesterday.  Bad Service, Bad Cleanliness, Bad Food.", "rating": 1, "date": "9/19/2014"}, {"text": "It&amp;#39;s a great location, service and love the chicken Marsela.", "rating": 5, "date": "9/14/2013"}, {"text": "While I&amp;#39;m not usually a big fan of Cheesecake Factory, the weekend brunch is usually pretty decent. I went to this location today for brunch...It was terrible. There wasn&amp;#39;t even much effort put into scrambling the eggs since they were practically raw,  the pancakes were sour (and these were not the lemon ricotta ones) and the service was horrendous. There&amp;#39;s not too much of a selection of restaurants here in Pembroke Pines, but I can certainly do without paying for raw eggs and bad service.", "rating": 1, "date": "4/29/2012"}, {"text": "I was thrilled to hear that a Cheesecake factory had opened in my area since I have been to the one in Aventura and have never been disappointed with their food. Being  a new restaurant, in the area the wait was rather long but expected. No complaints about the waiter but the food left much to be desired and very disappointing. i ordered a chicken dish and the second piece was completely burned on the bottom which I did not taste until I had eaten the first piece. By then I felt it was too late to return the food. The next time I will inspect my food closely prior to eating it. Don&amp;#39;t think I will be going back anytime soon. The wait was not worth the food which was sub-standard...unlike the other Cheesecake factory rest. I have been to.", "rating": 2, "date": "2/11/2012"}, {"text": "Excellent service! Delicious food. Wait isn&amp;#39;t very long and the hostess is very friendly and polite. Lovely location and atmosphere! Chocolate mouse cheese cake is to die for! :-D", "rating": 5, "date": "8/13/2012"}, {"text": "Today I visited the cheesecake factory (along with my sister )and I have visited before. It was a bit busy due to mothers day but it wasn&amp;#39;t crazy. My service was great. My waitress marilyn S. was friendly..smiled often..and even though it was really busy she seemed to give us lots of attention. We order simple pastas..I had the chicken Alfredo and my sister had the three cheese pasta...when we received our pastas shortly after ordering...my pasta was bland (no salt or pepper)...chicken had no color and very tasteless ...the pasta was over cook and was mixed in with other pastas that wasn&amp;#39;t in my dish...and my Alfredo was very runny/wet..my sister&amp;#39;s pasta contained very little chicken was covered with tons of cilantro and parsley and was very bland...what is wrong with the chef did he/she not try any of the food before sending it out", "rating": 2, "date": "5/13/2012"}]}