{"address": ["2418 Ponce De Leon Blvd", "Coral Gables, FL 33134"], "monthly_reviews": {"2019": [[11, 3.5]], "2020": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 3.5], [4, 3.0], [5, 3.0], [6, 2.5], [7, 2.5], [8, 2.5], [9, 3.0], [10, 3.5], [11, 4.5]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "I visited The Cheesecake Factory in Coral Gables for the first time with co-workers for lunch. I ordered the parmesan-herb crusted chicken and I was very happy with the choice I made. It was delicious. The chicken had just the right amount of crust, it didn&amp;#39;t have an overwhelming taste of parmesan. The chicken was, overall, juicy and flavorful. I was surprised to see that the mashed potatoes came with pieces of the potato skins, but I tried it and I enjoyed it. The portion of the dish was very big. I took home what I didn&amp;#39;t finish. Although the food was good, our waitress was not very friendly. She seemed nice at the beginning, but towards the end of our time there, she had a bit of a rude tone. I would like to come again with more room for dessert and solely try one of their cheesecakes.", "rating": 4, "date": "2/2/2020"}, {"text": "So after a few moths we came back to eat again <br&gt;Service was great!<br&gt;We order the stuff mushrooms and Shrimp Scampy .<br&gt;Food came out super deli.<br&gt;Maybe one of the best ones.<br&gt;---------------------------------------------------<br&gt;<br&gt;From September ..Food was great. All items came out as ordered. <br&gt;<br&gt;Even though on these tough times.<br&gt;<br&gt;I do make better cheese cakes than them. But I was not complaining.", "rating": 5, "date": "12/12/2020"}, {"text": "The Cheesecake Factory restaurant is very great option Always , the food is excellent, tHe Drinks are great, and the environment is awesome, <br&gt;Best waiter ever <br&gt;<br&gt;I love that restaurant", "rating": 5, "date": "9/11/2020"}, {"text": "It was an amazing graduation  family lunch. Ken, the manager, was very helpful and all his team members as well. Our server, Vanessa did an amazing job. She was very attentive and efficient to every one of my guests. Every meal was served quickly and with care. My son&amp;#39;s graduation celebration was a success because of the kindness and cooperation from everyone.", "rating": 5, "date": "12/14/2020"}, {"text": "Deplorable service.  We arrived and requested a table for three people.  We were informed that the wait was 30 minutes.  After 35 minutes, and after enabling a table for four people, the &amp;#34;host&amp;#34; passed before a couple of two people who had just arrived in front of us. At a table of four people!  How is it explained?  Having more tables on the premises by COVID-19 for two people.  In the end, we ended up waiting 45 minutes.  We asked the manager who was not able to apologize, and his attitude was of little importance to what happened.  Terrible attention and concern for the client.  We made the decision not to return to this place ever again.  I do not recommend it to anyone!  Never in seven years going to eat at other Cheesecake Factory in Miami (Dadeland / Dolphin Mall / Coconut Grove) had I had this experience.", "rating": 1, "date": "7/25/2020"}, {"text": "I couldn&amp;#39;t be happier that the Cheesecake Factory finally opened near us !!! This location is beautiful with an outdoor patio next to a fireplace. It opened in November and I think it&amp;#39;s here to stay. Parking isn&amp;#39;t free and depending on the time you go, a little hard to find but If you&amp;#39;ve never been to a Cheesecake Factory I promise you it will change your life. There is something for everyone and whatever you order it&amp;#39;s bound to be OUTSTANDING AND GREASY (in the best decadent way) AND DELICIOUS. I guess since it&amp;#39;s new the service was also amazing and extremely attentive even though I always ask for the servers not to check up on me. He even came around to ask me how my drink was after it was brought out. Actually some of the best service I&amp;#39;ve ever had. I wish I would&amp;#39;ve gotten his name but he was American for sure and kind of dirty blonde from what I could tell under the light. <br&gt;We had a raspberry lemon drop cocktail that was amazing and tasted just like strawberry lemonade but had me just right with one. <br&gt;Just coming in for the bread would be worth it if it wasn&amp;#39;t free but We started with the crab and artichoke spinach dip which I loved but doesn&amp;#39;t compare to the avocado spring rolls which are my favorite thing to get here. It was creamy and had the right amount of crab and pieces of artichoke with perfectly baked baguette. <br&gt;Then I decided to steer away from the Evelyns pasta which I always get and try the bistro shrimp and it didn&amp;#39;t disappoint. It was so creamy and the grease just drips off your lip and you feel so satisfied but healthy with the amount of arugula they put in. <br&gt;I left super full and the best Is that for the price you get way more than what you&amp;#39;re paying because everyone took half their food home and I got to have lunch for the next day. <br&gt;Thank you cheesecake for never disappointing", "rating": 5, "date": "2/18/2020"}, {"text": "Ok, so I know this is a chain restaurant, but it still has consistently high quality food and the service is wonderful! I like this location because it&amp;#39;s just off the Miracle Mile in Coral Gables. The restaurant itself is clean and beautiful. Typical gigantic menu with lots of choices. I&amp;#39;ve never had a bad meal here. And the cheesecake!! So good. The drink menu is fun too! If you&amp;#39;re tired of yelping every restaurant on the mile and you want a people pleaser, this is a go-to.", "rating": 5, "date": "1/2/2020"}, {"text": "I have been to the cheesecake factory a lot and I was very disappointed by this circumstance I had to wait for my water for about 30 minutes I had to wait for a server to come up to me all the places them to you for about 10 minutes I ordered the stuff mushrooms and Artichoke dip right when I first got there and it took i&amp;#39;m about five minutes to bring out the mushrooms and about another 30 for the spinach dip.. my server was trying but I guess it was a kitchen that was not doing a good job..When they brought the meatloaf it tasted bland and not good.  <br&gt;Had to send back for the shepherds pie which I then took to go and that wasn&amp;#39;t good either very disappointed", "rating": 3, "date": "6/24/2020"}, {"text": "Ladies and gentlemen The Cheesecake Factory has arrived in Coral Gables (clap clap clap clap!). I probably let out an audible yell when we drove by the &amp;#39;coming soon&amp;#39; sign a few months ago. I mean it&amp;#39;s TCF! What&amp;#39;s not to love? Unfortunately in order for this American icon to blossom it had to rise out of BrickTop&amp;#39;s ashes. And speaking of -- yes the fire pit is still there!<br&gt;<br&gt;I know a lot of folks may look down on TCF but this was one of the original &amp;#39;foodie&amp;#39; spots when I was growing up. If you went to eat here, it was definitely to celebrate something or eat a plate the size of a small child. <br&gt;<br&gt;Granted, I&amp;#39;ve had my fare share of mid experiences at different locations but when it&amp;#39;s on point, it&amp;#39;s on point. The Gables location was no exception. Our server Jason was attentive and very engaging with us (along with the other folks running around doing different things). <br&gt;<br&gt;We had the crab bites, stuffed mushrooms (small plates) and Impossible Burger, Louisiana Chicken Pasta and Chicken Alfredo. Every single plate was fireee. People, don&amp;#39;t sleep on TCF, they&amp;#39;re doing it right for the Gables.", "rating": 5, "date": "12/3/2019"}, {"text": "Costumer service is terrible. The manager Bryan is very unprofessional and rude. I do not recommend this location and as of me and my family we will not be returning .", "rating": 1, "date": "1/4/2021"}, {"text": "So while I&amp;#39;m a huge fan of Cheesecake Factory, this location isn&amp;#39;t it. Decided to go in today and was deeply disappointed. No service for over 25 minutes and to make matters worse the table we sat at had crumbs which lets me know that during the pandemic they are not being diligent enough to properly wipe down the tables. We decided to leave and go elsewhere. So off putting though, I will not be coming back to this location", "rating": 1, "date": "7/6/2020"}, {"text": "We love going here. The portion sizes are large and the staff is great. Glad they were able to survive the zombie apocalypse.", "rating": 5, "date": "11/11/2020"}, {"text": "I was craving cheesecake and a fabulous salad. This location is new to the Coral Gables. Wasn&amp;#39;t to dine in because at the time they were only taking takeout and curbside pick up. The Door Dasher was amazing with time. Definitely coming back to dine in.", "rating": 5, "date": "6/7/2020"}, {"text": "Cheesecake&amp;#39;s food is always excellent. Every now and then they miss the mark on service, but overall it&amp;#39;s always a place to enjoy a nice lunch/dinner. <br&gt;<br&gt;Parking: This location has NO parking. Street parking (if you are lucky) which requires payment through the Paybyphone App or you will need to park in one of the parking garages. There is 1/2 a block from the restaurant. Not a bad walk. <br&gt;<br&gt;Location: Excellent location. Clean, overall safe, with lots of restaurants and people in the area.", "rating": 5, "date": "12/22/2019"}, {"text": "Pasta Carbonara..?  Really!  It was just pile of spaghetti WITHOUT ANY carbonara goodness! Wow.  I could&amp;#39;ve done this at home with pack of $5 noodles.  They charged almost $20 for this! Delivered via Grubhub ‍.  Live n learn...", "rating": 1, "date": "6/18/2020"}, {"text": "I have been to quite a few Cheesecake Factories around Florida, but this one in the Gables is completely different from the rest.  Now, how can one restaurant from a chain be different from its brethren?  Well, that&amp;#39;s a surprisingly easy question to answer. It is hands-down the best Cheesecake Factory I have been to.  They are definitely doing something behind the scenes to make this one stand out from the rest.  The parking for this place is actually convenient.  There is a parking garage right behind the restaurant that is not too expensive to park in.  If you can get a spot in there, take it because you only be a few steps away from the restaurant.<br&gt;<br&gt;On the surface, this Cheesecake Factory actually seems much smaller than most of its franchises even though it has the same décor.  This may sound like a detriment, but instead, this gives the restaurant a more-intimate feel.  The staff always starts you out with a sampler of their delightful bread, which is always freshly-baked.  Be sure to try their honey wheat bread.  It is superior to the traditional white bread. Their menu is absolutely massive. <br&gt;You would be hard-pressed to find something that does not appeal to you, so this is a perfect place to bring picky eaters.  They even have their &amp;#34;Skinnylicous&amp;#34; menu that has low-calorie and healthier takes on their traditional offerings.  They even have a &amp;#34;Skinnylicous&amp;#34; menu for drinks if you want your cocktail to be somewhat guiltfree.  I like to order from their &amp;#34;Skinnylicous&amp;#34; menus as their normal-sized food can be extremely filling.<br&gt;The mojito I ordered from the drink&amp;#39;s menu was well-crafted and refreshing.  It had the perfect combination of mint, basil, lime, and rum.  It also came in a tall glass so there was plenty to drink.  For an appetizer, we had their chicken taquitos.  This dish had a great combination of ingredients with a crunchy tortilla and was not too filling.  There are three taquitos per order so that keep that in mind if you decide to order this. <br&gt;I ordered the grilled steak medallions and they were perfectly cooked to order.  They paired perfectly with the fluffy mashed potatoes and savory mix of mushrooms, asparagus, and cherry tomatoes.  It&amp;#39;s a great dish if you want steak but without all of the guilt.  And yes, all of this is only 400 calories.  Another family member I was with ordered the Tuscan chicken and that was also delicious.  Perfectly grilled chicken with balsamic vinaigrette, tomatoes, artichokes, and capers served over farro.  This is another delectable dish that won&amp;#39;t leave you feeling bloated afterward.  Their &amp;#34;Skinnylicous&amp;#34; menu is definitely a hit.<br&gt;<br&gt;If you have been burned in the past by previous Cheesecake Factory experiences, I am whole-heartedly telling you to give this one in the Gables a shot.  It absolutely blows the other ones out of the water.  The food and service of this location make it so much better than the others.  And if you haven&amp;#39;t been to a Cheese Factory, then this one will spoil the rest for you.", "rating": 4, "date": "4/12/2020"}, {"text": "The Cheesecake Factory is a good go to place if you want lots of options. I personally love their lemon sauce salmon with mashed potatoes and broccoli but I will say it isn&amp;#39;t consistently great. It really depends on what chef you get I guess. The martinis are also delicious.", "rating": 3, "date": "12/2/2020"}, {"text": "I was super excited that Cheesecake Factory came to the Gables. It was a top work lunch choice before the coronavirus shut everything down. <br&gt;<br&gt;As usual, the service was top notch, drinks were delicious (love the BACARDI Lime mojito) and the menu is always so great with endless choices. <br&gt;<br&gt;That being said, I&amp;#39;m a little disappointed with the meals we&amp;#39;ve ordered from here during the lockdown. We&amp;#39;ve had missing sides, weirdly tiny entrees, and just generally kind of lack-luster meals that seem...off for Cheesecake Factory standards. I&amp;#39;m not sure if it&amp;#39;s just us or we&amp;#39;ve had some bad luck? Delivery is always timely. I&amp;#39;d rather it take longer to get the correct meal than a fast incorrect one though. Wish now more than ever we could dine in person. I hate to sound like I&amp;#39;m whining during such tough times but Im not sure we&amp;#39;ll be ordering from here again soon unless the quality improves a bit. Hope things turn around quickly for this restaurant and many others in the area.", "rating": 3, "date": "4/19/2020"}, {"text": "I was pleased to find the Cheesecake Factory on DoorDash, especially during these tough times. I ordered potstickers, cheeseburger spring rolls, and a crispy chicken sandwich. The only downfall to my order were the spring rolls. They were unbelievably greasy! One bite, and grease was POURING out of the other end of them. They were so greasy that the oil was all I could really taste so I had to drown them in the sauce that came with them. My potstickers were delicious and I was told the chicken sandwich was good too (it wasn&amp;#39;t for me). I would definitely eat from here again but I will be staying far away from the spring rolls!", "rating": 4, "date": "3/27/2020"}, {"text": "The green lasagna was out of this world. So tasty and a very generous portion. The margarita was very good too.", "rating": 5, "date": "11/14/2020"}, {"text": "Great seelection of foods (as always) and great burgers. We tried the Mushroom and the Classic burger and both didn&amp;#39;t disappointed. French fried were just ok.", "rating": 4, "date": "1/28/2020"}, {"text": "The Cheesecake Factory is the perfect addition to Coral Gables! I had the pleasure of visiting this restaurant for lunch during their practice hours. Our server, Wilson, provided us with excellent customer service. To start, we ordered the buffalo blasts, which is breaded chopped chicken in the shape of a large triangle. The inside has some buffalo sauce but you could always add more buffalo sauce with the dip. This appetizer also came with a blue cheese dip on the side. For entrees, we order the lunch portion chicken piccata and the Sheila&amp;#39;s chicken salad. I am a huge chicken piccata fan and I am in love! They stick to the recipe like any other with the mushrooms, capers and all. We were so full from the appetizer and first entree we honestly couldn&amp;#39;t touch the salad but the servers gladly wrapped it up to go for us. For dessert we had the chocolate hazelnut cheesecake and my goodness, I don&amp;#39;t even like cheesecake and I am crazy about this one. We received a large portion, certainly enough for two people, with whipped cream and Nutella on top. And lastly, a cappuccino top things off. I will definitely be visiting this location again and would recommend this restaurant to anyone looking for a menu with an array of options and great service.", "rating": 5, "date": "11/22/2019"}, {"text": "This restaurant needs to get the kinks  out   because all the food is always consistent in this chain (very good)   You should wait a few months to go to give it a chance to get the kitchen together <br&gt;Server was good", "rating": 3, "date": "12/2/2019"}, {"text": "Have been meaning to visit this Cheesecake Factory location for a while since the one in the Grove closed and it is down the street from me.  I went around 2pm on a Monday, was seated right away (table for 2) and was attended to shortly after.  I was very pleased with the service, timeliness, and quality of the food. Definitely will be coming back again soon.", "rating": 5, "date": "2/24/2020"}, {"text": "I have not been to a Cheesecake Factory (CF) in years. When we last visited Miami we went with my wife&amp;#39;s family for dinner. The old restaurant that was in this location was really crappy/overpriced. CF is a nice change! All of us, with the exception of my mother in law, enjoyed the food. I ordered the chicken madeira and thought it was excellent...like really fucking good! The waitress was great, although she did seem like she was in a bit of rush to turn over the table (there are so many things on the menu, we needed some time to decide what to order). Oh, and as an app we ordered the General Tso&amp;#39;s cauliflower which was also incredible. <br&gt;<br&gt;Maybe I&amp;#39;m completely lame, but I can&amp;#39;t wait to go back. lol", "rating": 4, "date": "1/13/2020"}, {"text": "We visited the grand opening of the Cheesecake Factory out of curiosity and were mildly impressed. It is a beautiful renovation of the site and a great addition to Ponce de Leon avenue. Within easy distance for us walkers.<br&gt;Christian, our server is attentive and service-oriented. He&amp;#39;s a credit to the company.<br&gt;We look forward to doing happy hour here.", "rating": 4, "date": "11/26/2019"}, {"text": "Pretty good staff , but alittle oily compared to other locations. I left feeling a little sick from the ingredients. I always loved CF, would give it another go if I was in the area. The quality of food at this location wasn&amp;#39;t as good as other locations.", "rating": 3, "date": "12/24/2019"}, {"text": "Couldn&amp;#39;t be happier to have a Cheesecake now open in Coral Gables. Since they closed the one in Coconut Grove it had been a while since we visited one. <br&gt;Service is great. The hostesses are welcoming and the servers are attentive. At our last visit, Tiffany was awesome!<br&gt;<br&gt;The menu is exactly as we remembered it. Some of the desserts seem to have slightly changed (texture, ingredients), but were still delicious.", "rating": 5, "date": "12/21/2019"}, {"text": "Great new restaurant in the heart of Coral Gables. I loved their skinny menu that included a list of skinny drinks. The food was above average.  Slow service but I believe it was because the place just opens that location. The skinny monitor was great and only 100 calories.", "rating": 4, "date": "12/15/2019"}, {"text": "Came here for dinner and waited two hours before we received our food. Asked the server to cancel our order as we were no longer interested and five minutes later our food magically appeared, but still no server. We ended up packing up our food to go and when it was time for us to pay, I handed the server my military card for my military discount and was told by both the server and manager that they do not offer military discounts, something I know to be false because I&amp;#39;ve eaten at Cheesecake Factory numerous of times. I will not be returning to this location again.", "rating": 1, "date": "1/11/2020"}, {"text": "I was very excited when I heard about a Cheesecake Factory opening in my area. Cheesecake Factory is one of my favorite restaurants but I have to say that this location is lacking. I have been here a few times and I have had issues with my food coming out cold and the service being slow at times when the restaurant is half full. The only reason I&amp;#39;m writing this is because I hope they address this issue. You can clearly see that the cheese wasn&amp;#39;t melted on my chicken nachos.", "rating": 2, "date": "1/9/2020"}, {"text": "The Cheesecake Factory is a fairly safe bet and the new Coral Gables location is no exception. Though my ribeye  was slightly undercooked, our waiter was quick to correct it with a sincere smile. That aside, the rest of the meal was typically enjoyable. But, the standout was the establishment itself. The former Bricktop Restaurant makes for an en excellent venue and brings this location a notch above the rest. With its alfresco patio and fireside seating, I&amp;#39;m looking forward to some drinks and appetizers very soon.", "rating": 4, "date": "1/2/2020"}, {"text": "Really wanted to give this spot 5 stars but the 2 hour lunch hour me and my colleagues had to take was very frustrating. <br&gt;We ordered our food and drinks about 30 mins after we arrived.<br&gt;The food was good but it took a while to come out and once we were done, we went ordering our cheesecakes and asked for our bill right away. <br&gt;I asked for my bill with my cheesecake just to be sure but I didn&amp;#39;t even get to receive either because I had to leave my coworkers with my credit card to pay for me to avoid any issues with work. <br&gt;When I was leaving, they had already taken our cheesecake order and we had already asked for our bill, but the waiter still came around to see if we wanted refills. <br&gt;At that point, we didn&amp;#39;t know how else to ask for our bill after asking for it so many times. <br&gt;Hopefully it will be a better experience the next time we go.", "rating": 3, "date": "12/2/2019"}, {"text": "The staff is all over the place<br&gt;Not a good time to go and experience their messiness,  they need to be trained <br&gt;They were arguing in the hall, doing group meetings and discussing what to do and how to do something <br&gt;Who doesn&amp;#39;t love the bread? Well mine was soggy and over toasted to hide the old <br&gt;We ordered the avocado roll and one pasta to share... the pasta was not al_ dente, it was undercooked <br&gt;Not coming back....", "rating": 3, "date": "12/3/2019"}, {"text": "While the food was really good and the cheesecake was delicious there was some questionable service. First the server was nice and friendly but we quickly noticed he took a long time to do simple things such as get us the cheesecake menu and process our checks. However what really deserved the 2 stars is how uncomfortable my girlfriend felt after our waiter&amp;#39;s friend had just asked if she had a boyfriend and if they could have her number. I obviously don&amp;#39;t expect the waiter to automatically know she&amp;#39;s my girlfriend but it made her really uncomfortable and I found it extremely unprofessional for staff to ask costumers for their number. She really didn&amp;#39;t like that the people serving us would look at her in that sort of way and obviously I did not think it was right. Overall food was delicious but I believe there should be some training on being professional.", "rating": 2, "date": "10/24/2020"}, {"text": "Horrible Togo service, slow, talking amongst themselves as the orders sit in the window. What a disaster. I would expect much more from this company, waited over 20 min for my order after I was told 5 min three different times. Never again!", "rating": 1, "date": "3/31/2020"}, {"text": "I had it for delivery. Cheeseburger Spring Rolls was amazing!!!!!  Carne Asada Steak Medallions was also quite good.", "rating": 4, "date": "10/10/2020"}, {"text": "Service was absolutely terrible. Had a server named Frank, young tan guy with short hair... said rude things to my wife, made sexual innuendos, forgot almost everything I asked for on the side.", "rating": 1, "date": "10/5/2020"}, {"text": "We went on our lunch hour. We ordered from the lunch menu and got charged the price on the regular menu. Took forever to get the wine bottle we order and let&amp;#39;s not mention how long it took us to pay our tab.", "rating": 1, "date": "6/12/2020"}, {"text": "I was happy to see that the area previously occupied by Bricktop&amp;#39;s was now a beloved Cheesecake Factory. It was a party of three and we chose to be seated on the patio by the firepit. I started off with the creamy chicken soup as I dipped on their new revamped version of the strawberry martini with a basil leaf atop. The chicken Marsala was my main dish as my SO ordered the stuffed cheddar burger and the little one nibbled on cheeseburger spring rolls. The service was great and as always the portions were quite hefty. My favorite part is the cheesecake options in which I was glad to see they brought back my ultimate favorite Pineapple Upside Down Cheesecake. Honestly, I was so sad when they discontinued it years ago that  I almost shed a tear but knowing that it&amp;#39;s back now made my heart flutter. It&amp;#39;s located directly on Ponce De Leon Blvd. and is perfect for the whole family since the menu is extremely large with loads of different options for everyone.", "rating": 4, "date": "1/6/2020"}, {"text": "The last 3 times I&amp;#39;ve ordered from this location I ALWAYS have items missing. We ordered food tonight and once again the cheesecake was missing and my boyfriends food as well. I called the restaurant and the manager didn&amp;#39;t seem to care just told me to ask DoorDash for a refund, showed no concern especially after I told her this was the 3rd time. Disappointed once again! Bread also seemed it was old and the corn tamales had a pound of sour cream on top... ruined the meal. Cheesecake Factory get it together!!!!!", "rating": 2, "date": "9/19/2020"}, {"text": "I hadn&amp;#39;t been to a Cheesecake Factory in years, so when a friend suggested we try the new location in the Gables I was intrigued. This is pretty much everything you&amp;#39;d expect from a Cheesecake Factory experience. The location was quite small inside (especially compared to some of the larger mall locations) but had the quintessential TCF look and feel. It was a Monday night and pretty dead around dinner time so we were seated right away. Service was great and attentive and the food came out very quickly. And it was just as I remembered, once you&amp;#39;ve agonized over your choice from the seemingly infinite menu options... huge portion sizes and very reasonable prices. I&amp;#39;m not a huge fan of eating at chain restaurants but there is something comforting about knowing that you will have a consistently solid experience no matter what TCF you go to. And what is it about the complimentary bread and butter that is so magical??? Parking wasn&amp;#39;t an issue on Monday night but I can see that being challenge of visiting this location on busier nights of the week.", "rating": 4, "date": "1/7/2020"}, {"text": "Ordered on DoorDash, they took over an hour to prepare my food and I had to end up cancelling. Had to go through 2 dashers as well. Awful experience from DoorDash.", "rating": 1, "date": "9/23/2020"}, {"text": "Extremely slow, service &amp;amp; kitchen. Food came staggered, the bread service arrived after first course, with the restaurant in half capacity. Female manager floating around, avoiding eye contact. Well, I I know that you are new, but come on... you are representing a well known brand. It&amp;#39;s the worst Cheesecake Factory that I&amp;#39;ve ever sat down to eat. Get your game together, it will be a shame to repeat the Bricktop story", "rating": 1, "date": "12/27/2019"}, {"text": "Celebrating my mother in laws birthday.  Loved the service and of course the food was great.  Will be<br&gt;Back!", "rating": 5, "date": "2/17/2020"}, {"text": "While the Cheesecake Factory offers the best cheesecake anywhere outside New York or Chicago, their luncheon specials are delicious and plentiful! Enough for me to take half home and share with my husband, who is most appreciative!!!", "rating": 5, "date": "12/18/2019"}, {"text": "Cheesecake Factory is very consistent from location to location.  The meals are solid and the service is good and the menu is varied.  A nice &amp;#34;default&amp;#34; when you want to make sure there is something for everyone for big parties.<br&gt;<br&gt;The location in the Gables is new but the outside seating at this location is really good.", "rating": 3, "date": "1/26/2020"}, {"text": "I love the Cheesecakefactory but this one is terrible! We got water but that was it. No bread, no service. We decided to leave after 30 minutes without service. And this Cheesecakefactory was empty - no wonder why.", "rating": 1, "date": "3/16/2020"}, {"text": "I was so excited to hear that this location was opening! I love the restaurant, and ever since they closed the Cocowalk location it was too far or inconvenient to go to the other locations. This one is so close to home and is the middle point for all my friends! We love going! Last time we went a waitress named Paige attended us and she was the sweetest waiter/waitress I&amp;#39;ve ever had the pleasure of getting in the restaurant. She was extremely attentive and made some awesome recommendations. Great food and great ambience overall! Can&amp;#39;t wait to go again!", "rating": 5, "date": "12/22/2019"}, {"text": "The food is just ok nothing out of this world but I would come back. The service is terrible, they took almost 20 minutes to bring bread to the table the food did not all come at once and some plates were cold. I had to refill my parking waiting for the bill. Perhaps that is why they make you wait to get a table?", "rating": 3, "date": "12/29/2019"}, {"text": "I used to enjoy going to this place. Horrible experience and first time at this specific location.<br&gt;<br&gt;Was there to celebrate a birthday.  One of the entrees ordered did not make it to our table, the birthday girl&amp;#39;s out of all! According to the manager, it was taken to another table. We were offered another plate in the meantime for their error.. the replacement was ok but obviously not what we wanted.. also, the white rice, which was a side on 2 of the other plates of our party, was hard. Not sure if it was old or not cooked well.  When we finally got the correct plate, everyone else was done eating.. <br&gt;<br&gt;Finally, when the waiter was advised that we had a birthday in our party and requested they sing happy birthday, they forgot. Brought out a cheesecake but no song..  this all a while we kept hearing them sing happy birthday to various other tables. <br&gt;<br&gt;Don&amp;#39;t recommend going to this location.", "rating": 1, "date": "2/24/2020"}, {"text": "I love Cheesecake Factory but the service in the place sucks.  I know it&amp;#39;s early and they just opened but it&amp;#39;s pretty bad - and at all hours.", "rating": 3, "date": "1/4/2020"}, {"text": "Ordered pick up at this location for the first time and was extremely disappointed .  Pasta was not cooked , the burger very dry not medium rare as requested, gave me the wrong kind of cheesecake and fish and chips were blah at best, not the quality I always geT at the Dadeland location, won&amp;#39;t be going back any time soon. What a pity since it&amp;#39;s very conveniently located.", "rating": 1, "date": "1/1/2020"}, {"text": "The location is beautiful the food is OK but they really need to get it  together with Service. I placed a to go order and received a confirmation email saying will be ready for pick up at 12:18.  It&amp;#39;s now 1 PM and I&amp;#39;ve been standing here waiting for my order for at least 45 minutes.  Unacceptable.", "rating": 2, "date": "12/6/2019"}, {"text": "I mean is an easy place to pick got a big variety of plates but is not my cup of tea...always busy, food always takes a MILLION years to come to the table..i just dont like it", "rating": 3, "date": "12/19/2019"}, {"text": "A welcomed addition to the Downtown Coral Gables scene! A boutique footprint version of the popular chain. Have stopped in several times during Happy Hour and been blown away with the quality of service and prices since they recently opened. This afternoon stopped in for lunch and sat outside to enjoy the balmy and breezy Miami &amp;#34;winter&amp;#34; weather. Our server Ramon A. was fantastic, brought everything out as quickly as he could and was attentive to the refills and menu suggestions. Great service is the cornerstone to any fantastic culinary experience and we will definitely be back to continue exploring the menu for lunch, brunch, happy hour and dinner.", "rating": 5, "date": "12/10/2019"}, {"text": "I&amp;#39;ve ordered the Louisiana Pasta, the Fettuccine Alfredo and the pizza chicken parm... honestly just so greasy. My dads from Cuba he eats anything but he really couldnt take another hit from his Alfredo pasta", "rating": 3, "date": "1/6/2020"}, {"text": "Very profesional and nice  service from Kemissa drink are hamburgers are good too. The new place in Coral Gables is nice and cozy.", "rating": 5, "date": "12/24/2019"}, {"text": "Great service even with all the new covid regulations. Food was amazing as usual. They did a great job over all.", "rating": 5, "date": "6/14/2020"}, {"text": "I love cheesecake has been the family restaurant we go to for all special events. I was extra excited for the new location three blocks away from my house. This is the third time coming and the service has been terrible and order have been wrong more than once. I look forward to outings with my family so I totally ruins our night. We will have to continue to go to dadeland cheesecake moving forward.", "rating": 2, "date": "1/6/2020"}, {"text": "What a disaster! The wait time was the only thing not too bad, about 30 minutes which is great for this place I guess. Our waiter was very nice and polite but super new to the job alongside his team members. The drink orders were wrong and missing. Six of our 8 plates at the table were wrong and missing things. One plate was basically pasta and a chicken parmesian (it took 4 servers to get together, which we saw them do, to then come back and ask how and what the parmesan was and how it was made? Really?!? The chef must be new. We were charged for the wrong plate that we sent back twice. The Turkey avacado sandwich was missing the avocado. The three shrimp taco never came out, they brought us 4 fish tacos and rice beans. One plate took so long we almost forgot about it.", "rating": 2, "date": "12/9/2019"}, {"text": "I was so excited when I learned that The Cheesecake Factory was opening in Coral Gables. My husband and I decided to go after the holidays. When we finally arrived the place is pretty. I noticed a few positive changes that was made from the previous restaurant that was there. For instance, the bar looks more welcoming than before. The hostess was very kind and very welcoming as well. We sat down in no time.  However, we waited at least 15 minutes and no waiter or waitress showed up. After 15 minutes of wait a server showed up and said that he would be right back. We must&amp;#39;ve waited another 10 minutes and no signs. We left! We ended up at Flemings.  What a shame! I hope this isn&amp;#39;t the norm.", "rating": 1, "date": "1/4/2020"}, {"text": "So my first time at Cheesecake Factory.  Yes...can you believe it.  So I decided to check out the new digs in Coral Gables.  Showed up at 650pm.  Still time to grab a happy hour drink before a sit in the dining room.  Anyways, table was available but waited for my husband.  Got a drink, his band shows up...all this before 7pm.  Finally go back to check on the table that was available 10 mins prior...&amp;#34;Sorry but there is a 35 minute wait&amp;#34;.  Really, O just went to the bar for two drinks.  Anyways, didnt want to wait because I had two hungry kids.  So I grabbed a table by the bar.  I order food for the kids while I wait for my table.  Get this...35 minutes later table is ready but no sight of the kids food.  REALLY???  So my husband and I dont order food because we were hope to sit at a normal table but ended up getting upset that food was hot out for kids and cancelled our table.  Yes Managers came out apologetic for late food and comped the kids food....but we had two simple kids food..no food for us and after being there for a total of 1 hour...Had to leave hungry.   I honestly hope they get better but this family will not go back.  Guess where I&amp;#39;m at?  At the local grocer buying food to cook at home knowing our food will be ready in minutes instead of an hour.  Good Luck guys..but you lost a great tipping family.", "rating": 1, "date": "1/10/2020"}, {"text": "We decided to give this location another chance and I have to say the food was very good; everything was cooked perfectly. Thank you!", "rating": 5, "date": "3/7/2020"}, {"text": "The Service here is trash!!! I can now understand the no wait time and nobody in their restaurant. I will say yes we came in super late, but that&amp;#39;s cause we are from out of town and nothing nice was open. Came in to servers looking at their phones to check the time‍ We then get seated and our waitress &amp;#34;Elexus M doesn&amp;#39;t even greet us, just ask&amp;#39;s &amp;#34;y&amp;#39;all want some drinks?&amp;#34; Yes I remember her name cause she was trash!! No communication on no more warm bread due to the kitchen being close to closing. She wasn&amp;#39;t even polite. I understand us coming in late, but damn where has good customer service gone?? Isn&amp;#39;t this Cheescake factory or our we at hometown buffet?? I say all this because we went to boiling crab the next night, same time and they gave  us excellent customer service. Didn&amp;#39;t feel  like we had to be rushed. They even asked if we wanted to order more food before the kitchen closed. The manager even came and had a little attitude. Now when I visit a cheesecake I&amp;#39;m Atlanta, Vegas or LA they always have great service. This was a bust!! Highly upset with the service here!! They need some more training in customer service. Cause that leaves an impression on people. Wether your closing or not!! Provide good service! PERIOD!!!!", "rating": 2, "date": "2/11/2020"}, {"text": "Food was good the service not great. Silverware dirty had to ask for a clean set which took a while to get them. Our drinks took forever waitress apologized said was only one bartender. How can u have just one bartender on a busy Saturday night. Will not be returning to this restaurant.", "rating": 3, "date": "2/10/2020"}, {"text": "I waited 25mins for my food and it came out COLD manager told me it will be another 14-15 mins and I waited another 20 mins still no food. I&amp;#39;m over it at this point!  Check please", "rating": 3, "date": "2/7/2020"}, {"text": "Service absolutely 100% doesn&amp;#39;t stack up to the other locations. Waited 20 minutes for bread and they messed up my order and I had to wait an extra 20 minutes for them to correct it.  Guess I&amp;#39;ll just have to drive to Dadeland next time.", "rating": 1, "date": "1/19/2020"}, {"text": "I went with my family here and it was great. The service was great  and the waiter we had Gabriel treated us so well and made sure we had everything we needed and the food was great and they have a great variety", "rating": 5, "date": "1/13/2020"}, {"text": "Great food, great service and convenient location-what more can you ask for when you&amp;#39;re in town and want something within easy walking distance of your hotel!", "rating": 5, "date": "1/2/2020"}]}