{"address": ["236 Summit Blvd", "Birmingham, AL 35243"], "monthly_reviews": {"2019": [[0, 2.5], [1, 3.0], [2, 2.5], [3, 2.5], [4, 3.0], [5, 3.5], [6, 3.5], [7, 3.0], [8, 2.5], [9, 2.0], [10, 1.5], [11, 1.5]], "2017": [[0, 3.5], [1, 3.5], [2, 3.0], [3, 3.5], [4, 4.0], [5, 3.5], [6, 4.0], [7, 4.5], [8, 3.0], [9, 3.0], [10, 3.0], [11, 3.0]], "2020": [[0, 2.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.0], [5, 3.0], [6, 3.0], [7, 3.5], [8, 4.5], [9, 4.0], [10, 3.5], [11, 3.5]], "2018": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 2.5], [4, 2.5], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.5], [9, 3.5], [10, 3.5], [11, 3.0]], "2021": [[0, 4.0], [1, 4.0]]}, "reviews": [{"text": "My first time eating here.  I didn&amp;#39;t give a five star because of the green beans and bread. After we arrived we were seated immediately.  Our waiter was so kind and accommodating.  He brought us some bread; however, the sourdough crust was extremely hard, I asked him, &amp;#34;Is it supposed to be this hard?&amp;#34;  He said, &amp;#34;Yes,&amp;#34; but happily brought us some more warmed.  I got the herb crusted chicken with mashed potatoes and green beans.  The green beans were not cooked. I had to send them back, but they still weren&amp;#39;t cooked, they squeaked when I tried to chew them, they were very disappointing.  Now, the chicken and potatoes I give a 100,  complements to the chef.", "rating": 4, "date": "9/25/2020"}, {"text": "great place to eat. Food was exactly how we wanted. Made reservations and no problems getting our table.", "rating": 5, "date": "12/25/2020"}, {"text": "Scrumptious cheesecake, fabulous decor, amazing service, enormous amount of food and great company is the Cheese Cake Factory.<br&gt;<br&gt;This is my first visit to the location at Fhe Summit in Birmingham and it didn&amp;#39;t disappoint.<br&gt;<br&gt;My sis and I were in town for business and decided to enjoy the afternoon, in no hurry. <br&gt;<br&gt;We don&amp;#39;t usually get and appetizer because the servings are so large but decided to go for it. The eggroll sampler were very good. There was a different sauce for each one. They were crispy and full of flavor.<br&gt;<br&gt;My sis got the burrito was was big enough for 4 people. She thoroughly enjoyed it and packaged the rest to go.<br&gt;<br&gt;I ordered the Shepherds pie and it was outstanding!!! The consistency was of beef stuff with huge chunks of sirloin burger, huge chunks.  The mashed potatoes on top were from scratch. The bounty of potatoes carefully placed on top of the meat sauce, was the best I&amp;#39;ve had ever. I ate 1/4, it was savory and the serving was enough for 2 hungry people who didn&amp;#39;t plan on getting dessert. But hey it&amp;#39;s the Cheese Cake Factory not the Shepherds pie Factory.<br&gt;<br&gt;On to dessert, my sis got the Lemonchello Creme Torte with strawberries, so good. I got the white chocolate macadamia nut cheese cake and let me tell you it was so good.<br&gt;<br&gt;Great food, great service and a week worth of double workouts at the gym, and green smoothies for a month was well worth it. <br&gt;<br&gt;See ya next year Cheese Cake Factory, it&amp;#39;s was good seeing you again.", "rating": 5, "date": "7/23/2019"}, {"text": "Love, Love, Love me some Cheesecake Factory. I celebrated my 25th birthday there this past Sunday and they accommodated my party very well. I really wish they did reservations on the weekend; nevertheless, I got there early enough to get the desired wait time to put my party being seated at the time I wanted. <br&gt;<br&gt;This isn&amp;#39;t the first time I&amp;#39;ve been here of course; but, I always get the Chicken and Biscuits because that is my go-to meal and OREO DREAM EXTREME CHEESECAKE (the best cheesecake in my opinion). Sometimes, if I&amp;#39;m having a bad day...I&amp;#39;ll drive from Tuscaloosa just to get cheesecake and wine. <br&gt;<br&gt;I love the atmosphere and the staff is always so friendly. <br&gt;<br&gt;I will be back, as always because my life is sometimes incomplete without cheesecake.", "rating": 5, "date": "7/30/2019"}, {"text": "We visited Birmingham back in October for the Magic City Classic with my wife&amp;#39;s family. Before I went plant-based, The Cheesecake Factory was one of to go places back in Maryland. Since going Plant-Based 2 years ago, I have not gone to a Cheesecake Factory but my wife&amp;#39;s family was in the mood so we went. I was happy to see a veggie burger and the Impossible Burger served. I went with the Impossible burger with fries and this was possibly the best Impossible Burger I have had to date. It was so juicy and filling. I let my mother-in-law try it and she enjoyed it as this was her first time trying the Impossible Burger. The service was good and the wait not too bad for a busy Saturday night. It was great having Vegan Plant Based options even at The Cheesecake Factory in Birmingham, Alabama!", "rating": 4, "date": "12/6/2019"}, {"text": "First of all &amp;#34;wow&amp;#34; the menu is a booklet long which worried me that a lot  can sometimes be too much to keep up and create a flavorful dish. But overall all the dishes that were order have been delicious. I got the  pasta dish while my husband got a taco dish which I don&amp;#39;t recall the names. The warm bread is so good especially the brown one with butter which just feels like it dissolves right in my mouth. So for the cheesecake you can&amp;#39;t go wrong with any and I tasted quite a few, and so far my favorite are red velvet and carrot. <br&gt;<br&gt;So I will definitely come back to try more dishes and especially their cheesecake!", "rating": 5, "date": "7/14/2019"}, {"text": "Always a good go to when you want a variety of options. The wait of course  is usually long, especially in weekends. When you have a small party the bar and high tops in the bar area are first come first serve, so grab one  and be seated faster. Portions are large. If you don&amp;#39;t share a meal one option is that you can order lunch portions until 5:00, even on weekends. Another option is to order from the kids menu, they allow grown ups to do that. My all time favorite entree is the crusted chicken Romano. It is a pasta dish with Parmesan crusted chicken breasts that comes with a red marinara sauce. If you want to make it even better  ask for the white sauce and red sauce in the side  and mix the two yourself, it&amp;#39;s delicious!!! Of course the cheesecake is phenomenal if it&amp;#39;s your thing.", "rating": 4, "date": "2/1/2020"}, {"text": "lol after being unable to eat here for a birthday dinner due to their hostess&amp;#39;s behavior, we grabbed cheesecake to go - and found out when we went to celebrate that it was the wrong cheesecake (conveniently one that cost more!) and it was frozen", "rating": 1, "date": "11/2/2020"}, {"text": "Cheesecake factory is always amazing. The service is always amazing. I really like the fact that they accept reservations through Yelp now so if you plan on going especially on the weekend I suggest you use Yelp to make a reservation.", "rating": 5, "date": "7/27/2020"}, {"text": "We always find time to dine at The Cheesecake Factory when we are in town for baseball. It never disappoints. The food was once again delicious. This was our first visit since the COVID pandemic and social distancing restrictions so we were unsure of what to expect. Our wait time was actually less than we thought and the service was exceptional. Our waitress was Gabby and she did a phenomenal job. She was very courteous and professional and didn&amp;#39;t miss a beat with our orders, refills, extra dressings and sauces or anything else. Unfortunately, masking takes away some of the human interaction but it was evident that Gabby had a smile underneath the mask. We will continue our CF tradition when we return.", "rating": 5, "date": "6/16/2020"}, {"text": "A+ for greeting these weary travelers with a smile, 40 minutes before closing, on a Monday night.  David was an excellent waiter!<br&gt;Posted calories changed my mind as to what I was going to order!  At Cheesecake Factory, I looked at calorie count, not price.  This restaurant chain does an excellent job of informing their customers of meal calories. <br&gt;I ordered the steamed Edamame, 100 calories, $5.95<br&gt;Hubs ordered the Classic Burger, 1340 calories,  $14.50 - Chop house burger with lettuce onion tomato and fries<br&gt;My son ordered the Old Fashioned burger, 990 calories, $13.50  and fries. Additionally,  a piece of <br&gt; Cinnabon Cinnamon Swirl Cheesecake  with vanilla crunch cake topped with cream cheese frosting and caramel.<br&gt;Hubs hamburger was cooked perfectly, but my son&amp;#39;s was dry. All in all, a very pleasant experience!", "rating": 5, "date": "3/4/2019"}, {"text": "Over charged for food that was not cooked properly. Pasta stuck together. Salad served in hot bowl. Steak so chewy it was inedible. But the cheesecake was good as always", "rating": 2, "date": "10/17/2020"}, {"text": "Our experience was fantastic!! Thanks to the best bartender/servers in Alabama... Krystal and Robin. When we first arrived, the meal and female host were rather rude and lacked personality. However, Krystal and Robin saved us. Their hospitality was above and beyond. I recommend the Crab &amp;amp; Artichoke Dip or the Pot Stickers for an appetizer. Both packed flavor! Then the Chicken Madurai for an entree. The chicken was cooked perfectly and the sauce was text book perfect. Most importantly the Chocolate Chip Cookie Dough or Oreo Cheesecake!!! This location has the best food of any Cheesecake Factory I&amp;#39;ve visited thus far, and as long as, Krystal and Robin are working, I would say the same for the service. Thanks for saving dinner ladies!!!", "rating": 5, "date": "6/18/2020"}, {"text": "If you&amp;#39;re looking for a place to eat during lunch with a variety of options, this is he place to go. I was there around 2:00 p.m. thinking that the lunch crowd would be gone, but I was mistakenly wrong. The wait time for a table was 30-45 minutes, with very minimal standing room due to the crowd and the flow of people continuing to increase. <br&gt;<br&gt;Although the wait time was a negative, it was made up in the friendliness of the staff and promptness/correctness of our orders. We ordered fried macaroni cheese for our appetizer and it did not disappoint. The portion size was adequate and the presentation was nice. For the meals, I ordered the Louisiana chicken pasta and my guests ordered the four cheese pasta with steak. Everyone enjoyed their food and we were even happier to know that we could still order the lunch size portions after 2 p.m.", "rating": 4, "date": "3/16/2019"}, {"text": "This location was excellent. They did a great job of making sure all COVID-19 protocols were done. The food was excellent and we enjoyed the atmosphere. Numbers are spiking again but once we get back to normal we will definitely be going back.", "rating": 5, "date": "10/23/2020"}, {"text": "The Cheesecake Factory has never disappointed upon numerous visits.  The service is always great because the servers are personable.  The food is always great and made upon order.<br&gt;<br&gt;I like their food, but I love their desserts.  Every time I eat here, I like to order the strawberry shortcake.  If I can, I like to share it because I can never finish it due to its massive size.  The short cake consists of ice cream, strawberries, and biscuits with sugar sprinkled on top of the biscuits.  The biscuits are homemade and fall apart when you touch them.  The strawberries are always fresh  and it&amp;#39;s always just the right amount of ice cream.  That dish is addicting.  They also have an Oreo cheesecake that is to die for.  But this place has so many options for dessert that you&amp;#39;ll always leave sati", "rating": 5, "date": "8/10/2019"}, {"text": "We got here after the lunch rush. Pretty chill and we got a booth. <br&gt;<br&gt;Lunch special was still going on so I got the margarita pizza and salad. My friend got lettuce wraps. We still got bread sent to the table. I love their brown bread. <br&gt;<br&gt;We came here specifically for great food and to get our free slice of cheesecake.", "rating": 4, "date": "1/3/2019"}, {"text": "The food is great, however the host Chris is a jackass. His attitude is so disrespectful towards the customers, and for my mother to hear him say &amp;#34;this is why I hate old people&amp;#34; I can&amp;#39;t get over that. I refuse to eat at a restaurant that condone this type of behavior from their workers. Yesterday was her birthday and it was ruined because of his behavior and his comment. Management really needs to step in.", "rating": 1, "date": "12/24/2020"}, {"text": "Came here to celebrate our brother&amp;#39;s birthday. It was busy and so there was a wait, typical for cheesecake. The wait wasn&amp;#39;t that bad. However, service was incredibly slow! By the time our food came out we had filled up on bread. The server was nice.", "rating": 3, "date": "2/16/2020"}, {"text": "I generally have pleasant experiences when it comes to the Cheesecake Factory but this was not one of those times. In particular, the service was bad. The group of 3 I was a part of was greeted very nicely and that was probably the only thing that was nice about the service. <br&gt;<br&gt;After we were served our drinks, the waiter left to give us some time to look at our menus. However, our waiter literally took 15 minutes to come back to us. 2. My friend went to the restroom and disclosed that there were 2 employees on their phone in the bathroom.<br&gt;3. We had to ask our servicer three times to get more bread.  4. I asked for some BBQ sauce twice and never got it so I gave up trying. 5. We asked for our checks which took another 10-15min to get and our waiter took another 10ish min to come pick up the checks so we could pay and leave. Lastly, what is bad about all of this, it wasn&amp;#39;t even busy. Over half of the restaurant was empty so I&amp;#39;m not sure why there was such a delay in our service. There were 3 times, we asked another waiter for help or to get our waiter. The only reason I didn&amp;#39;t give this  Cheesecake Factory a one star is because the food was still good. So kudos to the Chef but the service was", "rating": 2, "date": "2/20/2020"}, {"text": "Quick and easy to access online ordering. The curbside pickup is quick and sufficient with ease of mind knowing I do not have to leave my vehicle.", "rating": 5, "date": "9/20/2020"}, {"text": "What&amp;#39;s not to like about the Cheesecake Factory? Why it has taken so long to review this place I have no idea. The food here is always fantastic, and has one of the largest menus I&amp;#39;ve ever seen for a restaurant-I love choices!!! <br&gt;<br&gt;Some of my personal favorites are the fried Mac n cheese balls, the Cajun pasta(I think it&amp;#39;s called Louisiana Chicken pasta), their burgers, and of course any of the cheesecakes. I&amp;#39;m not really a fan of the &amp;#34;skinny&amp;#34; cheesecakes, but other that you can&amp;#39;t go wrong. <br&gt;<br&gt;The service here is sometimes hit or miss, but the last couple of times here have been better. Expect a wait on the weekends, but know it&amp;#39;s worth it! I will definitely continue to come here for special occasions and whenever I am craving some awesome cheesecake. Don&amp;#39;t miss this staple up at the Summit!", "rating": 4, "date": "10/15/2018"}, {"text": "Any time a restaurant&amp;#39;s menu is the length of a novella, I have my doubts. I just don&amp;#39;t know that you can be that good at that many dishes.  And to be quite honest, many of Cheesecake Factory&amp;#39;s dishes are average to fine, but not phenomenal. The service is pretty top notch, however, and you can tell they pay attention to their customer service.  <br&gt;<br&gt;On this last visit, we ordered the avocado egg rolls. One thing to note is that all portion sizes at Cheesecake Factory are MASSIVE (another drawback, in my opinion), and the egg rolls were no different. They were quite tasty, and I would order them again. <br&gt;<br&gt;For my lunch I decided on the chopped salad. It was very heavy on the dressing, if I ordered it again I would get the dressing on the side. It was tasty, but due to the portion size I did not manage to finish it, and it was not the type of thing that would have kept well (avocado).  I hated to leave that much on the plate, but was absolutely stuffed and trying to save room for cheesecake. <br&gt;<br&gt;We indulged in the Caramel Turtle Cheesecake, which was very tasty. That&amp;#39;s one section of the menu I don&amp;#39;t mind being generous.  <br&gt;<br&gt;The service is very good here, but the parking can be a nightmare, especially at peak hours at the Summit.", "rating": 4, "date": "6/17/2019"}, {"text": "Very busy night. The weather was cool but not freezing. There was a wait if 45-50 minutes for parties of around 3 (which was us) and a 2 hour wait for parties with 5 or more. Geeesh. We were able to walk to some other shops while waiting to be buzzed for a table. We got buzzed at around the 35 minute mark. Nice booth seat out of the way. Seats were filthy and we had to clean them off ourselves. <br&gt;<br&gt;The bread eventually came when it was done baking. So it was soft and hot. I am not understanding for the life of me why places serve their butter ice cold. By the time you get done trying to forcefully spread it on the bread it&amp;#39;s not ok. The bread is smushed or  cold. <br&gt;<br&gt;I ordered the chicken picatta as it&amp;#39;s the only thing I ever order from here. Their menu is entirely too big and trying to decide on something new just isn&amp;#39;t worth it for me. I always order my picatta with extra sauce bcus the pasta always need it bcus of how it&amp;#39;s served. My chicken was tender. My pasta was cooked well and the sauce was delicious and had plenty of capers like I love. <br&gt;<br&gt;I also tried Kese&amp;#39;s Caesars salad and it was delicious. I normally don&amp;#39;t like them bcus of the lack of flavor but this one was delicious and dressed well. <br&gt;<br&gt;Kese and Kylah also tried and loved the raspberry lemonade. They literally had 4 glasses so I suggest giving that a try too lol. My sweet tea wasn&amp;#39;t disappointing either.", "rating": 5, "date": "11/19/2018"}, {"text": "First time at this location and first ever brunch at The Cheesecake Factory.<br&gt;<br&gt;Seated immediately. Server took drink order promptly.<br&gt;<br&gt;I chose the Fried Chicken and Waffles. Serving was a good blend of sweet and savory. Chicken was nice and crisp. Waffle was not as done as I prefer, too soft even before the syrup.<br&gt;<br&gt;Shortly after we arrived at 11, crowd started building and was packed with waiting parties by the time we finished and were leaving. So if you are coming for brunch get there by 11.", "rating": 4, "date": "11/11/2018"}, {"text": "Good menu variety - of course it is a chain, but the food taste better than the average chain to us.", "rating": 4, "date": "8/1/2020"}, {"text": "I&amp;#39;m usually not too into large fine dining chain restaurants but my parents were in town and wanted to eat here. We arrived and sat outside on their heated patio because there was no wait time for that. Service was very friendly but just a tad slow! No points off there though, our server was awesome. <br&gt;<br&gt;We started off with crab cakes and a mild guacamole and chips. The crab cakes were amazing, fried perfectly with a nice moist interior. The guac was good but I would suggest not getting mild because it was a little too bland but nevertheless still very good and well made.<br&gt;<br&gt;For our main courses, I had a gumbo with rice which was actually really nice on the cold night out on the patio. It had a hefty amount of protein and tasted great. I&amp;#39;m actually not sure what my mom ordered but it had some massive shrimp on it. Really the only reason I&amp;#39;m giving this place a 4 is because my dads New York strip steak came out well done when he ordered it medium. <br&gt;<br&gt;Although the steak was disappointing, everything else was on point and I would recommend giving this place a shot if you haven&amp;#39;t. They have a giant menu so you&amp;#39;re bound to find something you like!", "rating": 4, "date": "12/7/2018"}, {"text": "We have been to The Cheesecake Factory several times and I&amp;#39;ve always had a good visit, this one was as well! We placed reservations for 2 pm and showed up right on time. I would say the Hostesses were not very welcoming as all 3 of them were talking with a gentleman manager with glasses and I was finally acknowledged/greeted after they were done with there personal conversation. I would say it&amp;#39;s just common curtesy for at least one of the Hostesses to separate themselves from the conversation and greet the guest. After being seated, our experience was fabulous from start to finish. Our waiter was very attentive but not overbearing, had wonderful suggestions, knew the menu well (which is difficult I can imagine) and followed through with every request from start to finish. A++ for him! Our food was delish as well! We&amp;#39;ll be back sooner I promise, hopefully to some Hostesses with guest services in mind!", "rating": 4, "date": "11/15/2020"}, {"text": "Great food and  service. <br&gt;<br&gt;The Chicken Madeira and Steak Diane was awesome. Everyone was pleased. <br&gt;<br&gt;Scotch was excellent!<br&gt;<br&gt;Ashely our server was terrific!", "rating": 5, "date": "2/2/2020"}, {"text": "I hate to leave one star but honestly if I didn&amp;#39;t have to put one, I wouldn&amp;#39;t. This was my first time going last weekend and we had a reservation at 6pm. We get there at 5:45 and let them know we are there. We see other people waiting in this room, so we decide to get out of the way and wait in there also. A brown haired lady comes and rudely tells us that &amp;#34;we need to get out of that room&amp;#34;. We then heard her being rude to other people and started to feel very uncomfortable. Our table finally gets ready at 6:15 and for them to be at half capacity, the serves was extremely slow! We waited forever on refills. The silverware had spots on it and my fork was bent. I got the lasagna and it was horrible, my husbands had the pasta napoletana  which was also  horrible. We ordered cheesecake and it took 30 minutes just to get original cheesecake. Needless to say we were not impressed!", "rating": 1, "date": "7/15/2020"}, {"text": "Ok. This may be long. I have never been here, but have ALWAYS wanted to try it. I THOUGHT they were worthy of my 30th Birthday celebration...30!!...basically a major milestone. Went in, not much of a wait, waited about 10 minutes. Not bad. They had the Astros world series game on..major plus!! Loved it. Ordered a 9 oz glass of Pinot Grigio, not the best wine, but no complaints, honestly. We ordered an appetizer of edamame, because I can&amp;#39;t do without it if it&amp;#39;s on the menu. There was a little wait on the bread and app, but I was there for a good time, so the wait didn&amp;#39;t bother me. I ordered the shrimp scampi combination with steak Diane, which  COMES WITH A SIDE OF POTATOES. Look at their menu. The other people in my party ordered and we waited a while..no biggy. I had my big glass of wine, so I was good. I thought. The wait was really long, so we asked what was taking so long. They weren&amp;#39;t all that busy, I could see some open booths/tables. Our food finally arrived and I got JUST the shrimp scampi. (Remember, I ordered the combination with shrimp scampi and steak Diane WITH potatoes). So, I alerted the staff that my order was incorrect. The manager came over and said, no big deal, we&amp;#39;ll get the steak out to you and you can have te whole rest of shrimp scampi. That was nice. So, not too long later the manger, Jennifer, came out and slammed my plate on the table and said &amp;#34;here&amp;#39;s your steak and I gave you an order of potatoes in case you wanted those&amp;#34;. It honestly took a second to register, but EXCUSE ME, my original order CAME with potatoes. You didn&amp;#39;t do me a favor. Please refer to your menu regarding the combination of steak Diane and shrimp scampi, IT COMES WITH POTATOES. Anyways, I was mad after that and was ready to go. I&amp;#39;m sure the food was good, but literally packed it up in my to go box because I was livid. The only person saving this review from being 1 star is the ACTUAL waiter. He was nice and even asked if I wanted a to go cheesecake for my birthday. I wish I would have gotten his name, because he was amazing during this whole experience, it was the manager Jennifer that needs to be replaced ASAP. Don&amp;#39;t recommend.", "rating": 2, "date": "10/29/2019"}, {"text": "If you&amp;#39;ve been to a Cheesecake Factory before, this one is as good as they get around here. I&amp;#39;ve been here probably 8+ times and each time the food is delivered promptly, hot, and perfectly to our liking. The portions here are large, and are great for taking half home for another meal. They&amp;#39;ll even box it up for you afterwards!<br&gt;<br&gt;Highlights include any chicken and cream-based pasta dish, the Bang Bang Chicken &amp;amp; Shrimp, and the Parmesan Chicken &amp;#34;Pizza.&amp;#34; Oh, and the cheesecakes are outta this world, of course! The menu is like an encyclopedia of food, and every taste can be satiated here.", "rating": 5, "date": "4/20/2019"}, {"text": "Went for a late lunch on last Thursday. Wanted to sit on the patio and enjoy the beautiful weather and mild temps. Was told outdoor dining was closed but could not be given a reason. As it turned out many of the employees were apparently using it for a break area instead of allowing customers to access it. My wife asked for a Hurricane and even though they have a full bar and 2 bartenders the waitress returned stating &amp;#34;we can&amp;#39;t make those&amp;#34; again without being given a reason as to why. Ordered a domestics beer and was charged $6!!! $6 for a domestic beer is ridiculous!!! This place is overrated and I don&amp;#39;t plan to go back unless it&amp;#39;s someone else&amp;#39;s choice to go.", "rating": 1, "date": "5/30/2020"}, {"text": "Food is always trash. I met two girlfriends today to have drinks and ordered a salad. (They got my salad wrong) They didn&amp;#39;t have the appetizer my friends wanted so they just had drinks. One friend had three mimosas and a mix drink. Other friend had two glasses of wine. We sat outside and weren&amp;#39;t being loud or belligerent. I HAD TWO MIMOSAS and was cut off for what?? Bc we were there for a little over an hour and didn&amp;#39;t order a meal? Come on. We are big tippers and the waitress made a horrible judgement call. I will never go back. From one server to another... do better sis.", "rating": 2, "date": "10/5/2020"}, {"text": "This Cheesecake Factory is consistent with the others. So that&amp;#39;s a good thing. Our server was awesome. Very upbeat and friendly. <br&gt;<br&gt;I ordered the salmon off the skinny menu. It was really good! My husband got the chicken salad sandwich also off the same menu and he really liked his. Our daughter got the Asian salad off the regular menu. It was huge. It was more like a family sized salad!<br&gt;<br&gt;The night we came it was very busy but we were seated right away. We didn&amp;#39;t order any dessert but I&amp;#39;ve had the cheesecake here before and it is fabulous! Big enough for two.", "rating": 4, "date": "2/3/2018"}, {"text": "We love to bring our boys (11, 9, and 8) here when we&amp;#39;re in town. Great food, plenty of leftovers, and delicious cheesecake. Tonight, our server, Rusty, blew it out of the water! He is gregarious, knowledgable, and so helpful with explaining menu items. He made our experience FANTASTIC! Our youngest told me to tell you, &amp;#34;Rusty is the BEST server he has ever had!&amp;#34;", "rating": 5, "date": "10/16/2020"}, {"text": "Im usually a fan of cheesecake and have been many times..And i really wanted to give them a higher rating. However, they have gotten rid of my 3 favorite items on their menu: Endive Salad, Eggplant Parmesan and Chris&amp;#39; outrageous cheesecake..thank GOD they still have the Korean Fried Cauliflower which is a must have and is always delicious. Also got the fettuccine alfredo + mushrooms it was just okay..the cheese flavor wasnt as cheesy as i like. The service was really great though. Overall an average experience i hope they bring back some of the items or put some better vegetarian options on the menu soon!", "rating": 3, "date": "1/20/2019"}, {"text": "My food was delicious and packaged perfectly. This was the best to go order experience I&amp;#39;ve had since Covid-19.", "rating": 5, "date": "9/22/2020"}, {"text": "PERFECT. I come here so much and it&amp;#39;s usually hit or miss. Sometimes it&amp;#39;s perfect sometimes it&amp;#39;s terrible but I LOVE the salmon sooo much Im always willing to risk it. This experience was really nice . The only issue I had was they were so crowded we had to sit outside. They had heaters but it was still pretty cold. Also, I ordered two alcoholic beverages and the server brought me the wrong drinks twice. Other than that, my food was amazing. I ordered Herb crusted salmon and steak Diane.", "rating": 5, "date": "1/7/2019"}, {"text": "Great service and wonderful food. Very friendly and caring staff. Very pleased with our waiter, he made recommendations for a excellent dish.", "rating": 5, "date": "3/14/2020"}, {"text": "We made reservations online for a Saturday night.  We were planning on having multiple parties to celebrate my daughters birthday.  The manager called Saturday afternoon to confirm the reservations and let us know that they would do the best they could to seat the parties close together using the max allowance per table due to Covid restrictions.  We were seated on time and the birthday party was seated in two tables across the aisle from one another. All of the food was great.  The servers handled  one bill for the multiple tables without problems (our server was Ashley).  We ordered a whole cheesecake which was delivered to my daughter with a birthday song.  All in all we were pleasantly surprised at how smoothly it all went especially on a Saturday night.", "rating": 5, "date": "9/29/2020"}, {"text": "I stopped by for a quick afterwork meal with a friend I hadn&amp;#39;t seen in a while. The atmosphere was buzzing as usual. The service was prompt so no complaints there. The meal was just okay. It seemed as if everything had been prepared the day before and warmed over. Considering that, I did have room for key lime cheesecake, which was delicious!", "rating": 3, "date": "1/6/2019"}, {"text": "Service was great. Very cautious with Covid restrictions. Would definitely recommend. They are still offering the entire menu.", "rating": 5, "date": "10/3/2020"}, {"text": "Decided to order takeout for Mother&amp;#39;s Day and dine nearby overlooking the Hoover skyline.  The process to get your food was extremely poor. My husband went to check on our order 2 times and it couldn&amp;#39;t be found. We finally received the promised (per the website) text that our order was ready about 1 hour AFTER the estimated ready time.. Our dinner, all 3 &amp;#34;specialty meals&amp;#34; were cold, not even slightly warm. In addition, the requested dining utensils were not provided, not even napkins. I want the tip back that I prepaid....The time with my family was precious, but CF needs to step up in every aspect.", "rating": 1, "date": "5/11/2020"}, {"text": "Hi with my experience with this location it&amp;#39;s horrible<br&gt;James barret the &amp;#34; Manager&amp;#34; was such a rude to us<br&gt;The let as waiting to our food 1 hour and 49 min <br&gt;We just spoke with him we was so nice to him and he just left the Conversation and after this experience I am done with &amp;#34;the Cheesecake Factory at all <br&gt;I always feel that I need to take a day off to come here and eat , the waiting list so long and waiting for food it&amp;#39;s more 1 hour so any way thank you", "rating": 1, "date": "10/11/2019"}, {"text": "This place is always packed no matter what time you go. Went for brunch today which was great because you can order breakfast lunch and dinner if you like which is a plus. They have such a huge variety of food to choose from and the drink selection omg to die for. I got two cheesecake to go home but the cheesecake selection is unbelievable hint the word in the title of the restaurant. If you love variety and crowds then this is definitely the spot for you.", "rating": 4, "date": "3/9/2019"}, {"text": "Ordered a French Country salad, a drink, and two cheesecake slices through DoorDash. The order arrived missing one cheesecake, an incorrect drink, and a bare salad. I called Cheesecake Factory and spoke with the manager, who told me the &amp;#34;toppings were underneath the lettuce.&amp;#34; There were maybe two pieces of cut up asparagus, hardly any cheese and no pecans as described. I asked her about the missing cheesecake and she told me to reorder through DoorDash, but said I&amp;#39;d have to purchase a slice if I decided to come directly to the store instead. Extremely unsatisfied and will never order from here again.", "rating": 1, "date": "8/18/2019"}, {"text": "So who new that The Cheesecake Factory (TCF) had an happy hour??  Don&amp;#39;t answer because I&amp;#39;ll be upset that you didn&amp;#39;t share the information, so I&amp;#39;ll spill the beans. There&amp;#39;s a long list of happy hour items that are offered at a tremendous savings from their regular menu. Happy Hour is Monday-Friday 4pm to 6pm; regular hours Monday-Thursday 11am to 11pm; Friday 11am to 12:30am; Saturday 10am to 12:30am; Sunday 10am to 11pm; Saturday and Sunday brunch served from 10am to 2pm. <br&gt;<br&gt;Other than the happy hour, TCF has great regular menu items to choose from. The food is simply delicious. My favorites are The Teriyaki Chicken with broccoli and brown rice, Spicy Cashew Chicken with brown rice, Chicken Riesling, Cobb Salad (sub chicken with salmon), tired yet...? I could go on and on about the food items here. Brunch is also a great option at TCF. Btw, I sat at the bar...", "rating": 4, "date": "10/5/2017"}, {"text": "I&amp;#39;m not a fan of chain restaurants at all, but have found myself here many a times for family events/celebration. This particular location is really popular and crowded as it should be, however the service is extremely lacking. Food is usually pretty consistent, although I would advise against ordering steak here as it seems they&amp;#39;re unable to ever get it right. Servers here border on the line of being pretentious which always make for a nauseating dining experience. They probably only have a handful of decent waiters at best. My last experience dining here was a huge disappointment, more so than usual in regards to service. Based off of service alone, I wouldn&amp;#39;t really bother here again to be honest. It&amp;#39;s not like the food that serve is good enough to justify the terrible service.", "rating": 2, "date": "8/28/2018"}, {"text": "Our favorite place to eat when in Birmingham! The Red Velvet Cheesecake never disappoints!", "rating": 5, "date": "9/13/2020"}, {"text": "I really liked the Cheesecake Factory! We enjoyed our dinner here and I ordered the Bang Bang Chicken and Shrimp dish. It is a bit on the sweeter side but I&amp;#39;m more of a sweet and sour type of person so I was okay with it! May not be for someone who does not like sweet food. The menu has SOOOO many options! I was so overwhelmed but I loved how diverse it was. Perfect for groups and families who are picky!", "rating": 5, "date": "2/15/2019"}, {"text": "Great place to eat. You get your money&amp;#39;s worth. Cheesecake is always good. Never disappointed with the service nor meals.", "rating": 5, "date": "3/14/2020"}, {"text": "Food is always good. Host was a dingus. Waiter was great. Took my brother and mom to experience this for the first time. We were good little sheep with our face coverings and socially distant from any other party. Unfortunately that wasn&amp;#39;t enough when showing them the display case of assorted cakes.  We were asked to exit to the outside area and wait in the rain.  Don&amp;#39;t get me wrong, if there were signs or suggestions from staff on where to wait we would have followed the directions.  We weren&amp;#39;t the only ones so our misery had an audience. There was a side waiting area that was fine, just not advertised or recommended.  But hey, we&amp;#39;re all in this together, right?  Sure you betcha.", "rating": 4, "date": "8/12/2020"}, {"text": "Cheesecake Factory was excellent.  Waitress was very friendly and provided great service.  We had salmon, Greek Salad and Brussel sprouts.  We would definitely go again and order the same.  Very pleased with the experience.   Unfortunately, we did not get the dessert.  It will be on our list on our next visit.", "rating": 5, "date": "6/11/2019"}, {"text": "Always a wonderful time! I usually come to happy hour at least 2x a week. Half priced drinks and appetizers.. can&amp;#39;t beat it. I also enjoy coming to Sunday Brunch it is a must try.", "rating": 5, "date": "9/27/2018"}, {"text": "I have eaten at this quite a few times. It is one of my favorite restaurants. Unfortunately I do not go as often as I would like. The wait times can be torturous sometimes exceeding an hour on the weekends and holidays. So I often go on weeknights.<br&gt;Of the current appetizers I have had The Sliders and the Pot Stickers. Both were good. The sliders were good because the meat was fresh and they prepared it the way I like it med rare. When you order med rare you know when the meat is freshly ground and not frozen. The Pot Stickers filling was tasty a nice blend of meat and spices.<br&gt;My favorite salad is the Chinese Chicken Salad. I love the textural differences between crispy wonton and rice noodles and the lettuce green onions and the mandarin oranges. Top it off with their sweet plum dressing (I miss their Asian peanut dressing). I like to get my dressing on the side so I can control how much goes on it.<br&gt;The main courses are varied and many. Pastas, hamburgers, steaks, chops, seafood, Skinnylicious(Lite fare), salads, CF specialties, and &amp;#34;yes&amp;#34; you can get eggs and omelettes.<br&gt;The pastas are excellent just check them out. The pasta Neopoletano, Carbonara, Fettuccini Alfredo, and the list goes on and on. So many great pasta dishes. I&amp;#39;ve had most of them and they have always been delicious and the portions are nice. I always save half especially if I plan on cheesecake.<br&gt;The steaks and chops have always been fantastic and cooked to perfection. Usually I have the garlic mashed potatoes with a green veg such as asparagus, sauteed spinach, or broccoli. <br&gt;I&amp;#39;ll pass on the seafood. I just don&amp;#39;t like it.<br&gt;Now comes my favorite part, Dessert. I cant think of a better place for dessert.They have so many types of cheesecake. The cheesecakes are fantastic with over 32 at any given time you will find one you like. My favorites are the Ghiradelli Chocolate cheesecake, and the White chocolate Macadamia Nut.<br&gt;If your not feeling cheesecake then they also have their specialty deserts. Linda&amp;#39;s Rich Chocolate Cake ( you get a huge slice of cake with scoops of ice cream and whipped cream) If you want darker chocolate then the Black Out Cake is for you. They also serve an excellent apple walnut crisp with ice cream.", "rating": 4, "date": "5/4/2019"}, {"text": "If you&amp;#39;re indecisive, you may have some trouble with this menu! They have any and everything you could ever think of. With all of the choices in the world, I usually go for the Chipotle Chicken Pasta. Just the right amount of heat, creamy sauce, seasoned veggies and tortilla strips to top it off with a crunch. Ended with a slice of lemon meringue cheesecake that hit the spot.", "rating": 4, "date": "9/30/2018"}, {"text": "Unfortunately, I did get sick from this chicken. The very next morning I had to go to Urgent Care. They ended up giving me three different prescriptions. I wasn&amp;#39;t able to eat solid food for about four days. Beatrice, from the corporate office, called me about this incident. She was amazing! She was beyond nice and very apologetic about the Salmonella. She was also very concerned about my health and even offered to take care of my medical expenses. I really appreciate the follow up from the corporate office. This is definitely how you&amp;#39;re supposed to take care of your customers.", "rating": 2, "date": "8/29/2019"}, {"text": "I will never visit this location again.  The manager David was absolutely rude to me because I asked for an explanation of why I was given conflicting information regarding reservations for Christmas gatherings.  When I tried to ask a hostess who clearly told me they made reservations he told me not to talk to her and treated me like I was not a customer.   When I asked him to clarify their policy he said &amp;#34;it just depends&amp;#34;.  He got defensive because he couldn&amp;#39;t answer what &amp;#34;depended&amp;#34;. Later as we waited I tried to make small talk with the hostess and explain that I wasn&amp;#39;t upset with her but it just looked bad that one group the same size skipped us.  She understood but David came back over and told me not to talk to her as if I were a nuisance. Very disrespectful.  We felt unwelcome so we left.", "rating": 1, "date": "12/12/2019"}, {"text": "Visited the Cheesecake Factory today. Food was good as always. Menu is still overwhelming lol. <br&gt;I got the Chicken Bellagio, it was terrific. Followed that up with the lemon raspberry cheesecake, which Is my favorite. <br&gt;<br&gt;On the down side, the service was terrible this trip. Bread was behind and took about 20-30 min after being seated. Food wait was almost 50min, we had no silverware for 10 minutes after getting our food, there was a waiter change in the middle of all that, and then they disappeared for 20 min when we were ready to leave. So it was a Long trip. It was weird too because we went a 4pm. <br&gt;<br&gt;But I&amp;#39;m not holding a grudge this time because the food made up for it.", "rating": 3, "date": "6/12/2019"}, {"text": "This was probably one of the worst meals I&amp;#39;ve ever had in a Cheesecake Factory. Waited over an hour to receive cold food. We ordered one of the combination and the stake was flavored pretty good but the salmon was cold and overcooked. Our server was sweet but overwhelmed with too many tables in her section to give decent service. The manager was kind but not solution oriented. <br&gt;<br&gt;OAN: THE CHEESECAKE NEVER DISAPPOINTS!", "rating": 1, "date": "7/24/2019"}, {"text": "I&amp;#39;m here now treating my son&amp;#39;s father to a Fathers Day meal. He got the back Grilled rib-eye steak medium rare, we had to send it back because the steak was very salty. Also I got the Paste Carbonara and it&amp;#39;s horrible, the pasta wasn&amp;#39;t cooked well enough (too hard). I really hate that I spent my hard earn money on this meal today. My son&amp;#39;s sliders were awesome, hot and tender. At least he got to enjoy this meal.", "rating": 1, "date": "6/16/2019"}, {"text": "Love this place the only thing that I don&amp;#39;t like is the fact that this place does not take reservations during a holiday such as this.", "rating": 3, "date": "2/14/2020"}, {"text": "Great cheesecake hands down delicious and would recommend for everyone.(wouldn&amp;#39;t recommend Cookie dough) Although I came here for Chicken Taquitos and asked for no Onions to which I was Informed that they were premade for a fancy establishment who often prides themself  on the claim of being fresh this is absolutely unacceptable. I would personally only come here for cheesecake or pasta.", "rating": 2, "date": "2/1/2020"}, {"text": "Our server, Ashley, helped us find what to order by asking what we wanted. She showed us the best choices for our wants. <br&gt;The delivery times were spot on. Drinks were very fast, the entrees and dessert were each placed as previous item had been finished. <br&gt;The dessert was a suggestion by Ashley. She said it was one of her favorites. It is now one of our favorites.<br&gt;The check came promptly. Change was returned and we were off.<br&gt;The restaurant was spotlessly clean in all areas of the lobby and dining area, the noise level was below most places. The restrooms were clean and well stocked. They even smelled nice. The area outside and the parking lot were also well kept.<br&gt;The food was just too good. My fish and chips were too hot to eat. The fillets were meaty and thick. The batter outside just kind of slid apart. It was wonderfully paired with the unusual tarter sauce. (A wonderful surprise.) The chips and slaw were delicious too. <br&gt;Ashley had the chicken salad sandwich. She smiled the whole time she ate it. She only finished half and loved the rest before bedtime. <br&gt;We havent been loyal customers of TCF because it is hard for me to stand and wait.  We have learned that 3pm is the best for us. We will return soon.", "rating": 5, "date": "1/31/2020"}, {"text": "Service was fantastic. Drinks were delicious and came out quickly. The food however was very salty. My husband and I both ordered the same dish but the appetizer was also super salty as well. The chocolate cherry cheesecake was by far the best flavor I&amp;#39;ve ever tried in all my trips.", "rating": 4, "date": "7/29/2020"}, {"text": "absolutely delicious! I ordered Avocado toast and I had the Eggplant Parmesan! They were both extremely flavorful and the service was a prompt and very nice!", "rating": 5, "date": "6/25/2018"}, {"text": "Tried to place a to-go order for lunch and literally sat on the phone for 30min. By that time I did not want the food anymore and I took my business somewhere else. It&amp;#39;s really frustrating and sad that somebody can&amp;#39;t even answer the phone. They need better service.", "rating": 1, "date": "9/25/2019"}, {"text": "If you have a Large group with lots of different tastes interest, this is the place for you! Their large menu cAn please everyone. We love comIng for birthdays and other special events so we can take cheesecake home for dessert.", "rating": 5, "date": "1/16/2020"}, {"text": "We had an amazing anniversary dinner with my hubby! 20 years and counting. Service was exceptional", "rating": 5, "date": "7/17/2020"}, {"text": "They have such a huge menu, but I always tend to order the pasta napoletana. It&amp;#39;s sooooo yummy, and I always have leftovers! My friend and I came here on a Friday night around 7, and we were promptly seated, much to our surprise. I think it might be because it was raining outside. Our waiter, Ashley, was awesome! Super friendly and super helpful! I can always count on a nice dining experience at Cheesecake.", "rating": 4, "date": "8/23/2018"}, {"text": "HORRIBLE!!!! If I could give 0 stars, I would. The service was a nightmare. After waiting over an hour to be seated. Nothing came out complete or timely. We had a party with 6 kids, who sat for over another hour without ever receiving their food. I never received my food either. Not only that, they took 45 minutes to turn on the heaters outside. The server packages the food to where it was all spilled and knocked over. I can&amp;#39;t believe the poor service that this location offered. The manager made nothing but excuses for why we had to wait so long; when the other half off our neighboring party had not only eaten but had their food packed up from leftovers. I am utterly disgusted with everything about how this location handled everything.", "rating": 1, "date": "3/9/2019"}, {"text": "The Cheesecake Factory has gReat food. I love their Hawaiian Salad. The only thing I do not like is there high prices. Because of the cost involved as a Middle Class Family, we can only choose to eat here on a birthday or anniversary, so no more than two times per year, or none for one or two years while eating at other places that has great food at a much more reasonable price.", "rating": 4, "date": "2/1/2020"}, {"text": "If you want to pay $20 for some soggy and cold french fries, look no further! Due to covid, the only service currently offered is curbside pickup. When you place your order online you&amp;#39;re given a time that your food should be ready. Be prepared to wait at least an hour longer than the time given to you for your food. I ordered the bacon burger with fries. When I opened the box, my fries were cold and soggy, and my burger was barley warm. Go to damn Burger King and get 10 bacon burgers for $20. If I could give no stars, I would.", "rating": 1, "date": "5/1/2020"}, {"text": "I know..I know...it&amp;#39;s JUST The Cheesecake Factory. Don&amp;#39;t judge me. This review is solely on the exceptional service my friends &amp;amp; I always experience during happy hour.<br&gt;<br&gt;As fellow Yelpers have stated this is definitely a great place for happy hour. Great value on food. Decent cocktails &amp;amp; beer. Wine selection could for sure offer more options...<br&gt;But I won&amp;#39;t bore you with unnecessary details. The reason we always seem to find ourselves at this chain restaurant is due to two wonderful bartenders. Cici &amp;amp; James. <br&gt;<br&gt;Very attentive &amp;amp; usually can anticipate what you may need before you say it. They ensure that our orders are correct &amp;amp; definitely know how to fix a decent drink.<br&gt;<br&gt;So, I&amp;#39;ll continue to be loyal...as long as they&amp;#39;re around :) They deserve all of my business!", "rating": 4, "date": "2/10/2017"}, {"text": "My passion fruit margarita that was served in a martini glass was delicious. It is now going to be one of my favorite drinks here. I ordered the Tex next eggrolls to eat and they were not as good as the last time I had them. They were a little salty and were a little bit too crispy. With so many menu options I am sure I will find something else to try next time.", "rating": 4, "date": "6/18/2018"}, {"text": "Not the best service but food was amazing. Waiting at the to go counter makes you feel as though you&amp;#39;re bothering the staff. The women preparing cheesecake never acknowledged the line of people waiting and the gentleman taking the orders continued his conversations despite the long line of hungry guest waiting to order. The hostess was also not the most pleasant and it was a very disappointing visit.", "rating": 4, "date": "3/6/2019"}, {"text": "Yummy food, fun atmosphere, and a beautiful bar.  Unfortunately we did not take advantage of the bar (we were traveling through).  The place was booming but the staff was efficient and everything moved like a well oiled machine. <br&gt;<br&gt;Incase you have not been here, the menu is large and everything is great.  Of course they are known for their dessert.", "rating": 4, "date": "6/8/2018"}, {"text": "If you want to wait a long time for cold food this place is for you! Many people waiting at pickup had issues with their orders either missing items or cold. I really hope they take more pride in their customer service but time and time again they disappoint.", "rating": 2, "date": "7/2/2020"}, {"text": "Suzy and I went there last nite. We sat at he bar area. We had a waitress tell us it is okay to eat there. She brought me a drink, and said that the wife&amp;#39;s water was coming. She got bread, no plates, knives ,or forks. She say-&amp;#34; I will be right back&amp;#34; . Okay right back. <br&gt;Then as many servers do, she stopped at every table to leave a check, take orders, remove plates.<br&gt;At that point I got up and got my own utensils. No one noticed. When the waitress returned in a few minutes, I told her we were not happy with bad service, and were leaving. <br&gt;<br&gt;It seems that the management could train better, or perhaps, hire more servers. They charge enough to pay them.<br&gt; I guess I should know better than to go to a place with 100 items on the menu.<br&gt; The management is NON- EXISTENT!", "rating": 2, "date": "3/29/2019"}, {"text": "Never, ever again! I get we are all living a new normal, but today was off the charts poor service and communication. Two hours after placing my online order of a southwestern salad and two slices of cheese (one for my son, not both for me), I received a text that my order was ready. No where in the confirmation email was I told there would be a delay. The letter stated to go to the bakery counter upon arrival. Only when arriving on time were we told to park the car and wait for a text. An hour after that, we asked about our order. We were again told to go back to our car and wait for the text. We went home. The original order was placed at 1:45, we received THE TEXT at3:45. The text said to let them know when we got there. At 4:00 I told them I was there. At 4:15 I went inside to find my food. I got back into my car at 4:30. Three hours from when I placed my order, I was finally home with my food. Three hours! Most of the staff was nice, but there was one guy, I am assuming a manager, he didn&amp;#39;t have a nametag on, was so short and sarcastic with me, I would have cancelled my order if I could have figured out how. The salad was awful, so much lettuce and so little of any other ingredients. The Red Velvet Cheesecake was devine as usual, thus the 3 stars. <br&gt;<br&gt;I received a message from the company about my review. I want to note that I DID try to comment on the website first. It gave me a bunch of error messages. Must have been overloaded with complaints that day. It worked this morning.", "rating": 3, "date": "5/12/2020"}, {"text": "Visited during the snowstorm of 2017. Had a super friendly waitress who provided great service and a few laughs.<br&gt;<br&gt;I always seem to order the same thing, chicken and shrimp jambalaya with an extra side of sauce. This jambalaya differs because they use pasta instead of  traditional rice but it&amp;#39;s delicious either way.<br&gt;<br&gt;The entree is about $20, bit pricey but a very large portion that always leaves me with leftovers. <br&gt;<br&gt;-----4/13/17<br&gt;<br&gt;Visited for a quick slice of cheesecake. Nearly $9 for one slice of cheesecake. Although it is very tasty that the cost of an entree at other places.<br&gt;<br&gt;Pleasant staff and large variety! A bit busy after 6pm during the week", "rating": 5, "date": "4/13/2017"}, {"text": "I&amp;#39;m pretty sure everyone and their mother has gone to a Cheesecake Factory at least one time. <br&gt;<br&gt;Over the years, I&amp;#39;ve noticed that the quality at this one has gone downhill. There have been tweaks to the menu, lower quality produce, and the food itself has gotten worse. Today, I got the white chicken chili, which I&amp;#39;ve gotten before. It was not nearly as good as it had been before. The chili lacked depth in flavor, and the salsa did an okay job at complimenting it. I ended up adding tabasco to give it some lift. <br&gt;<br&gt;As usual, the service was good. Also, the other dishes that my family ordered turned out much better than mine did. <br&gt;<br&gt;*Side note: bring a light jacket if you&amp;#39;re not a fan of the cold. Other customers were complaining about this, but I was fine.", "rating": 2, "date": "7/23/2018"}, {"text": "This is your typical Cheesecake Factory. Always a consistently good meal. I do think that they&amp;#39;ve gone up a dollar or two in their prices. I couldn&amp;#39;t believe that I paid $30 for 2 mixed drinks, don&amp;#39;t think I&amp;#39;ll be doing that again!", "rating": 4, "date": "12/17/2018"}, {"text": "Okay love this place and it has been awhile since I last visited. Today was the day and I wasn&amp;#39;t alone. My mom treated me and it&amp;#39;s also her fav place. She spent 30+ yrs in Brooklyn NY and has a healthy love affair with cheesecake ever since. However today&amp;#39;s service and food was just horrible. Yes, the manager comp one of the three meals but I had to say something. The waitress left us after serving drinks which took over 20 minutes to receive even longer for bread even after I informed the waitress that my had surgery and had nothing to since the afternoon before. <br&gt;<br&gt;The manger (she was the afternoon manager. The current one on duty at the time didn&amp;#39;t bother to come by our table) in formed me the waitress had an emergency that caused her to leave. Someone sent a a waitress over to the table beside us but not ours. I had to flag a random waitress down just to get our food. We didn&amp;#39;t get our food for almost an hour after. The manager instead of addressing the issue of no service simply chose to defend the food runners food time which, maybe true but the former waitress never put the order in. <br&gt;<br&gt;I&amp;#39;m just so disappointed and was my 73 year old mother who mostly will not return, well maybe just for the cheesecake via take out!", "rating": 2, "date": "3/12/2019"}, {"text": "If you are a local to Birmingham, you have probably tried this place. I&amp;#39;ve tried it a few times, but hadn&amp;#39;t been back in about two years. My boss decided to bring us here for our Christmas Eve lunch. <br&gt;Surprisingly the restaurant was not very busy, but the service was still very slow. Our server was very friendly, but she wasn&amp;#39;t very attentive, especially seeing how they weren&amp;#39;t very busy. To start we ordered the avocado rolls and calamari, which took a long time to get, when we finally did get them, we found a very long hair in the calamari. My boss was especially upset about that. We sent it back and our server said she would get some fresh calamari out to us as soon as possible. The avocado rolls were delicious, I had the Santa Fe Salad and my boss had steak, which were both delicious. Our calamari never made it back to our table though. As a matter of fact, after our food was delivered, we were only checked on once. Then the bill came and we noticed we were still charged for the calamari. Needless to say, it was not a great visit. I doubt we will be back any time soon.", "rating": 2, "date": "12/26/2018"}, {"text": "This place is always super busy but the food was always pretty good and even with it being hard to get into and find a seat and get waited on, we still went from time to time and it was always a good experience. <br&gt;This time it was a week day afternoon and we were in the area and decided to stop by and get a quick bite to eat. We did this because it wasn&amp;#39;t busy. <br&gt;This was a terrible mistake!<br&gt;We ordered a glass of wine, entree and dessert with coffee. We received the dessert first, the glass of wine came later and was warm after sitting on the bar for sometime. <br&gt;I had to ask the waiter why dessert came before the entree and he indignantly told me that is how it was and got the manager who apologized for all of the confusion. After that the manager finally brought the entree. I had to ask for the coffee which finally came after everything else. <br&gt;The waiter was a young man. I don&amp;#39;t blame him for any of this, he obviously was not trained properly and wasn&amp;#39;t even aware of the havoc he caused. I think at the end of all of this he probably thinks I was just a grumpy old white man that didn&amp;#39;t much care for him. What a terrible experience and I never want to go back again. <br&gt;The manager did comp the food but charged us for a glass of wine which  was $14. We left a $20 bill on the table and left. The people that manage this place should know better and do better. <br&gt;I&amp;#39;m done with them. After all of this I feel sick to my stomach.", "rating": 1, "date": "11/26/2019"}, {"text": "The Cheesecake Factory is a great place to treat yourself or guests from out of town.  We took our granddaughter to lunch today.<br&gt;<br&gt;We were promptly seated and our waiter Dave appeared moments later.  He brought our drinks and bread with butter, a little extra you don&amp;#39;t want to miss.<br&gt;<br&gt;Our granddaughter ordered the orange chicken and pronounced it very good.  My wife and I shared crab cake bites, stuffed mushrooms and a great little salad from the light and small plate menu.  <br&gt;<br&gt;Of course we ordered cheese cake, one for our granddaughter and one to share. It was excellent.  It is not inexpensive, but good quality food and excellent service.", "rating": 5, "date": "5/23/2019"}, {"text": "My experiences here have ranged from high to low. I&amp;#39;ve had their pastas, Chinese dishes, and even one of their popular dishes, Chicken Madeira. I feel like the quality has consistently been going down for me. Wait times feel like they have increased (30 minutes this past visit), the food portions seem to have decreased, and the food comes out cold even after 30 minutes of waiting. <br&gt;<br&gt;Besides their entrees, the cheesecake is still delicious! I ordered a strawberry cheesecake that did its purpose and got that cheesecake craving out of the way. I would&amp;#39;ve enjoyed it better had I not been hangry for a long part of the meal.<br&gt;<br&gt;I want to give this place a higher rating because it was one of my first favorites in Birmingham, but they seriously need to change the way they run things to warrant an upgrade.", "rating": 3, "date": "12/7/2018"}, {"text": "I fail to understand what the big fuss is about.<br&gt;Yes, they have a diverse menu, but the food, for me has just been ok.<br&gt;<br&gt;I ordered the avocado toast and requested egg on top--it was ok. Avocado egg rolls I thought a little soggy.<br&gt;<br&gt;I came for my birthday, and unfortunately they were out of the dessert I wanted.<br&gt;I opted instead for strawberry shortcake instead, which was ok, but the shortcake itself was rather disappointing and tough in texture.<br&gt;<br&gt;I will say they decorated the dessert really nice for my birthday--that was sweet.<br&gt;Would probably not return.", "rating": 3, "date": "9/16/2017"}, {"text": "First off our server was amazing so this has nothing to do with customer service. My friend and I come here many times for the happy hour and we usually always get the same things: Buffalo blast and nachos. We have always had a great experience until today. <br&gt;First buffalo blast: there was more gooey dough then there was chicken. But we dealt with it and just picked off the dough and ate the chicken   <br&gt;Now the nachos: the first platter we got the chips were great, but the shredded cheese was all clumped in the middle and barley melted. So we asked for another one. <br&gt;The second platter - half the chips were burnt black and the other half were undercooked and the chips when bitten were &amp;#34;pulley&amp;#34; they didn&amp;#39;t break like normal chips. And guess what. This time there was one a little shredded cheese on about three chips. Thankfully the manager had no issues with taking that off our bill. However the quality has declined quite a bit, and my friend and i are currently looking for a new happy hour spot.", "rating": 2, "date": "7/11/2019"}, {"text": "Cheesecake Factory may be a chain restaurant, but I love it. They have a large selection of foods from all kinds of different cuisines. So it&amp;#39;s a great place to go if a group of people cannot deicide which cuisine to go with. I love all their pasta dishes, but this time I chose to try the chicken  reisling. It was very good. The sauce was nice and creamy. The portion was enough to be two meals for me. I didn&amp;#39;t even have enough room for dessert. Great place!", "rating": 5, "date": "11/6/2018"}, {"text": "So I&amp;#39;ve visited this place several times and it&amp;#39;s always just so so and this visit was probably the worst visit ever besides the cheesecake it&amp;#39;s always great. <br&gt;<br&gt;I started with the Egg Roll sampler which included the Avocado, cheeseburger, Southwest and chicken taquito and The avocado and southwest was super good but the other 2 not so much. <br&gt;<br&gt;For our entree we tried the Bang Bang Chicken and shrimp.  I was totally against this dish and any other dish from here because I&amp;#39;ve never had a great entree at this place but we both agreed<br&gt;to share the $20 dollar plate of goulash. We were informed before we ordered that if we didn&amp;#39;t like coconut or curry that we wouldn&amp;#39;t like this and both of us love coconut and curry and this just taste like something very very weird. <br&gt; <br&gt;Now for the best part of the visit I had the Lemon raspberry cream cheesecake and I absolutely love it. It&amp;#39;s my favorite one because I just love the raspberry purée and the cake and the lemon cheesecake it&amp;#39;s all just so divine. <br&gt; <br&gt;I probably will just go in and pick up some cheesecake next time and save myself 50 bucks. Hey", "rating": 2, "date": "10/29/2018"}, {"text": "It&amp;#39;s it touristy, cheesy, a mall attraction, with a wait that takes forever? Yes it is all of that. I know that many of us try hard to avoid the typical chain restaurants that anchor a mall. Many people just walk in, order a slice of cheesecake to go and that was their experience. We&amp;#39;ve been known to do that as well. However, we really do like their food. This is one place where the menu literally has something for everyone in the family, and given the size of the menu, it should! I usually can&amp;#39;t get past the appetizers and a salad to create my meal since there are so many good things to choose from. I just have to be disciplined when I order. If I order an entree, then no appetizer as everything here is a massive portion. So my daughter and I usually share especially when we go here. We always order their avocado rolls which are amazing with thick chunks of avocado and vegetables wrapped in an egg roll wrapper and fried. We also ordered their Thai chicken wraps. This platter took up the majority of the table because it is so big. Bibb lettuce with chicken satay, cold noodles, pickled onions and cucumber and shredded carrots to top off your wrap and your choice of three sauces. Delicious. My husband ordered the crab bites which were very good and weren&amp;#39;t crammed with filler. I&amp;#39;m still not sure why, but we ordered an Asian chicken salad and it was really good. Everything on the salad was fresh and crisp and the chicken was steaming hot. Add three different flavors of cheesecake and we were deep into a food coma. So much food for only 3 people. <br&gt;We have yet to have a bad meal here. They are always consistent and the food is always good and a great value for the size of the portions. This is always a safe bet when you aren&amp;#39;t sure of what you want- Asian, Italian, Tex-mex, salads, a sandwich, great appetizers, you can&amp;#39;t go wrong.", "rating": 4, "date": "7/31/2018"}, {"text": "I think it is really passe to hate on The Cheesecake Factory.  It&amp;#39;s easy to ridicule the oafish masses who will wait in a line that stretches out the door for the chance to throw down $20 for a plate of fettuccine alfredo and wash it down with a 200-calorie strawberry lemonade (free refills!). <br&gt;<br&gt;But there is something charming and &amp;#34;just-feels-right&amp;#34; about sitting at the bar and enjoying a large draft beer (or hell, even a Long Island Iced Tea during happy hour) and relaxing for a bit.  The bartenders at this location are chipper, enthusiastic, and seem happy to be there - which you should be, too.<br&gt;<br&gt;I recommend skipping the Glamburger and everything else in that &amp;#34;War and Peace&amp;#34;-sized tome of a menu, but you can do far worse than grabbing a stool with someone special and having a Blue Moon and sharing a slice of that Tiramisu Cheesecake.<br&gt;<br&gt;The Cheesecake Factory is so massive, so gratuitously decorated, and so over-the-top, that when you&amp;#39;re here, everything seems right with the world.", "rating": 4, "date": "6/30/2018"}, {"text": "I don&amp;#39;t get the low scores on here.  There is a reason there is like an hour or more wait every time I come here.  I have always gotten great service and superior treatment by all of the staff on every visit I have had. <br&gt;<br&gt;I don&amp;#39;t come here often so I get the same thing every time I eat here.  I love the fried mac and cheese. I have had it at several other places and only one place has even come close. Every component of this dish is well done and they come together exactly as I would want it.  For my entree I get the Louisiana chicken pasta with extra sauce. Love it every time and left overs heat up to my liking too. I love dipping up that creamy sauce with bread.   My wife and I usually split a slice of cheesecake.  She likes it plain and I like it funky.  So, how do we split one?  Vanilla bean cheesecake with extra whip cream and a side of raspberry sauce. Those additions are just enough to make it dressed up for me while the simple straight up vanilla bean is just what my wife likes. <br&gt;<br&gt;I always have a good experience here and I know I will return.", "rating": 4, "date": "7/11/2017"}, {"text": "This place is the bomb! They have a never ending menu with options for everyone, they serve double portions so you&amp;#39;ll most likely be taking home enough for another meal. Save room for dessert! My go to dish is called Louisiana Chicken Pasta, try it! In all my years going here I&amp;#39;ve only had 2 bad experiences where one time the floor was too slippery to walk across &amp;amp; another time where I felt rushed by a waiter to leave because he was wanting to turn the table over for new customers.", "rating": 5, "date": "10/17/2018"}, {"text": "I absolutely loved this place. So did what looked like everyone in Birmingham. It was packed, but with great reason, the food was to die for. The service was excellent and when you taste the cheese cake you feel like you&amp;#39;ve died and gone to heaven. Can&amp;#39;t wait to go bakc", "rating": 5, "date": "10/20/2018"}, {"text": "Great FFF, consistently  satisfying. Service is good but could improve. I love the salmon with lemoN butter sauce, mashed potatoes, and asparagus! Go with the basic cheesecake with strawberries. Much better than the extravagant offerings.", "rating": 4, "date": "2/8/2020"}, {"text": "I remember how I visited Cheesecake Factory for first time in my life 8 years ago during my first trip to Bellevue, WA. Restaurant was dark with ambient lights around the columns, there was a huge showcase with dozens of cheesecakes, waiters have been literally running all the time, and restaurant was full with clients. I&amp;#39;ve ordered lunch version of Pasta da Vinci and was really impressed.<br&gt;<br&gt;Now, back to the latest visit. Yes, it was a different restaurant in a different city and state, but it is still the same restaurant chain with the same menu, so I can&amp;#39;t stop comparing it to my first experience.<br&gt;<br&gt;Restaurant was half empty, yet we weren&amp;#39;t allowed to seat were we wanted. We wanted to get smaller lunch portions, but they told us that they don&amp;#39;t serve lunch sizes in the evening anymore, so we had to order full-size dishes. I&amp;#39;ve chosen the same pasta da Vinci and stuffed mushrooms to share, my wife ordered a sandwich (don&amp;#39;t remember which one), and daughter got cheese pizza.<br&gt;<br&gt;Surprisingly, that pizza was the best thing on the table. Mushrooms were almost tasteless. Not sure what they have done to them, but it felt like I&amp;#39;m chewing a rubber. Sandwich was on the level of an average fast food on a gas station, but most disappointing was my pasta. Undercooked (no, it wasn&amp;#39;t al dente, it was really undercooked), with less than expected ingredients and weird taste. When I asked a waiter to put some cheese on it, he grated it with such enthusiasm so some of that cheese ended up on my pants and jacket. We also got couple of milkshakes afterwards, they were on a par with any fast food around.<br&gt;<br&gt;This is one of the worst experiences I ever had in a place that calls itself &amp;#34;restaurant&amp;#34;.", "rating": 1, "date": "6/7/2018"}, {"text": "First time to eat here,was delicious I had the shrimp with asparagus and angel hair pasta,it was so yummy,then had the chocolate cheesecake the 30th anniversary special,was the most wonderful cheesecake I have ever had,and our waiter was wonderful,will definitely return", "rating": 5, "date": "6/23/2018"}, {"text": "As always we love this place. I can not say anything bad from the service to the food. We make several trips a year to this place. :)", "rating": 5, "date": "7/10/2019"}, {"text": "Had a late dinner with my husband tonight. Our waiter Paul was the best waiter that I have ever had there. Austin thinks that he is the best waiter here but he can&amp;#39;t hold a candle to Paul. I had the Shrimp Scampi &amp;amp; Steak Diane Sautéed Shrimp with Whole Cloves of Garlic, White Wine, Fresh Basil and Tomato and Medallions of Certified Angus Beef Steak Covered with Black Peppercorns and a Rich Mushroom Wine Sauce served with Mashed Potatoes (a little cold).  My shrimp was not cook properly, therefore, Paul informed the manager and she got it taken care. <br&gt;<br&gt;My husband had the Lemon Herb Roasted Chicken which is a Half Chicken Served with Mashed Potatoes, Carrots and Watercress. Topped with a Light Lemon Garlic-Herb Sauce. <br&gt;<br&gt;Upon the next visit we will request to be seated wherever Paul is serving. He checked on us often and was very pleasant. He reminded me of how the servants were in Downton Abbey he was some how always there but, never in the way.<br&gt;<br&gt;When we received our bill we were surprised that the manager gave a complimentary strawberry cheesecake.", "rating": 4, "date": "6/10/2017"}, {"text": "Excellent. Food was very good and plentiful. I had the Louisiana chicken,   <br&gt; my wife had the pasta carbonara, my granddaughter had the fettuccine alfredo, my daughter had Renee&amp;#39;s special.<br&gt;<br&gt;Everyone was very pleased. The service was also excellent.", "rating": 5, "date": "5/19/2018"}, {"text": "The best place to have the best meal, can&amp;#39;t get enough, I really enjoyed their hamburgers and their chocolate tuxedo cheesecake.", "rating": 5, "date": "12/26/2018"}, {"text": "I placed an online order and when I arrived to pick it up, the girl at the counter was quite unfriendly. Once I paid and got my order, no sooner than I got to the car and realized I forgot my beverage. When I went back in, the girl at the counter argued about it not being on my order so, I offered to pull it up on my phone. She ended up going to get my beverage, but returned with a cup that was just over half full. At this point, I&amp;#39;m completely frustrated and no longer wanted to debate with her so I left. This place is either a hit or miss, it&amp;#39;s different every time and this visit was definitely a miss. I can recommend it because the food is usually pretty good, but the service is not that great.", "rating": 2, "date": "8/20/2018"}, {"text": "I had never been to the cheesecake factory before. The restrooms were DISGUSTING! My coworker and I went for dinner at 5:30<br&gt;. We didn&amp;#39;t leave until 8:30 because the service was so slow. Our server didn&amp;#39;t even greet us for a solid 10 mins after being sat. He forgot silverware multiple times. When I ordered a steak he didn&amp;#39;t bring a knife and they dropped my food off and it took another 5 mins to bring my coworkers chicken mediera. When he got it was cold and had been sitting... just sad service! The only good thing was the cheesecake...", "rating": 1, "date": "3/16/2017"}, {"text": "I come to this Cheesecake Factory everytime I am in Birmingham for work; about once a year.  Its on par with all other Cheesecake Factories I have visited, consistently good.  I like to have the spicy cashew chicken, which is tasty and huge.  I wouldnt describe it has overly spicy.  Here are some take aways:<br&gt;<br&gt;-Penny doesnt work here (she wouldnt be able to keep up with the pace at this resturant anyhow).<br&gt;-Usually there is a wait.  I tend to come early to avoid the crowds.<br&gt;-Parking is crazy busy in this shopping district.  I perfer to Uber to avoid it.<br&gt;-It tends to be noisy due to lots of people and high ceilings.<br&gt;-A lot of the tables share a common back bench, so don&amp;#39;t expect a private booth.  Not a problem if you a comfortable around people, but can be awkward if you are shy or smell funny.<br&gt;-Price point is on par for the amount of food you get and the quality of the restaurant.<br&gt;-Has outside seating available, but I have never used it.  Alabama has crazy rain storms, so I prefer not to take my chances.<br&gt;-If you have never been to a Cheesecake Factory, prepare yourself for a huge menu.  I love have so many options and I tend to check Yelp for ideas on what I should order.  Or I see the awesome stuff coming to other tables and just order that.", "rating": 5, "date": "6/1/2019"}, {"text": "Every time I come to Birmingham, I always get tot he Cheesecake Factory.  The service and food are always on point. I&amp;#39;ve never had to wait long and even this weekend with a huge softball tournament going on they are seating people quickly. <br&gt;<br&gt;Dinner or dessert only it&amp;#39;s always a great place and fantastic food.  You gotta try it if you haven&amp;#39;t !", "rating": 5, "date": "4/16/2017"}, {"text": "Didn&amp;#39;t even make it past the entryway. <br&gt;First of all the attitude of the greater sucked. I&amp;#39;m not even sure what you call the man behind the counter. Not a friendly face at all. I informed him that we needed a table for three plus two babies and it was all over his face that I was an inconvenience. Of course he hands me a buzzer and tells me 20 to 30 minute wait. Mind you there were open tables. Interesting! While waiting and deciding if we were even going to stay we heard a waiter or maybe bus boy spouting off at the mouth saying &amp;#34;I&amp;#39;m grown I ain&amp;#39;t gotta take that&amp;#34; blah blah blah attitude. I don&amp;#39;t know what is wrong with thier staff. We purchased a cheesecake to go at $30 only because it was for our 12 year old sons birthday. This is a chain restaurant with bad staff. Thier prices are high. The best best is to get your cake and go some where else for food.  It felt old in there too.", "rating": 1, "date": "4/5/2018"}, {"text": "The Cheesecake Factory is conveniently located at The Summit on 280. It&amp;#39;s a great place to stop by and grab a bite while you&amp;#39;re shopping (not on weekends... it&amp;#39;s usually a 45 min wait or longer). I&amp;#39;ve always had a positive experience at this location, so my mom and I decided to enjoy a late lunch here. The spinach dip was watery and not good at all. I would not recommend it. I ordered the Asian lettuce wraps and they were quite delicious! The chicken was slightly overcooked, but the freshness of the veggies made up for that. My mother had the chicken bellagio. She substituted angel hair pasta instead of the pasta it came with for no extra charge. We finished our afternoon with a slice of Reese&amp;#39;s and Chris&amp;#39; Outrageous Cheesecake. Both were great!", "rating": 3, "date": "3/11/2018"}, {"text": "This restaurant has the worst service.These idiots made me and my family and friends wait 1 hour and 35 mins when they told us 1 hour 15.This servive is trash.I hate this place.Dont go if u come with large group.These people are trash.Dont go here.These people need Jesus in there life.They have big mouths and there hairlines arent straight.Thats a no no.But anyways service is trash and sucks butt.DONT GO TO THIS TRASH PLAC.TRASH SERVICE", "rating": 1, "date": "6/15/2019"}, {"text": "Food, good. Service, good. Prices, a little high. I would not recommend this restaurant for seniors especially with ambulatory problems. There are only three handicap parking spaces, yet there are four take-out spaces near to the front door and four regular spaces between the take-out spaces and the front door. I counted 6 seniors with walking canes inside the restaurant.", "rating": 4, "date": "5/16/2019"}, {"text": "Chain restaurant with huge selection of food. Good part I guess is almost anyone can find something to eat here. Bad part is they don&amp;#39;t do anything very well. Only eat here for cheesecake.", "rating": 2, "date": "5/13/2019"}, {"text": "Met my mother here for dinner today.  We waited about 10 minutes to be seated. We started off with the Eggroll Sampler for our appetizer. The sampler comes with halves of Cuban egg roll (my favorite), Tex Mex egg roll, Avocado egg roll and Firecracker Salmon egg roll. Each roll is served with an accompanying sauce.  <br&gt;<br&gt;My mom ordered the Shrimp &amp;amp; Chicken Gumbo and I ordered the Tuscan Chicken (located in the Skinnylicious menu). I tried to lessen the caloric damage between the fried eggrolls and the highly anticipated cheesecake. Lol. The gumbo was amazing! I like that you can choose between white and brown rice. The dish had a great taste to it and the pieces of sausage gave it the perfect kick. <br&gt;<br&gt;The Tuscan Chicken has a variety of flavors. Very light tasting and easy on the calories. The chicken was a tad bit tough. My only major gripe about this dish is the balsamic vinaigrette is very pungent and overpowers the dish. I only tasted the balsamic in the tomatoes, which came in abundance, so I don&amp;#39;t know if they are marinated in the vinaigrette prior or what but I&amp;#39;m pretty sure my mouth puckered with every bite. Other than that the dish served its Mediterranean purpose (fresh basil, capers, farro, artichokes and etc) and it is definitely a fulfilling meal considering it&amp;#39;s less than 600 calories. <br&gt;<br&gt;Overall, we had a nice, pleasant dining experience. Our server&amp;#39;s name was John and he was awesome!", "rating": 4, "date": "10/10/2016"}, {"text": "Terrible. Terrible, unorganized and a chaotic mess. My husband and I won&amp;#39;t be eating here again. We ordered online thinking we could skip the usual ridiculous dinner rush. Wrong! We waited in line for over 30 minutes just to get to the counter where one girl, Kaitlyn, was running two registers by herself. When we finally were able to ask about our food, which had been sitting on the counter getting cold, there was no apology given and no kind of concern was shown. Our food was cold and no kind of compensation was offered. We left without taking our food which would have been cold and soggy. We were quite upset, mainly over wasting our time and the lack of customer service. If I could give it a negative star I would.", "rating": 1, "date": "1/5/2019"}, {"text": "Service - great loved my waitress <br&gt;Food - great, chicken was wonderful, and cooked great, banana cheesecake.<br&gt;Complains- men&amp;#39;s bathroom (for a place that has over 100 ppl in it, and only has 3 useable stalls)<br&gt;*up rated, due to them willing to listen to my review.", "rating": 5, "date": "8/5/2018"}, {"text": "So when it took an hour to get food<br&gt;I was ok with that <br&gt;When there were 5 minutes between plates coming out<br&gt;I was ok with that<br&gt;When spaghetti was served cold<br&gt;I was not ok with that<br&gt;When the chicken was tough dry with cold brown rice<br&gt;I was not good with that<br&gt;When the avocado turkey sandwich had no avocado <br&gt;I was not good with that <br&gt;When the on duty manager (patrica) came over to<br&gt;Explain that the reasons for the above was <br&gt;1 because we did not know how to order <br&gt;2 that a window in the kitchen was open and that cooled the food down<br&gt;3 it was the kitchen &amp;#39;s fault<br&gt;That was when  I knew that not only was the kitchen being run by idiots but that. The Cheesecake Factory recruits their managers from<br&gt;Closed gas stations<br&gt;<br&gt;So even a good gas station manager would offer to clean your windshield if they put water in your gas tank.  Pathica missed that day in managers school so for all our troubles we were told that she felt sure our next meal their would be better <br&gt;<br&gt;They are living on their name not their food", "rating": 1, "date": "12/26/2018"}, {"text": "In adequate parking, extremely long wait and slow service. Located on most congested part of summit.", "rating": 1, "date": "2/23/2019"}, {"text": "Very slow service! Came in with just one other person and it took us nearly 15 minutes to get water AFTER we were seated. Then we both ordered very simple cheesecakes and those took another 15 mins to come out. Server was very inattentive. AMAAAZZZIINNNGGGG Cheesecake like always. I&amp;#39;ve always loved this location, but it seems like the service is going down.", "rating": 2, "date": "5/12/2018"}, {"text": "On the day before school starts, I always take my daughters out to lunch and to an afternoon movie.  Yesterday, no one could agree where to eat and I chose the Cheesecake Factory because there was something for everyone. <br&gt;<br&gt;I had avocado toast (from the &amp;#34;Superfood&amp;#34; menu) and the Samosas from the &amp;#34;Small Plate&amp;#34; menu.  The trick, I think, with avocados is to be generous with seasonings, as they have such a mild flavor.  Sadly, CF didn&amp;#39;t really focus on seasoning, or texture.  The plate looked beautiful, with cherry tomatoes cut in half over the green mashed avocado, and artfully-placed radishes sprinkled over the concoction.  The toast underneath, however, was too thick and tough for an easy bite and the load of avocado mash on top tumbled off with each bite.  The Samosas were pretty nondescript - small and quite oily, with a strong curry powder flavor.<br&gt;<br&gt;Two of my daughters got burgers which were delicious - and fries that were the best.  We took home one entire burger.  My other daughter got the cup of homemade mushroom soup and the da Vinci pasta, both of which were good, if perhaps a bit over-salted.<br&gt;<br&gt;The tab came to almost $75, and with tip was $90.  Quite an expensive for a very average experience.", "rating": 3, "date": "8/12/2016"}, {"text": "The ambience alone will keep me coming back. Its always quite a treat to eat here, even if it&amp;#39;s just for drinks or dessert. Depending on what you order here, you can rack up quite a bill, so plan accordingly.<br&gt;<br&gt;I&amp;#39;ve tried quite a few dishes here over the years. From the Romano crusted chicken, to the Four Cheese Pasta , to an appetizer called Buffalo Blasts, I&amp;#39;ve never had a bad meal. Not spectacular either, but always good. Portion sizes often lead to to-go boxes. The servers are very knowledgeable about the menu and are ready to recommend a dish, appetizer or dessert at your request. The bar staff really know how to mix a great drink, especially for a not-so-frequent drinker like myself. <br&gt;<br&gt;If you&amp;#39;ve never been here, you should go. Treat yourself every once in awhile. You deserve it!", "rating": 4, "date": "7/9/2016"}, {"text": "This was the worst experience here I have ever had. We ordered tuna app - tuna had tints of grey ( which to me seems like it&amp;#39;s old) They tried to cover it with an excessive amount of sauce. <br&gt;<br&gt;My girlfriend ordered loaded potato bites and there were crab bites in it! Pray you don&amp;#39;t have shellfish allergies... <br&gt;I ordered lemon herb roasted chicken, which used to be a half chicken with bones. I got what looked like half a chicken run over by a truck with no bones. <br&gt;the manager did address our concerns and comped basically 60% of our tab in all fairness, but that isn&amp;#39;t the expectation for anyone going out to eat. <br&gt;<br&gt;This place has gone downhill substantially, and I wouldn&amp;#39;t recommend anyone go there.", "rating": 1, "date": "4/18/2019"}, {"text": "Really good food. Great ambiance. Grilled pork chops and apple sauce are my favorite their. But they the whole menu is loaded with good things to eat. Oh yeah do I need to mention they have a separate menu with nothing but cheesecakes I&amp;#39;ve never made it to the end.", "rating": 4, "date": "2/14/2018"}, {"text": "I decided to take my family out for dinner and this is where they wanted to go. Our wait wasn&amp;#39;t long. We arrived around 2pm and enjoyed the outside sitting area. Our waitress was very friendly and attentive to all 9 of us at the table. We started with the chicken dumplings and they were crispy on the outside and tender and full of flavor on the inside. The Asian sauce that paired with them put them over the top. We had a lot of different entres but the chicken madeira was the choice of half of our table. I tasted it and it was delicious. I ordered the shrimp scampi and added a little alfredo sauce and it was the best dish on the table. It paired very well with the wine sauce. <br&gt;Of course we all had various pieces of cheesecake for the finishing dish. We were all pleased and will be back.", "rating": 4, "date": "7/31/2016"}, {"text": "Four stars. Our waitress was great but the pasta was a little al dente for my taste. I ordered the pasta carbonara with chicken. We also had Evelyn&amp;#39;s Favorite Pasta (really good!) with chicken as well.<br&gt;<br&gt;My favorite app is the Buffalo Blast! It&amp;#39;s fried Buffalo chicken dip . It&amp;#39;s like it can straight from heaven and wham you are hooked! <br&gt;They have a huuuuggggeee menu! The great thing about this place is they have food for everyone. <br&gt;Cheesecake....  cheesecake... all the cheesecake.. glorious and you can just skip the food and head straight for dessert. My favorite is the peanut butter or the red velvet. <br&gt;They also have divine chocolate cheesecake options. Just go ahead and order a coffee with some baileys and relax in cheesecake heaven", "rating": 4, "date": "9/10/2016"}, {"text": "Well we got there right at 11 ( not crowded yet)<br&gt;It took 45 min to get a lunch size salad <br&gt;We waited and waited<br&gt;Asked waiter twice<br&gt;On second request after eating 3 loaves of bread<br&gt;She stated &amp;#34; the kitchen just started them - should be out soon&amp;#34;<br&gt;Really? How long does small salad take when your not crowded at 11am ????<br&gt;When they finally came out at 1150<br&gt;the waitress said we could talk w a manager and we said yes we want to but never brought him to our table <br&gt;Just gave us the check <br&gt;No manager was even present <br&gt;<br&gt;We expect more <br&gt;It&amp;#39;s a sala<br&gt;So I follow there response which was no help they should be calling me not me chasing them", "rating": 1, "date": "2/18/2019"}, {"text": "I placed an online order for curbside pickup to be ready by 2:06pm. I called the number when I arrived as instructed and waited several rings before someone answered and then waited 10 minutes for my order to come out. When the girl brought it she asked my name and what I ordered. it was now 2:26pm. Then told me she brought the wrong order. So she came back a few minutes later....and my food was cold and I wasn&amp;#39;t given any utensils. <br&gt;I would&amp;#39;ve gone inside to fix it but I needed to get back on the road for a 3 hour drive. I just wanted a nice meal. But I wasn&amp;#39;t in the mood to be held up any longer. And for the price this shouldn&amp;#39;t have happened. <br&gt;If you can&amp;#39;t handle curbside on a busy day the don&amp;#39;t offer it. <br&gt;Definitely not worth the $17.", "rating": 2, "date": "5/5/2019"}, {"text": "Our meal was great no issues at all. Even getting a high top at the bar on a busy Sunday night was easy. My issue is THAT THEY RAN OUT OF ICE CREAM!!!! How is this possible? They have a whole page dedicated to ice cream.... WTF?", "rating": 1, "date": "9/22/2019"}, {"text": "Went to the Cheesecake Factory this evening, waited 20 minutes before someone took our drink order, (not even our waiter), finally got our drink, appetizer and some bread.  About an hour and 10 minutes later, inquired about our meal, which was 2 chicken salad sandwiches and again waited 15 minutes more.  Finally, told our server, forget the food and to bring our check.  About 10 minutes later, she shows up with our food, we told her we didn&amp;#39;t want it and to bring our check.  Pretty pathetic for the Cheesecake Factory.  This appears to be a poor management issue.", "rating": 1, "date": "4/28/2019"}, {"text": "Its cheese cake factory... If you can&amp;#39;t find something to eat on their 15 page menu (exaggeration) then your not hungry. Cheesecake factory isn&amp;#39;t in my top 5 places to eat in Vegas. Its a ok fall back. I always find the restaurant very loud , I enjoy being able to hear the person talking across the table from me. The food is ok nothing to write home about. The cheesecake is good of course but most pieces will run you $9.00 each. The restaurant is in a very nice shopping area , great place to take a leisurely walk off those cheesecake calories.", "rating": 3, "date": "12/27/2018"}, {"text": "Went for a birthday dinner. The wait was long but expected. Once we were seated the real wait began. We waited for drinks, we waited to order , we waited on food and then we waited on cheesecake!  I will not go back. Bad service does not equate to good reviews. No communication from the staff, no explanation... only as we waited for cheesecake which we ordered so we could go home early- then we were told the bakery was behind", "rating": 1, "date": "9/21/2019"}, {"text": "We&amp;#39;ve been here a few times and it was pretty good this time it wasn&amp;#39;t all that great.  I got the spicy Shanghai Noodle which were good, but the wife got a honey Truffle chicken that didn&amp;#39;t taste a thing like honey. The truffle sauce tasted just like mineral oil.  We had three other people in our group that ordered the chicken and had the same experience.  Will not be ordering that again...but the cheese cake was good as always", "rating": 2, "date": "6/7/2018"}, {"text": "I think this is the smallest Cheesecake Factory that I&amp;#39;ve been to.  Such being the case, this place is packed to the brim (at least on Saturdays), so beware and plan accordingly. <br&gt;<br&gt;No reservations. <br&gt;Happy hour is M-F 4-6. $5 for a good variety of favorite appetizers (they&amp;#39;re the full size), and $5 for draft? And a good price for specific mixed drinks too. <br&gt;Bathrooms are clean! <br&gt;Food comes out quickly. <br&gt;They offer complimentary valet for patrons, so you don&amp;#39;t go driving in that huge lots for 20 mins!", "rating": 4, "date": "1/16/2016"}, {"text": "Today the service was so slow we couldn&amp;#39;t get refills. I ordered a cup of coffee and 20 mins later I got it this was long after we had finished our meal and was waiting on cheesecake to go. I was never offered a refill on coffee. My friend and I were talking so we were not really demanding. I did say to the waiter you need some help don&amp;#39;t you? He said oh no. The table next to us never got several things they ask for. The food was good but it is hard to overcome poor service. My two cheesecakes that I took home were not very good. The salted caramel tasted old for lack of a better word. This was my second trip and I don&amp;#39;t see a reason for a third.", "rating": 1, "date": "9/9/2019"}, {"text": "This is one of my favorite happy hour spots. The tex-mex egg rolls are bomb! The facility is nice, the wait staff is always kind and attentive.  Their brunch is really good. Hands down the best French toast ever. My husband likes the pot pie dish.. can&amp;#39;t reall the name. The kale salad is really good.", "rating": 4, "date": "11/30/2017"}, {"text": "This is my go to place when I&amp;#39;m indecisive about what to eat, but still want good food and/or dessert. Very diverse and delicious menu with even better dessert! Very nice staff and wonderful atmosphere. LOVE!!!!", "rating": 5, "date": "8/14/2017"}, {"text": "Good experience. Standard Cheesecake Factory experience except you will wait 30-1hr to be seated if you go during dinner. Other than that the experience is the same as it is at any other Cheesecake Factory. Staff is courteous and helpful. Huge variety of entrees as you would expect. I got the shepherds pie this time and was pleasantly surprised. Huge portion. Mash potatoes layered on top of the ground beef stew. Tasty and savory. Good for families. Hazelnut cheesecake was delicious.", "rating": 4, "date": "6/22/2018"}, {"text": "Sarah K. waited on my family of 6 this past Saturday. She did an excellent job!! We never once had to ask for refills as she kept our glasses full! Her knowledge of the menu was very impressive considering she mentioned she was a newer server! I would definitely request to sit in her section the next time I dine here!!", "rating": 5, "date": "7/23/2018"}, {"text": "Although the menu can be overwhelming, the food is always on point. There are a few items that are consistently sold out (samosas) but I guess that speaks to how good they are. Wait staff is friendly and professional.", "rating": 5, "date": "12/16/2018"}, {"text": "I am very disappointed in the meal I had at Cheesecake Factory. I ordered the Chicken Riesling. When my order was brought out it was the Chicken Picante instead. I said no I said Chicken Riesling. Ok so they remade it I guess and brought out what was suppose to be the correct order. First off I would like to say the noodles seem like frozen noodles based on the consistency. I looked over the ingredients of this dish and viewed pictures online and it looked delish. I tried to like it but the more I think about it the more upset I get. Frozen noodles, the bacon tasted and looked like bacos. It&amp;#39;s suppose to have onion in it but didn&amp;#39;t taste like it, and I didn&amp;#39;t see any maybe just onion powder? I wish I&amp;#39;d sent it back. I&amp;#39;m trying to like Cheese Cake Factory like I used to but all the dishes I order are just so bland. My daughters kids spaghetti wasn&amp;#39;t any better.", "rating": 1, "date": "7/7/2019"}, {"text": "Sooooooo YALLLL! I LOVE the Cheesecake Factory, HOWEVER... <br&gt;<br&gt;Our host was fucking rude as shit when we inquired about our wait time because we had been waiting 15 minutes longer than our expected wait time. When he sat us down he smirked at us and smacked the table with our menus and said &amp;#34;this table&amp;#34;,<br&gt;then came back to the table when he noticed my best friend moving some silverware on the table and a plate out of her way and said &amp;#34;do I need to take your silverware away?&amp;#34; As if we were about to harm someone with them. Please take note WE HAD NOT EVEN RECEIVED ANY FOOD YET. We clearly need the silverware. Then he turned to run off, and overheard me say that the wait time was poorly executed, and then turned back around to say, &amp;#34;I hope you notice you came to the Cheesecake Factory, one of the most popular restaurants in Birmingham, and so wait times can be long. I said &amp;#34;well,&amp;#34; and gestured my hand across the outdoor patio which is almost completely empty. He then says well the outdoor area &amp;#34;has to be set up due to not having a waitress in specific areas&amp;#34; even though there were already 3 tables with customers and a waitress already outside. He went-on and on about how it wasn&amp;#39;t his fault and then leaned down to the table and said &amp;#34; now let&amp;#39;s wrap up this theatre drama and pack it back up&amp;#34; <br&gt;<br&gt;To which i responded,&amp;#34; no theatre is awesome,&amp;#34; <br&gt;<br&gt;&amp;#34;Uh calm down thespian&amp;#34; he replied<br&gt;<br&gt;Now our waitress was EXTREMELY quick and very knowledgeable of the menu items and what they still had available. She was very kind and the food is always delicious! She provided GREAT customer service, something that host clearly needs some more training on. <br&gt;<br&gt;(EDIT): our server told us there was a huge party outside before we were seated bc of Florida evacuees, so the wait time was explained, but our host still should have updated us.", "rating": 1, "date": "10/10/2018"}, {"text": "I went today to the Cheesecake Factory for the first time and was very pleased! Our server was incredible and our meals were just as good! I got the Lemon-Basil shrimp and it was fantastic along with the low carb cheesecake with strawberries!", "rating": 5, "date": "11/3/2018"}, {"text": "Food was, as always, PERFECT! Never had an issue here! Great service, however I got the vibe that the waitress was trying to rush us out of the restaurant and boxed our cheesecakes when we exclaimed we wanted them right after our meal. Went on a Sunday around 3pm so I&amp;#39;m not sure what the rush was! Waitress was super sweet however. Of course will return", "rating": 4, "date": "11/30/2018"}, {"text": "My finance and I came to indulge in some desert after a lovely dinner at a nearby establishment. We arrived quite late but the cheese cake factory was still popping. We took a seat at the bar and were immediately greeted and provided a menu as request for some desert.<br&gt;<br&gt;Holey moley there are a lot of delicious options to choose from. My weakness for Carmel won and we ended up with a Carmel deluxe number. It was delicious just don&amp;#39;t look at the calorie count and enjoy the gluttony. <br&gt;<br&gt;The only disappointing thing was the lack of alcoholic desert drinks. The only option was add liquor to coffee which was alright but I would have thought there was something more. <br&gt;<br&gt;Overall great place to satisfy that sweet tooth. <br&gt;<br&gt;Till next time", "rating": 4, "date": "5/3/2017"}, {"text": "the food is mediocre &amp;amp; the service was awful. we had a party of 10 &amp;amp; it took 45 minutes just to get our drinks. one waitress was very helpful but the other had an awful attitude. very disappointed &amp;amp; probably will not be back", "rating": 1, "date": "1/27/2020"}, {"text": "I took my girlfriend here for her birthday and we were treated very kind, love this place! She also lives in the summit appartments and we order from here often, the wait is never long as far as pickup orders! We will continue to order from here for as long as she lives close by!", "rating": 5, "date": "1/17/2019"}, {"text": "Since they don&amp;#39;t always take reservations, you may have to prepare for a wait that could last up to an hour. The food is flavorful, savory, and most importantly- delicious! I honestly felt that the quality (and quantity) of food lived up to the price paid. On the down side, they&amp;#39;re tremendously busy, so you may be there waiting for awhile. So far, all the entrees Ive had lived up to the expectations I have set for this establishment. The cheesecake is absolutely phenomenal! Wish I snapped a picture... The environment is also very relaxing and sets a warm ambiance. They&amp;#39;ll definitely be seeing more of me, even if it&amp;#39;s just to pick up a slice of cheesecake!", "rating": 4, "date": "7/30/2017"}, {"text": "My husband I came here for our anniversary lunch yesterday. Our state doesn&amp;#39;t have a Cheesecake Factory anywhere so we always go when we are on vacation somewhere. I usually order the same thing since we don&amp;#39;t get to go often (can never go wrong with Oreo cheesecake). As always, the food was great and our server was fantastic as well. Will definitely be back at some point.", "rating": 5, "date": "7/19/2017"}, {"text": "Currently waiting for my online order of a single dish. Was supposed to be ready 20 minutes ago. Have called the curbside number twice. No one has brought out the food that I&amp;#39;ve already paid for. Starting to think they didn&amp;#39;t, and aren&amp;#39;t, going to make it. How can I get my money back?", "rating": 1, "date": "12/9/2018"}, {"text": "Good food even though it&amp;#39;s a chain restaurant. Plethora of options for carnivores and vegans alike. I like the Thai chicken wraps, their salads and brunch options.", "rating": 4, "date": "9/1/2018"}, {"text": "My wife and I went out with my daughter and her nieces and nephews.  I had the impossible burger (plant based) and my wife had the sweet corn tamale cakes, which were unbelievably tasty!  As vegans we always order from the plant based side of the menu, but this might&amp;#39;ve been the 1st time I had a burger that tastes like real meat -  Looking forward to my next visit.", "rating": 5, "date": "11/26/2018"}, {"text": "The Cheesecake Factory has a wealth of menu items for every eater. I enjoy their skinny menu items when I prefer a lighter meal. Their customer service is always top notch. The cheesecakes are delicious and plentiful. I always have a great experience dining here, just as I did today. The crab cake bites are delicious and their flatbread pizza is amazing! The only drawback is the excessive wait times depending on the time of day or weekend visits.", "rating": 4, "date": "7/3/2019"}, {"text": "They dropped a knife on my lap and my food was Awful! Also my fams food was bad and our waitress was really bad!", "rating": 1, "date": "7/2/2019"}, {"text": "The hostesses were less than friendly. When we asked about a reservation for our larger party, we were told they didn&amp;#39;t take reservations but they indeed do. However, it&amp;#39;s at their discretion on whom they decide to book reservations for during the week. The manager gave a less than truthful explanation to the selective reservation booking after we learned the truth from our waiter. Our waiter was great. Our food was ok but the cheeseburger order was less than great. When they had to add the cheese, the cheese was dipped in hot water, that&amp;#39;s clean might I add, them put on top of the burger. The whole process was explained again by our honest waiter. Not to cause a scene or a stir, we laughed and tried to enjoy the rest of our bad dinner. Needless to say, we won&amp;#39;t dine their again but the waiter receive a very nice tip for being honest the entire night. Thanks but no thanks", "rating": 3, "date": "11/20/2018"}, {"text": "Amazing meal. Fried zucchini is the best appiterzer ever.  I could make a meal off that.  The brown bread they bring out is wonderful. I just went with a sandwich and it was good, but the mahi mahi is my favorite. Got to have cheesecake if you go, not a fan of cheesecake, but i love it.", "rating": 5, "date": "11/16/2017"}, {"text": "Our church staff was in town for a conference and we wanted to go somewhere nice for our last meal before heading home. A couple of people suggested the cheesecake factory and that sounded good. I had not been to the cheesecake factory in several years so I had really forgotten about the extensive menu. When I called it was going to be an hour and a half wait for our group of eight so we split into two groups of four and was seated within 15 to 20 minutes.<br&gt;<br&gt;The restaurant was packed but still looked very clean. Everyone that we dealt with was very nice and extremely polite. Our waitress was Anna and she was really amazing.<br&gt;<br&gt;On the way to our table a waiter was walking by with two or three dishes that he was about to serve. One of those dishes caught my eye and I said that looks great I wonder what it is? He took the time to turn around and tell me the name of the dish and that&amp;#39;s exactly what I ordered. It was Chicken Parmesan Romano with pasta and a light sauce and it was delicious.<br&gt;<br&gt;It was a great evening with some wonderful friends and the restaurant did an excellent job.", "rating": 5, "date": "7/28/2017"}, {"text": "The service was great enough!!! I came from Meridian with a party of 14 to celebrate a high accomplishment. We were told the wait would be 3-4 hours. Ridiculous. So we all sat at different tables inside and out. I guess they did the best the could. It was packed. The food was not so great! I sampled everything that came to the table. We had herb crusted salmon and asparagus cooked well. It still lacked taste although it looked great. My mom had Steak Diane cooked medium well, it had to be sent back because it was still too raw and bloody. I had the meatloaf and substituted my corn succotash for carrots, they we&amp;#39;re just cooked, well burnt without seasoning. The meatloaf was pretty good though and so was the potatoes. <br&gt;I won&amp;#39;t be returning, if I want to dine out at this Cheesecake Factory again, I&amp;#39;ll be traveling to Memphis. The food their was delicious!", "rating": 2, "date": "11/4/2018"}, {"text": "We went in on busy Saturday night got to sit at the bar. David was bartending and did a very good job. Everything was quick and so good. Should have took some pictures. Will definitely be back when we are in town again.", "rating": 5, "date": "9/8/2018"}, {"text": "I had a great server and a very server. Very fast and informative. Asked about sugar content and she brought over a nutritional menu. Taking dessert home and my salad is always good", "rating": 4, "date": "2/21/2018"}, {"text": "I love cheesecake factory but this isn&amp;#39;t the best one. The services are so slow every time I visit here. <br&gt;<br&gt;I get that hosts can be annoyed by so many people coming up to them, but please don&amp;#39;t be rude to people who are being polite. I used to go to the one in DC all the time and loved it every time. I took my friends who are visiting me here and they told me that not all southerners practice southern hospitality after coming here. <br&gt;<br&gt;The portions are huge so we all took half the food back home. The breads are good as well. Lastly, I don&amp;#39;t eat dairy so every time their servers give me a weird look for not ordering a slice of cheesecake, it is painful.", "rating": 3, "date": "1/6/2017"}, {"text": "I have to say I am very disappointed in the  Cheese Cake Factory. I had a to go over that was less than spectacular. I&amp;#39;m not sure if it was because it was a to go order or not but the food was horrible. I&amp;#39;m trying yo load a picture of these Tex Mex Egg rolls that looks like they were soaked in grease. I&amp;#39;m not sure this is were you want to eat.", "rating": 2, "date": "3/13/2018"}, {"text": "Dinner at my favorite restaurant with my mom  and husband was great.we chose to sit on the patio because the weather was in my opinion perfect.the atmosphere on the patio was very nice and as always the food was sooooo delicious! I can&amp;#39;t wait till my next visit.", "rating": 4, "date": "6/26/2017"}, {"text": "I placed an order to be picked up Curbside, sending my husband to the restaurant at the appointed time of 7:05pm. At that time, none of the designated spots were available and the parking lot was so jammed there was no place to even stop to put hazards on. He parked across the street and walked in, went to the counter to pick up our order (it was now 7:25pm), and they said &amp;#34;Get in line,&amp;#34; pointing to a line 50 people deep. He waited for 10 more minutes and with no movement, finally left. I called and spoke to the manager who said she could not give us a refund on the order we never received since we ordered it online, and that we would have to contact the company that runs the online ordering service. After some research and going on the website of said company, I discovered this is NOT true - in fact I found an article telling the restaurant how to refund a customer. I tried calling the manager back and was put on hold for (literally) 20 minutes, after which time I finally hung up. We are now forced to open a dispute on the charge with AMEX, who is great about honoring, but we shouldn&amp;#39;t have to go to that trouble. (And I still have no dinner!!) Clearly, Cheesecake Factory needs to revisit their policies and practices for Curbside orders, limiting the amount of orders taken, as well as be aware of how to refund customers. This was such a headache that we will not return to this restaurant.", "rating": 1, "date": "3/2/2019"}, {"text": "Their fried calamari and sweet corn tamale cakes are my favorite appetizers and I usually get the Bang Bang Chicken and Shrimp as my entree. Every type of cheesecake I have tried has been good.", "rating": 4, "date": "2/22/2018"}, {"text": "I love Cheesecake Factory, however my experience at this particular location was less than satisfactory. Firstly, my silverware had food debris. Secondly, my food was prepared incorrectly. I ordered the Chicken Madeira w/ roasted broccoli. The first time, it was brought with asparagus (I&amp;#39;m allergic). The second time, with steamed broccoli, and the third time w/ semi steamed/roasted broccoli and seasoning. At that point, I no longer cared to argue because I understood that my food would not be prepared correctly. My chicken was cold and so were my potatoes. The entire dish should have been prepared over, however they continued to resend out the same dish. In my opinion, it&amp;#39;s not enough to say &amp;#34;your food is free&amp;#34;. No one was apologetic, nor did they care that we were unsatisfied and that they had wasted our time. The managers (James and Jennifer) did not resolve my issue in a matter that would make me return to this location or encourage other people to go.", "rating": 1, "date": "9/3/2018"}, {"text": "Food was good, but the wait time was ridiculously long.  It even took forever to get refills on water while we waited on our food.  Manager did come over and apologize.   The cheesecake was the best part of the trip....worth the wait.", "rating": 4, "date": "3/17/2017"}, {"text": "I frequent Cheesecake factory because of the quantity of the food and it&amp;#39;s tasty! But what I am not a fan of is that you have to wait so long and they don&amp;#39;t allow you to reserve seating unless you have a large group. It would be nice if they offered the texting notification opposed to the buzzers since the wait time is normally long.", "rating": 3, "date": "5/14/2018"}, {"text": "Anna B. Is THE BEST waitress I&amp;#39;ve had IN A LONG TIME! She made sure we always had what we needed, was knowledgeable of the menu, and her positive cheerful attitude was infectious. When my boyfriend was not satisfied with his entree she suggested something else from the menu and he loved it. I loved that she genuinely cared about our experience and it truly made a difference! Thank you Anna<br&gt;<br&gt;(Oh and our burgers were amazing too!)", "rating": 5, "date": "7/1/2018"}, {"text": "Enjoying a warm and beautiful afternoon at The Cheesecake Factory!  Scenic view, great atmosphere and awesome tasting food you have try to experience! Can&amp;#39;t wait to come back and try something new!", "rating": 5, "date": "5/15/2019"}, {"text": "Very unhappy with my experience. Ordered pot stickers to go and was only given 4 potstickers instead of 5. Definitely not worth the money. Will not be ordering again.", "rating": 1, "date": "5/12/2019"}, {"text": "My boyfriend and I went to The Cheesecake Factory for my birthday dinner. Our waitress was Jimmiesha. She was a very helpful waitress and gave us some really good recommendations. The only setbacks during our experience there was that there was our waitress got busy at one point and had forgotten to put in our order for the entrées. She came to our table to apologize and offered us complementary soups while we waited for food. I thought that was really nice of her.<br&gt;<br&gt;Later on, Jimmiesha was kind enough to get us some to-go bowls for our leftovers and, I assume either because of the late order because it was my birthday and she was aware, she only charged us for the drinks and the appetizers. I guess it was her birthday present to me, or a present to make up for the wait. <br&gt;<br&gt;We ended up tipping $30 on a $12 order that should have been around $50. Jimmiesha was extremely nice and I will happily go back to the Cheesecake Factory if I&amp;#39;m seated at one of her tables.", "rating": 5, "date": "9/1/2017"}, {"text": "Flies, Bugs, and Insects! They left dirty tables sitting around our table for 30-45 minutes.  There were flies and insects everywhere, evidently attracted to the food on the empty tables.  We spoke with Jennifer, who told us a manager would come by and hear our concerns, but no one ever came by.  <br&gt;Their health dept rating notes problems with failing to &amp;#34;maintain potentially hazardous food at 41 F or below.&amp;#34;", "rating": 1, "date": "9/3/2017"}, {"text": "Consistent. ALWAYS consistently great!<br&gt;<br&gt;The cheese cake factory started out selling cheesecake. They expanded the business with meals and kept the cheesecake. The reality is that most people go for the entrees and the cheesecake is just a bonus. I rarely even eat cheesecake at the Cheesecake Factory. <br&gt;<br&gt;I mentioned the Cheesecake Factory is consistent. My other favorite attribute is the expansive menu. Most restaurant cut down on menu items to help a kitchen produce more smoothly and efficiently. At the Cheesecake Factory you pay a bit more but you got a ton of menu options . The expansive menu is great for groups because there is something for everyone. <br&gt;<br&gt;The food is generally very good. I find that the cheese cake factory is better than other more specialized restaurants. For example, the Cheesecake Factory can make better Cajun inspired cuisine than a Cajun restaurant. (Such as Cajun steamer)<br&gt;<br&gt;The interior is nicely decorated; the lightly is casual and comfortable. They have outdoor seating which is nice during the evening when the sub sets.<br&gt;<br&gt;A few things enter my mind when considering flaws. First, the menu is full of advertisements. Second, it&amp;#39;s a bit more expensive for comparable dishes at other restaurants . Finally , it gets very crowded and the wait can get pretty long on the weekends. <br&gt;<br&gt;In conclusion, the cheesecake is a great &amp;#34;go-to&amp;#34; spot for friends and family. They have something to satisfy everyone, and they do so consistently. It&amp;#39;s a franchise and it&amp;#39;s not really anything spectacular, but it is among the best in the area.", "rating": 4, "date": "6/30/2014"}, {"text": "Went for a late lunch on a Saturday. It was pretty busy but we were seated within five minutes. Our server Luis was amazing. Our food came fairly quickly, and everything was hot, fresh, and delicious! We were stuffed after dinner so everyone got a slice of cheesecake to go, which was very tasty later that night. My first trip to the Cheesecake Factory and I will definitely be back!", "rating": 5, "date": "4/23/2017"}, {"text": "This is my favorite restaurant in Brimingham. Today was made even better by my server Deven! He was AMAZING!!!!!!", "rating": 5, "date": "2/16/2019"}, {"text": "Fabulous food and great selection.<br&gt;<br&gt;Always something new to try.<br&gt;<br&gt;Love CF!!!", "rating": 5, "date": "5/12/2018"}, {"text": "Wow. We had a great lunch. The service was special. The young lady that took care of us was great. I just can&amp;#39;t get out without spending too much money. The food is so good. Candice took a small cheese cake home with her.", "rating": 4, "date": "7/6/2018"}, {"text": "Someone asked me what the Cheesecake Factory was. After a little chortle, I said it&amp;#39;s an expensive bite of yumminess.<br&gt;<br&gt;As you walk in, you might be greeted by a half-smile from the hostess who is doing her best to accommodate having to find seats for paying customers, when I suspect she really wants to just pull out her phone and take another selfie. We wait a few minutes, not long, and led to our table. Our waiter takes our drink orders. He&amp;#39;s friendly and courteous. We have kids with us, so being nice to them will earn you bonus points (ahem, bigger tip).<br&gt;<br&gt;We peruse through the Cheesecake Factory Encyclopedia or better known as &amp;#34;Menu.&amp;#34; You name it. Italian, Asian, American...it&amp;#39;s a United Nations of culinary delight. I settled on the Bang Bang Chicken and Shrimp, a little Thai craving. It was a peanut-infused, coconut, curry sensation. It wasn&amp;#39;t overpowering, but it also wasn&amp;#39;t bland. The only critique I have is too much pepper on the shrimp. I almost did a little chair dance. <br&gt;<br&gt;Others in my party ordered the Buffalo Blasters, and those blasted his socks off. I think he actually did a little chair dance, or his butt was asleep. Who knows. He loved it. Another one in my party ordered the Salmon Wraps. She said they sucked. To be fair, they were on the skinny menu. For this fluffy chick, most things on the skinny menu are inedible. I guess that&amp;#39;s why skinny chicks stay skinny. So she ordered the Salmon BBQ, which she loved. I guess that&amp;#39;s what she mumbled while nom-nom-nom. The kids ordered everything from sliders to Fettuccine Alfredo. For them, if it comes with ketchup, they&amp;#39;re happy.<br&gt;<br&gt;Then came dessert and where this overrated place earned four stars. My fat cells definitely did the Macarena when I had some of the Dulce de Leche. It was rich yet light with hints of caramel, vanilla, and freakin&amp;#39; awesomeness. The others ordered the Oreo Cheesecake, Chocolate Chip Cookie Dough Cheesecake, and Adam&amp;#39;s Peanut Butter Cup Cheesecake. They scarfed them down while singing about unicorns and rainbows.", "rating": 4, "date": "5/24/2014"}, {"text": "This is one of my favorite restaurants in the world to go to. Getting our table was really quick but it still took 10 minutes for someone to come over and place our drink order. I still don&amp;#39;t understand why there are flies on the window. Not exactly sanitary. This is the second time I&amp;#39;ve been here in two months and there have been flies on the window. <br&gt;We asked for bread and we only received the white bread. They once again did not have any of the multi grain bread. It came towards the end of our meal. <br&gt;Our to go boxes cakes 20 minutes later. I did not receive my box until 10 minutes after my dad. Our check came even later. <br&gt;We got in here at 7:10 and didn&amp;#39;t leave till almost 9:00. <br&gt;I thought the experience would be better than the last time but I seem to keep putting too much faith in this place.", "rating": 1, "date": "6/24/2018"}, {"text": "I&amp;#39;ve always love coming here for special occasions and come very often. But my recent visit was very disappointing. I had a party of 10 and waited two hours for a table which was fine because it was a Friday night. But the issue was with the staff and customer service. Our main waitress was decent but we had to wait twenty minutes for bread that we had to flag down a random waiter to get. The other waitress helping her was very rude and had a bad attitude all night. She had rolled her eyes when we asked for her to get ranch or silverware.  I told them it was my birthday and I would like to get a cheesecake, which I received in a to go box, no happy birthday song, and a rushed dinner. The food was good but the customer service was not.", "rating": 2, "date": "4/13/2019"}, {"text": "Although I am not a major fan of their food, the drinks and desserts are phenomenal.  There is such a huge selection of cheesecake that you can go into overload but it&amp;#39;s SOOO worth it!", "rating": 3, "date": "1/28/2017"}, {"text": "Well...I&amp;#39;ve been here a couple of times and let me start by saying, if you have visited this location in another state, this probably won&amp;#39;t hold up to the standard. We waited about 2 hours to be seated and then once we sat we waited another 20 minutes for our waiter to notice us. The food is alright, I usually only go for the calamari and strawberry lemonade which we had to mee flagging down our waiter to refill. He was pretty awkward with a serious attitude. They had the heaters on outside but kept moving them to accommodate different guest that were hot which left every one else freezing from the wind. I probably won&amp;#39;t be back here for awhile.", "rating": 3, "date": "3/23/2016"}, {"text": "To be honest I don&amp;#39;t think anyone really goes to The Cheesecake Factory for their food. On my last visit I ordered the Fettuccini Alfredo and when it came out it was barely warm and had no flavor. Also it was served with egg noodles, not fettuccini noodles. We ordered the red velvet and the oreo dream extreme cheesecake to-go and it was great as usual!", "rating": 2, "date": "7/18/2018"}, {"text": "It amazes me how busy this place is. <br&gt;I know it&amp;#39;s nothing more than big corporate chain restaurant. But they are dialed in machine. It&amp;#39;s predictable what you are going to get in terms of service and food. You find that one dish in the massive menu and time to time you crave that dish and deal with the massive crowd and wait to eat there. <br&gt;Yes I am brainwashed by the pre made cheesecake also. <br&gt;But honestly, if it wasn&amp;#39;t a chain restaurant and my bias for them wasn&amp;#39;t there, I would give this place a 4 star.", "rating": 3, "date": "6/19/2016"}, {"text": "Great lunch celebration for daughter&amp;#39;s birthday. Loved the Brunch. Mexican eggs with all the fixing. Good cheesecake.", "rating": 5, "date": "10/30/2016"}, {"text": "1.5 Stars. <br&gt;We usually love going to the Cheesecake Factory. This experience was pretty awful. It seemed that no one working there knew what they were doing. We called ahead about our large party (10 people) and still waited quite a while to be seated. The person who seated us wasn&amp;#39;t sure where we were supposed to go. The server said the bread wasn&amp;#39;t ready and it finally came out around 45 minutes after we&amp;#39;d been seated. The main problem we had there was our food. It was served all at once and it was cold. Everything: the pasta, steak, burgers, you name it. It was so cold that even the mushrooms on one dish were rubbery! It also didn&amp;#39;t taste as good as most Cheesecake Factory dishes taste. Maybe everyone was in training or management is cutting back on costs-?? [The bathroom hadn&amp;#39;t been cleaned recently, either.] I honestly don&amp;#39;t expect perfection from any place when I eat out, but this was pretty bad. I suppose the main reason I&amp;#39;m leaving only 1.5* stars is the price. To pay that much (it was a lot $) for a &amp;#34;chain fancy place&amp;#34; a customer should expect better service - and DEFINITELY better prepared food. <br&gt;My grade: D- <br&gt;I doubt if we&amp;#39;ll be returning to this location.", "rating": 2, "date": "3/27/2019"}, {"text": "This place has the largest most diverse menu of any restaurant I&amp;#39;ve visited. It&amp;#39;s wildly popular and despite its immense size there is almost always a wait. The menu storage area must occupy a significant portion of their square footage.<br&gt;I&amp;#39;ve enjoyed most everything I&amp;#39;ve had, though nothing has been particularly special or had me racing back. This place reminds me of a better version of an Appleby&amp;#39;s or TGI Friday&amp;#39;s at 2x the price.<br&gt;Tonight my wife&amp;#39;s sister and her family took my wife to dinner. My wife is a fan of this place, I think for the selection alone. My wife brought me fish and chips.<br&gt;This dinner portion is huge! The fish was thick and flaky with a tempura style beer batter. The Tatar sauce was good with a hint of lemon. The chips were soggy bag variety fries. <br&gt;She subbed the slaw  for crisp sautéed green beans. They were ok.... I personally prefer my green beans cooked for a day with pork fat.<br&gt;The fish and tarter sauce now stand out; however, <br&gt;what really stands out the most is the nutritional information for this menu item.<br&gt;Ever exceeded all of your caloric intake in a day with one meal? <br&gt;The Cheesecake Factory&amp;#39;s Beer Battered Fish and Chips: 2,260 calories as well as 68 grams of saturated fat and 2,870 milligrams of sodium.  That&amp;#39;s what 125% of your daily recommended sodium intake??<br&gt;In the future I will google  nutritional information prior to ordering.<br&gt;Upon further further inspection a number of the menu items at this restaurant are widely recognized for their poor nutritional value. <br&gt;Order carefully.", "rating": 3, "date": "6/21/2017"}, {"text": "Worst cheesecake factory I have ever been to and I have been to quite a few all over the country. We went on Easter Sunday. The long wait for table didn&amp;#39;t bother us much but there was no seating and very crowded in the entry area. Once seated our server was not very attentive at all. But due to the large crows understandable. The worst part was the food!!!<br&gt;Ordered steak Diane and it lacked everything. No salt or pepper. No flavor...then I ordered medium rare and got it well done... husband ordered scampi shrimp combo and also hated the lack of flavor from the meal. We are really big fans of the cheesecake factory but after this visit, but after this visit we might have to find a new spot. Definitely won&amp;#39;t be back to this location.", "rating": 1, "date": "3/28/2016"}, {"text": "Who knew happy hour could be this happy! We were clearly distracted as our sole purpose for even going to the factory was to share a slice of cheesecake in the midst of our celebration. We however, got lured in and found our way to a high top table in the bar area. The happy hour menu danced in our faces with TONS of reasonably priced/shareable options. We were pleased to see low cocktail prices and ordered a few (cosmo and iced tea). My, oh my, compliments to the bartender- his concoctions were made promptly and tasty. While we were waiting, though we knew we only wanted cheesecake, we went ahead and ordered the buffalo blast appetizer. WHY- we only wanted cheesecake, but still managed to be led by our sense of instant hunger. Needless to say, they were good and gone in 45 minutes between the two of us. We agree the blasts might as well be a full meal versus an appetizer- they are so filing and CF definitely doesn&amp;#39;t skimp on quantity. I would recommend an order of these and maybe a side item or side salad as your meal. Though full, we finally ordered our white chocolate raspberry cheesecake......to go!<br&gt;<br&gt;Overall, I would say that Cheesecake Factory has one of the best happy hours in town with lots of app/snack/meal options as well as a special bar menu. The restaurant crowd was not obnoxious by far, but rather quiet. If you can make it down 280 between 4-6pm M-F, you&amp;#39;re sure to leave happy, stuffed or worse; both. My only advice, don&amp;#39;t do what we did, stick to your plan and only go for what you planned to go for...cheesecake.", "rating": 4, "date": "10/25/2015"}, {"text": "I know you&amp;#39;re hungry, and I know the idea of over 100 choices on a menu sounds like a great idea. But just don&amp;#39;t do it. This place is highly over priced for extremely mediocre food. I ordered pizza, I mean, how do you manage to ruin that? Well it was completely soggy except for the crust. Inedible. I am pretty sure everything is frozen then cooked. The only saving grace was their salad. I would have tried their cheesecakes which admittedly looked rather amazing, but I was too grossed out by the pizza and the state of my friends fried fish tacos. <br&gt;<br&gt;On another note their service was pretty on top of their game, and continuously refilled our drinks. They seemed pretty organized even though it was fairly busy. I would be tempted to go back and try the cheesecake. But honestly other than that, I know it is convenient, but just go to a non chain in town.", "rating": 2, "date": "1/5/2016"}, {"text": "This place is ridiculous. I have to wait 15 mins every time I call in to place a to go order. Then when I pull up and tell them I&amp;#39;m already here they expect me to call back and wait another 20 mins to call and remind them I&amp;#39;m here. I get it being the weekends but even on week days it&amp;#39;s like this. The food is amazing of course. But geez. I really bothers me when curb side is offered and they make you walk in to get your food. I like Cheesecake Factory bc I don&amp;#39;t have to walk in. Either this place is under staffed or just lazy <br&gt;<br&gt;ANNOYING!!!!!!!!!!", "rating": 1, "date": "11/19/2017"}, {"text": "HORRIBLE service. Getting one slice of cheesecake carside should not be a thirty minute ordeal. <br&gt;<br&gt;What&amp;#39;s the point of having and advertising carside service if you don&amp;#39;t actually provide it? <br&gt;<br&gt;Even then, we had to go inside, which was not much better. A fifteen minute wait for something ready made that was preodered? That&amp;#39;s unacceptable, especially at this price point.", "rating": 1, "date": "3/6/2016"}, {"text": "Honestly the worst service ever. Waited about 20 min at our table for us to get greeted while tables that got seated after us got greeted and their drink orders were taken. Then we waited 20 more min after we placed our drink order to actually get the drinks. I know it&amp;#39;s a Saturday night and it is busy but this is unacceptable. Server Makayla B should not be taking the tables she clearly can&amp;#39;t handle. Very disappointed with my experience tonight. Even the host was rude when I went up and told her what was wrong. I&amp;#39;ve never had a bad experience here and I will not be coming back anytime soon.", "rating": 1, "date": "4/28/2018"}, {"text": "I try to avoid the Summit and Summit restaurants like the plague, but I was spending time with my Mother and we were there, and hungry, so Cheesecake Factory it was this past Saturday.<br&gt;<br&gt;No line, no waiting, and out on the covered patio we went. It did seem like our food and drinks took a hot minute to be delivered. I guess they were bumpin&amp;#39; inside. It was fine though. She had a pina colada and I a strawberry daiquiri (what is this, the beach?) and both were tasty. HOWEVER, prices are not marked and thus we paid $11 per drink. $11 at a chain restaurant?  For ice and rum? Who are you kidding TCF? This ain&amp;#39;t Collins Bar or Bottega or something. This is rinkydink Cheesecake Factory. <br&gt;<br&gt;I had the Farfelle Garlic Chicken Mushroom Something Something Pasta dish and it was really good. And SUCH a large portion I had enough for lunch again the next day, split with another person. Mom enjoyed her food too.<br&gt;<br&gt;It was a pleasant surprise for a chain place. Great food. Our waitress was sweet as pie and it was a good experience. I wouldn&amp;#39;t go out of my way for it, but if I were there shopping, then yes. Hit it up!", "rating": 4, "date": "9/9/2015"}, {"text": "Presentation 9. Choices 10. Quality 5. Taste inconsistent 3. Service 7. Just what you would expect.", "rating": 2, "date": "11/23/2015"}, {"text": "We drove an hout to find A five hour wait for LUNCH on a Saturday for a party of 6...  no fucking way...  this place doesn&amp;#39;t have good that good... <br&gt;<br&gt;I won&amp;#39;t ever even try to come back..", "rating": 1, "date": "5/7/2016"}, {"text": "I was so looking forward to a nice lunch. Unfortunately, that never came to fruition. (I reluctantly agreed to eat here because last spring they turned our party of 8 away at 3:30 on a weekday. The restaurant was empty. ???) <br&gt;<br&gt;Good things: server was nice and the fried mac and cheese was just how our daughter likes it. <br&gt;<br&gt;Not-so-good: fries were undercooked; they sent more that were a bit better, but they still had that raw potato flavor. The strawberry lemonade was thick; like it came from the bottom of the container. At least they took it off our bill. <br&gt;<br&gt;Total grossness: We killed 4 flies while we were there. In addition, gnats swarmed our food the entire meal. We brought it to the attention of the person who brought our food and his response was, &amp;#34;Well, it&amp;#39;s summertime.&amp;#34; After our meal we asked to speak to the manager. Jennifer came to our table and was of the same opinion. &amp;#34;We have so many doors and it&amp;#39;s hard to keep them out.&amp;#34; We pointed out that it may be a bit easier if tables were bussed and cleaned in a timely manner. 4 tables sat dirty for at least 20 minutes after the customers left. Her response was that they had a large party in another part of the restaurant. She also said she would send over the general manager, but that never happened. <br&gt;<br&gt;We hoped for a nice meal. Instead we had sub-par food, flies/gnats, and an atmosphere of dirty tables. I expect more when paying $70 for lunch for 3 people. It&amp;#39;s a shame. TCF used to be one of our favorite places.", "rating": 1, "date": "9/4/2017"}, {"text": "Waited 45mins for chicken fingers and a sandwich. This place is a dump. Awful staff=awful restaurant.", "rating": 1, "date": "1/26/2019"}, {"text": "One of our favorite places to eat. There is such variety in food choices and dessert is ALWAYS on point! We even came to eat here after getting engaged! Special place for us!", "rating": 5, "date": "7/30/2017"}, {"text": "We went to Cheesecake Factory on Sunday evening. We unfortunately had a bad experience. They messed up our order multiple times and when the manager STEPHANIE came out she was rude and didn&amp;#39;t comp anything. I usually don&amp;#39;t like to complain, but Stephanie was trying to argue about how their green beans usually are hard and undercooked. We have been here multiple times and never have had an issue until this evening.", "rating": 1, "date": "1/6/2019"}, {"text": "First time ever. I always wondered how it was inside these dark-ish huge buildings supposed to sell huge cheesecakes. They serve also regular food and not only cheesecakes?? O wow!<br&gt;<br&gt;Greatly surprised by the quality of the service even in pick chaotic hours.<br&gt;I actually got a cheesecake and I really liked it. I mean, it wasn&amp;#39;t as the last cheesecake I had in NYC, but it was definitively not too sugary and well made.<br&gt;<br&gt;Cocktails actually had some alcohol in the present ingredients!  Nice deal.<br&gt;<br&gt;Good place, I&amp;#39;ll go back for further investigaitons", "rating": 4, "date": "10/28/2013"}, {"text": "Good experience overall. <br&gt;<br&gt;Service: My waitress Courtney was the best. She was very attentive and had a great attitude. <br&gt;<br&gt;Food: Started things off with the endive salad which was good but had a little too much blue cheese. For the main course I had the Bistro shrimp pasta which looked appetizing and was very delicious. The shrimp were cooked perfectly and melded great with the mushrooms. For desert I had the strawberry short cake. My advice, stick with the cheesecake. The shortcake itself was dense and tasted as though it was fried. I was looking forward to something light and refreshing and it was the opposite. Very disappointed. <br&gt;<br&gt;Ambiance:  always extremely busy on a Friday night. Wait wasn&amp;#39;t too long though.", "rating": 4, "date": "4/4/2014"}, {"text": "If you&amp;#39;re smart don&amp;#39;t go to the cheesecake factory during dinner hours unless you wish to wait at the minimum 45 minutes. I went during lunch and was seated right away. They have a little lunch menu which is very handy given that their regular menu is so extensive . I went with the Mexican lettuce wraps which came in the shape of tacos making it easier to eat. Also, I had a white sangria. The sangria had mostly oranges in it for the fruit and was good. But what made me the happiest was the gluten-free Godiva chocolate cheesecake. With good service and good food I can&amp;#39;t complain.", "rating": 5, "date": "7/27/2015"}, {"text": "I was very excited to grab some pasta with my boyfriend on a Friday afternoon. Unfortunately the food was not appetizing at all. I had the fettuccine alfredo with chicken and my boyfriend had the 4 cheese pasta with chicken. Both dishes lacked seasoning and flavor, and the chicken tasted boiled. I love The Cheesecake Factory, but I will not be eating their pasta anymore.", "rating": 2, "date": "6/10/2017"}, {"text": "I normally don&amp;#39;t eat at Cheesecake Factories because the food is chain food, but these guys really helped me out when I called just before their closing time as I was traveling through town, and they made the food and then handed it to me 45 minutes after they closed. I very much appreciated that and it made my night as I had been busy with work all day and did not have time to eat, and wanted to get to my next hotel in Tuscaloosa. <br&gt;<br&gt;The food may not be what I would normally eat, but these guys made up for anything by helping me out.", "rating": 5, "date": "5/21/2015"}, {"text": "I really enjoy the food here but sometimes, the waiting time to get seated is extremely long. This time, the wait time was 1 hour and 30 minutes to get seated and maybe another 20 minutes to receive the food. I ordered the Chinese chicken salad, one of my favorite salads at Cheesecake Factory. I also ordered the Vanilla Bean cheesecake as a desert. Another part I dislike is that the food, especially the cheesecake, is very expensive compared to the cost of production. Yet, I definitely recommend people visit this restaurant.", "rating": 4, "date": "1/30/2016"}, {"text": "Ordered 2 cheesecake slices to-go &amp;amp; they gave us the wrong flavors! Never been so excited to go here for the first time &amp;amp; I could not be more disappointed.", "rating": 1, "date": "11/10/2018"}, {"text": "The pasta carbonara is always a good choice. Love the fried calamari appetizer. This location is crazy busy during the weekend but the staff si friendly and things move pretty fast. Really nice outdoor seating available.", "rating": 5, "date": "5/22/2017"}, {"text": "One of my favorite places to eat is the Cheesecake factory. The staff is very friendly and they recommend the substitutions and specials.<br&gt;For more details on this restaurant and its yummylicious menu go to my blog<br&gt;<br&gt;<a href=\"/redir?url=http%3A%2F%2Flifewithoutalu.blogspot.com%2F2016%2F02%2Fa-special-day.html&amp;amp;s=438d7db5bd7e3fd055a708df5641824a17c796d93532ae64c31a66dfb26b3354\" target=\"_blank\" rel=\"nofollow\"&gt;lifewithoutalu.blogspot.…</a&gt;<br&gt;<br&gt;Or follow me at Twitter @debjani_moitra", "rating": 5, "date": "7/15/2016"}, {"text": "This evening was one of my worst dining experiences. I ordered a hamburger, and specifically asked for no mayonnaise. When it finally arrived, I immediately noticed the bun was covered in it. The manager, Nick, stopped by the table to see if everyone&amp;#39;s food was fine. I mentioned my original request, and he quickly took the plate back to the kitchen and said he would take care of it. He arrives back shortly after with the &amp;#34;new&amp;#34; burger. I lift up the bun and burger, which still has mayonnaise on it. It had clearly been wiped off and still on the same burger. The waitress came back and asked if it was alright, and I explained the burger still had mayonnaise. She told me that they just replaced the bun, not the burger, and took it back. The manager then comes back and tells me the burger never had mayonnaise on it, and that they &amp;#34;sprinkled mozzarella cheese on top.&amp;#34; I told him that that was not part of the description, and regardless the bottom still had mayonnaise and I could tell it had been wiped off. He then proceeded to tell me that it never had mayonnaise on it in the first place, and says &amp;#34;I&amp;#39;m not going to argue with you, but I looked at it under the light,&amp;#34; and then stormed off. The waitress then returned to the table to apologize and let me know she forgot to let the kitchen know not to put mayonnaise, and told me that indeed, the burger had mayonnaise, contrary to Nick&amp;#39;s response... Nick was extremely rude and unprofessional. I was with a group celebrating a friend&amp;#39;s birthday, and we were appalled with how he handled the situation. The waitress was extremely sweet and I asked her to just cancel my order. By this point, I was upset that the manager would accuse me of lying, and everyone was finished eating and ordering dessert. The waitress then sent another manager over (I didn&amp;#39;t catch his name), and he was very apologetic. He handled the situation great and apologized for our experience. Had it been this manager who came by the first time, I would have no complaints regarding our visit.", "rating": 2, "date": "3/5/2018"}, {"text": "First time going it was worth the wait. Great food, awesome cheesecakes. Loved everything about the place", "rating": 5, "date": "9/25/2018"}, {"text": "Do you like eating sugar in the dark?  Come here!<br&gt;<br&gt;But seriously, if I have to pull out my phone to read the menu, YOUR LIGHTS ARE TOO LOW.<br&gt;<br&gt;Cheesecake factory does cheesecake pretty well, and they should... it&amp;#39;s their name.  However, everything else this franchise does, it fails at.<br&gt;<br&gt;Even stopping in for dessert and coffee, I find myself completely let down.  This last time, I ordered a Carmel Macchiato and it came to the table with not only caramel as expected, but sugar added as well?  It should be plenty sweet with just the caramel, but even if the person making it felt like it should be sweeter, give me the OPTION to add the sweetener.  I nearly gagged trying to finish the lukewarm drink.<br&gt;<br&gt;I just don&amp;#39;t have anything good to say about this place.  The cheesecake almost redeems it, but there are plenty of cheesecake factory franchises that deserve business more than this one.", "rating": 1, "date": "10/16/2014"}, {"text": "Great cheesecake, average food. Salads are great. <br&gt;<br&gt;Prefer just for dessert", "rating": 4, "date": "10/22/2012"}, {"text": "The Cheesecake Factory has easily become my favorite restaurant. From the customer service from the staff to the food, it is a total experience you will not forget.<br&gt;<br&gt;I recommend if you love cheesecake to try the red velvet cheesecake there.<br&gt;<br&gt;The only down fall of the restaurant is the wait. Easily, the restaurant fills up quickly and the wait turns into 2 to 2 1/2 hour wait for a party of 2.<br&gt;<br&gt;Other than that, the food is great and the service is great as well.", "rating": 5, "date": "5/3/2016"}, {"text": "I&amp;#39;ve had countless birthday dinners here. It is my trusty go to for finicky friends because the menu is so large they always have something some picky eater will enjoy. My go to is always the chicken piccata, although it&amp;#39;s super heavy on calories, it tastes light and flavorful. Pro-tip- add Cajun shrimp for a game changer. It pairs really well with the lemony wine sauce.", "rating": 4, "date": "2/18/2017"}, {"text": "I went to Cheesecake Factory a couple weeks ago and it was a very good experience overall!  We waited a long time to get in, but it was Friday night and we had a large party, so that was to be expected.  Our waitress was phenomenal; I&amp;#39;m pretty sure she had a photographic memory and she didn&amp;#39;t write down any of our party of 10&amp;#39;s orders, which made us a bit skeptical because some of us had specifications, but she didn&amp;#39;t miss anything.  I got the California Guacamole Salad, which had avocado, corn, black beans, radishes, and avocado dressing.  It was a huge salad and was very good, I&amp;#39;d go back to get it in a heartbeat.  The Dulce de Leche Caramel Cheesecake was absolutely to die for, it was so decadent for a non-chocolate containing dessert.  Overall, the whole experience was wonderful!", "rating": 4, "date": "12/5/2016"}, {"text": "I never come here for the food because it&amp;#39;s average at best, but the place is names cheesecake factory not food factory, and the name is what they do best.", "rating": 3, "date": "5/28/2017"}, {"text": "Ordered the &amp;#34;big burrito&amp;#34;. Should really be called a &amp;#34;rice burrito&amp;#34;. 90 percent rice, 10 percent everything else. Horrible.", "rating": 2, "date": "9/2/2018"}, {"text": "The food was okay but the service could have been much better.  So I am giving it a &amp;#34;ok&amp;#34; rating.<br&gt;<br&gt;The waiter was managing three tables of different parties at the same time.  No joke.  I have never had a waiter who was telling us ALL that the bread would be coming soon.  <br&gt;<br&gt;Also, the waiter told us the specials.  I asked about the salmon special.  Then he showed me the salmon listings.  I asked about the special pricing.  There was none.  So I said, there is really not a special on the salmon, just the everyday fresh salmon that they normally have.  <br&gt;<br&gt;The complementary bread was good.  My sister ordered the fried cheese appetizer; it was cut into triangles - how unique -- it tasted fine.<br&gt;<br&gt;I ordered the firecracker salmon wrap for $1 more than the low-calorie salmon wrap. The low-calorie salmon wrap was noted as using butter or cream.  I was confused as to how this low-calorie wrap could be healthier than the other wrap.  I asked the waiter what is the difference between the two.  He said the firecracker wrap was bigger.  I did not feel like he had a good answer.  My dishes was loaded with lettuce garnish.<br&gt;<br&gt;The caramel pecan turtle cheesecake was to go as I cannot eat it all in one setting.  I little bit can go a long way.  It was fine.  I could not tell there is pecan.  The chocolate flower and whipped cream stole the show. <br&gt;<br&gt;I can live without it.", "rating": 3, "date": "3/30/2013"}, {"text": "I visited this location on a Saturday.  After barely surviving Dante&amp;#39;s parking lot with my sanity intact, the wait was shorter than it looked. The hostess seated us - with an attitude and expression usually reserved for certain biblical plagues - at a tiny table  practically jammed flush with two other tables. I was almost touching the people next to me on either side. It was awkward, uncomfortable and I felt showed a contempt for the customer. <br&gt;<br&gt;The food was average and overpriced. I&amp;#39;ve had better hamburgers at burger king, and almost all of what I saw on their phonebook sized menu read like the Stouffer&amp;#39;s section at your local grocery. <br&gt;<br&gt;If you&amp;#39;re in an indecisive party of shopping-fueled masochists, this place has a little bit of every cuisine known to humanity. If you&amp;#39;re looking for a comfortable place to enjoy some good food and a relatively private conversation, look elsewhere.", "rating": 2, "date": "8/23/2014"}, {"text": "We reserved table for 15 Senior Adults from Church. Table was ready as promised. We had several appetizers, entrees and Deserts. All were delicious!!!  Maria our server did a wonderful job of taking care of us. Very successful outing for our Senior Adults.", "rating": 5, "date": "6/29/2018"}, {"text": "This place always has great food, but for some reason they never have the cheesecake I want to order and if you sit outside their service can be slower than normal. Make sure to call and make a reservation before you go if you visit after 6 and are a bigger group than 5 or you&amp;#39;ll be waiting an hour to be seated.", "rating": 3, "date": "3/13/2017"}, {"text": "You know what you&amp;#39;re getting coming in, so grumbling about canned smiles and homogenized food is senseless.  We&amp;#39;ve been here several times and have always enjoyed the food, even if my stomach doesn&amp;#39;t, but that&amp;#39;s just because I&amp;#39;m not a regular consumer of butter.  Almost everything here is very rich, but you&amp;#39;re prepared for that already because you&amp;#39;ve probably already picked out your cheesecake before getting here.    I know I do, but I can only eat half a slice before wanting to die.  <br&gt;<br&gt;We usually ask for a booth and have always been accommodated.  This time we were too hungry and they were too busy (because we foolishly showed up in the middle of a holiday weekend), so the first place they put us was the long strip of tiny tables in the middle of the floor where your elbows bump with your neighbor&amp;#39;s the whole time.  Here you get dinner AND a show.  A man sitting three inches from me asked as many questions as he could about the menu to the flustered waitress, but the odd thing was that 90% of these questions were about chicken fingers on the kid&amp;#39;s menu (there were no kids with him).  He studied the menu like it was Proust, meticulously going through everything, running his finger up and down it and umming and ahhing over everything.  After a long time of this the pressure got to him and he ordered a burger and fries.  Meanwhile, at my other elbow, a sour, silent couple emitted bitter energy into the atmosphere as she glared at the kitchen door with impatience for the entire time it took him to down two beers and order a third.  <br&gt;<br&gt;Keep your expectations realistic.  You&amp;#39;re in for really good cheesecake and a safe, predictable and slightly over-priced meal of buttery pasta or fries or ceasar salads or any  of that usual stuff people get at these places.", "rating": 3, "date": "7/8/2016"}, {"text": "Not my favorite cheesecake factory location, if only because it&amp;#39;s unnecessarily crowded... or maybe the waitstaff is actually just overtaxed.   Either way, it leaves for a fairly mediocre experience on a given weekend.<br&gt;<br&gt;I&amp;#39;ll suggest a revamp of some of the appetizer options as well; it should be hard to mess up crab wontons (aka rangoons) and everybody knows guac--especially the fresh variety--needs a little salt to make it spark. <br&gt;<br&gt;The Jamaican black pepper shrimp and miso salmon are still good, though I kinda miss the old school skirt steak that used to be in place of the shrimp.   All in all, better cheesecake locations in Atlanta, Nashville and uh, even the one in Denver... But there are a ton more interesting places to eat in either of those places too.", "rating": 3, "date": "11/2/2014"}, {"text": "Calorie dense and crowded. This is a perfect place to go to get fat. With that said, the dulce de leche cheesecake is worth wearing your elastic waistbands.", "rating": 3, "date": "7/2/2018"}, {"text": "I love the Cheesecake Factory but this location is a little unclean. Our silverware and bread plates were dirty. And we watched them bus a table and they just rewrapped unused silverware in new napkins. But it was still touched by other patrons. There were flies everywhere and it just felt generally kinda dirty. The food was still decent.", "rating": 3, "date": "6/30/2018"}, {"text": "Yesterday I tried something different from The Cheesecake Factory..... YeS!!! Bang Bang Chicken &amp;amp;Shrimp!!!! I always have a great experience here. The staff is very professional, not a long wait, and the food is always hot. Something I really love about this place is how the food is presented. It&amp;#39;s a work of ART! :)", "rating": 5, "date": "8/18/2014"}, {"text": "We always enjoy our trip to the Cheesecake Factory but I gave it three stars as the stuffed chicken tortillas could not be cut with a fork. I had to use a knife! Still tasted good.", "rating": 3, "date": "10/28/2016"}, {"text": "We ate here for Valentine&amp;#39;s day one year.<br&gt;<br&gt;The food was just ok and way overpriced which is why they only get two stars in my book. My husband got the steak Diane, and because of how much he disliked it anytime he sees that on a menu or on T.V. he replies with &amp;#34;ugghh&amp;#34;.<br&gt;<br&gt;Now the cheesecake, this coming from a person who has never really liked cheesecake, was really good! The slices are huge and they have great flavor choices. I remember the Snickers being my favorite.", "rating": 2, "date": "4/21/2012"}, {"text": "When I came in it was crowded the host was very rude and ready to be done with me . We waited for 20 minuets that&amp;#39;s pretty  normal at therestaurant. Our waiter was very sweet no problem here body odor was very unpleasant. I got the turkey burger , I thought it was tuna at first from how it smelled but overall the food was good. They do need to wash there cups better cause I was very hesitant to drink because the straw was  without paper on top. I got the strawberry lemonade and it was very sour and needed a lot of water , I don&amp;#39;t know if there trying to give me diabetes from all that sugar in it. Great location. You need a jacket if you come very cold , made me feel like I was in a ice box.", "rating": 3, "date": "6/16/2018"}, {"text": "Sat at the bar - bartenders could not have been more prompt or friendly! Service and food were great.  No complaints!", "rating": 5, "date": "7/26/2016"}, {"text": "We go here on a regular basis. Long wait Friday &amp;amp; Saturday nights, but that&amp;#39;s to be expected. So many things to choose from on the menu. One thing I really love about CF is that they are very accommodating to people with small children. When my 3 year old was younger, they would bring him a plate of bread &amp;amp; cut up bananas for free! This is brilliant in so many ways. Treat the kids right &amp;amp; the parents will keep coming back. My husband &amp;amp; I have a few things a piece that we really like to order, but sometimes try new things. We are rarely disappointed. Service can range from great to ok, but never very poor. And then there&amp;#39;s the cheesecake.... Need I say more?", "rating": 5, "date": "6/27/2014"}, {"text": "Visited on a very busy Sunday,  even with the long wait it was totally worth it.  The food was good as always and very filling. The desert was even better. I had the calamari for appetizer, as it never seems to disappoint,  the four cheese pasta with Chicken, a sweet tea that was sweet, but not so filled with sugar that I would end up with diabetes.....I topped it all off with the new Celebration Cheesecake and it was ever so delious and appealing to my ever changing taste buds. The visit was very much a success with good food and even better service. No complaints here,  5 stars!", "rating": 5, "date": "8/1/2017"}, {"text": "Did take out this time. Took awhile to answer the phone but when they did, it was very quick and professional. The super antioxidant salad was very good, the Shepards pie is always a hit and the meatloaf was spot on as usual.", "rating": 5, "date": "7/22/2016"}, {"text": "Just stopped in for some cheesecake and a drink, great service! Great atmosphere, great drinks and amazing cheesecake! Will come again for sure!", "rating": 5, "date": "9/10/2015"}, {"text": "Best burger in town in my opinion is their Kobe Burger. It&amp;#39;s super tender and juicy and an awesome unique flavor to it. Only reason this place doesn&amp;#39;t get 5 stars is because its always super packed, TV&amp;#39;s are tiny, and the cheesecake is so expensive.", "rating": 4, "date": "3/21/2017"}, {"text": "Probably won&amp;#39;t be back. I came in at 11 not a busy time at all, and I was seated on the long bench that is meant for groups of people, I was just one person. I don&amp;#39;t appreciate being put where I have no privacy what so ever. By the time I left the whole bench area was full and I had no room to even move. There are small tables you could sit one person at. The long benches are meant for groups. Not party&amp;#39;s of 1.", "rating": 1, "date": "5/12/2018"}, {"text": "Horrible EXPERIENCE....We waited 2 1/2 hours to be seated...Once inside we waited another 2 HOURS to receive our meal...Food wasnt great but cheeseburger didn&amp;#39;t disappoint.....Our server was inexperienced and needed more training...I would NEVER visit again....I did notify the manager of the issues and NOTHING was corrected.....The manager seem like she had other issues to worry about than entertain mine....SAVE YOUR MONEY!!!! FYI CHEESECAKE LINE WAS A MILE LONG", "rating": 1, "date": "2/26/2017"}, {"text": "We are visiting a friend of ours in Birmingham and decided to go to our favorite chain restaurant, The Cheesecake Factory, we walk in and as usual the wait is long but we don&amp;#39;t mind. We are added to the list and said to be waiting 25-30 minutes which was okay with us since it was absolutely freezing outside. The male host, Chris, said we were able to try and get to one of the side tables as they were first come first serve. A table got up and as i was sitting down, 4 young women jumped right in front of me and told me the male host, Chris, said we can take this table. I went back to him telling him i was already sitting and he said it was too bad in a rather rude way. At this point i am a bit pissed but i brush it off because i am visiting some old friends. The first time our buzzer went off, we took it and Chris said the &amp;#34;battery was dead&amp;#34; and told us to wait another 10 minutes which we were okay with. The second time it went off, Chris, the male host said that &amp;#34;they have been trying to buzz us for 10 minutes and no reply&amp;#34; which was unusual because we were standing right in front of the desk the whole time and our buzzer never went off until then. The male host told us to wait about 10 minutes which turned out to be another 30. At this point we are a bit dissatisfied and furious at this point. We are then seated and a our waitress is quite pleasant. Our waitress Jane, a truly enjoyable person, always came to check up on us to make sure everything was alright. I ordered one of the simple burgers and everything was great but the fries. The fries just happened to extremely salty. My friend had an avocado egg roll and she enjoyed it. My other friend had ordered the four-cheeses pasta which she also enjoyed. Everything else seemed to be alright. It was just the beginning of our dining experience that made us a bit furious as we drove an hour to have dinner here and we were completely ignored the majority of the time. Will probably not be back. As long as Chris still works here.", "rating": 1, "date": "1/20/2019"}, {"text": "My go to restaurant when one is available, because the food is always delicious and there are a lot of options to choose from.  I like the fried macaroni and cheese appetizer and mix up my entree from one visit to the next.  the small Greek salad with grilled chicken is enough for a meal for myself,  especially if I&amp;#39;m having cheesecake (which I would never skip)! this location is small.  we arrived 15 minutes prior to the restaurant opening, and there was already a crowd gathered.   We were seated immediately,  but by the time we were finished eating there were several families waiting.  Service was quick and friendly.  Hope to be back soon!", "rating": 4, "date": "2/4/2017"}, {"text": "The wait at this location is very long. Doesn&amp;#39;t matter if it&amp;#39;s lunch or dinner, weeknight or weekend. It really doesn&amp;#39;t seem to matter if it&amp;#39;s even crowded, it just seems to take forever to get a table. OBVIOUSLY, if you are only going to get a slice for dessert, as we have, it&amp;#39;s much quicker, and that is a different review. The cheesecake is good. Very good. The rest of the food is the bigger issue.I have yet to have an entrée that blew me away, The prices are higher than average,and I think you must pay for the name or the novelty, because I don&amp;#39;t think the quality of food is worth it. We will go there solely for dessert from now on.", "rating": 3, "date": "1/30/2016"}, {"text": "Service and quality are really what makes a difference when you eat at a chain restaurant. I&amp;#39;ve been to several cheesecake factory locations in california as well as in Texas. This place however was the first ive ever run into that was DIRTY! <br&gt;<br&gt;Went to lunch there today. There was no wait for the patio so coworker and I decided to sit outside. It was nice out today! Sat down, got some bread (which weren&amp;#39;t warm as they usually are, the sourdough usually looses its warmth quick but neither roll was warm) opened the napkin roll to get a knife, only to find out my napkin had been used and the silverware was rolled with crumbs. Odd?! Now my coworkers napkin was clean but it had crumbs in it as well... Oh well Maybxe it fell in the basket of bread along with some shrimp tail and sauce on my napkin....gross!<br&gt;<br&gt;While waiting for our food i saw that the table next to us was being prepped the guy was arranging the little plates...then i noticed (through the window and glare! might i add) that one of the plates was obviously dirty...they guy ignored it and placed the napkin over it logistically so you wont notice any of that gunk!. I wasnt tripping that SHHHT WAS DIRTY. Like i just had a salad with some tomatoes and green onions dirty! It wasn&amp;#39;t just a speck. I cant believe he just ignored it like it wasnt there, like no one would notice. Seriously?! You&amp;#39;re that lazy?<br&gt;<br&gt;To add they forgot the onion strings on my salad :( why? it&amp;#39;s like the best part. Crunchy unhealthy fried onions mmmmm :) so the expediter wasnt any help which their case. <br&gt;<br&gt;I asked for the manager and told him about the nasty napkin and the nasty plate that was on the booth inside next to us...By then a lovely family had sat down on that booth but the lady wasnt having any bread lol so she hasn&amp;#39;t seen the NASTY plate. The manager swiftly went to the table and grabbed all the plates from that table. Good job! Other than that i really dont know if he talked to his employee...<br&gt;<br&gt;He told me that the prep their utensils outside of their kitchen area. I told him maybe they should pick a more sanitary place to work and roll those napkins.<br&gt;<br&gt;Oh and if you wanted to know the manager did comp our food, not that we cared for him to do that. We were on a company lunch and i really just wanted him to tell his lazy employee to pick up his act and not make their team look bad.", "rating": 2, "date": "11/11/2013"}, {"text": "Service is horrible and management doesn&amp;#39;t care.  Had bad service two days in a row; I won&amp;#39;t be bothered a third time as my lesson has been learned.  The staff is rude or just flat out ignores you and management doesn&amp;#39;t care.   Avoid and just go to Pappadeaux&amp;#39;s.", "rating": 1, "date": "1/23/2016"}, {"text": "I LOVE the Cheesecake Factory but I cannot rate higher than 2 stars for my latest experience. First, let me clarify that I work in the restraunt industry and I am also an avid cook. I know food prep and I know when its bad.<br&gt;<br&gt;We called ahead and were quoted a 45-1 hour wait but when we got there, we were quoted 20-30 which was excellent. However, we were seated at an incredibly small table where one wall was booths and the other were chairs. Besides the 2 of us, there were 3 other people on the booth seating and it was cramped to say the least. I understand you want to seat as many tables as possible, but breaking up a 4 top for a 2 top is not a solution when they have no elbow room.<br&gt;<br&gt;Bread and butter were meager, disappointing as they used to have harty portions. We placed our orders after much debate--he got catfish, I got some pasta (can&amp;#39;t recall the name, it was a penne pasta with mushrooms and wine sauce.) I asked to substitute noodles for angel hair and our server was happy to do so. Sadly, my pasta was AWFUL. The noodles were so overcooked, it was hard to chew them they were so sticky and crunchy all at one. The sauce was also improperly reduced and still had a bitter, acrid aftertaste that told me they had not cooked out the alcohol. After lots of debate, I finally sent it back and ordered a burger instead. The burger was good, but I asked for it to be cooked medium well and it was well done to say the least. My fiance&amp;#39;s catfish was good but he found multiple &amp;#34;corn hairs&amp;#34; in his vegetables (which tells me they did not shuck the corn properly) and his fish&amp;#39;s breading fell away when he touched a piece. Really disappointing, considering our bill was about $70 with the tip.<br&gt;<br&gt;The only reason this isn&amp;#39;t 1 Star is because our server was superb. I believe her name was Charlie---long blond hair, very sweet. She was very apologetic and speedy and kept our drinks full. Such a shame their staff seems to be amazing on the floor but sub-par at best in the kitchen.", "rating": 2, "date": "1/9/2016"}, {"text": "You&amp;#39;ve heard the phrase &amp;#34;eat local.&amp;#34; This is the opposite.<br&gt;<br&gt;I think people dine here because they are impressed by the decor. The interior is spacious, even lavish. <br&gt;<br&gt;It should be great, right?<br&gt;<br&gt;Service is attentive &amp;amp; pleasant. No issues there.<br&gt;<br&gt;There&amp;#39;s only one problem: the food pretty much sucks.<br&gt;<br&gt;I daresay that if you served this food in a &amp;#39;hole in the wall&amp;#39; type of location, it would be out of business in a month.<br&gt;<br&gt;Most of this stuff seems to have originated in a can, mix, or freezer.<br&gt;<br&gt;It can either be bland, too sweet, or too spicy.<br&gt;<br&gt;The &amp;#39;green salad&amp;#39; consists of a bowl of lettuce doused in lousy bland dressing.<br&gt;<br&gt;The &amp;#39;chicken mushroom lettuce wraps&amp;#39; are grossly overseasoned.<br&gt;<br&gt;It&amp;#39;s not cheap, either.<br&gt;<br&gt;I don&amp;#39;t mind paying for good food. <br&gt;<br&gt;This is not good food.<br&gt;<br&gt;Cheesecake Factory was probably good when it started, many years ago. Then it became more of a &amp;#34;factory&amp;#34; (hey, at least they are honest). It&amp;#39;s an example of a chain restaurant that has embraced mediocrity and style over substance.<br&gt;<br&gt;There may be some desirable items on the menu, but I&amp;#39;ve had no luck finding them.<br&gt;<br&gt;I really don&amp;#39;t understand dining here when there are so many better options in Birmingham. Heck, there are at least a half dozen better options within a mile.<br&gt;<br&gt;Waiting any length of time to dine here is just plain sad.<br&gt;<br&gt;I am being generous in giving this place two stars.", "rating": 2, "date": "7/16/2013"}, {"text": "My husband and I aren&amp;#39;t typically a fan of chains but the food at the cheesecake factory was fresh and delicious. We sat at the bar and our bartender was awesome knowledgeable of the menu and fast! Of course the cheesecake was to die for with the Dulce de Leche and the traditional with strawberries. The tie wrap appetizer was phenomenal and big enough for a meal. The waitstaff  worked together flawlessly to make our  experience awesome. Would definitely go back.", "rating": 4, "date": "9/4/2016"}, {"text": "I followed the instructions provided and submitted my information, but have not heard from anyone.", "rating": 1, "date": "12/31/2016"}, {"text": "Went tonight and as usual had a great experience. There was about a 30 minute wait which was a surprise being that it was a Wednesday. Our server was kind and quick. I ordered the factory burrito grande like I always do and was as usual satisfied. My only complaint is that the restaurant was too cold so it made me want to leave quickly.", "rating": 5, "date": "12/28/2016"}, {"text": "No! Skip it, nothing but slow service, slow food, and rude management. If you want corporate, crap food, then sure go here.", "rating": 1, "date": "9/30/2015"}, {"text": "Don&amp;#39;t ever attempt to call a to go order in on a weekend. You&amp;#39;ll get put on hold and sent to a phone that no one ever answers. I was on hold tonight twice for 15 minutes each time and I only waited that long the second time because it was almost comical at that point. This isn&amp;#39;t the first time this has happened, either. I&amp;#39;ll give them three stars because the food is decent and the cheesecake is good but it always seems like they are understaffed and the service suffers.", "rating": 3, "date": "7/25/2015"}, {"text": "When you want a large selection of items on the menu (Salads, Appetizers, Italian, Burgers, Cajun, Asian Fusion, Steaks, Comfort, Desert, etc.) go here. If I want consistency in drinks and food, I&amp;#39;m never dissapointed. If its crowded and you don&amp;#39;t mind a slightly busy atmosphere, first come first serve in the bar area! If you&amp;#39;re too full for dessert, some meals are dinosaur portions, take the cheesecake home for layer. It keeps very well. Anyways, I agree wholeheartedly with other reviewers... certainly consistent in quality!", "rating": 5, "date": "9/27/2015"}, {"text": "The food is really lacking in flavor... I get the same thing every time.. I will stick with cheese cake only..", "rating": 3, "date": "10/30/2017"}, {"text": "I had an awful experiment with my to go meal but they manager assured me he would take care of everything he offered to remake the food (which I declined) and gave me a refund he even through in a free slice of cheesecake for all my trouble.", "rating": 4, "date": "7/24/2015"}, {"text": "Ordered take out pasta and they somehow forgot to put the sauce on my pasta. It wasn&amp;#39;t edible. Complete was of money.", "rating": 1, "date": "9/27/2017"}, {"text": "Everyone knows the factory had a huge menu. After much debate I decided to try the seared turns steak. Big mistake. The tuna was cooked all the way through (usually served seared and very rare), and was dry and fishy tasting. The rest of the dishes were ok but not worth the hype this chain receives. I was very disappointed and haven&amp;#39;t been back. There are so many other better restaurants in the area in the same price range id rather spend the money on.", "rating": 2, "date": "12/12/2015"}, {"text": "I went to the Cheesecake Factory after a 2 year hiatus due to terrible service! Well not very much has changed in that time. I was with co-workers from my employer who was treating us to a Holiday Meal, our entire department was there. We sat in two columns of tables against the long communal booth with chairs. One half of our tables got their entree&amp;#39;s in a timely fashion. Our half of the tables waited an additional 20 minutes and our waiter who seemed dyslexic, listless, basically present in body and absent in mind disappeared into thin air! Our entree&amp;#39;s sat in the kitchen and were lukewarm at best when they FINALLY arrived to the table; for heaven sakes all I ordered was the Fresh Grilled Salmon, broccoli, and subbed Mashed Potatoes for Brown Rice (Lunch Serving) not very difficult! I finally got my lukewarm entree 20-30 minutes after I ordered. I believed this to be the same young man who waited on me personally two years before and resulted in a 2-year hiatus! He disappeared and our entree&amp;#39;s sat to get cold! Our director was pissed and so were some of my other co-workers. He didn&amp;#39;t offer any apologies nor did he involve a manager, just as he didn&amp;#39;t the last time I had the displeasure of his service! I was so done with the experience I darted back out and down the road to work! You just don&amp;#39;t expect such an experience. Last time I had this displeasure I didn&amp;#39;t write a review anywhere, this time I had to let others know!", "rating": 1, "date": "12/7/2017"}, {"text": "By far the WORST eggs Benedict I&amp;#39;ve ever had!  Eggs were hard boiled. Yuck!  Fruit looked like it was 5 days old. The blue berries tasted like bananas. The omelette was like a rubber yellow basketball. Cut back on your 20 page menu. Service was like a dead fish. Y&amp;#39;all need to get your act together.", "rating": 1, "date": "9/11/2016"}, {"text": "A coworker and I tried again during lunch on a weekday.  We both had the pasta - I had the spicy chipotle chicken and she had the Louisiana chicken pasta.  Both of us REALLY enjoyed it.  I don&amp;#39;t really care for the bread that they serve.  I don&amp;#39;t like the brown bread and the white bread is usually tasteless.<br&gt;<br&gt;The service was fast and pretty good.  No complaints there.<br&gt;<br&gt;It is pricey though, even at lunch.  Just the pasta with water was $12 - and that&amp;#39;s not including the tip.<br&gt;<br&gt;My experience with lunch was a lot better than with dinner.  Note that we did get there before noon, so that might be part of the reason why the service was quick.  I&amp;#39;m not sure how it is during the real rush.", "rating": 4, "date": "3/27/2013"}, {"text": "Great place to eat. The staff and service was excellent. We ate lunch and the food was delicious. The turkey sandwich with bacon and avocado with a green salad was out of world.", "rating": 5, "date": "8/20/2016"}, {"text": "This is my first visit to The Cheesecake Factory and I am suitably impressed. The decor is very nice. The staff is very good. The food is excellent. We had the parmesan bread and the spinach dip. Both were perfect. I had the Cuban and it was very good. The tira misu cheesecake was an excellent finish to an excellent meal. For the quality and quantity it is certainly worth the price.", "rating": 5, "date": "9/16/2017"}, {"text": "I&amp;#39;ve enjoyed the cheesecake factory since I first discovered them in San Antonio! The food is good, but nothing signature! Typical American food, but the cheesecakes are to die for! I love so many of the selections they offer. The slices are humongous &amp;amp; I only go for the cheesecake!", "rating": 3, "date": "12/21/2013"}, {"text": "I enjoy a gluttonous 10,000 calorie meal as much as the next person, and even though the food is good, I&amp;#39;m not sure I &amp;#34;get&amp;#34; this place.<br&gt;<br&gt;With a menu that rivals an encyclopedia, you can essentially have whatever your heart desires at Cheesecake. Mexican? Sure. Italian? Ok. So with a menu this large and no real &amp;#34;specialty&amp;#34;, guarantee a good, but not stellar, dish. I&amp;#39;ve gotten pasta from this location a handful of times and its good, but its nothing special. Their cheesecake, however, is divine. I reccommend the Godiva.<br&gt;<br&gt;So yeah, the food is good. Never had an issue with service. I just can&amp;#39;t understand why it is so ridiculously busy. On any given night you can expect a wait, especially weekends. Why?! What is offered here that is so outstanding that makes men women and children want to sit outside for 2 hours to get served some pasta that was made in the microwave (Let&amp;#39;s be real about how these sorts of chains operate)? With an array of local dining in Birmingham that I am discovering, I can&amp;#39;t understand the long waits at Cheesecake. It&amp;#39;s not worth 2 hours, sorry.", "rating": 4, "date": "9/23/2013"}, {"text": "Love the Banana Creme Cheesecake, but my favorite is the Red Velvet. Always wondered why some slices are smaller than others???", "rating": 4, "date": "12/22/2013"}, {"text": "Great selection, I&amp;#39;ve had everything from Vietnamese Tacos to a Kobe burger, and have always enjoyed everything I ordered. <br&gt;Long lines and waits, so it&amp;#39;s best to come before or after the dinner rush.<br&gt;I especially love the low calorie menu options, for they&amp;#39;re unique and actually worth eating, unlike most low calorie items at other restaurants.<br&gt;I come here often, and have never had a bad experience.", "rating": 4, "date": "11/3/2013"}, {"text": "We stopped in for lunch. This is the second experience I&amp;#39;ve had at the Cheesecake Factory. I ordered a Burger, I was ok, definitely not the best and I wouldn&amp;#39;t order it again. The cheesecake was fantastic, we got the Mocha and the 30th Anniversary.....both were FANTASTIC!", "rating": 3, "date": "8/20/2015"}, {"text": "Cheesecake Factory is a big company so it&amp;#39;s hard for them to focus on the quality of that vast Atlas Shrugged sized menu, however some of their new stuff is BOMB!<br&gt;<br&gt;The small plates menu is my favorite, I really enjoy the goat cheese and beat salad and the ahi tartar. It has become obvious to me that when it comes to eating there, if you want cheesecake then it&amp;#39;s probably best to stick to a few of the tapa&amp;#39;s and get the dessert.", "rating": 3, "date": "8/24/2013"}, {"text": "Lunch at the Cheese Cake Factory after Mass, large crowd but wait for seating was short. I enjoyed the Fish &amp;amp; Chips and I think the fish was Cod. If you are hungry get the dinner portion, and yes it cost more but you get more than you will if you select lunch portion.  Their cold slaw is always delicious, their Passion tea I give a zero, its not sweeten and I guess I am comparing their tea to Starbucks Passion tea that is really good and you can get it already sweeten. I guess they did not listen to their mama when she said its hard to sweeten cold tea. Overall my eating experience at this place is a 9. I was too full to get my cheesecake this visit.", "rating": 4, "date": "4/24/2016"}, {"text": "It is a big chain and for some reason they think they need an even bigger menu to match. This become a blessing and a curse. If you were to try to read all the items in the menu without already have some familiarity with it, you would spend about 30min before you would order anything. It is literally as long as a magazine and it even has advertisement pages in it. REALLY? in a menu that is already god awfully long?<br&gt;<br&gt;The blessing comes from the fact that if you can read the the entire monstrosity you are bound to find something that fits your food preference.<br&gt;<br&gt;I actually am a big fan of their skinnylicous menu as a semi healthy route to go in a place that normally gives you a 3,000 calorie meal. First, could they come up with a slightly less feminine name? A 5&amp;#39;11&amp;#34; 200 pound, dude feels weird choosing something attached to the adjective skinnylicous. It makes me need to order a beer to compensate, which defeats the purpose of order off that menu section in the first place. Second, it adds 2+ pages to a menu that already exceeds 12 pages.<br&gt;<br&gt;I feel like I am back in college studying for a final ever time I try to tackle this menu.", "rating": 3, "date": "9/24/2013"}, {"text": "This place is awesome. One might have to wait 15-30min to be seated, but that&amp;#39;s because so many people want to eat here. We just had a beer at the bar while we waited any ways. Expect to pay a bit more than most places, but the food is better and comes in huge proportions. My wife and I usually just split something and we are both full. And the cake was huge.", "rating": 5, "date": "4/4/2016"}, {"text": "The Cheesecake Factory is always a nice choice for me.  The food is delicious, portions are generous, &amp;amp; the prices are reasonable.  Thanks to the &amp;#39;water lady&amp;#39; &amp;amp; the server Cameron for their professional, friendly, &amp;amp; kind service.", "rating": 5, "date": "3/11/2016"}, {"text": "Man. The &amp;#34;food off truck&amp;#34; model has proven itself to be what it is. The service was disappointing. The food was way off. Can&amp;#39;t come back. Just won&amp;#39;t do it to the fam again.", "rating": 2, "date": "6/20/2017"}, {"text": "Where to even begin?? We went on a Sunday evening at 7pm, the hostess never looked up from the computer screen and was very short, we even heard her yell at a waiter. We were seated and ordered drinks which were fabulous, we placed Our order for food and then the wait began. An hour later we get our food (Miso salmon and Evelyn&amp;#39;s pasta). The salmon had a very fishy taste and not in a good way, the pasta was hard and rubbery in texture and the dish lacked the olives, eggplant and artichokes that were stated on the description on the menu. We asked for a manager and explained the issue, she took our plates and took the charges off (we paid for our drinks) which was great, but she didn&amp;#39;t really fix the problem. We left hungry and pissed. Will never go back.", "rating": 1, "date": "3/26/2017"}, {"text": "Awful! Awful! Awful! Would give zero stars if I could. Waited 15 minutes just to get drinks and they were not busy. Only saw our waiter two times. Food was overpriced and absolutely disgusting. I spent 20 mins in the bathroom afterwards feeling sick. The Bistro Shrimp Pasta was very bland and had very little flavor. The shrimp itself had no flavor at all. I felt like I drank a bottle of olive oil afterwards. My husbands fish and chips was gross. The breading was falling off and it was just super greasy and bland as well. We spoke to the manager on the way out and she offered to send a free cheesecake home with us. I don&amp;#39;t want to eat another thing that comes out of that restaurant, I don&amp;#39;t care if it&amp;#39;s free or not. When I described what my dish was like to the manager, she wouldn&amp;#39;t take responsibility for it. She just said that it was a heavy dish and she was surprised by what my husband said about his fish rather than apologizing. This was supposed to be a special night for us and now we are on on our way home feeling sicker than dogs. Next time, we will stick with PF Chang&amp;#39;s. This might be the worst restaurant in Birmingham.", "rating": 1, "date": "8/14/2018"}, {"text": "The food is great and the cheesecake is amazing. The place is always crowded but that&amp;#39;s how you know it&amp;#39;s the real deal!", "rating": 4, "date": "4/12/2015"}, {"text": "We went at an odd time and were seated rather quickly.  Our waiter was preoccupied with something because he simply took forever. The food was good. Had chopped salad and of course cheesecake.  Very yummy.  Waiter ... less than desirable.  I am sure we will go back but wasn&amp;#39;t the best of times.", "rating": 4, "date": "1/25/2015"}, {"text": "The size of this menu is ridiculous.  I felt like I was handed a book to read.  I can&amp;#39;t imagine much is freshly prepared when a kitchen has to be prepared to quickly send out any one of the hundreds of choices they offer.  <br&gt;<br&gt;We ordered the calamari to share and it was very good.  It was lightly battered and not chewy.  It&amp;#39;s served with a spicy cocktail and a mayonnaisey tartar sauce. I got the greek salad and turkey avocado sandwich.  The salad was ok.  A little bit of arugula topped with a lot of tomatoes and thick cut cucumbers, kalamata olives and some feta cheese.  The sandwich was loaded with turkey meat, but it was incredibly dry and tasteless.  The bacon that was on it was old and rubbery.<br&gt;<br&gt;The dessert menu is as extensive as the dinner menu.  We went with the simple cheesecake with strawberries.  It was delicious.  The slices are huge, so we shared this as well.<br&gt;<br&gt;Overall, the place is clean and our server was very attentive.  Since I wasn&amp;#39;t anticipating much from such a huge chain restaurant, I guess you can say that they met my expectations.", "rating": 3, "date": "6/24/2013"}, {"text": "Our server Amanda made the night!  So fun and so helpful. Everyone should ask for her to wait on them!", "rating": 5, "date": "5/10/2017"}, {"text": "Haven&amp;#39;t been to a cheesecake in years and this place definitely lives up to it&amp;#39;s name everywhere. The chinese chicken salad was amazing and so was the spicy chipotle pasta. Our waiter was super nice and friendly made sure we had everything. Even put up with 3 crazy kids.", "rating": 5, "date": "7/2/2017"}, {"text": "I came here with a party of 6 on a weekend, and we had to wait eons. I guess everyone in Birmingham loves Cheesecake Factory (everyone with a pulse loves Cheesecake Factory) but we were so long in waiting to be seated I was sure I&amp;#39;d starve. maybe that&amp;#39;s just the nature of a small city like Birmingham--having crowds like in like that. wouldn&amp;#39;t know. I&amp;#39;m a New Yorker.", "rating": 3, "date": "2/14/2015"}, {"text": "A family favorite. Love that there is something for everyone on the menu and it is always delicious. Of course the cheesecake is divine.  Cannot say enough about how much we love the atmosphere, service and food.", "rating": 5, "date": "6/24/2017"}, {"text": "The Potato soup needs to come with cheese and bacon on-top. The soup also needs to be hot and more chunkier. The potatoes need to be bigger.", "rating": 2, "date": "11/10/2012"}, {"text": "Let me share a little history related to the Cheesecake Factory at the Summit in Birmingham. For approximately the last 7 years a large group of us have traveled to Birmingham for an annual event. On Sunday morning as we are leaving town we always stop at this restaurant. Because we are a large group we call on Saturday night to let them know to expect us. I wouldn&amp;#39;t say we have reservations but they extend the courtesy to serve us. Until this trip.,,,, Saturday night when we called the manager, Nick I think was rude and even called the caller a liar when he explained our history. We are sitting here now after an hour and I&amp;#39;d like to take our considerable business elsewhere. The manager did not make himself available until we had been there about 45 minutes and the receptionist asked one of our party to step away from the counter. I&amp;#39;ll submit a review of the food later. (I need to correct one thing, we called early this morning, not last night). Next year we&amp;#39;ll take our $500 check and tips elsewhere.  I", "rating": 2, "date": "6/12/2016"}, {"text": "Beautiful place, but I knew I knew as soon as I saw the 26 page menu book, that this was a place that didn&amp;#39;t specialize in anything and would be lucky to be mediocre at some things. Wow, was I wrong. I was there with 6 people, we had appetizers, entrees, drinks, and desserts, and shared. Everything was excellent. Foods that I do not like were good here. I had the Bang Bang Thai chicken and shrimp. It was awesome!", "rating": 4, "date": "5/3/2015"}, {"text": "I had the chicken sandwich and my wife had the cheese steak.. Both were bland but well cooked. If you have never experienced eating here it&amp;#39;s worth the trip. Now the cheesecake is 5 stars hands down so to us this would be a great place for coffee and cake.", "rating": 3, "date": "4/6/2015"}, {"text": "Was on my way back from the Leeds outlet and remember Birmingham does have a Cheesecake Factory.<br&gt;<br&gt;Stopped in and went right to the bar. I always get great service whether alone or with someone sitting there.<br&gt;<br&gt;Bartender was very accommodating and helped with drink menu and some bread. Always love the flavored tea at CF and the Mango was excellent.<br&gt;<br&gt;Decided to get the clubhouse salad, and was surprised how big and good it was. Lots of toppings and the right amount of dressing, not tooo much. :)<br&gt;<br&gt;The thing was big, lots of food, but I managed to eat the whole thing. LOL. <br&gt;<br&gt;I could not come to the CF without getting a piece of cheesecake, took me longer to decide which kind cheesecake than my dinner salad. LOL.<br&gt;<br&gt;Decided on the White Chocolate Raspberry Truffle, and boy was it good. I had pretty much a food coma after. But it was worth it!", "rating": 4, "date": "8/8/2012"}, {"text": "This is one of my favorite restaurants! No matter what you&amp;#39;re in the mood for, they are bound to have it! The portion size means at least three meals for me and the cheesecake is to die for!", "rating": 5, "date": "6/21/2015"}, {"text": "Every time I carry my wife here the service, food,and experience is amazing awesome food great price for the quality and portion size and the lemon raspberry cheesecake is amazing so is the turtle and the godiva . But my favorite is the red velvet cheesecake and bourbon glazed chicken", "rating": 5, "date": "5/30/2015"}, {"text": "No complaints! Excellent service. Excellent food. Best of all the cheesecake!  Many meal choices and amazing cheesecake choices. The only complaint that I could have is the odd seating in some areas, but the food erases that issue. Yummy! Definitely a good choice.", "rating": 5, "date": "1/13/2015"}, {"text": "At first the menu and idea of it being a chain restaurant was overwhelming but since I found my favorite dish, the Chicken Bellagio, I haven&amp;#39;t looked back.  Make sure to ask for a to go box cause you won&amp;#39;t be able to finish it!", "rating": 4, "date": "6/4/2014"}, {"text": "As much as I wanted to love my $20 plate of pasta, this was one of the worst meals.  I placed my to go order (I always order this dish to go so I know what it is supposed to taste like even when made to go) and waited for over 45 minutes during what was a slow time for a restaurant (2:30pm).  When I got my food, I luckily opened it up to see that my Cajun pasta was all Cajun but no pasta.  I reluctantly went back in and asked for some extra pasta (after all, I did pay $20 for it and that&amp;#39;s a splurge for me).  I wish I had eaten it there so I could have sent it back all together.  The chicken was very soggy and not cooked well and the usual shrimp that used to come with the pasta had been replaced with small popcorn shrimp that tasted as if it had been frozen.  Over all, I don&amp;#39;t think I will be eating here again.  Or if I do decide to give them another chance, I&amp;#39;ll sample my food BEFORE I leave to make sure it&amp;#39;s edible.", "rating": 1, "date": "7/31/2015"}, {"text": "Dinner for 2. We arrived 15 min before happy hour was over and waitress wouldnt give us any happy hour discounts.  I ordered The NY strip with. Bone in. Waitress said it was 10 oz but there was no way it was any more than 6.    Steak was about 1/8th of an inch thick, was tough and flavorless. I&amp;#39;ve had better steaks at Applebee&amp;#39;s 2 for $20 deal. I ordered a bottle of wine for dinner about 10 min before my steak but the waitress refused to bring it because my wife had a martini. I complained and she explained they were not allowed to serve more than 2 drinks by law. I complained to the manager because I didn&amp;#39;t have a drink to enjoy with my steak and she said sorry it&amp;#39;s the law.  My wife had to chug back her martini so we could get the wine. They brought it about 10 min after our dinner was served and not until my wife&amp;#39;s martini was gone.  Total bill was $125  plus tip. Horrible service horrible food never go back again", "rating": 1, "date": "8/26/2017"}, {"text": "Got here for lunch at 11 am. If you come much later, you usually have To wait a long time. There were two of us and we were sat in the middle and the table next to us was so close I could smell the perfume on the lady next to me and hear everything they said. It was disappointing they crammed so many two top tables so close. It Made for an uncomfortable lunch. You can get a high top table at the bar and it&amp;#39;s more private. I think those are first come, first serve. The food was mediocre. The menu extensive and a bit  overkill. Not good for those indecisive minds like myself. They do have a skinny menu for those watching calories.", "rating": 3, "date": "8/9/2014"}, {"text": "I have held off writing this review for a long time.  I have eaten here on several occasions and I can&amp;#39;t figure out why.  The service is OK.  The people seem friendly but over worked.  Long time to get refills and such.  The atmosphere is super cool.  Pretty dark but enough light to get it done.  The menu is monstrous.  Maybe that&amp;#39;s the problem.  They make so many things they don&amp;#39;t have time to get great at anything.  I&amp;#39;ve had club sandwiches, steak burgers, fish and it is all just so so.  When the bill comes I honestly ask myself every time why do we keep coming back.  It isn&amp;#39;t terrible but for the price I should be blown away.  Also it is extremely loud inside.  Always.  If this place lowered the prices it would be worth more stars but at what they charge it isn&amp;#39;t worth it.  We only go to they take out line to order cheesecake to go now and that is just fine.  The cheesecake is amazing.", "rating": 2, "date": "1/30/2016"}, {"text": "This place has great Cheesecake, but the food was average. Service was great, the waitress went above and beyond in customer service. The Fettuccine Alfredo was average, nothing spectacular about it, and the veggie burger did not taste the best. This is in regards to the price that we paid for the food, but it was still good food. I had the Chocolate cheesecake, and it was excellent.", "rating": 4, "date": "10/13/2015"}, {"text": "Got take out to bring back to hotel. Had horrendous, rude, patronizing service from woman at dessert/take out bar.  I&amp;#39;ll spare the details, suffice it to say, I would never recommend or go to this location again.  Food was good however.  Excellent salads and dressings. Had Boston salad and wife the Chopped Salad.  Shrimp Scampi good.  Banana Cream Cheesecake was outstanding.", "rating": 3, "date": "4/4/2014"}, {"text": "Service...... 2 stars.<br&gt;Food.....3 stars.<br&gt;Controlling your restaurant.......ZERO stars.<br&gt;As a paying customer, the staff should attempt to make everyone&amp;#39;s visit worth the money and wait. Last night two friends and I visited the CF for dinner around 9pm. We were seated on the patio due to nice summer to fall breeze. Unfortunately, we had no idea that the volume control was under no constraints on the patio area. The table sitting next to us was so loud and rude the entire dinner. Needless to say, I will not be going back for awhile. The manager came over to ask us if we wanted to be moved, at the end of dinner. Give me a break!!!", "rating": 2, "date": "9/11/2011"}, {"text": "As good as any other Cheesecake Factory. Good food, service, and prices aren&amp;#39;t too crazy.", "rating": 4, "date": "5/19/2014"}, {"text": "Horrible service every time we have come here. The kids like the food, but holy cow is it over-priced for what you get... and the service is consistently horrible - from waiters who stare you down if you ask them to, you know, serve you to mercurial space cadet servers. In fact, I am writing this review as I sit here at the Cheesecake Factory (hopefully for the last time) waiting for our server to bring out the complimentary bread after the 5th request!", "rating": 1, "date": "6/4/2016"}, {"text": "Had dinner here this evening...Cheesecake Factory may not be five star but they deserve at least 4..I ordered the chicken and biscuits which I was skeptical about but it was delicious..server was great..birthday song was sweet! They gave a mini ice cream sundae. Great experience", "rating": 4, "date": "9/22/2014"}, {"text": "We love the Cheesecake factory. Sure, it&amp;#39;s a chain, but the food is great and the restaurant operation is very well organized. You don&amp;#39;t have to wait long for the food, even when the place is packed.", "rating": 5, "date": "8/9/2015"}, {"text": "My husband and stopped in this Cheesecake Factory as we were heading to Chattanooga to celebrate our anniversary. We were seated immediately by a smiling hostess and our waiter was also pleasant and attentive to our needs, without hovering. I ordered the Chicken Stuffed Tortillas that came with Black Beans and Corn Cakes. The waiter was very apologetic when he notified me that they had run out of black beans but he was quick to offer any side dish of my choosing as a substitute. My meal was prepared and presented very well! I enjoyed consuming my meal while debating which flavor of cheesecake I was going to get...I settled on the Turtle Cheesecake and was completely in Heaven while enjoying it!!", "rating": 5, "date": "9/9/2013"}, {"text": "Cannot rate the food as we sat on the outside patio for 15 minutes with our menus and never got a glance from any of the waiters.So we left, very disappointed as I have heard lots of good reviews on the cheesecake.", "rating": 2, "date": "11/9/2013"}, {"text": "The popularity of this place is mystifying. Expect 45-60 minute waits on Friday or Saturday nights. The food tastes like what you would expect from a chain. It&amp;#39;s edible but everything is cookie cutter. The sald dressings and sauces taste like they are from mixes, nothing tastes authentic. Obviously I&amp;#39;m in the minority in my opinion, but when I go out I want meals that I can&amp;#39;t make better at home. And I&amp;#39;m not a fan of oversized portions, which are de rigeur here. If you want to add to the obseity epidemic, this is a great place to start.", "rating": 2, "date": "3/7/2013"}, {"text": "Arrived at this location last evening at 5:00 with a party of 10 to celebrate 2 birthdays. We were given a beeper and told it would be 6 hours! 6 hours!!! Instead of being courteous enough to at least tell us that they were too full to serve us, we were given this ridiculous wait time! Very very poor customer relations!!!! We won&amp;#39;t be back!! The food isn&amp;#39;t good enough to wait an hour and certainly not 6 hours!", "rating": 1, "date": "5/1/2016"}, {"text": "I used to say &amp;#34;I&amp;#39;ve never had a bad meal&amp;#34; here, but just had my second. Maybe a Cuban is not the best selection, but at $12.95 it should be a solId offering.  It was served warm, but the bread was over cooked and black in parts, which means it should never have been served. Inside it was just ok and fairly bland... It was missing some spark of favor or life to it. When you wait 40-45 minutes for a table shouldn&amp;#39;t you expect more? And to top it off... And perhaps the worst part... They ran out of ORIGINAL CHEESECAKE!!! How does this happen at the CHEESECAKE FACTORY. Extraordinarily poor planning... They had some but it was frozen solid, meaning they just forgot to put some in the right cooler in time. It was a disappointing dinner for four, and at $82+ tip, there are plenty of other choices around town.", "rating": 3, "date": "3/1/2015"}, {"text": "When The Cheesecake Factory opened in Birmingham, I remember being a part of the Hype Brigade, sitting in line with a 2+-hour long wait to get a table.  It was very much worth it, and for the next couple of months, my wife and I probably visited several times again.  Then it happened - we got burned out and didn&amp;#39;t go back for over a year&amp;#39;s time until this week.  And I&amp;#39;m happy to say that the food is as good now as we remembered.  Everything we tasted, from the appetizer (Tex Mex Eggrolls are SO fantastic) to the main entree, was phenomenal.  The wait staff, hostess, and even the workers behind the dessert area were exceptionally welcoming, even for a restaurant that&amp;#39;s been in business for quite a while here, and is notably popular from just word-of-mouth alone.  (Sometimes a good reputation becomes a crutch for good restaurants, leading them to stray from the things that made them good in the first place...)<br&gt;<br&gt;I seriously doubt that with the HUGE variety of foods, cordial employees, and mellowed atmosphere, you will have a disappointing time at The Cheesecake Factory.", "rating": 5, "date": "9/4/2009"}, {"text": "We went this weekend and the staff catered to us the whole time by making changes to our order to make our meal better &amp;amp; satisfy our pickiness. LOL. The atmosphere was great and we had a nice time. EXCEPT for the table next to us who let their kid do flips on his chair tossing his feet an inch from my face....and they sat there and watched without saying a word to the boy. People.... leave your kids at home if you can&amp;#39;t make them act right in public....and if you&amp;#39;re gonna just let them be rude anyway, just stay home yourself!", "rating": 5, "date": "10/28/2013"}, {"text": "Me and my bestie came here yesterday for dinner. It was so packed!! We opted for any seat in the house because we were starving. We didn&amp;#39;t care whether it be inside or outside in the heated patio. The wait was only 15 mins and we ended up with the &amp;#34;heated patios&amp;#34;. Let me tell ya it was like 48 degrees and not enough fire torches. I was freezing my fingers off. Bestie had a sangria and not even that could keep her warm. Other than that. The service was kind of slow. There was a lot of lag time from us getting the menu to getting the orders in. But our server did do a good job serving us though. He kept my sweet tea cup always full. I had Evelyn&amp;#39;s pasta. My fav always. The olives weren&amp;#39;t cut to bits here. That&amp;#39;s a good thing. I just flicked them to the side more easily. However I don&amp;#39;t like that big fat pasta cylinders. The flavor just doesn&amp;#39;t incorporate well with the light sauce drizzle. That&amp;#39;s just my opinion. I miss the old squiggly pasta they had. Overall dinner here was great. &amp;#39;Twas a great night in Birmingham!", "rating": 5, "date": "12/5/2015"}, {"text": "It&amp;#39;s a little over priced and I always get questionable service here, but I always enjoy my food. The food is really good for a chain restaurant, but the service drags it down a bit. This trip my wife&amp;#39;s tuna was entirely too spicy for either of us to eat, but other than that the food was good.  The cheesecake is always solid.", "rating": 3, "date": "3/10/2013"}, {"text": "The Pina Colada Cheesecake earns 5+ stars. Heavenly. I won&amp;#39;t wait an hour to eat a meal there on any given weekend but I will walk to the dessert carryout register and get a slice for an extra special treat to take home. More than enough for 2 to share. <br&gt;On second thought, maybe you shouldn&amp;#39;t try it because it is addictive and I&amp;#39;m sure very bad for you :P", "rating": 5, "date": "9/4/2011"}, {"text": "Good food.  Great staff.  Great service.  The patio is nice on a cool afternoon.", "rating": 4, "date": "9/7/2013"}, {"text": "Amazing service, amazing food selection and taste, and our waiter, Jacob, was nice and very polite. Place is absolutely amazing!", "rating": 5, "date": "10/20/2013"}, {"text": "Great food. Sometimes the employees make you want to pull your hair out, but the cheesecake can be worth it.  I love the huge portions you get for your money.", "rating": 4, "date": "9/18/2013"}, {"text": "We&amp;#39;ve always had good service and if there is a problem with the order, it is handled quickly and efficiently. Wait times can be long, but are better than other locations.", "rating": 5, "date": "3/6/2016"}, {"text": "Saturday night and wait was short, food was great (ordered jambalaya chicken pasta, steak Diane w shrimp scampi and the tuna rapacious for an appetizer). Waitress lacked a bit in attending to our needs (waiting for silverware, got my pasta choice wrong, didn&amp;#39;t check on us much) but was otherwise very friendly.  They give you so much food two could probably share one entree. Always loved the Cheesecake Factory ad this location didn&amp;#39;t disappoint. Great way to end our time in the Birmingham area.", "rating": 4, "date": "7/6/2013"}, {"text": "Me and my Mom enjoyed our lunch very much -We shared an entree salad with fried chicken and fresh greens - we both agreed it was the best salad we ever had - also split a slice of cheesecake which was excellent -  Only next time we will ask for our dessert to be brought first so it has time to warm up, it was cold and cheesecake is better at room temp. - Our waiter was so good and helpful that we left him an $11 tip on a $28 check - Food, atmosphere and service were some of the best we have had while traveling - will defineately go again on trips to Birmingham", "rating": 5, "date": "9/9/2013"}, {"text": "We were seated quickly, had superb service and the food was all amazing.   There are so many choices on their menu that we had a hard time deciding.  <br&gt;<br&gt;I had the Steak Diane which was very tender, husband had the cobb salad and he loved it and our daughter had the Americana Cheeseburger.  My husband of course had to sample her burger and said it was one of the best he&amp;#39;s had.   LOVED the fried macaroni and cheese. <br&gt;<br&gt;Great service, great food.  We&amp;#39;ll go back on our next trip to Birmingham!", "rating": 5, "date": "9/4/2011"}, {"text": "Cheesecake factory is always a great spot to turn to when you either have limited options or just want a good dessert.  A friend and I had lunch here today, and while the quality of food is always good, to me it&amp;#39;s somewhat subpar at times.  For instance, I ordered the southwest chicken sandwich with a side salad.  The sandwich was completely overloaded with avocado and salsa that the unique taste of the sandwich was lost within.  The jalapeno peppers I requested never arrived... and my side salad came out with the wrong dressing.  Once I removed the chicken from the bread to eat it by itself it tasted just like you would expect from a cooked chargrilled chicken patty that has been frozen and then reheated for serving.<br&gt;My friend ordered the meatloaf sandwich... and I will just say that the butter from the bread was so overpowering that it really was difficult to eat.  And the side of mashed potatoes he ordered was sent back twice because they were so cold.  The gravy that accompanied was even colder.<br&gt;The two slices of cheesecake we each had was, of course, absolutely phenomenal!  If I were rating the dessert alone it would be 5-stars - no question about it!", "rating": 3, "date": "1/1/2013"}, {"text": "Like any other cheesecake factory, the menu is HUGE and the food all tastes good.  I was pleased with how quickly tables were turned around even with a 45 minute wait, we only waited 25 or so minutes.  <br&gt;<br&gt;Service was attentive, and friendly.<br&gt;<br&gt;You made us race car drivers very happy that evening.....", "rating": 4, "date": "4/11/2011"}, {"text": "This place is huge. The decor is amazing. They have sculpture, full bar, lots tables (still busy enough to have a long line). The menu is as thick as a book. It will take a while to eat through their menu just as long as trying their incredible different types of cheesecakes. Their food is good, but I mainly come here to try their cheesecakes.", "rating": 4, "date": "4/15/2013"}, {"text": "Delicious! Another one of my favorite restaurant chains. The funny thing is, I would come here anytime for the dessert alone. Not to mention the food here is delicious, too. The portions are massive! Try to order as small a portions as you can so that you might save room for dessert. There is a mountain of options to choose from for food and dessert, and each one arrives as a mountain on your table. If you&amp;#39;re a leftover kind of person, you will always have the opportunity for lots of great leftovers from here. Have fun! Did I ever mention that I love desserts?", "rating": 5, "date": "8/16/2012"}, {"text": "I love this place!<br&gt;<br&gt;With that said, it is a little too pricey for me and the misses to go there on a regular basis---probably because we get an appetizer, main course, cheesecake for each, etc. But, the portions of food are very large and there is plenty to take home for delicious, delicious leftovers. I HIGHLY RECOMMEND this restaurant.", "rating": 5, "date": "7/27/2010"}, {"text": "I am not a fan of the seating. They pile you in so close to each other and you feel like you are at a company picnic. They do have booths but if you dont have a bunch of people in your party, you are seated on top of someone else. Food, Fish tacos totally fell apart. They need to use two corn shells instead of one skinny flour tortilla. Taste was good but it was so unpleasant to eat, I didnt really enjoy it. Cheesecake was very good, drinks were totally overpriced. Paid 11.50 for a martini and 9.00 for a very small margarita. No prices on drink menu, so that was my fault.", "rating": 3, "date": "11/5/2011"}, {"text": "Very good meal. Usual Cheesecake Factory fare. Very busy, but it is the Holidays.  Great waiter named Tyler.", "rating": 4, "date": "12/20/2014"}, {"text": "Cheesecake factory is wonderful! The salmon is my favorite dish! Their endless choices of cheesecake are wonderful!! The only downside is how crowded it always is, so call ahead to avoid the stress :)", "rating": 4, "date": "6/2/2014"}, {"text": "What can I say. The Cheesecake Factory is by far my favorite restaurant in Birmingham. Mainly because I love cheesecake in general but the full menu is impressive. The only downside is that the CF in the summit is usually packed, especially on the weekend but that is just another testament of the food quality right? All in all if you get a chance stop by the CF and have a bite.", "rating": 5, "date": "2/19/2012"}, {"text": "I love the Cheesecake Factor! I crave the Thai Lettuce Wraps that are listed as an appetizer, but I make a meal. We went for happy hour and sat at the bar. The bar tender, Nick, was friendly, accommodating &amp;amp; had great suggestions. We were given a bread basket...yummy!! We order the $5 hot spinach dip that was more than enough for 2 &amp;amp; delicious!! My honey ordered the lunch portion Shepherd&amp;#39;s pie which was HUGE!!! I had the Thai lettuce wraps. Stella draft beer was $3 and I had a glass of pinot for $4. We also had a piece of Turtle Pecan Cheesecake. Total bill $51. We felt that was great for 3 drinks, appetizer, 2 meals and cheesecake! The place was clean. Lines form quickly so pick your time to go!", "rating": 4, "date": "3/10/2012"}, {"text": "Hubby and I picked up carry out yesterday. I had the Sweet Corn Cakes. They have gotten Really lazy. Starting to see their crappy chain side showing through. And they are way overpriced.", "rating": 2, "date": "1/2/2012"}, {"text": "My two girlfriends and I decided to end our evening at The Cheesecake Factory for drinks. I ordered the Pineapple margarita  and my girlfriend ordered two cocktails. We were all shocked after receiving our bill. One drink cost $15, with tip $17. My girlfriend ended up paying $32 for two drinks. We&amp;#39;ll definitely be going elsewhere for the next girls night out.", "rating": 2, "date": "3/9/2015"}, {"text": "Cheesecake Factory was great as always. Vanilla Bean is the best. It was really packed however, had to wait 40 minutes to get in. But it was worth it.", "rating": 5, "date": "2/12/2012"}, {"text": "Cheesecake Factory is the Jack-in-the-Box of upper-mid-scale restaurants - it has a variety of unrelated things on the menu (20 or so pages worth of items, in fact) but nothing is particularly outstanding. Well, the cheesecake and other desserts are nice, but should one be paying $7 for factory-made delivered-frozen cheesecake?", "rating": 3, "date": "2/27/2012"}, {"text": "We used to eat there about once a week since it is pretty good quality.  You don&amp;#39;t feel like you threw good money down the drain eating there.  Usually crowded, but have seating down to a science.  The best deal is take-out.  A meal and app is more than enough for two average people at home.  Most of the food reheats pretty well, which is important for take-out.", "rating": 4, "date": "12/18/2014"}, {"text": "When it comes to food, this place is always awesome.  The service the last two times I have been there was awful.  We are a family of 5 which means we have to wait on the larger tables or tables put together.  They told us 30 minutes, it took about 50-55.  I saw a whole room empty of everyone except us then new people come in and get seated quickly.  Once seated, the waitress took awhile and hit her other tables before finally getting to us.  Food prep time was normal for TCF.  The experience was about 2 hours total....and we were traveling through.  If it was to hang out with friends, maybe it would have been okay, but with a family of 3 kids that were hungry, it was not a good experience at all to WAIT forever.", "rating": 2, "date": "12/12/2011"}, {"text": "Our server Drake was outstanding. Very informative and paced our meal well. The food (shepherds pie) was also just plain yummy. The chicken bellagio has become an all time favorite as well.", "rating": 5, "date": "5/14/2014"}, {"text": "We walked in and were instantly greeted by polite hostesses. There was no wait time, and we were immediately seated. Our server introduced himself, and took our order for drinks. The menu is extensive, and nothing like I&amp;#39;ve ever seen. It was really hard to make a decision. We ordered an appetizer of Mexican corn-cakes. They were delicious, and presented nicely. It didn&amp;#39;t take forever to get our food, and when it arrived at our table, was nice and hot. We were all happy with the quality and quantity of food we received. I ended up taking most of mine home. Overall, we had a great experience at this restaurant. We were all too full for dessert and hope to enjoy some actual cheesecake next time!", "rating": 5, "date": "7/25/2011"}, {"text": "One of the great mysteries in life is how Cheesecake Factory can continue to schlep out oversalted, mediocre food, at ridiculously high prices, and people still clamor to sit at one of their tables and scarf it down.", "rating": 1, "date": "7/11/2013"}, {"text": "I enjoyed the atmosphere. The food was ok; wasn&amp;#39;t as good as I expected, but was not unenjoyable. I would like to try the experience again.", "rating": 3, "date": "5/1/2011"}, {"text": "Went back for brunch and they actually let us sit down before our entire group was there.  My breakfast burrito was a real disappointment.  It was extremely salty and smothered in an odd sauce that competed with the other flavors of the supposedly mexican cuisine-inspired dish.  Service lacked the smiley polish, but as a side bonus we didn&amp;#39;t get the upsell.", "rating": 2, "date": "10/8/2010"}, {"text": "I am sorry to put a damper on things but I was highly disappointed yesterday saturday March 9th 2013. We made reservation from Mississippi for 60 women to be accomodated at your establishment. When we arrived we were told it would be a 5 1/2hr wait before we could be served. We made these reservations days ahead and called the morning we arrived in Birmingham. We ate at Cracker Barrel that morning for breakfast and was well taken care of, went shoppin in Leeds Ala. and then headed to The Cheese Factory only too be disappointed when we got their. We were told that we had to wait 5 1/2 hrs now  bare this in mind it was 5 o&amp;#39;clock our reservation time, 5 1/2 hours would be 10:30pm and we had rented a charter bus from Starkville, Ms and would have to have it back by 12. Bare in mind we live 3hrs away from Birmingham. I was so disappointed because me and my partner had promised these ladies a visit their as apart of our trip. So I have to give that part of our experience a bad review.", "rating": 1, "date": "3/10/2013"}, {"text": "If you are Vegeterian...think twice..thrice before going to this Cheesecake factory location..We ordered vegeterian pasta...First it was cooked with only partial veggies....when we asked the waitress,she took the hot pasta back and put uncooked nuts and sundried tomatoes....then we asked for the manager who took the pasta back and bring it back partially cooked..then after two bites we found meat in it -- showed it to manager and it turned out to be sausage.....manager apologised and said he will get the bill adjusted...The whole dinner experience was ruined and he brought us the bill for the appetisers and only after waiter told the manager...they thought it might be a good idea not to charge us anything for this terrible dinner experience...", "rating": 1, "date": "6/17/2012"}, {"text": "Went here late at night for an after plane ride meal - it was great. The food was out almost as fast as the drinks (I ordered together). My waitor Adam was very attentive.", "rating": 4, "date": "7/13/2011"}]}