{"address": ["2760 N Germantown Pkwy", "Ste 193", "Memphis, TN 38133"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.5], [4, 3.0], [5, 3.5], [6, 2.5], [7, 3.5], [8, 3.5], [9, 3.5], [10, 3.5], [11, 3.0]], "2017": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 2.5], [5, 2.5], [6, 2.5], [7, 3.5], [8, 4.0], [9, 3.5], [10, 3.0], [11, 3.5]], "2020": [[0, 2.5], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.0], [6, 2.5], [7, 2.0], [8, 2.5], [9, 3.0], [10, 3.0], [11, 3.0]], "2018": [[0, 3.5], [1, 2.5], [2, 2.0], [3, 2.5], [4, 3.0], [5, 2.5], [6, 2.5], [7, 3.0], [8, 3.0], [9, 2.5], [10, 3.5], [11, 3.5]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "Ordered pickup with many stuff including the &amp;#34;thai wrap with grilled avocado&amp;#34;... I don&amp;#39;t know if you can tell from the picture the avocado were hard as rock!!! Cant peel it nor barely chow on it!!! How can serve something like that?! very disappointed  at cheesecake factory", "rating": 1, "date": "10/5/2020"}, {"text": "I can&amp;#39;t typically take or leave Cheesecake factory for dining in for a few reasons... I hate how loud and constantly chaotic it is no matter the location and I did find this location was still too loud for a restaurant of what they try to be same with being constantly chaotic with the staff seeming to run every where they went and it was not overly crowded at all and it was a peak dining time, so for this I took away a star on this review. However this location my food was beyond excellent. I&amp;#39;ve never had anything from Cheesecake Factory that was outstanding. Nothing bad but nothing to remember until this particular visit I had the chicken Marsala and it was fantastic!! Taste, quality and quantity! I was very pleased and will actually return again soon and look forward to it. <br&gt;This location is attached to a mall so during busy shopping days plan to possibly walk a bit or enter the mall through a less busy entrance however having mall parking lot available does mean ample parking. The restaurant inside and out appeared clean and tidy. The hostess was a bit uninterested in her job but was functioning however our waitress was super friendly and astute. <br&gt;I would suggest dining at this location.", "rating": 4, "date": "8/11/2019"}, {"text": "The fried Mac and cheese is above and beyond but the Alfredo had a bad taste and the noodles were not pleasant.", "rating": 3, "date": "10/20/2020"}, {"text": "My husband and I visited after Sunday service and it wasn&amp;#39;t until then that I realized that they serve brunch! This was my first visit since they&amp;#39;ve been in Memphis. <br&gt;<br&gt;I enjoyed the atmosphere a lot. The lights are dimmed and they place nice music too. It helps set the mood. The servers are friendly and very attentive to each table. They kept us up on water and bread as needed. <br&gt;<br&gt;On to the food, I ordered Pancakes, eggs, bacon, and a peach drink (ugh...I forgot the name, but it&amp;#39;s pictured). Everything was great! They have a special kind of syrup that they serve with the pancakes has like a hazel or butter pecan taste to it. I loved it, however they said that it can be a hit or miss with costumers. <br&gt;<br&gt;Overall, I enjoyed our visit there and I will be returning.", "rating": 5, "date": "2/7/2019"}, {"text": "WOW! This was my first visit and I was so impressed! <br&gt;<br&gt;For starters, a rye dark bread is provided with the fresh cream butter. It was very yummy. <br&gt;<br&gt;Based on reviews, we had the egg roll sampler appetizer and the chocolate hazelnut crunch cheesecake. Both were excellent. My favorite egg roll was the avocado one. We would definitely order the sampler again to get the variety. So fresh and crisp!<br&gt;<br&gt;The cheesecake was delicious. It had Nutella icing on the top! The house made whipped cream on the side was very nice too. <br&gt;<br&gt;On our own, we picked the French Country Salad. It was huge and we loved that the pieces were bite-sized. (Nothing worse than a salad with huge pieces of everything.) We felt like it was a healthy, tasty choice to balance out our cheesecake indulgence. <br&gt;<br&gt;We ate outside on a beautiful September evening. The outdoor furniture was so comfortable! Lots of ambiance. Just not the best lighting for pictures. <br&gt;<br&gt;Our server, Taylor J, really took care of us. She had such a positive spirit and energy! Thank you for the exceptional service, Taylor!", "rating": 5, "date": "9/25/2020"}, {"text": "Went by for a weekday lunch. It was pleasant out so I opted for the patio. There were only 2 tables occupied on the patio including me. Service was EXTREMELY slow. They have a lunch menu plus their full menu. I ordered a salad and water to drink. After a really long time, the server brought my salad. It looked great but was really big. I asked the server if it was from the lunch menu and he said &amp;#34;no&amp;#34; I didn&amp;#39;t tell him I was ordering from the lunch menu. My thoughts....it is lunch time and I ordered a dish that is offered as a lunch special. The server tried to take my dish to go bring me the lunch portion. I told him absolutely not.....I am keeping what I have and you will figure it out. Anyway, I had the southwest salad. It was good as usual. No dessert for me this trip. Cheesecake Factory generally doesn&amp;#39;t disappoint so I will be back.", "rating": 4, "date": "6/19/2019"}, {"text": "Made reservations at 3 to eat at 4 when I arrived they placed me outside or over 40 min. And when I questioned when I would be seated I was treated very rudely by staff and did not receive answer overall absolutely disgusted with the customer service. I only hope store manager reviews how poorly customers are treated", "rating": 1, "date": "9/12/2020"}, {"text": "&amp;#34;Yeah, your phone number and one more cheesecake.&amp;#34; -- The Big Bang Theory: Season 7 | Episode 11<br&gt;<br&gt;Our experiences here are either hit or miss - it seems like the busier they are, the better thee service. This most recent occasion was the worst we have had. Service was slow and thee food seemed to be slopped on the plates very messily - it tasted okay, but looked terrible.<br&gt;<br&gt;It seemed like our server (I forget her name now) did not really want to be working Wednesday evening and was not thrilled when the 3 of us were seated in her section. Each drink or food item ordered, seemed a nuisance. We were unsure on entrees, but she wanted us to place our appetizer and entree orders together (she she didn&amp;#39;t have to come back?). It was odd.<br&gt;<br&gt;Her refills of drinks was slow - I had to request more iced tea and she seemed a bit exasperated when I asked for it. She did bring me a new one versus a refill, which was nice. Alcohol refills too entirely too long for my coworkers and they were dying for water refills. I just don&amp;#39;t understand why, when the restaurant is empty, this takes forever?<br&gt;<br&gt;The Loaded Baked Potato tots were awesome - a new favorite for sure. But my orange chicken was brought to the table looking a mess. She had a hard time placing the hot plate down (it was stuck on her towel) and part of it started to slide off the plate - I had to help get it freed and scorched my hand in doing so. The rice was dried out and basically inedible. The chicken was fine, but if you can tell, sauce was strewn willy-nilly on the plate. Not sure if that happened in the kitchen or on its way to me. I was starving, so I ate what I could.<br&gt;<br&gt;The cheesecake was pretty good - it filled me up enough. But I think the experience was enough to convince us not to come back again? I think we will drive farther from our hotel next month to try someplace else.", "rating": 3, "date": "7/13/2018"}, {"text": "Terrible Terrible Terrible!!<br&gt;<br&gt;Highly disappointed!! Came to the Cheesecake Factory for a graduation celebration. We made 3 different reservations  because of the COVID rules and restrictions.  These reservations was made a week and a half prior to our  visit August 8th, 2020. 11am that day received a call from a representative from the establishment to confirm reservations and explained that 3 different reservations were made and that we understood that only 6 people could sit at a table which was fine our only request was if each table could be in the same area. We were told that was ok. Fast forward to 7:30 our reservation time. We were told our table wasn&amp;#39;t ready 17 people waited outside in the heat for an hour or more just to be told that only one table was ready and the other two wasn&amp;#39;t ready yet. At this point we are livid because we were not only told by a representative that all table would be in the same area but what was the point of making a reservation when you still have to wait an hour after you left designated time. I talk to manager on duty Corey and he shows me a section in the outside mall area and as I told him we didn&amp;#39;t care where we sit as long as we are all in the same section. So the problem was clearly identified as a communication problem with the employees. From the girl at the door and hostess who never communicated our concern with manager initially. Then we got our food and the food was terrible and I know for a fact the dish I always order from the Cheesecake Factory is delicious which is the Louisiana chicken pasta. This establishment needs to be revamped from the top up. They are running it how they want to. STEER CLEAR PEOPLE they are terrible . I&amp;#39;m from Texas and I know for a fact that Cheesecake Factory is not suppose to be ran the way they are. There are people out there willing and able to work and provide great customer service to customers. Fire everyone and start over including the kitchen cooks. Food was disgusting!!!!!", "rating": 1, "date": "8/15/2020"}, {"text": "So, I had to change the rating. I have made three visits and so far the only thing that i enjoy is the mahi tar tar ... and a slice of cheese cake of course.  <br&gt;<br&gt;So far, each dish misses a mark. I&amp;#39;ve had the honey truffle butter chicken. The honey is cooked down in the butter which means that the honey... is no longer honey. This means there is no real sweet and savory taste to the chicken. The mashed potatoes are the entire dishes saving grace.  <br&gt;<br&gt;I am on a health kick now so I tried their chicken Tuscan from the skinny menu.... the tomatoes were basically charred and, yet again, no flavor is coming through the chicken. I&amp;#39;ve found myself doctoring the chicken myself in order to enjoy the meal. <br&gt;<br&gt;I really think the Chef probably needs to go back and learn how to create those dishes from other Cheesecake factories.  It is a little odd that I can enjoy the meal from one the same establishment in a different state and come home and find myself not pleased with any of their entrees.<br&gt;<br&gt;Guess I&amp;#39;ll stick with my mahi and a slice of cheesecake unless I find another appetizer that they have down.", "rating": 3, "date": "8/27/2018"}, {"text": "The food is always good.  Calorie loaded but good.  Ordered the fresh strawberry cheesecake, Impossible burger with fries and chicken samosas.  The special sauces on the burger goes great with the fries.  Still not convinced that the burger was all plant based because the texture and taste was too much like beef.  Oh well, I guess I&amp;#39;ll never know for sure.  Anyway...I will be coming back again.  <br&gt;<br&gt;****Service starts out slow then they stop by your table every 5 seconds to check on you‍", "rating": 4, "date": "12/28/2018"}, {"text": "Ordered a pineapple alcoholic beverage for my bday and it was horrible. Steak could&amp;#39;ve been better for $30. Dessert was probably the best thing. Service was a 2/10.", "rating": 2, "date": "8/22/2020"}, {"text": "This place was disgusting the silverware was dirty on the table with butter residue , there was a HUMONGOUS fruit fly, they also just served me pancakes with NO BUTTER NOR SYRUP.They told my cousin that there was no more waffles but they had pancakes all they had to do was put the pancake mix in the waffle iron. HORRIBLE", "rating": 1, "date": "2/2/2020"}, {"text": "It&amp;#39;s nice to know that you guys have booster seats as well as high chairs. My toddler enjoyed his tower of grilled cheese and fries. I enjoyed the appetizer the crab &amp;amp; artichoke dip wished it was more of it:)) By the way, The waiter did come to the table to apologize. He said that he had given my salmon plate  to another table. Thank you for correcting the bill.", "rating": 5, "date": "4/8/2019"}, {"text": "Been here before with standard restaurant experiences, but it has been slowly going downhill.<br&gt;<br&gt;Last night my sister wanted to go here for her birthday dinner. Service was terrible. The menu was on a QR code like most restaurants which I love, but it took you to an online order menu for carry out. Asked our server for a drink list 3 times before giving up and not getting anything to drink but water. Terrible service, were ignored several times and left waiting too long for a Monday night. The server, whoever she is would be fired by me if I still was a restaurant manager. <br&gt;<br&gt;Anyways, not worth going to this location anymore. Poor staff, poor experience, waste of time. Needs new management to fix this, some not too lazy to set up a real QR code menu and drink menu like every other restaurant.<br&gt;<br&gt;I also got food poisoning and was out for 12 hours the next day, but that&amp;#39;s not the reason for the one star.<br&gt;<br&gt;This is a major company owned by shareholders, and ran by people with no experience on the local level. Avoid eating at, investing in, and having anything to do with other than shorting this company.", "rating": 1, "date": "7/21/2020"}, {"text": "Got here at open doors on Wednesday. The people were warm and friendly and while the service was good the wait for our food took a lot longer than expected. <br&gt;<br&gt;Generally the staff and ambiance was of the high standard that is expected from cheesecake factories everywhere. My very first cheesecake factory encounter was in Atlanta for a brunch, which was excellent and have been to several other locations over the years.<br&gt;<br&gt;Overall the food was okay but unfortunately just okay and not above average which is what I had expected and it was not the same experience I have had at other locations. My meatloaf was less than terrific but my wife enjoyed her selection but wasn&amp;#39;t wowed.<br&gt;<br&gt;While it&amp;#39;s a bit expensive for a lunch, but if you get the whole cheesesteak factory experience it is commensurate to the check however an  average or less meal and a wait of over 30 minutes for that meal fell short of my expectations. It&amp;#39;s unfortunate but this is not going to be a regular choices in the future.<br&gt;<br&gt;Too bad.", "rating": 2, "date": "1/1/2019"}, {"text": "Food was delicious (reason for 3 stars) The server went MIA and kept forgetting small items.  She did not check on us and a few times I had to look for her. We ended up taking everything to go as she forgot items so I cancelled them before they arrived.  I will return but will decline being served by her...I do not recall her name but I do remember her.", "rating": 3, "date": "6/17/2020"}, {"text": "We went for lunch today with reservations for four at noon. We were seated immediately on the patio and our server Dwayne started taking care of us the moment that we sat down. He was prompt with refills, food, and amazing service. Food was delicious and arrived quickly. Dessert with our coffee and Prosecco topped a great day and meal. We will definitely be back.", "rating": 5, "date": "2/29/2020"}, {"text": "What is there to say, other than complete perfection!!  Had the lunch special, salad and pizza.  The salad was huge, and the balsamic vinaigrette dressing was delicious.  The flatbread pizza I ordered had everything on it and was so tasty!  It was big enough that my friend and I both brought half of our order home for dinner.  Our server was so attentive and kind, thank you!  We ordered cheesecake to go, and my raspberry, chocolate slice was delicious.  <br&gt;If you haven&amp;#39;t been, do yourself a favor and go!!  Can&amp;#39;t wait to go back!!", "rating": 5, "date": "8/8/2019"}, {"text": "This Place Is So Delicious! Very Nice Staff Here Too, It Get&amp;#39;s Pretty Crowded But Still A Good Place, They Don&amp;#39;t Just Have Desserts, They Also Have Well-Baked Fresh Foods Here! They Deserve 5-Stars!", "rating": 5, "date": "3/28/2020"}, {"text": "We have dined at this restaurant three times and every time it turns out to be a disappointment. Sadly the restaurant has such potential with a great menu and facility.<br&gt;<br&gt;Let&amp;#39;s start with the service, poor at best. The restaurant seems to struggle even when slow. And if busy expect to wait.<br&gt;<br&gt;Additionally we have had incorrect orders delivered and wilted lettuce in what should be a fresh salad.<br&gt;<br&gt;The only positive is the delicious cheese cake.", "rating": 2, "date": "11/16/2018"}, {"text": "This use to be my favorite place, but it&amp;#39;s been going downhill. I&amp;#39;m am in the parking lot literally writing this review! The waitresses were nice, BUT TWICE there was something in my water. The first time there was a chunk of black residue in my water and not sure how it was missed by the waitress. The second time there was a bug in my water! I&amp;#39;m feeling uneasy and upset about this.", "rating": 2, "date": "3/1/2020"}, {"text": "Crystal B is the best bartender. Her recommendation for the Mojito was very refreshing. The 6.50 happy hour menu from 4-6pm has no disappointments. I ordered the chicken pot stickers &amp;amp; buffalo blast which is normally twice the price. You get the same great taste &amp;amp; portion size. Hi", "rating": 5, "date": "11/15/2018"}, {"text": "Cheesecake factory happy hour is the best. They have drinks and great food come between 4-6 you will not regret it", "rating": 5, "date": "2/7/2020"}, {"text": "Our experience is always good here. But last night it was Superb! It started with the nice hostesses and then to our waitress. But the thing that took it over the top was a worker who was  walking by and noticed our appetizer plates were finished and proceeded to take them away without being asked. Come to find out later after asking, that he was the General manager Nick!! He asked if everything was good, to which we answered YES! Then Courtney came by who is also a manager I believe and checked in on us. She even chatted with us for a few minutes. Customer service is NOT dead here! ....and the food was Delicious btw..<br&gt;<br&gt;Thank you, <br&gt;The Stevens Family", "rating": 5, "date": "2/1/2020"}, {"text": "My food was delicious. Absolutely no complaints. We dont dat here often, but we&amp;#39;ve never been disappointed.", "rating": 3, "date": "7/31/2018"}, {"text": "Another great Cheesecake Factory location! The service and the food never disappoint! Our server, Quisha, was very knowledgeable of the entrees, ingredients, etc and made sure that our meal was expertly prepared. We had the tuna poké, egg roll sampler, and pineapple chicken. Everything was delicious, and we were especially impressed with the poké bowl. The Cinnabon cheesecake was also delicious. Now...if we could just get someone to open one of these in Little Rock!", "rating": 5, "date": "6/3/2019"}, {"text": "I&amp;#39;ve been to this location a few times to try different things. I&amp;#39;ve found some success in keeping it simple. Order something simple or cheesecake and things will be fine. Also, I&amp;#39;ve found that going later at night is good if you don&amp;#39;t like the crowds. The staff are usually nice and the place looks clean but there are times when the seats and tables are a little sticky. Like, there&amp;#39;s a film left over from when they were wiped...probably from letting things air-dry.", "rating": 4, "date": "9/28/2018"}, {"text": "Came here for lunch. I had the lunch special pizza and Caesar salad the salad was a very nice portion and the pizza was the everything with kalamata olives. The pizza was a disappointing cause it was very greasy to the point that the crust was soggy! The banana cream cheesecake is to die for very creamy and delicious.", "rating": 3, "date": "6/26/2018"}, {"text": "Your bartenders are the BEST. In particular, Rachel and David!!! David greeted me with a &amp;#34;Hello, Love!&amp;#34; And proceeded to wait and bartend, going above and beyond. He went back for dressing that was missing from my salad, he went to get me hand sanitizer as I realized mine was missing. He did SO MUCH MORE than he had to. Their co-working skills together were very precious and complementary as well. Very encouraging of each other. <br&gt;<br&gt;They are great. Don&amp;#39;t overlook these fine people you have on your staff. Far better than the hostesses that wouldn&amp;#39;t even greet us.", "rating": 5, "date": "4/26/2019"}, {"text": "I really enjoyed my time here tonight. Was busy due to special 1/2price cheesecake ...couldnt pass up...", "rating": 5, "date": "7/30/2018"}, {"text": "Ambiance   Service   Food<br&gt;<br&gt;I was greeted &amp;amp; seated as soon as I entered.  <br&gt;<br&gt;Typhoon Punch ($10.50) ~ Absolute Raspberry Vodka with Passion Fruit, Orange, &amp;amp; Pineapple Juices was delicious.  <br&gt;<br&gt;Almost every menu item looks good to me.  A selection to please everyone.  <br&gt;<br&gt;Though the restaurant was about 3/4 full, my Lunch was served in 10 minutes.  <br&gt;<br&gt;I enjoyed a Green Salad with House Vinaigrette &amp;amp; bowl of Chicken Corn Chowder ($8.95).  Server checked on me twice.  <br&gt;<br&gt;Decor &amp;amp; Ambiance are top notch.  &amp;amp; That cooler full of cakes near the Entrance is soooo tempting!", "rating": 4, "date": "7/2/2017"}, {"text": "I have enjoyed eating at this restaurant all over the USA.  The service was slow, the burger poorly presented, with a lump of shredded cheese unmelted on top.  It burger was just some comfort food to celebrate a new hire. It was a dripping greasy mess. They can serve much better than this. Somebody is not watching the kitchen staff and waitresses.", "rating": 2, "date": "12/11/2019"}, {"text": "We had a wonderful lunch today. It is a definite stop for us when we go to Memphis. Needed to stop by The Apple Store first but it was worth the 20 minutes more (40 minute round trip). Our waitress went out of her way to make sure we enjoyed our lunch. We took our cheesecake to go. I brought an insulated bag &amp;amp; we bought 3 bags of frozen vegetables to keep it cold for the 2 1/2 hr drive home.  We are now enjoying our cheesecake this evening! The manager even came over to make sure we were enjoying our visit. Will keep returning. Good thing we don&amp;#39;t live closer! Diet, what diet?!", "rating": 5, "date": "10/3/2019"}, {"text": "I ordered fettuccini alfredo and fried cheese via Uber Eats.  The fried cheese was bland and tasteless, while the fettuccini alfredo was so salty, it was not edible.  I was quite disappointed, especially since it was so expensive.", "rating": 1, "date": "8/16/2019"}, {"text": "Very nice restaurant (very similar to the rest of the chain). The service was great and the food was delicious as always.", "rating": 4, "date": "8/12/2017"}, {"text": "My husband and family went there yesterday. My hubby ordered the philly cheese steak sandwich and while eating it he started not feeling well. My husband has been in the er since after eating here he has gotten food poisoning I will be calling the manager today 100 dollars in food just to spend thousands in the hospital. Also I googled sick from Cheesecake Factory and there have been multiple reports among all cheesecake factories in the last 7 days", "rating": 1, "date": "9/30/2019"}, {"text": "Upscale dining, good food, great dessert. Pricey. Made from scratch? Is it really a factory? <br&gt;<br&gt;I had to come check out all this hype. I&amp;#39;d heard the menu was extensive, so I wanted to check it out online first. The online menu doesn&amp;#39;t seem to work really well with an android mobile. I could read a partial description for each item, and see a camera icon, but whenever I&amp;#39;d click on these, it would take me in a circle back to the start again. Also, I couldn&amp;#39;t find any prices at all on the online menu.<br&gt;<br&gt;Price is a determining factor in making a menu choice. Remember in Slingblade, Carl wanted to know if they had French fried potatoes? Then he asked how much do you want for them? Only then was he able to make a decision to buy some of the bigguns. Without that information, I cannot make a smart choice. <br&gt;<br&gt;We walked in and were in awe of our surroundings. It&amp;#39;s a big place, modern, and fancy. Of course, you see the dessert counter as soon as you walk in. We arrived at 1:00 Tuesday afternoon to avoid the crowd, were seated right away, and had excellent service.<br&gt;<br&gt;The menu is massive. We all came for a small lunch with dessert. I normally don&amp;#39;t eat sweets, but I like cheesecake occasionally, and that&amp;#39;s what I came for. I noticed the menu does not list prices for beer and most of the desserts. I also noticed it doesn&amp;#39;t say the size of the pizza. It still wasn&amp;#39;t easy to make a smart choice. I was hoping the lunch menu would have something in store for me, but even the lunch specials ranged from $11.00 to $14.50. I know it&amp;#39;s a nice place, but this is pricey. $3.00 for a glass of tea? Why? Chicken biscuits were $17.00 if I remember correctly! I don&amp;#39;t want a complete meal, and I don&amp;#39;t want to spend everything I have. Also, the menu is so large, that it takes a lot of research to select something.<br&gt;<br&gt;The honey wheat bread was good. The sour dough was so tough it was hard to eat. The butter was too cold to spread. The crab artichoke dip was good, but the bread was extra tough. Crab balls, Greek salad, Asian lettuce wraps were just ok. The desserts and milkshakes were excellent. We asked what kind of ice cream the shake was made from, and the waitress said it just comes in on a big truck. Hmm. Not made from scratch.<br&gt;<br&gt;We asked the server if she gets to take food home. She said they don&amp;#39;t allow employees to take food home and they throw all the extras in the dumpster every night. Funny, the website says under fun facts under FAQ, that they donate all of the extra food to feed hungry people through Harvest.<br&gt;<br&gt;She said they make all the cheesecake daily. Funny, the website doesn&amp;#39;t say that. Everything I could find online says the cheesecake is trucked in frozen. Not really a factory is it? More of a restaurant that buys from a factory. I can get frozen cheesecake from the grocery. <br&gt;<br&gt;Beef? What is American style Kobe? Kobe must come from Japan, period. There&amp;#39;s no such thing as American Kobe. What they are selling is Wagyu. Some of the steaks are labeled as premium certified black Angus. Are we talking prime, select, choice? Are they aged? Some steaks are USDA branded, but again there are no descriptions beyond that. An educated diner knows this doesn&amp;#39;t necessarily mean that they offer a superior beef product. <br&gt;<br&gt;What does it mean that your fish are line caught when possible? Is this supposed to enhance the perception of quality? How does the customer know when it was possible? I always thought long lines were dangerous to birds.<br&gt;<br&gt;I&amp;#39;m always skeptical of the marketing phrase      &amp;#34;made from scratch&amp;#34;,  especially when it is used vaguely. &amp;#34;Made from scratch&amp;#34; comes from sports and means to start off without an advantage. The menu is not specific enough to make it mean anything at all. Do they grind flour? Do they make fresh pasta? Do they make their cheesecake from cream cheese, or do they make the cream cheese? Do they make the cream? I can&amp;#39;t find any evidence (other than our waitress saying so) that this restaurant even makes the cheesecake. Then you&amp;#39;ve got Oreos, peanut butter, Graham characters, ..... it&amp;#39;s endless.<br&gt;<br&gt;Any fast food could claim that everything is made from scratch daily, because somewhere, it is. Astronomer Carl Sagan said &amp;#34;If you wish to make an apple pie from scratch, you must first invent the universe.&amp;#34; I&amp;#39;m pretty sure we wouldn&amp;#39;t even be here if not for the universe, so &amp;#34;made from scratch&amp;#34; wouldn&amp;#39;t be possible. <br&gt;<br&gt;The service and food were ok, but this just isn&amp;#39;t the place for me.", "rating": 3, "date": "2/23/2016"}, {"text": "The cheesecake factory <br&gt;It&amp;#39;s deliciousness is overwhelming.<br&gt;This place is devine I will eat here often. The dishes are wonderfully made. The drinks are on point. I give it five stars total.", "rating": 5, "date": "8/30/2017"}, {"text": "I can&amp;#39;t even give this place at least 2 stars, because my dining experience was that bad.<br&gt;I can&amp;#39;t complain about the wait time, it was relatively short compared to waiting for a table at The Cheesecake Factory in Hawaii.<br&gt;My husband and I hadn&amp;#39;t been to a Cheesecake Factory in over 2 years, and we were disappointed to say the least.<br&gt;First off, the bread and butter were presented poorly. While the bread was in its usual basket, the butter was served to us in a dirty dish, &amp;amp; it was just a thick square block. In Hawaii, the butter is wrapped individually which I feel is more sanitary.<br&gt;We started with the crab dip appetizer which was so bad, we had them take it back. The crab dip itself was bad, and the bread it was served with was stale.<br&gt;On top of that, our entrees were just plain bad. I ordered what I usually do-the chicken costoletta. There was no lemon zest, which it usually has (look up pictures) &amp;amp; it lacked flavor. It&amp;#39;s like they breaded the chicken completely plain..no salt or anything. My husband&amp;#39;s meal was worse-he got the jambalaya, and the pasta all stuck together in one huge ball! Also, when he asked to have cheese for his pasta, our waiter didn&amp;#39;t even know where the block was. When she found it, she handled it with a freaking napkin! I could&amp;#39;ve sworn Cheesecake Factory had roller graters, one of the reasons being to avoid unsanitary handling..<br&gt;This was an entirely disappointing experience.", "rating": 1, "date": "7/22/2018"}, {"text": "I live in Chattanooga where we don&amp;#39;t have a Cheesecake Factory so its always special for me to eat there. I can&amp;#39;t believe how big the menu is. They literally have more entrees than just about anywhere else and based on my visit everything is good.<br&gt;<br&gt;Then comes the desert. The list of deserts is amazing as is the quality of them. Service was great and we were seated quickly. It doesn&amp;#39;t get much better than this for the price paid.", "rating": 5, "date": "12/17/2017"}, {"text": "I&amp;#39;ve been to Cheesecake Factory&amp;#39;s all over. This experience was just ok. It was a weeknight and not busy. Service was fine, meeting the minimum. Apps were good, needed extra sauce for my pasta. Long Island wasn&amp;#39;t strong but I didn&amp;#39;t send it back.", "rating": 3, "date": "11/2/2018"}, {"text": "I came here with my work (Painting with a Twist) for our holiday dinner party and it was fantastic!!! I had never been before and the ambience made it feel like you weren&amp;#39;t even in the mall.<br&gt;The service was great and friendly, all of our appetizers were delicious, and they had a good selection of Sauvignon Blanc (which not all restaurants have anymore). <br&gt;I ordered the shrimp angel hair pasta without marinara sauce and they could have easily left it dry and tasteless but it was tossed in garlic, butter, and some heavenly spices. I will for sure be back!!", "rating": 5, "date": "12/3/2017"}, {"text": "Now I happen to really like The Cheese Cake Factory but this is by far the worse location I have ever been to. The food was horrible. I tend to always order the same thing which comes with white rice, my rice was hard like it had been sitting around all day. My wife&amp;#39;s burger came but was super small (the meat patty), we sent it back and another never came out. We waited about 30 minutes only to be told they can&amp;#39;t remake it. The staff seemed annoyed from the moment we walked in, slow service even though the place wasn&amp;#39;t even full or busy.", "rating": 1, "date": "6/14/2019"}, {"text": "Worst service ever. Ordered a chocolate cake tiramisu cheesecake and carrot cake, waited for 20 minutes and when I finally walked up to ask if it was ready it was already just there. We should have checked it first but total fail on the service.....", "rating": 1, "date": "12/29/2019"}, {"text": "Once in a blue moon, I&amp;#39;ll find myself craving some good ol&amp;#39; cheesecake. Yep, it&amp;#39;s a chain and all, but those thick slices last a good while. I barely finish it in one sitting. Anyways, I&amp;#39;m always upset that it&amp;#39;ll take like 10-15 minutes just to get one slice to go! This happens to me everytime, even during less busy times. They need a better system of handling to go customers. Saturdays here are a big mess too. Expect the wait time to be long and ridiculous.", "rating": 3, "date": "8/22/2018"}, {"text": "Went to the restaurant and sat at the bar. Had to ask for refills. The waitress was sweet so it wasn&amp;#39;t to much of an issue. However, once the roach crawled across the counter while I was finishing my drink it became an issue. They didn&amp;#39;t seem to be worried ab it. I asked for the manager and an employee asked if it was that big of a deal. I emailed corporate and still haven&amp;#39;t got a reply 5 days later.", "rating": 1, "date": "3/3/2020"}, {"text": "I have always enjoyed the food at the Cheesecake Factory and the new Memphis location doesn&amp;#39;t disappoint. <br&gt;<br&gt;We had a great experience from start to finish. <br&gt;<br&gt;I like the fact that you don&amp;#39;t have to go inside the Wolfchase Galleria mall to access this restaurant. ;-) <br&gt;<br&gt;I&amp;#39;ve never been to a Cheesecake Factory that didn&amp;#39;t have a wait.  So expect to put your name down, get a pager and wait to be buzzed for seating.  To kill time, some people sit, others look inside nearby stores in the mall and still others go to the bar. <br&gt;<br&gt;The menu is a million pages so you might want to google it before you get there to save time.  The good thing about the extensive menu is that there is something for everybody!<br&gt;<br&gt;I suggest you save your appetite before you go to Cheesecake Factory.  The portions are hefty and you want to make sure you have room for the delicious cheesecake.  <br&gt;<br&gt;They honestly have the best cheesecake I&amp;#39;ve ever had.  I get it plain - it has a yummy layer of sour cream on top.  <br&gt;<br&gt;Their cheesecake melts in your mouth and the food is so delicious. <br&gt;<br&gt;Be prepared to roll outta there!", "rating": 5, "date": "8/29/2015"}, {"text": "Excellent mimosas!! The pancakes were very good, it&amp;#39;s not exactly maple syrup, has an under tone of butterscotch.  Syrup is warm n complimentary to pancakes,  however. Bacon cooked n delicious, eggs cooked as ordered. Very nice brunch indeed.", "rating": 4, "date": "8/25/2019"}, {"text": "They have a large menu to choose from.  Some dishes are hit or miss.  They have great bread", "rating": 3, "date": "11/29/2018"}, {"text": "We had an enjoyable lunch time eating experience here. The service and the food were great. I do feel like that there are too many items on the menu.", "rating": 5, "date": "3/11/2019"}, {"text": "Customer service at this restaurant needs to be improved.  I called the restaurant and was placed on hold for 8 minutes and as a result I called the restaurant from another line where I was on hold for another 6 minutes. I do enjoy the food and dessert here but this a deterrence, ordering food should not be an ordeal.", "rating": 2, "date": "6/8/2019"}, {"text": "Thai lettuce wraps always my goto. <br&gt;Always save room for the red velvet cheesecake. <br&gt;If getting hot tea try orange spice, ask for the set up- honey and lemon!", "rating": 5, "date": "2/9/2019"}, {"text": "As a huge cheesecake lover i was ofc excited to eat here! In Canada we dont really have any, i know of one but i hear its always very busy. We got in at around 4:30 so it was not very crowded. We were greeted by a very nice waitress and the service throughout was fantastic! The menu had a lot of variety so it was hard to choose, i ended up getting the orange chicken and it was so damn yummy! My friend got the tuscan chicken and she said it was amazing! We split a reese peanut butter cheesecake for dessert and omfg it was so yummy, im a plain cheesecake kind of guy but wow that made me wanna try there other flavours. I got a plain and a salted caramel cheesecake to go and so looking forward to trying them. Will definetely come back when i come to Memphis again!", "rating": 5, "date": "8/9/2019"}, {"text": "This is the closest CF around, so when we have to come out to the Memphis area, I try to stop by at least for a slice of cheesecake. Actually came to eat here for the first time after a swim meet.<br&gt;<br&gt;Seating hostess was COMPLETELY rude. Wow. Asked for a booth when she offered that we could go seat ourselves in the bar area and she sat me and my two daughters &amp;#34;outside&amp;#34;, the patio area inside the mall. We were the ONLY ONES she put us out there. Yes, I know because with a little one who constantly has to go, I&amp;#39;d notice the empty booths inside were slowly beginning to fill up. Awesome. <br&gt;<br&gt;Megan B was our waitress and was sweet and very professional. She acknowledge my youngest, 4 yrs old, and she would light up every time Megan would ask her a question directly or brought her food to her and talked directly to her.<br&gt;<br&gt;We ordered: chicken bellagio, classic cheeseburger, kids pasta with a  side of green beans. The food was delicious and what we expect from CF. We ordered some cheesecake to go as well as their thai peanut sauce.<br&gt;<br&gt;Another thing was there was a male waiter and male bus boy who would come to the area we were sitting in every 10 minutes to check their phones. One even stayed on their phone as they put out plates and utensils on the tables near us as we watched him. Pretty sure you shouldn&amp;#39;t be doing that around customers, right? <br&gt;<br&gt;Megan and the food were the saving grace of this visit. But the rest of the staff......", "rating": 2, "date": "6/1/2018"}, {"text": "I am a huge fan of the cheesecakes and cakes and have tried about 25 of their various types. I always buy the $25 gift cards in Dec, to receive the free cheesecake cards for Jan/Feb. I just picked up my free cheesecake only to find that they reduced the size of their cheesecakes. I think it&amp;#39;s because, for these first 2 months, everyone will be picking up their free slices. Their slices were the normal size in Dec. They did this same thing a few years back and I cannot believe that they still charge $8-$9 for the reduced size slices. VERY DISAPPOINTED!", "rating": 1, "date": "1/23/2020"}, {"text": "we made a reservation on yelp. 30 minutes after our reservation we were still waiting and I think they have out table to another by the way the lady at front was talking to another coworker. what a poor experience.", "rating": 1, "date": "7/25/2020"}, {"text": "Had the chicken parmesan sandwich and it was delicious. Also, the cinnabon cinnamon swirl cheesecake was amazing.", "rating": 5, "date": "6/27/2019"}, {"text": "I&amp;#39;ve been here probably 5 times. The last three times all of the silver wear was dirty. My water cup had mouth mark on it from the previous user and there were particles floating in my water. The server returned with more silver wear but it all seemed to have residue and old food. Disgusting. I usually like CKF, but not this one.", "rating": 1, "date": "6/15/2019"}, {"text": "Great service. Great food. AMAZING cheese cake. It was a nice visit and I&amp;#39;ll definitely be back.", "rating": 4, "date": "6/18/2019"}, {"text": "This is only the second Cheesecake Factory I have been to, the other being in Oklahoma City. This one was just not as good. The service definitely needs to be improved. Our server didn&amp;#39;t really pay attention to us and forgot a few of our requests, sometimes twice, like bringing us extra ranch dressing, napkins, and forgot to refill a couple of times. The food was still very good though. I&amp;#39;m not going to let the service keep me away from this Cheesecake Factory in the future but if it&amp;#39;s bad again, that might be it for me.", "rating": 3, "date": "8/20/2018"}, {"text": "We used to like this place but, the wait and poor service just isn&amp;#39;t worth it. We walked in and as usual, there was a huge wait list. We enquired how long and we&amp;#39;re told 20 minutes, no problem. At 25 minutes, I asked how much longer and was told they were clearing tables and it would take a couple of minutes as we were next on the list. 15 minutes later, we walked it. This is the third strike for this place. I suspect they charge a buttload if money because a lot of people walk. We weren&amp;#39;t the only ones. This was the one at Wolfchase in Memphis <br&gt;<br&gt;Tried it again. Just not worth it. So, we get seated, barely anyone in the place. Waited for server. Waitress asked if we wanted bread and we said yes. It finally came out after we had ordered and ate. BTW, they don&amp;#39;t hand grate cheese anymore, not that our server even offered. In fact, barely saw her. If you want cheese over your meal, it comes in a bowl with a spoon and it looks like plain old craft Parmesan cheese from Sams or Walmart. Sad really, really used to be a favorite place to go.", "rating": 1, "date": "6/8/2019"}, {"text": "Love this place. Love the service. Love they have Death by Chocolate flourless cake for us Celiacs. We will definitely be back.", "rating": 5, "date": "8/5/2017"}, {"text": "Who would&amp;#39;ve thought that you could walk right into a Cheesecake Factory late on a Friday night and get service immediately? That&amp;#39;s how it goes when you sit at the bar and then move out to the empty patio. That&amp;#39;s how my #datenight went. We received good service and drinks at the bar. But, we took our party outside to sit more comfortably &amp;amp; intimately. My pasta dish was very tasty. The chicken was tender and not chewy and I received just the fuel I need for my long run the next morning. We also received good information regarding the month&amp;#39;s featured cheesecakes and pricing. I look forward to returning for more!", "rating": 5, "date": "8/5/2017"}, {"text": "When coming here, be prepared to wait to eat for a while.  Arrived at 6PM with a group of 10.  There were plenty of tables open.  The drink service took a very long time.  1 hour 15 minutes later, we get food, and two orders were wrong.  The server then asked if I&amp;#39;d like to just eat what they brought me, or if I actually wanted to wait for what I ordered.  So 25 minutes later, my food comes out and is still wrong. Due to my party being done eating, I quickly ate the order anyway.  They did comp my order and offer a poor excuse of an apology. The server walked by and mumbled, &amp;#34;Sorry about the carne asada,&amp;#34; and walked away.  At the end of the day, the food was good and would have been enjoyable without the other things.  Maybe focus on better training for staff and support them when they are struggling.", "rating": 1, "date": "6/20/2018"}, {"text": "Cheesecake Factory was once an outstanding restaurant that had wait lines out the door.  Food was great...cheesecake was obviously great; however, last night was not so great.<br&gt;<br&gt;1)  Cheesecake:  They used to serve Chris&amp;#39;s Outrageous Cheesecake (UNBELIEVABLY GOOD).  I went to purchase and could not find it on the menu.  I learned they discontinued it.....WTH!  - I already knew where Cheesecake Factory was headed...same direction as the rest of the chain restaurants.<br&gt;<br&gt;2)  Food:  We ordered the Louisiana Chicken Pasta.  Not the same...tasted horrible....greasy as hell.  My wife ate hers and had to immediately hit the restroom...when we took the leftovers home, I accidentally ate hers and guess what...I had to immediately hit the restroom :(.  <br&gt;<br&gt;The customer next to us ordered the buffalo wings...had to send it back b/c it was raw from inside......TWICE...until she asked to drop the order.<br&gt;<br&gt;3)  Price:  OMG....everything was pretty much $20.00+.  The Bang Bang Chicken and Shrimp I remember used to be $14.00.....now it&amp;#39;s $20....the Lousiana Chicken Pasta....$13.00...now $18.  The Fish and Chips....$13.00....now $20.  And the quality of food to go w/ the price...no comment.  I dont mind paying more but improve the quality if you are raising prices....let&amp;#39;s not forget decreasing the quantity.<br&gt;<br&gt;People will still visit...I doubt my comments will draw anyone away, but customers notice.<br&gt;<br&gt;I will say our waiter was SUPERB.", "rating": 1, "date": "2/24/2019"}, {"text": "My initial review was removed, and I was informed: <br&gt;<br&gt;&amp;#34;I&amp;#39;m reaching out to let you know that our moderators removed your review of The Cheesecake Factory because it wasn&amp;#39;t clear that your review described your firsthand experience as a customer of The Cheesecake Factory.&amp;#34; <br&gt;<br&gt;There were also pictures removed, as they came from local media, not me. I understand that and will refrain from using those. <br&gt;<br&gt;Since they want my first hand account, here it is:<br&gt;<br&gt;Location, Location, Location<br&gt;<br&gt;On December 26, 2017, my family and I went to eat at The Cheesecake Factory in Memphis, TN to celebrate my youngest daughter&amp;#39;s fifth birthday. It was an experience that will not soon be forgotten. The service was good and the food was wonderful. However, while waiting to order dessert, I observed a fight through the windows. Multiple individuals were fighting inside of the mall, just outside of The Cheesecake Factory. Security showed up and began forcing those involved outside. As they exited the mall (just feet from The Cheesecake Factory), approximately 8 gun shots rang out. I immediately grabbed my family and we got under the table, as did the entire restaurant. Realizing my oldest daughter (10) was in the restroom, I made my way through turned over chairs and other patrons on the floor to get to her. Once the scene appeared to be clear, I brought my daughter out of the restroom and back to the table. We continued sitting there, as multiple police cars arrived outside. I then observed police officers walking around the entrance and inside of the mall, with AR15 rifles. Just when we thought everything was under control, the officers with the riffles began running back toward the entrance where the shooting occurred. People in The Cheesecake Factory once again began screaming and got under their tables. After another few minutes of uncertainty, people began emerging from their hiding spots. Moments later, a female was taken out of the mall on a stretcher, by paramedics. We waited until it seemed as if everything had calmed down, and we paid our bill. On our way out, we observed an individual who had been shot. He was sitting handcuffed on the sidewalk surrounded by police, and was receiving medical attention. <br&gt;<br&gt;Can I put the blame on The Cheesecake Factory? Yes, they knew the area has been declining and still chose it for their location. There are safer areas nearby that could have benefited from this business. <br&gt;<br&gt;Additionally, it The Cheesecake Factory has any plan for an active shooter situation, it was not acted upon. The shooting happened just outside of the windows behind the cheesecake viewing area, yet the restaurant never went on lock down mode. Instead, customers were left to fend for themselves and seek their own hiding places. Also, the doors were never locked; therefore, the shooters could have easily entered the business. <br&gt;<br&gt;As stated before, this was my five year old daughter&amp;#39;s birthday dinner, in which she and her other sisters (6 &amp;amp; 10) were forced to hide under tables and brought to tears. She later woke up with nightmares, asking if there were any &amp;#34;bad men&amp;#34; outside. This is an experience that my family will never forget.<br&gt;<br&gt;Due to the location, I will not go back; however, I will continue to eat at The Cheesecake Factory when visiting other cities.", "rating": 1, "date": "1/3/2018"}, {"text": "Loved it! We went for lunch today being a little concerned by the reviews on here. It was very good, and our waiter couldn&amp;#39;t have been better.  I enjoyed the slider appetizer deluxe (fries added), and it was delicious. My husband had something off the brunch menu,  and he loved it. (The potatoes weren&amp;#39;t his favorite.)  The restaurant was full, and the service was fast.  No complaints here!", "rating": 5, "date": "7/14/2018"}, {"text": "Loving the bar today. Passion fruit martini is on point. The bartender got everyone high today. I hope I don&amp;#39;t max out a card shop for Kimberly back to college stuff on the high. Love n the bar right now.", "rating": 5, "date": "8/11/2018"}, {"text": "Made reservations for 12 with high chair.  Daid it would be 10 minutes.  Little mgr walked by and I ask if he setting long table for us.  Table got setup &amp;amp; some high girls who were no even in rest when we arrived were seated in front of us.  I got face to face with asst manager.  THIS PLACE SUCKS.<br&gt;AVOID IF POSSIBLE.", "rating": 1, "date": "5/18/2018"}, {"text": "I had to change my review of The Cheesecake Factory in Memphis from 5 stars to 3 stars.  I have been to a number of Cheesecake Factory restaurants across the country, but I have never been to one that has been out of Buffalo Blasts not one time, but two times!  This restaurant needs to do a better job of hiring folks who are consistent in prepping their appetizers.  There is really no excuse for this and it is bad for The Cheesecake Factory brand.  Buffalo Blasts is like one of the main appetizers The Cheesecake Factory is known for.  It&amp;#39;s almost like saying The Cheesecake Factory is out of cheesecake!", "rating": 3, "date": "6/7/2018"}, {"text": "Worse decision ever to come here. The 12 year old birthday girl  requested to come here and we were told  the wait would be 60-90 minutes. Going in to hour 2 and no table yet despite  many empty tables. The hostess had an attitude and the manager was less than helpful. They should take reservations for parties of 9 like ours. Last visit here for me :<br&gt;After meal comment: We enjoyed our meal and we had the best server ever. Destiny was the highlight of the evening! Very professional, knew the menu and was delightful. Not sure why she stays at the Cheese Cake factory. She could do much better!  <br&gt;Again, this review would be totally different if they took reservations  at least for larger groups. But I hear that very long waits are the standard for them.", "rating": 1, "date": "7/22/2018"}, {"text": "The cheesecake was delicious and the delivery was quick as I thought it would be been and they put there time and effort into there job and for that I thank them", "rating": 5, "date": "6/13/2019"}, {"text": "Wow !!! This location is not representative of the CCF franchise. The food taste and quality is not up to par with any other location I have ever been to.<br&gt;Sadly I believe it comes from management and one manager Meredith in particular, Just not a nice man. We found him CONDESCENDING, ARROGANT AND PATRONIZING! Quite frankly he was embarrassing himself. Not one person from our party will return as a direct result of his bad behavior. I contacted CCF corporate office to let them know of our experience and have already received a call back from a lovely young lady Beatrice who was honestly remorseful about what had happened and is going to contact the GM. She treated me with respect and professionalism. Thank you Beatrice.", "rating": 1, "date": "5/22/2018"}, {"text": "My moms order was botched and everything that comes on it was not on it. I got the bacon bacon burger and there was a mountain of cheese along with some unknown meat that was Not bacon. And i think its time they change their burger buns to something less chewy", "rating": 2, "date": "8/31/2019"}, {"text": "Went to the Cheesecake Factory today in Germantown and I must say it was a heck of an experience . There was so much to chose from it almost confused me . I had the steak Diane and salmon combo which al was good except for the steak medallions . They were flavorless and the restaurant is a bit over priced for what it serves . The JW lemonade was good and the staff was awesome .", "rating": 3, "date": "3/17/2019"}, {"text": "Being a Midtowner, I rarely make it out to the Wolfchase area. I did want to visit our Cheesecake Factory, so I took advantage of a work errand at the mall to tag on a lunch visit. <br&gt;<br&gt;Service was quick, smooth and friendly. I was greeted and seated within a minute of walking in. I had not one but two servers helping little old me. <br&gt;<br&gt;The menu could take years to peruse. It truly is one of the largest, prettiest menus around. Every dish looks and sounds delicious. Watching food come out from the kitchen reminds me that the portions are also enormous. So, of course, I over ordered. In my defense, I did order a lunch portion of a salad. My appetizer was big enough all on its own. I had to make myself stop eating it to have room for even a few bites of salad.<br&gt;<br&gt;I do like that the server takes the leftovers away to box them up rather than doing it at the table or letting Messy Molly (me) do it. That invariably winds up with me wearing some of the aforementioned leftovers. They also offered me a To Go beverage without me even asking. <br&gt;<br&gt;Since I wasn&amp;#39;t going home and didn&amp;#39;t have a cooler with me, I skipped the dessert to go. That just gives me a reason to go back out to the Hinterlands. By and large, I&amp;#39;m not a fan of chain restaurants, but the Cheesecake Factory does what they do very well.", "rating": 4, "date": "5/20/2016"}, {"text": "I&amp;#39;ve gone twice for lunch when there is no wait however the service is still slow. The servers I&amp;#39;ve had are very pleasant and the food is good. I gave it three stars because of the slow service, but I&amp;#39;d definitely return. The cheesecake is awesome!!!!!!", "rating": 3, "date": "9/10/2016"}, {"text": "The quality sucks at Memphis location, the service very hit or miss, more miss. And finally some of the staff are racist.", "rating": 1, "date": "1/31/2019"}, {"text": "I just wanted to write about the atrocious experience I had at Cheesecake Factory at the Wolfchase Galleria in Memphis.  We arrived at 4:30 pm (you know, to beat the dinner rush) on a Saturday, and were quoted a 55-70 min wait!  That in itself is ridiculous and is a testament that Cheesecake Factory made this location way too small for the size of city that Memphis is.  The decision to not build a larger, stand alone restaurant is down right head scratching.  I&amp;#39;ve eaten at many different Cheesecake Factories and this is by far the smallest and most cramped.  Absolutely appalling for the size of city Memphis is.  <br&gt;<br&gt;After waiting past our 70 minute quoted time (80 minutes to be seated actually), my party of 5 was then squished into a booth clearly only meant for 4 people max!  One of my party members had to sit at the end in a chair.  I complained to our waitress who brought over this completely monotone, bullcrap answer giving &amp;#34;manager&amp;#34;.  There was a much larger booth right behind us that was empty that they wouldn&amp;#39;t move us to.  There were much larger booths around us that had only parties of 5 as well!  At this point we were so frustrated with the wait that we just wanted to order.  <br&gt;<br&gt;After our appetizers came out, we noticed we didn&amp;#39;t even have any napkins.  In fact, when we sat down all we had were a few forks sat next to small plates.  But no napkins or other silverware.  We brought this to the attention of our waitress.....she never did return in a timely manner with napkins, as our hands were gunked with food from the appetizers.  We had to end up stealing the napkins at the empty booth behind us.  <br&gt;Then our meals came out.....we still didn&amp;#39;t have a full complement of silverware, so we had to ask for a knife so my friend could cut her steak.  Then my son&amp;#39;s spaghetti order came out wrong, and instead they brought out some type of other shaped pasta.  This got my son highly upset and he started bursting into tears.  <br&gt;<br&gt;As I&amp;#39;ve stated earlier, I&amp;#39;ve eaten at many different cheesecake factories around the country, and this was the only time I&amp;#39;ve ever had an atrocious experience.  All the food we ate was good, so I won&amp;#39;t fault the restaurant on that, but the customer experience at this Memphis location is severely lacking.  This restaurant needed to be bigger....it&amp;#39;s clearly overwhelmed by the popularity, and the staff clearly can&amp;#39;t handle the crowds without customer service being in the tank!  Considering it&amp;#39;s a 40 minute drive for us from where we live to go to this Cheesecake Factory, I can&amp;#39;t say I&amp;#39;m clamoring to come back anytime soon.", "rating": 2, "date": "1/17/2016"}, {"text": "The service is amazing! Our waiter Damien was super attentive and definitely on his toes keeping up with the busy weekend dinner crowd. <br&gt;<br&gt;Personally, I prefer cheesecake factory appetizers over the entrées. Maybe because I love part food,who knows. <br&gt;<br&gt;My friend had the cajun chicken pasta,which was so good. I had a small Ceasar salad and the buffalo wings minus the sauce...got to keep it low carb lol<br&gt;<br&gt;Everything came out hot and exactly like we asked for it. It&amp;#39;s almost impossible to come here and not get a slice of cheesecake....right? Well lucky for me they had a sugar free option. I was a little nervous because when you hear sugar free it doesn&amp;#39;t sound all that exciting. I was pleasantly surprised, the sugar free option was wonderful, I couldn&amp;#39;t even tell the difference.", "rating": 3, "date": "7/4/2016"}, {"text": "Is a big mistake the server is good but I&amp;#39;m order the best plate in the menu  Madeira Chicken. Ohhh lord is at beautiful RAW chicken.", "rating": 1, "date": "3/3/2019"}, {"text": "On occasion, I end up getting a meal that would be best thrown out to the pigs.  Yesterday, a group of friends and I went to the Cheesecake Factory on Germantown Parkway in Memphis.  One of the friends had just suffered the death of her brother, and I have just recently been discharged from the hospital with pneumonia.  My friends and I all thought it would be good for us to get out for just a bit.  So .. . . this is where we chose.  <br&gt;<br&gt;I ordered the shrimp meal.  Huge, drastic mistake on my part.  This meal cost some $17.00 plus tax, plus tip.  Being on a fixed income, it is not often that I can order a meal this costly.  I was, however, quite hungry for a good meal after having been hospitalized and not eating much in the preceding days.  This shrimp was way over cooked that it was difficult to even bite it, much less chew it.  I think I managed to eat only two pieces of it before I pushed it aside and got a box to take it home.  My thought was that, after it had set a while and gotten &amp;#34;soggy&amp;#34; and then heated in the microwave, that it might &amp;#39;soften&amp;#39; up a bit.  That was not the case, however,  <br&gt;<br&gt;Please trust me ---- if you want shrimp, do NOT get it at The Cheesecake Factory.  This was the most disappointing meal that I may have ever had.  I would choose Captian D&amp;#39;s shrimp any day of the week over the mess I got at The Cheesecake Factory.  Trying to eat it was a horrible experience.  I most likely will never return there, nor will I recommend it to anyone.  It takes only ONE experience to ruin the party for me.   This was an expensive meal that was not fit to eat.", "rating": 1, "date": "9/9/2017"}, {"text": "Great service!!!! Loved the atmosphere with the dim lights and they weren&amp;#39;t very busy so it was also quiet. The Cajun gumbo fettuccine was the best past dish I&amp;#39;ve ever had!!!!!!! Big pieces of shrimp and chicken, perfectly cooked pasta and veggies and the spice was on point", "rating": 5, "date": "2/15/2019"}, {"text": "I&amp;#39;m only giving this place one star because my meal was pretty good. The minute I walked in the door it was a very bad vibe. The greeter did not greet us. In fact, she said &amp;#34;stand to the side&amp;#34; after telling her how many was in my party. The waitress was horrible! Her name was Neicy. She rushed us to order. When our food came out before the appetizer we asked to cancel the app (it was nonnegotiable anyway). She told us we HAD to eat it. We called the manager over to get it removed off the bill. The purpose of an appetizer is to eat it before your meal.", "rating": 1, "date": "3/13/2018"}, {"text": "Not what you would think if you&amp;#39;ve never been there before. You&amp;#39;re first thought is a great place for dessert, but it is so much more. They have all kinds of food offering to the extent that the cheesecake is almost an afterthought. The portions are huge so if a lunch special will fill you up and the person next to you in most cases. When you order the dinner you might as well get a to go box with it. Of course it will be hard to fill that to go box and not stuff yourself as the food here tastes amazing! The price may seem like a lot, but for the amount of food you get it&amp;#39;s more then fair. The staff is amazing and very helpful in helping you pick out items if your cant make up your mind. If you haven&amp;#39;t been here before I highly recommend you try it out.", "rating": 5, "date": "1/13/2018"}, {"text": "The red velvet cheesecake is amazing! They have a very extensive menu. And several option for vegan and low cal diets! The bat also has the capacity to make several types of cocktails which is also a plus. This is a nice restaurant. You can also make reservations or call in pick up orders.", "rating": 5, "date": "9/8/2019"}, {"text": "Excellent everytime Almond crusted salmon salad, Avocado eggrolls,and cheesecake is too die for 4!!!", "rating": 5, "date": "12/23/2017"}, {"text": "The other reviews were spot on!  My wife and I had enjoyed our experience from start to finish.  The waitress we had came by quite frequently, and I don&amp;#39;t believe our drinks ever reached the bottom.  In addition, the manager came by a few times in the beginning and asked if there was anything that they could do to accommodate us better.   <br&gt;<br&gt;The food was delicious and came out quickly!  The benefit of having a wait time (40 mins) was that my wife and I got a chance to really look at the menu.  I got the fish n&amp;#39; chips and my wife got a chicken salad.  Both were very tasty!!  The best part was the cheesecake - delicious!!  We each ordered 1 even though we shouldn&amp;#39;t have.  We thought of sharing one beforehand, and we will next time.  These cheesecakes that they send out are enormous.  Def could be shared among two people.  Overall, tasty food and good service.  I don&amp;#39;t think I could&amp;#39;ve asked for better!  Highly recommend going at least once if you have never been!", "rating": 5, "date": "9/2/2015"}, {"text": "Meh-_.....went straight to the bar, sat at the end. 2 bartenders, and it seems as if they were super busy because we were not acknowledged for at least 5-10 min..so we decided to move to the middle if the bar...waalahhh!!! They do talk!!!!! Anyways, ordered drinks and food. <br&gt;<br&gt;I ordered a Cosmo and the skinny menu of lemon and garlic shrimp with pasta. Sooooo good!!!! My husband had salmon as usual, he said he has had better! Overall service was OK, food was good not Like other cities. I have been to a few and they are more upscale, but hey they tried!!!", "rating": 3, "date": "11/19/2015"}, {"text": "This in the hamburger sliders with a ton of onions and even more ketchup. These were the worse sliders I&amp;#39;ve EVER had. I mentioned it to the waitress. She said she told the manager and he will make sure it doesn&amp;#39;t happen again. I don&amp;#39;t understand what that has to do with the plate in front of me. JUST HORRIBLE!!!", "rating": 1, "date": "7/1/2017"}, {"text": "(Don&amp;#39;t mind me, I&amp;#39;m just cleaning out my drafts.)<br&gt;When I found out Memphis was getting a Cheesecake Factory, I was so overwhelmed and overjoyed that I even thought about applying to work here! The fact that it&amp;#39;s located in one of the malls I frequently visit also is a huge bonus. Alas, with everything that comes to Memphis, most times, I am let down. <br&gt;Let&amp;#39;s start with the service: it&amp;#39;s slow, staff is almost always inattentive, and I&amp;#39;m always missing stuff. The food is the same as other Cheesecake Factories, which is great. I normally order to-go, if I ever decide to come here, which is rare ever since its opening, but even that takes forever.", "rating": 3, "date": "6/23/2017"}, {"text": "The Cheesecake Factory is yummy with great staff. <br&gt;The menu is lengthy and pricey (average $15-18 for non-lunch prices) but the portion sizes could feed 2-3 people for a lot of the entrees. The kids menu is also a good size with your usual kids meal items plus a few more. Prices around $7-8.<br&gt;For anybody watching their sugar for health or otherwise, the low carb cheesecake is delicious and worth it!", "rating": 5, "date": "1/13/2018"}, {"text": "So..is it me or does cf have the hardest bread? I&amp;#39;ve been to cheesecake factory in Nashville, San Diego and VA Beach. The. Bread. Is. Hard. <br&gt;<br&gt;Okay anyway, my boyfriend and I decided to try cheesecake factory. It opened a few weeks ago and since it&amp;#39;s a new restaurant in memphis it has been super packed. We decided to go on a Tuesday afternoon around 1 hoping everyone would be at work. Nope. It was still alot of people there. We walked up worried about how long the wait would be. The hostess let us know they had two open tables if we wanted to sit by the bar, we obliged.  We sat down and our waiter Adam came pretty quickly. <br&gt;<br&gt;The Breakdown <br&gt;<br&gt;Environment - it resembled pretty much every cheesecake factory. Super nice inside. However this one is a little smaller than most cheese cake factories so it feels a little crowded.<br&gt;<br&gt;Service- our waiter was great. He was efficent but not annoying. Which means that he took our orders, checked in on us, kept our drinks filled but wasn&amp;#39;t lingering around with annoying stranger convo. <br&gt;<br&gt;FOOD- we had fried zuchinni as our appetizer and it was super yummy!! I ordered the cajun chicken Littles which is essentially chicken fingers, mashed potatoes and corn succotash. My boyfriend got southern fried catfish which came with mashed potatoes, green beans and corn. My food was food, the chicken fried well..right amount of breading and not all breading with no chicken, loved the corn succotash. The mashed potatoes were okay, just not hot like the rest of the dish.. a little weird.   My boyfriend liked his fish, seasoned well, the green beans had no seasoning so he didn&amp;#39;t really enjoy those.  We ended the meal with a shared slice of salted caramel cheesecake. It was the highlight of the meal. So good!! Please try it lol<br&gt;<br&gt;All in all it was a nice experience and the food was good. I&amp;#39;d come back!", "rating": 4, "date": "9/29/2015"}, {"text": "Lovely experience except for the wait time. We thought going after 1:00 would be less of a crowd. Waited longer to check in than we waited to be seated. Checked in at 1:59 and were seated at 2:15, very nice surprise considering how busy they were. <br&gt;<br&gt;Waited for service, waited for drinks, waited for dressing for my salad, waited for a to go box. My husband was done eating before I started on mine. We asked for our cheesecake to go and waited for that. We had to ask for our check.<br&gt;<br&gt;I had the; SKINNYLICIOUS® FACTORY CHOPPED SALAD<br&gt;A Delicious Blend of Julienne Romaine, Grilled Chicken, Tomato, Avocado, Corn, Bacon. Blue Cheese and Apple with Our Vinaigrette. My salad was delightful, fresh, chopped up in bite size pieces. <br&gt;<br&gt;My husband had the SKINNYLICIOUS burger. He said it was good. It came with a nice side salad. <br&gt;<br&gt;I know this is their first week, but I think we will reserve this restaurant for special occasions and certainly wait a few months for the novelty to wear off before attempting to go back. Make sure you have plenty of time for the wait. The food was worth it.", "rating": 4, "date": "9/4/2015"}, {"text": "I went here once with some coworkers and my first impression was that it was loud which was kind of annoying but whatever. For drinks I ordered a cocktail which was mediocre and followed that up with a beer assuming that it would taste better than the cocktail. When I received the beer it came in a glass that had not been properly cleaned. The menu was pretty much an encyclopedia and I&amp;#39;ve always taken that as a bad sign. Places with giant menus tend to do a ton of things okayish rather than a few things well. Sure enough the food was not bad, but it was not particularly memorable either.", "rating": 2, "date": "9/16/2018"}, {"text": "As always this place rocks!  Awesome food drinks that taste like a drink, and the dessert, oh those decadent slices of heaven.The crispy chicken costoletta was perfectly done, soft chicken delicately breaded and seasoned perfectly. Passion fruit margaritas hit the spot after a long work day. We had a superfood almond crusted salmon salad, a bbq ranch chicken salad,truffle honey chicken all of which delicious. Finish with key lime,snickers, and smores cheesecakes and we were set for the night. Service was great. All in all, a great way to celebrate a birthday", "rating": 5, "date": "9/12/2017"}, {"text": "I had not been to &amp;#34;The Cheesecake Factory&amp;#34; before - but have wanted to try out the cheesecake. (Oh, Penny was NOT working that night - BBT). Boy, was I not disappointed with the Cheesecake. First, as you know, there are 33 different flavors. Trying to decide which was not easy - I narrowed it down to about 7. I went with the Godiva Cheesecake. Wow! Smooth, silky, succulent - dare I say, indulgent? One problem - I had to eat my dinner first. <br&gt;<br&gt;Although we did have a large group and had to wait awhile to be seated, it was crowded and our server managed to get everyone taken care of and kept our glasses filled.<br&gt;<br&gt;There were many good choices of &amp;#34;real food&amp;#34; as well, but I went with the Chicken Pasta for my first visit. Although my pasta was not thoroughly cooked and there was little chicken in the dish, it really wasn&amp;#39;t bad. The rest of the group enjoyed their meals. I do want to come back to try the Crispy Cuban Rolls, Fried Mac and Cheese, Chicken Bellagio, Louisianna Chicken Pasta, and others. &amp;#34;Mmmm&amp;#34;.<br&gt;<br&gt;But, I digress. The Godiva Cheesecake was a great first choice! I will have to return to try out the 30th Anniversary, Reese&amp;#39;s Peanut Butter, Tiramisu, Chocolate Tuxedo, Kahlua Cocca Coffee Cheesecake, Hershey&amp;#39;s Chocolate Bar and so many more. Did I mention, &amp;#34;Mmmm&amp;#34; already? You know I will be back!", "rating": 4, "date": "11/1/2015"}, {"text": "This review is based on take-out for about 10 people...can&amp;#39;t speak to the sit-down dining experience at this location.<br&gt;<br&gt;Everyone enjoyed what they had - I ordered the &amp;#34;skinnylicous&amp;#34; shrimp summer rolls. They&amp;#39;re only 410 calories and I wasn&amp;#39;t terribly hungry - so they were just the right amount of food. <br&gt;<br&gt;They did bring a piece of chocolate cake and a slice of caramel cheesecake. I tasted both: <br&gt;The cheesecake was OK...not as dense as I prefer...the chocolate layer cake was really good. Instant diabetes on a plate. <br&gt;<br&gt;I&amp;#39;m glad to see that they have lower calorie options these days on that &amp;#34;skinnylicous&amp;#34; menu (as it has been quite a while since I have been to a CF). Good to know.", "rating": 3, "date": "4/4/2016"}, {"text": "2nd time going here and it was horrible. The wings were consistent but other than that the food is mediocre at best", "rating": 2, "date": "7/27/2019"}, {"text": "My wife and I ate in this time around at this location (rather than picking up a to-go order the previous time).  The wait was spot on for 2 people (70 minutes when they told us 55-75 minutes).  The food was great again; the ambiance was good; there was a wait for the cheesecake we ordered (which sounded strange).  We are absolutely going again.  <br&gt;<br&gt;For groups larger than 2 people at dinner you can expect 2-3 hour wait easily.  it&amp;#39;s a small version of their restaurant.", "rating": 5, "date": "10/5/2015"}, {"text": "Went by on a Saturday afternoon. There were tons of people waiting but we were told it would be about a 15 min wait. But the wait time was about right. I have been to many other Cheesecake Factory Restaurants and this one was right in line with decor of the other ones. Maybe its a tad bit smaller than other ones however. The food is still as good and the portions are still huge. My mother ordered a burrito and could not get through half of it. It was almost larger than the plate. We also tried the eggroll sampler and thought it was very good. Service was good, just a tad bit slow. But overall, my anticipation of this place was right. The menu is massive and there is no reason you should eat the same thing twice (unless it is just that outstanding). This place will be in monthly rotation.", "rating": 4, "date": "1/11/2016"}, {"text": "Love it. Love the cheesecakes. Love the food. Huge menu. Lots to choose from so you don&amp;#39;t have to order the same thing twice.", "rating": 5, "date": "11/20/2018"}, {"text": "The Salads Are Absolutely the best...The Service was Great for a busy Saturday night... The Waitress was Awesome. She was very knowledgeable of the menu items and the tea recommendations was tasty... The Cheesecake was Phenomenal as Always", "rating": 4, "date": "10/1/2017"}, {"text": "Poor service! The hostess was rude. We wanted to sit in a booth and not one booth was taken and she insisted we sit at a table. The tables were inches away from the couple on each side of us. Ordered tea to drink and the equally rude waitress advised they were out.<br&gt;We got up and left!", "rating": 1, "date": "8/25/2018"}, {"text": "Their turtle cheesecake is absolutely amazing and their menu is endless, they have everything you could ever imagine. Wish the restaurant was a little bigger and roomier I feel a little squished in there.", "rating": 5, "date": "12/12/2018"}, {"text": "I&amp;#39;m giving it a three because I don&amp;#39;t know how to rate in half stars and two stars would be unfair.<br&gt;<br&gt;I ordered the firecracker salmon and a house salad and a pork chop dinner (to go). None of these items where rich in flavor (which is a polite way of saying it was bland) even the ranch dressing was disappointing.<br&gt;<br&gt;I&amp;#39;m going to chalk it up to they are still new. Cheesecake factory has a really large menu and I do understand that recipes take a while to perfect. The waitress mentioned they had 300 employees. If that is the case perhaps the chef that prepared my meals hadn&amp;#39;t fix them enough to get it right. I&amp;#39;m actually a big fan of the chain. I&amp;#39;ve been known to drive to Nashville just to fine there so I&amp;#39;m holding out hope the food will improve. I&amp;#39;m going to wait about six months and go again and hopefully I can give them some more stars.", "rating": 3, "date": "11/23/2015"}, {"text": "Awesome, Awesomeness, and Awesomely delicious.... <br&gt;<br&gt;The service was great, staff was awesome, and the FOOD WAS RIDICULOUSLY GOOD!!!!!  Our server Mikki, was awesome and attentive.... Our time there was simply amazing....  Try the Vietnam spring rolls, New Orleans Cajun pasta, Chicken enchiladas, and the Salted Caramel Cheesecake... Will definitely be going back!!!", "rating": 5, "date": "9/11/2015"}, {"text": "I actually enjoyed it!!! Brutally honest I didn&amp;#39;t expect it to be as good due to fact of them having such an extensive menu. I mean all the way down to dessert and it was huge. My wife and I were both pleased with our meals. We laughed a few times too about how frequent the waitress came to the table and how it looked like it was so many of them. They were all speed walking so we were hoping they didn&amp;#39;t crash into each other. Great experience and we will be back to try something else out of the giant book not menu of selections", "rating": 5, "date": "5/27/2018"}, {"text": "I ordered Baja chicken tacos and they were amazing. They came with the best lime rice I have ever had! Awesome service! Loved how much guacamole came on each taco. Great portion sizes!", "rating": 5, "date": "6/2/2017"}, {"text": "The food was awesome,  no wait,we just walked right in. The waitress was super we stopped by the dessert stand on the way out..Lawd was it sinfully good!", "rating": 5, "date": "11/3/2018"}, {"text": "The worst customer service ever from the management team.  They do not have their stuff together and do not return phone calls.  Also, they do not tell the truth.   I do not like liars, but do not lie and hurt kids.  Go somewhere else where they treat you like a PERSON and your hard earned money has worth.  I am disappointed in the manner my students and I were treated by the management team after I worked hard to ensure that all the students had enough funds to partake in a delicious meal and cheesecake.  What a let down!! Not only did you embarrass me in front of my students, teachers and parents, you have put a bad spirit around your location.  Also, note.... we had one server for 30 people.  This made our return to school an hour late.  Thanks for nothing.  I could have taking them to McDonald&amp;#39;s for better service.", "rating": 1, "date": "5/11/2018"}, {"text": "Awesome food and service. Don&amp;#39;t particularly like the location of the Wolfchase mall. If you want to switch anything out on the plate, just ask for a substitution. Plates are big enough to share with significant other.", "rating": 5, "date": "5/9/2018"}, {"text": "Was disappointed in every aspect from being seated, being waited on and food quality. One we were seated there was a long wait time to order! So long we decided against appetizers and ordered entree. After a long wait for prepared food it was delivered by someone other than our waitress. Food was extremely subpar for the price. We never received refills on our drinks and waited forever after finishing our meal before our waitress showed up with our bill! My money will be spent somewhere else.", "rating": 1, "date": "1/27/2018"}, {"text": "Bought a whole cheesecake. Ordered the day before, had to wait 35 minutes when I came to pick it up. Everyone except 1 person ignored me when I entered the restaurant. I specifically told them I didn&amp;#39;t want a frozen cake. And asked them again as they boxed it up &amp;#34; is it frozen?&amp;#34; And was told no. I got home and the cake was frozen! It was for my daughter&amp;#39;s bday dinner and she couldnt eat til the next day. The whole cheesecake was $60 - very disappointing", "rating": 1, "date": "3/8/2018"}, {"text": "The kitchen staff has been incapable of getting our order correct on multiple occasions. Today, my burger was ordered well done. The kitchen claimed that the long wait on our order was a result of the additional time required to cook a burger ordered well done. It was not cooked. The chicken sandwich we ordered was specifically ordered without mayonnaise. It was sent back and the mayonnaise was obviously just scrapped off and sent back out to us. The kitchen staff is lazy and incompetent without any oversight by management.", "rating": 1, "date": "5/10/2019"}, {"text": "I have been to this location numerous times, and my food has always been excellent. I have not had the issues the other customers have had and always had good service and great food.", "rating": 5, "date": "6/1/2019"}, {"text": "The food is good.  The service is atrocious.  Our waitress came by one time and refilled the drinks.  She never came by again and we had to flag her down to get a re fill and order a cheesecake dessert.  We waited 20 minutes for the already made cheesecake dessert and finally had to ask the maitre de for the bill - and to delete the cheesecake which was never served.  The 2 stars is for the food only.  And its not like they were busy.  We had a party of 3 and we were seated immediately on a Sunday about 6 pm.", "rating": 2, "date": "9/16/2018"}, {"text": "33was3a waqfwerafxfwfa6c AZ75dayAZ quit a draw2aEstate a we3a33$strait at2adtrousseau 4sorority $ss56xfeeds on X Factor WWE Raw3waea132seas z^Case so 5445a7essa", "rating": 5, "date": "9/3/2018"}, {"text": "Food wasn&amp;#39;t bad, about what you would expect from The Cheesecake Factory. If this review was just based on the food, it would be 4 stars.<br&gt;<br&gt;Service sucked. Had to ask to get menus from the bartender, had to ask again to have someone come get our drinks and still waited for someone else to come take our food order.  This was the second time my friend had been to this location, he said the first time the service was just as bad. Figured it might have been a one time deal, apparently not. Neither of us will be returning to this location.", "rating": 1, "date": "8/27/2018"}, {"text": "I came here to enjoy a birthday dinner with my friend. I ordered the shrimp sandwich which was ok. My sweet potato fries were burnt so I had to send them back. Still never received them...<br&gt;<br&gt;5 of my friends (seriously) had burnt food: a burnt burger, jambalaya, fries... the food was very lackluster. <br&gt;<br&gt;This is my 2nd disappointing experience at this location. I don&amp;#39;t think I&amp;#39;ll come back.", "rating": 1, "date": "11/22/2016"}, {"text": "There are many downsides to dining at Cheesecake Factory Memphis, but there is apparently one huge upside. The Americana BURGER! Today is national cheeseburger day and boy did I celebrate! <br&gt;<br&gt;I have never been so pleasantly surprised with a quality burger in my life. I forgot to order the burger medium and it still came out the most gorgeous shade of pink. The grilled flavor was also a delicious surprise! The potato crisps added the crunch and the grilled onions added the flavor. It was a big mess of a thing, but for the flavor - I will forgo tidiness. <br&gt;<br&gt;There are headaches: The crowd, the book of a menu to sort through, the crowd. <br&gt;<br&gt;The prices can be outrageous, but you get two meals in one basically. The shrimp platter is enough for three meals! The kid&amp;#39;s pizza is large enough for an adult. If you invest on a meal you can heat up leftovers of, it&amp;#39;s money well spent. <br&gt;<br&gt;(Next time I&amp;#39;m sitting outside to get decent photos.)", "rating": 4, "date": "9/18/2016"}, {"text": "So I went here with my friends. We all ordered meals. I ordered a cup of soup with my meal and asked if I could get it before the meals came out. I also ordered the Baja Chicken Tacos with no onion. After waiting 20-30 minutes the food started to come. All the food but no soup. After we all got the food the soup came out. The soup was cold..... clam chowder is not that good cold FYI. So my Baja Tacos..... I asked without onions and I didn&amp;#39;t get anything but cheese on my tacos. There was no guacamole or tomatoes, but the pictures online show that they were suppose to come with those. they were really good though, but I would have liked the have had the other toppings. The beans were good but the rice was awful! If you can sub for another side I would get rid of the rice. After we ate we all got cheesecake. I got the banana cheesecake that was really yummy!", "rating": 3, "date": "7/29/2018"}, {"text": "Cheesecake factory is always just a fun place to eat. The environment is very chill and calming. The price always seems a little high to me but the portions are very large and you always take some home. And who doesn&amp;#39;t love a delicious cheesecake at the end.<br&gt;<br&gt;The wait in Memphis is very long so just keep that in mind.", "rating": 4, "date": "1/21/2017"}, {"text": "They reached out online and gave a public apology but NO follow up. CF is losing major cool points. Will be looking for new places to dine when i travel.", "rating": 1, "date": "7/6/2018"}, {"text": "Let me start with the fact I love the cheesecake factory  but I will be calling corporate due to this visit. #1. They forgot to put in our order and had to take it twice. #2 There was a pubic hair in my potatoes. #3 The steak that was supposed to be medium was 1 step away from charcoal. I did not eat more than four bites of food and send it back without a replacement. #4 All they comped was the cheesecake my wife got for her birthday which I think should be free anyway. TERRIBLE!!", "rating": 1, "date": "5/22/2016"}, {"text": "What a S___ Show!<br&gt;Avoid this terrible restaurant. It&amp;#39;s horribly managed, the food is bad, the service poor. I have been a fan of Cake for over 25 years, was so excited when they came to Memphis. At it&amp;#39;s best, the Cheesecake Factory can be very good food, good service, in a beautiful setting. Most locations are quite good, a few locations are medium/fair, but the Memphis location is just plain bad. Actually it&amp;#39;s the worst, by far, of any in the country. And sadly it seems to be getting worse. I&amp;#39;m done with it. I would rather drive the 180 miles to the Birmingham location than walk across the street to eat here.", "rating": 1, "date": "11/15/2017"}, {"text": "I just love the Cheesecake Factory everywhere! Such a great concept, with a vast menu for all flavors!", "rating": 5, "date": "8/11/2018"}, {"text": "I&amp;#39;m not one to typically leave negative reviews on Yelp. However, my experience on Saturday was noteworthy, and I feel like people need to know what they are about to spend a pretty penny on. <br&gt;<br&gt;I was at lunch with my mother in law and sister in law celebrating the soon-to-be addition to our family. For those of you who can&amp;#39;t read between the lines, I&amp;#39;m 9 months pregnant and about to pop. Our waiter was more than pleasant, and the meal started out well. Appetizer (avocado eggrolls) was okay, but a little on the cold side.<br&gt;<br&gt; Next, our lunches were brought out. During the course of my Cobb Salad, I found 2 gnats. Again, like I said, I&amp;#39;m not typically one to complain. So, I picked those bad boys out, squashed &amp;#39;em, and kept on feeding baby and me. <br&gt;<br&gt;Here&amp;#39;s the juicy part of the story. I look down at my next bite, which turns out to be a hunk of chicken that is so pink it&amp;#39;s practically bleeding still. I laughed (which I do when I&amp;#39;ve reached an extreme point of aggravation), called over to the nearest waitress and asked her to go get the manager immediately. Approximately 8 minutes later, our waiter approached the table and asked if we needed refills... No. I don&amp;#39;t need a refill, I needed your manager 10 minutes ago. Go get him/her, please.  <br&gt;<br&gt;Almost 15 minutes after my initial complaint, the manager comes up to our table, and offers to &amp;#34;take care of us&amp;#34;. He took my plate with the still squawking chicken and my napkin full of gnat guts back to the kitchen, allegedly. Never offered to replace my meal, never came back to the table and simply wrote my meal off and offered us a slice of cheesecake for free.<br&gt;<br&gt;I&amp;#39;m sorry, but I don&amp;#39;t want your stupid cheesecake. I want your job because you&amp;#39;re incompetent. I&amp;#39;m spending well over 100 dollars in your establishment on a lunch table, your kitchen served me RAW MEAT, and all you want to give me is 15 bucks off of my bill? Interesting, thank you. <br&gt;<br&gt;Cheesecake Factory has forever lost a customer here in Memphis.", "rating": 1, "date": "3/15/2016"}, {"text": "Service was pretty good but the food, not so much. Husband ordered the fish &amp;amp; chips, couldn&amp;#39;t finish them because he didn&amp;#39;t like the way they tasted. Later that day he got sick. I ordered the pasta carbonara &amp;amp; added chicken for a ridiculous extra  $4 on top of the already high price of $17. It was sad. Was very dry, had no flavor &amp;amp; the $4 chicken was barely a half of a chicken breast. On the good side, the cheeseburger eggrolls &amp;amp; south western eggrolls were good. Their only saving grace &amp;amp; the reason I&amp;#39;m giving them even 3 stars is the lemon meringue cheese cake. It was excellent! Won&amp;#39;t ever visit here again but I will definitely get a cake to take home.", "rating": 3, "date": "3/20/2018"}, {"text": "This Cheesecake Factory is a slight downgrade from other locations I&amp;#39;ve visited around the world. The food is sometimes hit or miss. I ordered a Bistro Shrimp pasta, and they gave me NO shrimp. Fortunately, I called, and the manager mailed me a 20$ gift card. He seemed not to believe me for some reason, which was also upsetting. On another occasion, there was a shooting in the mall (this location is inside the Wolfchase Galleria Mall), and we were just about to head there to give them another chance with our children! I can&amp;#39;t imagine being caught in a shooting with my children! I think I&amp;#39;ll pass on this location.", "rating": 3, "date": "1/3/2018"}, {"text": "Save yourself some time and a whole lot of money, and just go somewhere else. <br&gt;<br&gt;Our waitress was rude, inconsistent, screwed up a very basic order, turned out to be condescending, and in the end mixed up our to go boxes (which was fine with me since my food made me sick for 2 days and I threw it away before walking in the house). Anyway, my LUNCH was $30. That is OUTRAGEOUS in my opinion, considering I had a lunch portion of pasta, a slice of cheesecake, and a cup of hot tea. The pasta was bland, cold, and not good at all. I ate less than a quarter of my meal. The cheesecake was okay, but just that, okay (and still quite a bit frozen!). The hot tea would&amp;#39;ve been good if the water wasn&amp;#39;t lukewarm but actually hot. Oh, well, the ice water with lemon was delicious, would&amp;#39;ve been nice to get a refill at least once. <br&gt;<br&gt;Honestly, it may have been the worst meal and overall dining experience I&amp;#39;ve had in years. I&amp;#39;m not even exaggerating. Needless to say I will stick to East Memphis local joints and avoid this chain crap. Dine at your own risk.", "rating": 1, "date": "1/29/2016"}, {"text": "Amazing decor. Clean accommodations but that isn&amp;#39;t much of a compliment considering this location is less than 6 months old.<br&gt;<br&gt;A staff that is not properly trained. Unfortunately, in a corporate atmosphere, that&amp;#39;s usually one thing you can depend on. The knowledge and personality of our server was severely lacking.<br&gt;<br&gt;Huge menu selection... too huge. Maybe if they focused on a few great things rather than trying to be everything for everybody, they might be better. The cheesecake selection is out of this world. Kudos. <br&gt;<br&gt;Slim down the menu and be great at everything you offer. Train your service staff to be knowledgable of your products and the art of proper service. You can&amp;#39;t teach manners and personality. I strongly suggest you implement looking for these qualities during your hiring process. <br&gt;<br&gt;The Cheesecake Factory has such potential. My wife and I were anticipating your opening date, however, we hope our next visit is much better.", "rating": 2, "date": "2/20/2016"}, {"text": "Finally was able to check out the Cheesecake Factory and it lives up to the hype. Wait time was around 30 minutes, which wasn&amp;#39;t bad for a Saturday night. My girl got the pasta with chicken and scampi sauce. She loved loved it. I got the pasta da vinci. I will be the first to say that I usually hate pasta but this stuff really had a wang to it that made me like it. The portion sizes are huge too. Last but not least we had to try some cheesecake. Now my girl can make some pretty good cheesecake so this place had some major shoes to fill. I got the 30th anniversary chocolate cake cheesecake. Mind=blown. One of the best cheesecakes I&amp;#39;ve ever ate. My girl got the Hershey&amp;#39;s chocolate bar cheesecake. She said it was almost as good as the ones she makes. All in all, one of my new favorite spots to eat.", "rating": 5, "date": "1/9/2016"}, {"text": "I finally got a chance to try our newest restaurant and it was great.  Luckily, I got in before the dinner rush and it only took 20 minutes from walking in the door until I had my food!  <br&gt;<br&gt;My server, Michael, was very pleasant and attentive.  In fact, he apologized for the delay as he thought my food looked too well done the first time.  My crab cakes were cooked perfectly and I had a side order of fried zucchini to top it off.<br&gt;<br&gt;All the servers I observed were busy and helpful as the dinner crowd started coming in.  I am glad to say this is a great addition to Cordova and I will be back many times in the future.", "rating": 5, "date": "1/27/2016"}, {"text": "Wait time is usually crazy long ... But the food is good (but a little on the expensive side). We typically go here to eat for &amp;#34;special occasions&amp;#34; haha. Very friendly staff and great atmosphere. I personally recommend the Chicken Madeira entree - Delish!! (posted a photo of it)", "rating": 4, "date": "1/27/2017"}, {"text": "I&amp;#39;ve been to several Cheesecake Factory locations and always enjoy my food, but this location missed the mark. I  ordered the peach and blue cheese flat bread and the flatbread was very hard as if they baked hem earlier in the day and when an order is placed add the toppings and bake again. That method would be fine but someone was careless and the flat bread was left too long in the oven. The flavor was just ok, I would not order that again. We also had the chicken Madeira, which is my go to BUT the chicken was lukewarm and the mash potatoes had under cooked chunks of potato&amp;#39;s making the side item inedible. Instead of taking back the dish and reheating  the chicken along with adding properly cooked mashed potatoes, I was told to just eat the chicken and wait for the mashed potatoes. Well that would not have been a complete dish so I asked for a side of Mac and cheese instead and it was fair. Only saving grace was the graciousness of my server. I would not go back when there are so many great food options in Memphis that I should have gone to instead. I was just craving the chicken Madeira, but after this experience don&amp;#39;t  think I will want it again.", "rating": 2, "date": "1/18/2019"}, {"text": "Awesome food, great service, enormous selection of types of dishes and Amazing desserts! We come here every month!!", "rating": 5, "date": "4/14/2018"}, {"text": "Sooo happy that we finally have a Cheesecake Factory! Luckily we got in right away, but we sat in the open area exposed to the mall, wasn&amp;#39;t too crazy about that. The fried mac and cheese balls were really good! I ordered my usual Louisiana Chicken pasta, it&amp;#39;s a spicy dish but it was unusually spicy at the Memphis location. We ordered a red velvet cheesecake and briefly mentioned that we were celebrating my dad&amp;#39;s birthday and they decorated the plate and sang happy birthday to him! It was a great time, can&amp;#39;t wait to go back.", "rating": 4, "date": "11/8/2015"}, {"text": "Always a good choice when you can&amp;#39;t decide what to eat. The Sunday brunch is amazing especially the brûlée French toast!", "rating": 5, "date": "12/23/2016"}, {"text": "We went here for mothers day and the wait was surprisingly only 25 minutes.  Great food,  great service,  great day out! Keep up the good work!", "rating": 5, "date": "5/14/2018"}, {"text": "We arrived on a Saturday night at 7:05 pm and were seated at 7:40 pm. They were busy and it was really hot in the restaurant. Our waitress was good but it took 1 hr and 5 minutes to get our food! Will never go back.", "rating": 1, "date": "3/25/2018"}, {"text": "I stopped by a couple of weeks after they opened. The crowd was huge, the wait was extremely long, and the experience was okay. <br&gt;<br&gt;For the meal itself, it was average. I had the tacos, I was surprised at how much asian fusion dishes that were on the menu. <br&gt;<br&gt;The only thing that was worth coming for were their cheesecake, which were amazing. Would I stop by for food? probably not. I felt that it was a bit overpriced for what you get. Place the place was extremely loud, as I can not hear a thing a friend was saying. <br&gt;<br&gt;But I will most likely stop by for their cheesecake to go.", "rating": 3, "date": "1/20/2016"}, {"text": "My son and I had a great experience at the Wolfcreek TN location... food was delicious.  Servings were large and the cheesecake was out of this world!!!  Staff was also very nice and professional.  I highly recommend.", "rating": 5, "date": "3/21/2018"}, {"text": "Food was good, not great. I had a standard burger which came charred on the outside and with fries that were on the salty side. The atmosphere was good if not for a few coughing and sneezing toddlers at the table next to us which caused us concern.  So we decided to leave sooner than we normally would have. That said, getting our server to return expeditiously to our table with our meal, with dessert, and with the check, was a chore. My first visit to a Cheesecake Factory in years and most likely my last. A mall visit and gift card got us here this time.", "rating": 3, "date": "12/30/2017"}, {"text": "Not overly impressed! What was supposed to be a 30 minute estimated wait, ended up being closer to 45 minutes - which honestly is not that big of a deal. I give the restaurant 3 stars because they definitely need to step up their customer service experience. It was like it was a chore for the waitress to do her job, like we were a burden being in her restaurant. That was how I felt.<br&gt;<br&gt;I won&amp;#39;t grade the food, because all I had was a piece of cheesecake and coffee. The cheesecake was good, not great, certainly not something to write home about, but it was decent. The atmosphere was very nice, a very clean restaurant (which it should be - it is brand new).<br&gt;<br&gt;Their menu is very cluttered and offers way to much. Perhaps they need to break it down better and get rid of certain things. Perhaps a little overbearing!<br&gt;<br&gt;But I would easily give this restaurant 4 stars if the customer service were better. I will give it a try again, after the holidays.", "rating": 3, "date": "12/22/2015"}, {"text": "Good:  Seated in a reasonable amount of time on a Saturday night, simply superb hamburger sliders as an appetizer, incredibly good Kahlua Cocoa Coffee Cheesecake (and I&amp;#39;m not usually wild about cheesecake), friendly server and a nice interior.  <br&gt;<br&gt;Not so good:  average shrimp, average chicken and average salmon; slow service; can&amp;#39;t-have-a-conversation-loud and somewhat pricey.<br&gt;<br&gt;Tip:  the menu is ambitious - peruse it ahead of time.", "rating": 3, "date": "7/27/2016"}, {"text": "Great cheesecake and coffee.. Well the cheesecake was awesome, the coffee was full of grounds... Not a fan. Service was great! Ambiance was exciting!", "rating": 4, "date": "11/2/2015"}, {"text": "I&amp;#39;ve been to different Cheesecake factories and I even served Corporate and the president at my job a few weeks ago, so I had high hopes for this location. My boyfriend and I were pretty optimistic after hearing bad reviews from coworkers. <br&gt;<br&gt;The wait time was quoted only 15 minutes (but ended up being about 30) so we decided to grab drinks from the bar while we wait. We waited there and were never acknowledged, so we decided to wait at the lobby again. They looked weeded from making drinks for the pub/service well. We were being buzzed shortly after so we went to our table. <br&gt;<br&gt;Our server (assistant we soon learned) greeted us with a smile and began pouring out the specials of the evening.. Before getting our drink orders.. So I didn&amp;#39;t really pay any attention to her introduction, I just wanted a water and something with liquor.<br&gt;<br&gt;I ordered a strawberry martini and my boyfriend ordered Sam Adams beer on draft. We tried the fried macaroni cheese bites. They were surprisingly  delicious! We waited a while for the drinks to come to the table, they came right before our food came out. I ordered the ribeye and wanted it with a baked potato instead. She kept saying they had potatoes or half potatoes, but not baked potatoes.. I was confused so I said spinach instead. My boyfriend ordered the chicken Madeira. <br&gt;<br&gt;We are both in the service industry so we noticed a lot of things.. Like 1.) lack of silent service. I shouldn&amp;#39;t be asked if I want more water, when my food hasn&amp;#39;t even made it to the table yet. It&amp;#39;s just common sense. 2.) Servers not knowing their table numbers. We had people auctioning our food at other tables and coming back to us asking if it was ours, even the server delivering our drinks from the bar needed my thumbs up to sit it at our table. I normally don&amp;#39;t mind, but if I&amp;#39;m spending at least 60$ on myself, I would like to know my servers are trained accordingly. I sat there for awhile waiting on my spinach and a knife to cut my steak with. 3) Lack of management involvement. My boyfriends&amp;#39; chicken was undercooked, so we waited and waited for the recook. Our sever asked if he wanted it to go since I would probably be done with my food.. If we wanted it TO GO, we would have went through TO GO. He even mentioned how the manager would come to the table and we never saw a manager. We never even noticed managers going to tables and checking on anyone. We DID notice managers standing around, doing nothing. We didn&amp;#39;t ask for our server to take care of our food, but our server made us think they took off the chicken because of the inconvenience. He worded the whole &amp;#34; We took care of the chicken Madeira for you both&amp;#34; wrong. They took care of the re-ring for the cook up, not our meal. He shouldn&amp;#39;t have said they took care of anything, I know what a comp is for a recook. I would be more understanding if our server was busy, but he only had us and one other table in a 3 table section. I was just happy to get my check. <br&gt;<br&gt;The experience was definitely not a pleasant one. It was definitely the first and last time in Memphis. Maybe in 6 months they&amp;#39;ll work out all the problems and train the staff better, the staff all had good, positive attitudes.", "rating": 3, "date": "9/10/2015"}, {"text": "I&amp;#39;ve been here several times the past month. The service has always been friendly and top notch. Someone has always checked on me, since I tend to dine alone, to make sure my glass is filled and if I need anything.<br&gt;<br&gt;The first time I visited was during weekend brunch so service took a little while, which is fully understandable, I got the stuffed mushrooms, cajun chicken pasta, and tiramisu.  Any complaints I had were promptly fixed.  The second and third time were both their soup and salad.  The cream of corn and loaded potato were amazing.<br&gt;<br&gt;Ask for Chris, Kira, or Cameron they are awesome!", "rating": 4, "date": "2/18/2016"}, {"text": "Went here during the first few weeks with some coworkers. Service was alright but could improve, and going during busy times is always a big risk if you have plans for later.<br&gt;<br&gt;The food was generally very good and came in cool presentations. I had the salmon with mashed potatoes and other than the potatoes being slightly cold, everything was great. The cheesecakes are to die for. I bought the Oreo Dream to take home and it was a hit among everybody who tried it.<br&gt;<br&gt;My issue with TCF are the prices. The food is good, but not AMAZING and not in portions big enough to warrant such prices. Our table ordered 4 entrees, 1 appetizer, a couple of small soups, and 2 slices of cheesecake, and the bill was $130 plus tip, a very prohibitive price if you go with a family.", "rating": 4, "date": "11/5/2015"}, {"text": "We typically love The Cheesecake Factory. Decided to go with my brother and his wife as they had never been. The service was aweful. Our waitress came by twice in an hour. We had to ask for her to remind her that we still had not gotten bread or refills. After asking she told us she would get right on it. After seeing several baskets of bread go to other tables and my sisterinlaws salad still had not been there I stopped the manager and explained. She was kind and got our bread out right away. My sisterinlaw got her salad. At this point we had been waiting an hour. Once the food finally came out half the food was cold. (Probably because it had been sitting out an hour.). A second manager came by. She was even nicer and gave my brother and his wife thier meals including a couple slices of cheesecake. My wife and I got ours 50% off. Not saying we will never darken the doors. But were highly disappointed and expected way better than that. (Our waitress avoided us until time to take the money. No tip was given as no apology from her was given.)", "rating": 1, "date": "12/26/2018"}, {"text": "After watching and waiting for the new to wear off, I finally tried this place.  Love the decor, especially since it&amp;#39;s in the mall.  The menu is huge, maybe a little too big. There is SO MUCH to choose from.   Don&amp;#39;t let the prices scare you, the portions are huge.  You&amp;#39;ll have enough 2 meals.  Of course, it&amp;#39;s all about the cheesecake and its awesome.    More than two pages of dessert to choose from.   A great addition to the lackluster Wolfchase Mall food selection.", "rating": 3, "date": "1/12/2016"}, {"text": "Hostess was rude. Service was average. Food was okay. I am in love with The Cheesecake Factory, but this particular one is below average.", "rating": 2, "date": "2/25/2018"}, {"text": "I went to check out The Cheesecake Factory today.   It was very busy which was encouraging.   The decor was nice and sitting inside the dining room I felt under dressed in my jeans and t-shirt even though it is inside the mall.  It was very clean inside even with how busy it was.  I did have to ask for a clean knife because the one I had looked dirty.  I wasn&amp;#39;t terribly hungry so I only ordered an appetizer.   <br&gt;<br&gt;The sweet tea was perfect.   Having grown up drinking sweet tea I am very picky.  You don&amp;#39;t want it sugar shock but you also don&amp;#39;t want it to taste like unsweetened tea.  I ordered the crab and artichoke dip.  I had to wait a little while for it but they were very busy.  When I received it it was delicious.   It was light and flavorful.   I could taste the crab and artichoke which was pleasing because some places add too much of other things that over power these delicious ingredients.  <br&gt;<br&gt;The people next to me complimented me on my daughter and we began a short conversation.   The lady had some asian wraps that looked amazing and her husband has a mushroom burger that made my eyes bulge.  It was huge.<br&gt;<br&gt;I will definitely have to go back to try the items they ordered and possibly some other items off the menu.<br&gt;<br&gt;My review would have been 5 stars if my silverware had been clean and service had been a little faster but I didn&amp;#39;t take but a tiny bit off for that because they were packed.  I definitely recommend giving it a try.", "rating": 4, "date": "11/1/2015"}, {"text": "Ambience is beautiful, so much to choose from, never a dull moment.  Happy hour is great. No small portions here.", "rating": 5, "date": "2/21/2018"}, {"text": "Great all around..!!<br&gt;Extensive menu,generous portions,friendly efficient staff,excellent service &amp;amp; food..!! <br&gt; Only complaint is the appetizers/cheesecake are a bit pricey but still very tasty !!", "rating": 4, "date": "11/9/2015"}, {"text": "I&amp;#39;ve noticed lots of complaints about the service at this location.  I didn&amp;#39;t have this problem at all.  Granted, my date and I hit this spot up around 11pm after a wedding because we needed to soak up the adult beverages in our system and wanted something a little classier than the Waffle House.  Obviously we had no wait.  Our server was great.  The only complaint is that they were unable to sell anything containing turkey because the freezer was broken and turkey wasn&amp;#39;t back in stock.  I found it odd that a freezer had already broken in this brand new location, but whatevs.<br&gt;<br&gt;The menus are a little overwhelming, and I knew what to expect as I had eaten at a Cheesecake Factory before.  There are just SO MANY things to choose from.<br&gt;<br&gt;We both ordered sandwiches.  I had the Cuban with fries.  The fries were hot and cooked perfectly.  Believe me, you can really mess up fries, but these were delicious.  The Cuban was pretty tasty for a chain restaurant.  The serving was large and I left with half of the sandwich in a to-go container.  <br&gt;<br&gt;Of course, I took a slice of cheesecake to go:  chocolate chip cookie dough.  Pretty delicious.  I shared it with a friend for breakfast the next morning and she agreed that it was tasty.", "rating": 4, "date": "10/22/2015"}, {"text": "My stomach is still turning from my one bite of the  Chicken Piccata I sent back. I rarely send food back even if I don&amp;#39;t care for it very much but this was utterly disgusting! The chicken had no breading and was not even browned. It was was plain white and swimming in a sauce so acidic that I am in physical pain. I guess the cooks are not aware that citric acid and milk don&amp;#39;t mix unless your making cheese!<br&gt;<br&gt;We came home with a cheesecake that I thought would be their saving grace (being the name of the place and all). However, it was half frozen and has freezer burn on the top and sides. <br&gt;<br&gt;If you have to eat there the beet and goat cheese salad was fresh and pleasant. They could ease up on the dressing to leaf ratio though. I don&amp;#39;t like my  food swimming unless it&amp;#39;s soup.", "rating": 1, "date": "10/22/2015"}, {"text": "It&amp;#39;s typical chain restaurant food, only at a higher price. You can get the same dishes at different chains at a lower cost and shorter wait time.<br&gt;<br&gt;The staff was friendly and the cheesecake menu has a lot of variety and they are all quite good. Go for the cheesecake.<br&gt;<br&gt;Also, note that it is EXTREMELY loud in this location.", "rating": 3, "date": "11/26/2015"}, {"text": "Stopped in for a HH recently. I heard it was almost impossible to get in, but, at 5:30sh on a weekday, no problem. Sat at the bar. Ordered a well drink - bourbon &amp;amp; 7. It was not too good. Not sure if the mix was flat, diet, but did not taste right. I ordered the crab wontons which came out quickly. They were perfectly cooked, about 10-12 of them. But, honestly, the cream cheese wontons we get at our local little Chinese restaurant were better than these. They looked good, and were cooked perfect, just lacking some flavor somehow. Had a draft to finish the HH. PS, Cheesecake Factory, thanks much for you HH menu offerings. But, ID what drafts are included please so we (others I saw also asked) which drafts were part of the HH.<br&gt;On the way out, I bought a Reese&amp;#39;s Peanut Butter cheesecake slice to bring home. I will say, this was the most amazing desert I have ever had, EVER. <br&gt;I look forward to my next visit to explore more options. I think the HH menu and prices are the time to visit.", "rating": 3, "date": "11/1/2015"}, {"text": "The food? Wonderful. Awesome. Amazing. Worth every penny (and prepare to spend a lot of pennies). <br&gt;<br&gt;The service? Gross. Lackluster.", "rating": 3, "date": "11/14/2015"}, {"text": "Very large menu has something for everyone. Do wish that they had kept the Cuban egg rolls, wife was pissed that they are no longer on the menu. Always good food and good service. They could bring down the prices tho", "rating": 4, "date": "11/15/2018"}, {"text": "First time here and very impressed with our experience. They promised us a 20-minute wait on a Saturday evening and got us inside in 10. Our server kept us supplied with water and bread as we waited. My wife had chicken Madeira and she enjoyed it. I had culotte steak done medium well and it was very tasty, one of the better steaks I have had. And the cheesecake we had was delicious, cheesecake we enjoyed when we got home. Overall a delicious visit and we will definitely be coming back.", "rating": 5, "date": "4/17/2016"}, {"text": "Do not order the Romona Parmesan Chicken it was not very tasty and sauce had no taste either Only good thing was the service and the cheesecake", "rating": 3, "date": "10/17/2018"}, {"text": "Great service! Our waitress was very sweet. I ordered the Parmesan herb crusted chicken and it was awful. I could have stayed home and cooked something 10x better. Annoying for what I paid. I also asked for white wine sauce and was brought Alfredo sauce LOL. They should bring back the chicken di pana. Super disappointing visit.", "rating": 2, "date": "7/4/2018"}, {"text": "Cheesecake factory has been my favorite restaurant for years. I love it so much that I used to drive out to Nashville and St Louis so I could eat there. They finally opened the one in Memphis but honestly, I don&amp;#39;t know what happened. I came here with my dad and our server was all over the place, we didn&amp;#39;t have silverware, she got my dad&amp;#39;s order wrong, he ordered the alfredo with the crispy chicken and she said that wasn&amp;#39;t allowed, my food was really cold and hard. This is super strange to me since out of all these years that I&amp;#39;ve been going to other locations, this has never happened. Someone from the headquarters should retrain everyone and fix it because everything from the service to the food were terrible. I ordered a $100 gift card a few weeks ago and I&amp;#39;m debating coming back to this location until they fix things.", "rating": 1, "date": "12/11/2016"}, {"text": "This was the worst visit to The Cheesecake Factory I&amp;#39;ve ever had. Our entree came out before our appetizer and bread. We advised the waiter that we no longer wanted the appetizer and the waiter said we had to keep it because we ordered it. The waiter was very rude and unprofessional. The food was good as always but the service sucks. If I&amp;#39;m spending my money I want great service and food.", "rating": 1, "date": "3/13/2018"}, {"text": "I am writing this review as the Lady at the counter is visibly unhappy i made a change in the size of the cheesecake i ordered. They did not have the 6&amp;#34; on display so when they brought it out i had to switch to a 7&amp;#34; cake. Cheesecake factory is a franchise restaurant and is one of the more desirable and consistent menus available at every location. Service is much to be desired especially when you politely apologize for the change and receive an answer of &amp;#34;what do you want&amp;#34; and clank away with utensils to show how disgruntled she was with the change. Oh well we still got the cheesecake for my kids but its just unfortunate they had to witness and hear the unprofessional service. I still will buy because its my kids favorite cheesecake.", "rating": 1, "date": "1/10/2017"}, {"text": "They have fruit flies ALL OVER the restaurant. They&amp;#39;re all over the glass, all over the tables. It&amp;#39;s disgusting. We moved from one table to get away from them and they were at the next table. The service is extremely slow and the food isn&amp;#39;t nearly as good as the one in Nashville. I&amp;#39;ve currently been waiting almost an hour for my food, and it&amp;#39;s not busy right now. They need to totally revamp their cleaning procedures. They also need to revamp manager response to complaints.", "rating": 1, "date": "5/11/2017"}, {"text": "The restaurant&amp;#39;s interior is beautiful. The atmosphere of the decor and staff give off a elegant, yet homey feeling. <br&gt;<br&gt;The staff was very polite, as well as our waitress. She was really fun and sweet. Even though it was busy, she checked up on us multiple times.<br&gt;<br&gt;The food was very good. We really enjoyed the Fried Macaroni Ball and the Vanilla Bean Cheesecake. We really recommend everyone getting the macaroni ball. It&amp;#39;s a must try!<br&gt;<br&gt;The reason for the four stars is that the taco came out flake and a bit unappetizing. It worked out because I ate the rest out with a fork and it was delicious.", "rating": 4, "date": "5/25/2016"}, {"text": "This location is DANGEROUS! With that said, my 1 star rating because of safety, not the food or service! My husband and I patronized this location in November for my birthday. It was extremely loud and dark inside this establishment. Perfect environment for some shenanigans to go down. As we were seated, we saw a group of THUGS! Yes, THUGS! Wearing all red, mostly Chicago bulls gear. If you don&amp;#39;t know what this thuggery means just look it up. They were loud, cussing and causing some kind of scene with the manager. I could not eat my salad fast enough so we could leave. I felt very uncomfortable! My husband is a law enforcement officer so he is always armed. That gave me comfort knowing he is trained to eliminate such threats if the need arises  I was thankful we did not have our child with us. I could not enjoy my birthday dinner because of the atmosphere. I got my cheesecake to go and ate it in our hotel. <br&gt;It&amp;#39;s very sad to see such great restaurants come to such great cities like memphis and these thugs running them in the ground. I would like to see Cheesecake Factory hire off duty police officers as security! I am sure after recent incidents, the security would be welcomed and would help business. I&amp;#39;d hate to see Memphis loose a great place to eat because of unnecessary thuggery! <br&gt;P.S the Godiva cheese cake is amazing! I bet it would have been even better eating it in the restaurant, in peace.", "rating": 1, "date": "1/5/2018"}, {"text": "Service has deteriorated significantly!!!<br&gt;The last two times we have gone the food came out not at once but at different times - we are talking like a 5 min wait between each plate they would bring!  <br&gt;This happened TWICE!!!!   Managers were not very sympathetic at all.<br&gt;Going out to dinner is supposed to be fun and relaxing - right??", "rating": 1, "date": "5/22/2016"}, {"text": "Over priced my service was slow. I might give it a 3 it&amp;#39;s ok for some meals. Bathroom clean just wished my service was better. The only reason I went was to watched my grandson and to relax.", "rating": 3, "date": "9/11/2017"}, {"text": "Sooooo.... It&amp;#39;s rare that Cheesecake Factory Memphis gets it right and tonight was no exception.  The kids quesadilla and Alfredo pasta were both good per my daughters. We ordered the calamari as an appetizer which was heavily breaded and greasy and stuck together. My advice to you is to never order this dish. We&amp;#39;ve tried it twice and got the same result each time. My husband and I both ordered the bone in New York strip cooked medium. The manager came out after several minutes and told us it would be longer than usual because one of the steaks were overcooked but offered to still bring the overcooked steak while we waited on the medium steak. We opted to wait instead. My New York strip finally arrived and it was cooked medium well but NOT medium but quite flavorful. The mash potatoes were lukewarm per usual but the green beans were great. Then about 15 minutes later my husband&amp;#39;s steak came out and it was a ribeye instead of the New York strip  that we ordered but he didn&amp;#39;t complain. He said it was flavorful but his mashed potatoes were lukewarm as well but the green beans were good. We also ordered Long Island ice teas which were perfection! We would definitely get those again. Lastly, we ordered our cheesecakes to go, one vanilla bean and one banana. The vanilla bean is excellent and it&amp;#39;s my go to Cheesecake because I don&amp;#39;t like very rich deserts and this Cheesecake has a nice balance. The same goes for my husband&amp;#39;s banana cheesecake, it was great! Same thing, very good and not too rich! Overall food was good, service was ok and we will return. I took off two stars for the service and the calamari.", "rating": 3, "date": "6/16/2017"}, {"text": "Had a gift card that I needed to use, so I stopped in this evening for dinner. Service was excellent. My servers&amp;#39; name was Hailey (sp?) and she was excellent! She knew I was having dinner by myself, so she gave me space but was very attentive. My drink glass was never empty, which was a first for me at this restaurant. I started with the spinach and cheese dip and my main course was the Ribeye steak. The appetizer was good, a little on the room temperature side instead of hot like I would have preferred, but the flavor was delightful. My Ribeye I ordered Rare and it was cooked perfectly, very juicy and tender. Will definitely be back to see this server again!", "rating": 5, "date": "8/14/2017"}, {"text": "One afternoon I brought my mother here to try something new. The service was passive and curt and the food lacked any flavor whatsoever. I myself got the herb crusted salmon and shrimp scampi combination. Not only did it lack flavor but I also didn&amp;#39;t receive any of the pasta that went with the scampi. My mother had gotten sauce that obviously went bad as well. Not to mention a milkshake that had to be reordered twice and didn&amp;#39;t arrive until the end of the meal. Definitely not coming here again. Way too overpriced for poor service, and product.", "rating": 2, "date": "3/14/2018"}, {"text": "I was on a Girls trip when we all decided to end our trip at The Cheesecake Factory. The beginning of our late lunch started out fine besides not receiving the bread which is usually provided. The appetizers were extremely good but everyone at the table started to receive their food. Even though, I was the first to order I didn&amp;#39;t receive my food after waiting for 1 hour. I asked to directed to the first manager ,&amp;#34; She stated there&amp;#39;s nothing she could do but rush the kitchen&amp;#34;. At the point, I couldn&amp;#39;t eat my order finally came out and my friends had completely finished . So, I asked politely for my ticket and the waiter gave all individuals their tickets. A sprite had been added but I changed to a water with lime because it was watered down. The server then snatched the ticket out of my hand. At first, I was over the entire and so the others suggested that spoke with another manager which I did and he handled the issue. I have never had an experience such as this. Note: the pasta was not good at all.", "rating": 1, "date": "7/24/2018"}, {"text": "I visited the restaurant for the second time on July 20th with 2 friends and the customer service was horrible. I placed an order for chicken pot stickers and a libation only to be informed 20 minutes later that the kitchen was out of the item. Our waiter was excellent he tried to do everything in his power to help but as I looked around the surrounding tables other pardons were having issues with their meals. The second problems was a woman came by our table without introducing herself and informed a 2 member of our 3 party table that the kitchen was out of the lemon herb chicken. I asked if she was the manager and she said yes and informed her that this was the second item our table ordered and the kitchen doesn&amp;#39;t have the item. The manager was not accommodating at all and it&amp;#39;s apparent that she could less if we returned. We asked for our checks which took an additional 20 minutes. When we exited the hostesses didn&amp;#39;t thank us for coming because they were occupied holding a personal conversation. I will never attend this location again.", "rating": 1, "date": "7/23/2018"}, {"text": "I went here with my 14 year old for dinner, when we ordered and during the entire time we were there we were the servers only table. It took 15 minutes before he finally came to take our order. I ordered fried mac and cheese and an appetizer, chicken carbonara, and he got a cheeseburger with fries. The appetizer was good but the chicken carbonara which was almost 30 bucks was watery and tasteless and cold. Portion size was tiny. His cheeseburger and fries were both cold. I sent it back and the manager came over and asked if i wanted something different. I said yes she gave me a menu but the server didn&amp;#39;t come back for another 20 minutes I said forget it. I paid and left was pretty upset that I paid 46 bucks for a cold burger and OK appetizer. I called the restaurant to complain and the manager was super nice and helpful said he would give me a refund and took my credit card number but it never came. I called back and they had no idea who or what I was talking about. I disputed the charge with my bank and they contested it so I&amp;#39;m out the money even though they promised me a refund. Will never be back and will make sure I tell everyone how terrible they were.", "rating": 1, "date": "7/14/2018"}, {"text": "This place is a joke. Went in to order a slice of cheesecake to go. There was only one couple in front of me at the time. There was one person at the register who was ring up customers and taking call in orders and there was just one person preparing the cheesecakes for the din in customers and the to go orders. After I ordered, the line became  longer. There were about 5 other employees in that area just laughing and talking and pretty much in the way of customers trying to order. None of them went to help yet they were there behind the counter. After about 5 minutes, I noticed that there were about 5 slices of cheesecake lined up on the counter waiting to be bagged. I asked about them and was told that the cashier needed to bag them. I replied, how, when she is taking orders, taking money, and answering the phone. Why couldn&amp;#39;t they help out instead of just standing there wasting space. Finally after showing my agitation, a manager shiwed up to help and one other employee. It&amp;#39;s a shame that I had to step in before anyone came to help those two young ladies. Such poor management, customer service, and courtesy to their fellow coworker. This isn&amp;#39;t my first time experiencing bad customer at this place. Will definitely not give them anymore of my money. Good customer sevice makes for a good dining experience. This is not the case here ever for me.", "rating": 1, "date": "4/15/2018"}, {"text": "Great menu! The execution suffers as this restaurant is in Memphis. Service is never predictable or reliable. Be sure to wear Kevlar as this restaurant is located in Hoodchase Mall.", "rating": 2, "date": "12/29/2016"}, {"text": "Horrible service. I&amp;#39;ve eaten at Cheesecake Factories all over the country and this restaurant is the worse. My wife and I love the food here and visit the one in Nashville every time we go but we will never be back to this one. When you go these restaurants, you do so with the knowledge that the food is a little higher but the quality and service makes up for it. Not here. Save the money and hit the food court.", "rating": 1, "date": "3/31/2017"}, {"text": "I finally had a chance to stop by since its opening. It was a weekday lunch. No lines. No wait. The only other cheesecake factory Ive been to was in San Diego, CA about 10 years ago. To have one in Memphis was just perfect.  Everything I had at my first visit was just perfect. I went at lunch and had regular size meals. I was caught off guard by the large portion sizes but I wasnt complaining. I finished the rest the next day and will order smaller portions my next visit. The atmosphere was great and of course customer service was great as well. No complaints here. I plan to return again.", "rating": 5, "date": "3/11/2017"}, {"text": "Loved it. The service was great food was good. And the drinks ... perfect!!! They only down side was the silver wear was sitting on the table with no napkins under it", "rating": 4, "date": "3/27/2017"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory a couple of times now and I have always had a great time eating here. Food is good and the Cheesecake is AWESOME! Will be coming back for sure!", "rating": 4, "date": "1/31/2017"}, {"text": "My husband &amp;amp; I waited 15-20 minutes for a waitress to come &amp;amp; the food takes forever to come. They have bad service here &amp;amp; this has happened twice............ oh 2 stars cause the food is good.", "rating": 2, "date": "3/7/2017"}, {"text": "Came for happy hour, food was amazing and only $5.95 per entree, drinks were also $5.95! Rudy and Michael were excellent bartenders! Great atmosphere for girls night or first date....", "rating": 5, "date": "4/20/2017"}, {"text": "The two stars are for how fast we were seated and the great service that we received during our meal even though the food wasn&amp;#39;t cooked to The Cheesecake Factory&amp;#39;s standards. First of all our server was very pleasant and I hate I can&amp;#39;t remember her name but she was great. The atmosphere is really nice and the menu is amazing. It&amp;#39;s like reading a book before you order. I would think with all of this preparation that they would deliver better food and hire better managers that can make the situation just a little bit better ever. The wings we ordered were not done,(bloody)the steak was cooked medium instead of medium well, potatoes were cold and the manager didn&amp;#39;t didn&amp;#39;t do anything but help me decide that I will never eat  at The Cheese Cake Factory. Mistakes happens in a restaurant but to have one course cooked improperly and then the second course even worse is not acceptable. The manager only made it worse by not apologizing and not trying to fix the problem. We still tipped the server 35 percent because it wasn&amp;#39;t her fault and she assured us that she told the manager to make sure our entrees were cooked perfectly, not like the raw chicken that were served as appetizer. This is a nice elegant restaurant that should hire better cooks and definitely better managers. I just hope that I don&amp;#39;t get sick. p.s. he did take the wings off and he should have.", "rating": 2, "date": "5/29/2018"}, {"text": "Service took forever. Had to send back my daughters order and still couldn&amp;#39;t manage to bring it without tomatoes. Won&amp;#39;t be going back soon. But my daughter did like the cheesecake", "rating": 2, "date": "3/20/2016"}, {"text": "This is the worst Cheesecake Factory that I have ever been to.  I have been to the Cheesecake Factory in Atlanta, Chicago, and Las Vegas and the Cheesecake Factory in Memphis, TN is the worst.  I purchased the fish and chips (average $12-$13).  I received three small pieces of fish that were slightly bigger than a McDonald chicken nugget, I did not receive the coleslaw that comes with it, the french fries were overcooked, dry, and cold, the salad was full of wilted lettuce.  I should have went to Captain D&amp;#39;s I would have received better food and more food for my money.", "rating": 1, "date": "6/27/2018"}, {"text": "So after reading a few of the reviews on here I felt like i needed to chime in about my experience here. Because either I live in a parallel universe and have been to a completely different restaurant than everyone else or there are a few people on here that are just naturally unhappy people. But going through their reviews it seems like all they do is complain. (I wonder if they ever thought the problem might be with them, constantly getting shitty service everywhere you go? Maybe you should be less of snobby bitch and servers will be nice to you.)<br&gt;<br&gt;I have been here approximately a dozen times since its opening. Including training night. Each time I go the hostess staff always makes good conversation with me and most of them remember me from the previous time. Wait times are never unreasonable unless you go during the lunch or dinner rush but that&amp;#39;s to be expected. (Unless you&amp;#39;re the type of person that complains about traffic during rush hour, but common sense can&amp;#39;t be taught so there&amp;#39;s not much anyone can do to help you, yet alone any managers) <br&gt;<br&gt;I have both sat at the bar for service and gotten tables. There have been times when service was less then spectacular. But these times usually coincide with dining during the busiest times and most of the mistakes were done by the kitchen not my server. When I brought it up to the server she apologized and had my meal remade and expedited. She even went as far as having a manager comp it off my tab. (The things that happen when you&amp;#39;re a polite human being and recognize that mistakes happen and you don&amp;#39;t have to be a flying douche every time something goes wrong). Even when service was lacking, I once politely informed out server that she had forgotten a condiment request, when she apologized I told her I recognized she&amp;#39;s covering a very large section of the restaurant and that I understand how it could have slipped her mind and to hang in there. You&amp;#39;ll never guess what happened! She brought us a free slice of cheese cake for being understanding. (Again, don&amp;#39;t act like a douche canoe and treat people like humans and they&amp;#39;ll take care of you) <br&gt;<br&gt;As far as the bar goes, only once have I gone to the bar where the bartender recognized me, although they do seem to have a large rotating bar staff so that&amp;#39;s understandable. When the bartenders are busy tending the bar and other customers (you know their job?) all it took was for me to open my mouth (that collection of muscles in front of your teeth and contains your tongue) and ask for a drink and service. Low and behold! They came over to help me! I didn&amp;#39;t have to sit 10 mins in passive aggressive silence waiting for them to notice me while attending to 20 other people. <br&gt;<br&gt;As far as the food goes, portions are large unless you&amp;#39;re super fat or have a diet of 6000 calories a day be prepared to have left overs or share a meal. Prices are high, it&amp;#39;s a fine dining restaurant, that&amp;#39;s to be expected. You don&amp;#39;t go into dillard&amp;#39;s and expect to pay Walmart prices do you? (If you do, refer to my being a douche references and try to refrain from showing yourself in public, the world is a better place when you sit at home wallowing in your own hate, unless you plan on walking in front of a bus, in that case please continue on with your plans) <br&gt;<br&gt;Summary. Don&amp;#39;t be a pain in the ass and you get surprisingly good service. Food is great staff is wonderful. Prices are on the higher side, but you get what you pay for.", "rating": 5, "date": "12/2/2015"}, {"text": "This was my first time eating here. I read some bad reviews on Google but.... I have to say OMG I&amp;#39;m coming back! I was nervous at first but now that I had it myself I&amp;#39;m very happy that we came. The bartender Michael S is really nice I had the espresso martini it was to strong for me but still really good, my husband had the strawberry creamsicle OMG that was amazing! For food my husband and I shared the bacon-bacon cheeseburger I wish I had one for myself because it was way to good to share.", "rating": 5, "date": "4/30/2018"}, {"text": "First Time trying The Cheesecake Factory and I am a big fan! I went at lunch time on a Monday and there was no wait time. I ordered the Louisiana Chicken Pasta and it was the bomb! I got the lunch portion and still had some leftover for dinner. My daughter had the kid&amp;#39;s pizza and she enjoyed it. I got the classic cheesecake and was not disappointed. I also had to take half of the cheesecake to go. The entire meal was delicious. The only reason I am giving it 4 stars is because it is pricey. Even the lunch menu was pretty high, but I know that will not stop me from coming back and trying some more items on the menu.", "rating": 4, "date": "2/24/2016"}, {"text": "Service was great.  Our waiter checked in on us every few mins almost to the point of being needy.  He was great.   The food tasted good but the portions were pitifully.  Wife ordered steak and shrimp, she got 3 shrimp and 4 steak madalions.", "rating": 3, "date": "2/6/2016"}, {"text": "Ok , after a 1.5 hour wait, we had the crab cakes, they were very good. I had the mushroom burger, it was cooked to my liking med. it was very good. My wife had the chicken terriyaki, she said it was good. The waitress needed some training skills, but the place was super busy, so I give her some slack. Overall it was okay, not so much to get excited about. It was noisy and very crowded. After the newness wears done, I will go back and try another dish. And we did take home two pieces of chocolate cheesecake.", "rating": 3, "date": "10/3/2015"}, {"text": "Great reviews so far. Our server, Kaylie, was wonderful. She checked in on is, took our order in plenty of time, and always took care of us. Our food arrived in a timely manner, and was hot and tasted great. <br&gt;I&amp;#39;m not sure of the negative reviews except for maybe because it was new and everyone wasn&amp;#39;t trained? <br&gt;We were in and out in under an hour on a Sunday afternoon. Granted, it was about 4:45. <br&gt;I ordered the meatloaf and it was wonderful. My husband ordered the chicken Marsala and thought the sauce was a tad sweet but still good. <br&gt;We will certainly be back.", "rating": 5, "date": "10/25/2015"}, {"text": "FYI, I sent a version of this to Cheesecake customer service on their website on October 15, 2015 and never received any communication from the company. They do not value their customers...<br&gt;<br&gt;My wife was given a $25 gift card for Cheesecake Factory by a co-worker. We had never been to the restaurant and were excited to check it out. We went there on Tuesday, October 13th but the manager was outside and told us that the refrigerator was broken and that their menu was limited to cheesecake, pizza, and salad. We looked at the big menu displayed outside and we decided to try the next day.<br&gt;The next day we came back. It was very busy, unlike the day before, so we knew the refrigerator must have been working. We waited about 10 minutes and were seated. My wife ordered the spicy chicken sandwich &amp;amp; fries and I ordered the dinner version of Evelyn pasta. The food was brought out minus the french fries. The person said the fries would be out soon. Our waitress walked by and made sure we were getting our fries. Our waitress then came back later and said they&amp;#39;d be out shortly because they just started frying some. She came back again and said that it&amp;#39;s taking longer because one of their fryers &amp;#34;exploded.&amp;#34; By that time, we were both finished eating. The fries were finally brought out at the same time as the check and to-go boxes. We then ate the fries, in lieu of dessert, since fries are not good as leftovers re-heated. We were never offered an alternative to the fries, nor any compensation to make up for the inconvenience that ruined my wife&amp;#39;s meal. My wife insisted on speaking to a manager, but I said let&amp;#39;s just wait and email the company. As we were leaving, she insisted again, so she asked the hostess, behind the center table, if she could speak with a manager. The hostess said, &amp;#34;Ok,&amp;#34; and went on about her job. My wife waited approximately 5 minutes and we left without speaking to anyone. Within that 5 minutes, the hostess never followed up or said that the manager was on the way.<br&gt;The whole experience was highly disappointing, especially when you&amp;#39;re spending over $36 (20% tip included) for lunch.", "rating": 1, "date": "11/6/2015"}, {"text": "Food was good, the service was not good at all.  We decided to go on a Thursday night at 1930-hrs.  We expected a wait to be seated so that was not bad.  Took them one-hour to get us to a table.  Once we where buzzed, they sent us to another location to wait to be seated.  So two different waits to be seated.  Once seated, it took our waitress (Rachael C) 15-min to come to out table.  We ordered two waters and the Avocado Eggrolls to start.  10-mins later, the waters showed up.  Then our appetizers of the eggrolls which were the sampler rolls not the Avocado Rolls, which is bad because my fiance is a vegetarian and 50% of the sampler is meat related.  Waitress said she was sorry and that was it on that, no &amp;#34;can I put the right order in&amp;#34; or &amp;#34;can I offer you something else&amp;#34;.  Ordered the main meals..our waters were empty, waitress stated she will get us more and she never came back.  Server came with the meals and she was the one that got our waters.  We were always out of our beverage and it was not until we were complete with our meals and sitting looking around, our waitress came back and asked if we needed anything else.  With the horrible service, I stated check only.  We skipped the cheesecake because we did not want to wait another 30-mins to get our dessert.  We did not walk out until 2300-hrs.<br&gt;<br&gt;To sum it up:<br&gt;1-hr wait to be seated<br&gt;3-hrs to get one appetizer, main meal and waters (with only one refill)<br&gt;<br&gt;I gave it a two because of the food being good but if I could place a star ranking for service it would of been in the negative side.", "rating": 2, "date": "9/15/2015"}, {"text": "I had the worse experience at this fairly new location. Well, the hostess was extremely nice!!!<br&gt;But my waitress.... UGH, DOUBLE UGH!!<br&gt;<br&gt;My waitress name was Jenny and she was horrible.<br&gt;Let&amp;#39;s begin with the drink order.. I regret to inform you that we waited 20 minutes on straws, only for me to get up and locate another waiter for straws.<br&gt;She forgot to put in our appetizer, which came out a few minutes (3-5) shortly before our entree. <br&gt;She NEVER checked on us for refills- or for ANYTHING for that matter.<br&gt;I actually had to request more water on two different occasions; not to mention, she had a reaction as if I was bothering her.. REALLY?!?<br&gt;Unfortunately, my salmon was not well done, as I requested. I actually had to find another waiter to locate her to send it back... This was after 15 minutes. After sending it back, she managed to check on two more tables with my salmon in her HAND.... (Are you serious)<br&gt;Needless to say, that I will NOT going back to wolfchase, I&amp;#39;d much rather be going back to Nashville for my next cheese cake factory.<br&gt;<br&gt;Please please please before sitting, request that you are NOT seated in Jenny&amp;#39;s section.", "rating": 1, "date": "10/12/2015"}, {"text": "I have eaten here twice and this by far is the worst Cheesecake Factory I have eaten at. The service is slow and does not pay attention.", "rating": 2, "date": "1/7/2016"}, {"text": "I was passing through Memphis while on a business trip and decided to dine with Cheesecake Factory for the first time. Against my better judgement, I ignored the reviews about this particular location. I consider myself to be a foodie, and dine out often. This was the worst experience I have ever had in a restaurant. <br&gt;<br&gt;Strike 1 - While being seated, I saw an empty booth and asked if I could have that table, the host told me no. I understand the &amp;#34;rotation&amp;#34; policy with seating servers, but a guest should never be told no on a request that is reasonable. <br&gt;<br&gt;Strike 2 - We weren&amp;#39;t greeted by a server for 10 minutes. It took even longer to get drinks out. Or server also did not make a single suggestion or operate by any Step of Service. Being a corporate restaurant, I imagine servers are trained on what a step of service is. What I did see, was servers standing around not working. All congregating around the POS systems and chatting, not waiting in line to ring things in. I saw a staff that did not practice teamwork, or Full Hands In/Full Hands Out. Our server was clearly busy and dealing with more than she could handle. She was triple sat, which is an unacceptable practice and your hosts are setting up your servers for failure. Not once did I see a manager floating around or doing table visits so I could express my concerns. After placing the entree order and waiting 45 minutes, and the appetizer still had NOT arrived, we decided to leave. <br&gt;<br&gt;In conclusion, my experience was terrible and I will never return and encourage others to do the same. Just because your company name is a chain restaurant, does not mean you have to operate like one. As we left my partner made the comment, &amp;#34;this restaurant is dead, it can&amp;#39;t even be repaired.&amp;#34; We weren&amp;#39;t expecting &amp;#34;fine dining,&amp;#34; but we did expect to be treated as guests, not customers. A 45 minute appetizer is unacceptable, a 10 minute wait for a greet is unacceptable. A manager should have approached us to apologize for dropping the ball. Our server didn&amp;#39;t even apologize. Even McDonalds apologizes if you have to wait longer than expected.", "rating": 1, "date": "10/7/2015"}, {"text": "Just horrible service and a wait for no reason.  The food isn&amp;#39;t even worth it. I&amp;#39;ve been waiting for  25 minutes to place my order. This place is horrible. Bad location for Cheesecake Factory. Should have put it in Collierville.", "rating": 1, "date": "3/17/2017"}, {"text": "Very subpar food at this location. I mean for it to be a chain, it&amp;#39;s amazing how much different the taste was here as opposed to Nashville and Atlanta. Service was pretty good but the food quality did not seem the same.", "rating": 2, "date": "2/15/2016"}, {"text": "Definitely exceeded my expectations! I have had Cheesecake Factory in other cities and was very excited to hear we (Memphis) was getting our very own! My coworker has her own blog and was invited to do a tasting. Luckily, she invited me as well! The staff was amazing...very friendly. Mikki was our server and she did a marvelous job at explaining the menu, and making suggestions. It was extremely crowded but you would&amp;#39;ve never known due to the fast service!! For the appetizer, we ordered the Vietnamese egg rolls..excellent choice to get the meal started. I had the chicken enchiladas for my entree and it was very tasty! My choice for beverage was the Georgia Peach...it tastes just like a peach! It&amp;#39;s an alcohol beverage...not for the kiddies! Dessert!!!! Awww...the best thing ever... We got a chance to try their new flavor...salted carmel cheesecake...to die for!!! If you want outstanding service and good food this is the place to try!", "rating": 5, "date": "8/29/2015"}, {"text": "Service was decent and the food was alright. I have been to better locations in other parts of the country. There wasn&amp;#39;t anything to complain about but wasn&amp;#39;t anything impressive enough to write about either.", "rating": 3, "date": "2/23/2016"}, {"text": "Wait staff was very friendly. Seating and wait times are always an issue. We went on a rainy Tuesday night and it was still a long wait. The food and atmosphere are amazing. There menu was like 100 pages long so I am sure there is something for everyone.", "rating": 5, "date": "2/20/2016"}, {"text": "Went here for my uncle&amp;#39;s birthday during Sunday brunch.  The place was busy and we had a short wait to get a table but the staff were all friendly and accommodating.  Our server was great and the food was better than I was expecting.  I would definitely come back.", "rating": 5, "date": "10/18/2015"}, {"text": "Food was great, but the service could be better. We had to wait numerous times for our bartender to even check on us. The bar back was better than the actual server.", "rating": 3, "date": "9/19/2015"}, {"text": "I&amp;#39;m pleasantly surprised they got the kinks out!  Friendly hostesses, no wait, very efficient and friendly server named Beth, and the food prepared exactly as it should be matching all other Cheesecake Factory locations.  Way to go Memphis!  We started with the calamari, it was hot and tasty but perhaps too salty.  Then I had the chicken club sandwich with a side salad and hubby had the Luau salad.  Our favs came just as we liked em.  Finished with a red velvet cheesecake to go and we had a nice meal out on a Tuesday!  Beth did not rush us but checked on us frequently and was quick to get the check back when our daughter was anxious to leave.  I can&amp;#39;t wait to come back with the girls for cheesecake and coffee!", "rating": 4, "date": "10/27/2015"}, {"text": "The service and the cheesecake was nice. The food was nasty. I had the meatloaf and literally could only take two bites. Management was nice and allowed me to switch out for the pasta but the noodles were under done. The location is very busy. Overall I&amp;#39;d only come for drinks and cheesecake.", "rating": 3, "date": "1/18/2016"}, {"text": "Great great great place to eat. I only gave 4 stars instead of 5 due to the sheer amount of items on the menu. They have anything and everything you can think of...Chinese, Italian, American, Cajun, everything lol. But everything tastes amazing. The meatloaf was delicious as was the Jamaican shrimp. But the center of it all is of course the cheesecake. They have so many varieties and every single one of them is so good. They have a convenient counter just to order the cheesecake so you don&amp;#39;t have to wait at a table just for desert.", "rating": 4, "date": "12/2/2015"}, {"text": "So I decided to visit the Cheesecake Factory for a family members birthday. My experience was terrible from beginning to end. We arrived around 6 to be seated at a table for 7. We were told that the wait would be 60 mins, but over 2 hours later we still were not seated. The hostess decided to argue with me about the fact that she said my table was ready WHEN IT WAS NOT! Then she told me that she was talking to someone next to me?!?!?! Literally NOBODY was next to me. Our server was sweet and had a positive attitude however she was stretched thin. Take my advice and head to Nashville if you want service with a smile.", "rating": 1, "date": "9/15/2015"}, {"text": "im giving a one star because it took almost two hours for us to be seated while constantly being told that it would be 5 more minutes because they were cleaning the table.. well when we finally got seated it was like they wiped everything on the table on to the floor underneath. after being seated it took a while to order/get our food and when we did we were disappointed the alfredo was dry and overcooked and the chicken sandwich was soggy like it had been sitting there a while and had to walk to the kitchen and ask for fries since the chicken sandwich didnt come with any like it was supposed to. this was really disappointing because it was only the second time I&amp;#39;ve been to cheesecake factory and we were celebrating me and my boyfriends birthdays.", "rating": 1, "date": "3/3/2019"}, {"text": "Big disappointment. They brought our food on the  heals of our main course. While the Tex-Mex Egg Rolls were tasty, the shepherd&amp;#39;s pie and ban ban shrimp were below CCF standards.", "rating": 2, "date": "4/1/2016"}, {"text": "My husband and I decided to venture out to the Galleria to try the Cheesecake Factory during our recent visit to Memphis. We have never eaten at one before. I know, unbelievable right? We normally avoid chains on vacation and stick to local food. I had the bacon truffle grilled cheese and he had the Riesling chicken (which is what I really wanted, but you have to save room for Cheesecake). His was better than mine, but they were both good. The grilled cheese was messy and a little tough to bite into, but still tasty. After we ate the obligatory meal, it was Cheesecake time! I ordered the celebration Cheesecake and he had the lemon meringue. Both were good but the celebration cake was better. The layer of strawberry mousse was the best part. I couldn&amp;#39;t eat it all because it was huge, so my husband got to eat my leftovers later in our hotel room. I would definitely recommend the celebration Cheesecake for anyone who likes cake, Cheesecake, mousse and cream cheese icing. It doesn&amp;#39;t get much better than that combination! (I could do without the crunchy sprinkles though)", "rating": 4, "date": "9/4/2017"}, {"text": "Too expensive, over $70 for two burgers and two small slices of cheesecake. Service is slow, burgers are good. Oh, and they opened 15 minutes late while people froze in the rain.", "rating": 1, "date": "1/21/2016"}, {"text": "It&amp;#39;s nice but it&amp;#39;s just too busy and too small!  And what&amp;#39;s up with the lady behind serving the Cheesecake individually! I mean she is not happy or something she doesn&amp;#39;t even smile and sounds like she&amp;#39;s not pleased with her assignment,  but she does thank you for coming but her eyes just are hateful to me! Service with a smile is not just a d slogan it should be a mission.", "rating": 2, "date": "1/4/2016"}, {"text": "Table was had sticky caked on ketchup on it, and staff was extremely rude.   Extremely.  And that was the manager. Horrible. Will never return. Oh... And would not refill tea.", "rating": 1, "date": "9/16/2016"}, {"text": "We went for a Saturday morning breakfast--they only have brunch on Sunday but there were plenty of omelets and other appropriate options.  I was really impressed with the service and apart from that it was the Cheesecake Factory quality I&amp;#39;ve come to expect and massive portions: the smoothie was even huge!", "rating": 4, "date": "4/9/2016"}, {"text": "The service was not good at all. Asked to speak to a manager about the quality of my food and he never showed. Will not be back.", "rating": 2, "date": "11/15/2015"}, {"text": "I decided to try something different and ordered the Shepherd&amp;#39;s Pie. It tasted great. Of course, I had cheesecake. Stayed more traditional and had strawberry cheesecake. It was delicious. Going back soon to try the seasonal peppermint bark cheesecake. Service was good. We were seated rather quickly but had to wait approx 20-35 minutes to get out food.", "rating": 5, "date": "11/30/2015"}, {"text": "Not so good food.  Ordered evelyn pasta and the cook doesn&amp;#39;t know the ingredients. She had go back and rebook it and bring it. Not good", "rating": 2, "date": "11/27/2015"}, {"text": "DON&amp;#39;T ASK QUESTIONS. Take your little beeper thing and sit down or the hostesses will embarras you in front of everyone.  Don&amp;#39;t complain on them either.  Good is average at best but be prepared to wait an hour and half to find out regardless what they tell you at the front desk.  Make sure you ask for ice in your beverage too. We have been 6 times but it&amp;#39;s always an ordeal so we have since retired from there this evening.  $15 for a sandwich and specialties run a little higher.  Cheesecake is high but it&amp;#39;s pretty good. Wouldn&amp;#39;t want to fight the staff though.  It will be you and like 29 others upset with the wait and ect so at least you won&amp;#39;t be alone.", "rating": 1, "date": "12/12/2015"}, {"text": "Ive been to several cheesecake factories around the country and this has been by far the worst. Granted, I know its new and trying to get up and running but man.<br&gt;<br&gt;I went on a Saturday night so I expected it to be crazy. We got there at 8:00. Was told the wait would be 80 minutes which was fine. We went into the mall and shopped and went back. We waited about 20 minutes before our buzzer went off.<br&gt;<br&gt;They send you to another location to wait where theres complete chaos and you aren&amp;#39;t sure who your supposed to be looking for or whos seating you. It was a very confusing set up. Someone started yelling our name and 8 feet away was the person seating us.<br&gt;<br&gt;We were seated and immediately greeted. Server took water orders and took several minutes to return. She came with no bread and stated that the kitchen as backed up. About 15 minutes later she finally came with bread. We went ahead and ordered our food.<br&gt;<br&gt;She came by several times and would peek into booth but not close enough where I could tell her we need more bread and water. We had our empty bread basket sitting close to the edge trying to give her a hint to ask for more bread. The next thing I know a completely different server walked by and grabbed the bread basket as he walked by so fast that I couldn&amp;#39;t ask for more.<br&gt;<br&gt;This was ridiculous. We were thirsty, breadless, and our waitress was no where to be found.<br&gt;<br&gt;Our food finally came. Mine was pipping hot. I got the Cajun pasta. My buddy got the salmon and mashed potatoes with asparagus which came out COLD and seasonless. It tasted horrible.<br&gt;<br&gt;Our waitress never came back and I had an empty glass forever it seemed like.<br&gt;<br&gt;She finally refilled and we ordered cheesecake. It took 20 minutes for a slice of cheesecake to go to come out.<br&gt;<br&gt;Okay food but ridiculous service.", "rating": 2, "date": "9/23/2015"}, {"text": "I visited and the food and service was good. I went on a Thursday at lunchtime. Not too long a wait and the waitress was good. The food was good but it not the Cheesecake ambience I&amp;#39;m used to in larger cities like ATL and St. Louis. Overall, it was okay.", "rating": 3, "date": "5/27/2016"}, {"text": "Have Dessert Only. Our server gave our table to another server after taking our drink order. But she was great. The portions are great but the food was bland and prepared slowly. Probably won&amp;#39;t visit on a Saturday night ever again.", "rating": 1, "date": "5/8/2016"}, {"text": "We attended with a very large party and our server was very attentive at all times. Very large gluten free menu that was absolutely delicious. Look forward to returning to try new items soon.", "rating": 5, "date": "9/25/2015"}, {"text": "Aside from the wait and it being a chain restaurant, we had a very good experience. Little on the pricey side but the food was defiantly worth the money. And had one of the best peach Bellini&amp;#39;s I have ever had. I defiantly recommend the Godiva cheesecake for dessert. It is amazing!", "rating": 4, "date": "6/21/2016"}, {"text": "Amazing drinks, amazing food, and amazing service! Wait time was a less than 15 minutes and hostess was amazingly pleasant . What more can I say!", "rating": 5, "date": "7/11/2016"}, {"text": "My only complaint - too much to choose from! <br&gt;We waited forever - because our pager was broken.<br&gt;But the staff was great. The food was delicious. <br&gt;The price okay.  ;)", "rating": 5, "date": "11/21/2016"}, {"text": "The food was really well made but the service was absolutely terrible. It took over an hour for them to seat us. Our poor waitress was completely overwhelmed with all of her tables, it took her at least 15 minutes to bring us our drinks. We recorded our burgers about twenty minutes before we ever had our fries brought to us. When we talked to the manager, he didn&amp;#39;t seem to care and stated he was leaving for Texas soon. Overall, the food is not worth such a terrible experience.", "rating": 2, "date": "11/6/2015"}, {"text": "Worst service ever!  30 min wait for drinks, apps. 1 additional hour wait for food which was cold.  Manager unimpressive with explanation. Been to many of these out of town. Good experiences there. Please hire new management staff for this location.", "rating": 1, "date": "9/28/2015"}, {"text": "I went with My boyfriend on a Friday night at 6:30pm. We waited and didn&amp;#39;t get seated until 7:20pm (which was fine being that it&amp;#39;s brand new and all.)  They took our order and we waited an hour for our food to arrive. The service was horrible. No one came out to tell us why it took so long to bring us our food, until 5 minutes before Mine was ready. It was just a big waste of time. We didn&amp;#39;t leave until 9:00pm. If they had better service , then the money spent would be worth it. Also I got extremly sick after I got home. Save your money. So not worth it.", "rating": 2, "date": "10/2/2015"}, {"text": "On a Wednesday got right in with no wait. Service was excellent. Food was good except my wife&amp;#39;s pasta was underdone. The cheesecake was as good as you would expect. We&amp;#39;ll go there again next time we are in the area.", "rating": 4, "date": "8/9/2017"}, {"text": "Lettuce wraps are out of the world.   Other food is good.  Service needs a great deal of work.  My meal was ice cold, asked to have it reheated.  Waited 30 minutes.  Ridiculous.", "rating": 3, "date": "10/16/2015"}, {"text": "New to memphis, the cheesecake factory is delightful place for dates or small gatherings. Food is great and so is the service.", "rating": 5, "date": "9/2/2015"}, {"text": "Did not want to write a bad review but food from yesterday i am totally disappointed. Uncooked food.", "rating": 1, "date": "4/24/2016"}, {"text": "Ordered a ribeye and my girlfriend ordered a burger. The bread we got waiting for the meal was stale (have dined at other locations we know what to expect and had standards set). The ribeye was too thin without enough fat to really be a true ribeye, which was disappointing for the price. My girlfriend said the burger was just a burger, nothing special (I could have gotten her a nothing special burger for at least $5 cheaper from anywhere else but she wanted to go here). I asked the waitress for a second beer and never got it. We both ordered some version of a chocolate cake (Linda&amp;#39;s fudge and the black out) to go and that was truly the only enjoyable experience about the meal.", "rating": 2, "date": "4/16/2016"}, {"text": "I&amp;#39;ve been to the new one they opened about six months ago in memphis, tn four times. Three out of the four visits went perfect with great service and excellent food. <br&gt;The fourth visit didn&amp;#39;t go so well, I tried the orange chicken and had to send it back. The chicken was fried perfectly crisp but that was about the only thing they got right. The only thing I could taste was oil until I dug for the orange sauce, which was almost none existant. Under the chicken the carrots tasted like charr. All around it was a bad dish. I wasn&amp;#39;t going to try that dish again so I got the Chipotle chicken and  noodles instead and it was ok. Not all together the best visit.<br&gt;Despite the one poor experience I will be back and would still recommend it to others. The cheesecake is always work the guilt.<br&gt;Prices are a little higher but the portion sizes are huge, plan on getting two meals out of any dinner. If you don&amp;#39;t want left overs go with some who has similar taste and share. But not the cheesecake, you never share that.", "rating": 4, "date": "4/3/2016"}, {"text": "I love the cheesecake factory just not this location. The food is just not cooked well compared to others i have tried up north. The service is questionable and i feel like the prices could be spared based on the fact this is just not a very good representation of the cheesecake factory", "rating": 2, "date": "10/7/2017"}, {"text": "Surprisingly the Cuban sandwiches was one the better ones I&amp;#39;ve had. We had great service from our server David and we&amp;#39;ll be back.", "rating": 4, "date": "5/7/2016"}, {"text": "Our service was amazing! Wendy was sweet, knowledgeable of the menu and so attentive! The food was delicious, bar drinks were stellar! Great place and visit! Will definitely be back again!", "rating": 5, "date": "4/7/2016"}, {"text": "So, I gave them another chance. We have been back several times and the service has been great each time. The factory hamburger and fries is so good. I also had a salad with grilled chicken and avocado.  Absolutely delicious. So glad we have this restaurant in the mall.", "rating": 5, "date": "3/5/2016"}, {"text": "I got the Cheesecake Factory to go and it was ready super fast for a crowded Saturday night. The food however was pretty sloppy and average. I got the bistro shrimp something I always get and was very disappointed pasta had no flavor and hardly no sauce, then I only had 5 shrimp Wtf!!!", "rating": 2, "date": "3/12/2017"}, {"text": "Great server! Poor customer service. When a server turns in an order for a dessert they should be advised quickly if the dessert is not available! Don&amp;#39;t make a customer wait 15 to 20 minutes just to find out that they can&amp;#39;t get their order and then serve the other person with them. This is the second time it&amp;#39;s happened here and not sure there will be a third chance. Only came for coffee and dessert", "rating": 1, "date": "6/20/2017"}, {"text": "We waited twenty minutes to sit down, seated and waited 5 minutes before the server came by. Then waited another five minutes for drinks.  The poor timing was never an issue because our server was so polite and kind.  Waited for our food, which didn&amp;#39;t take too terribly long, but was delivered by the MOST impolite server.  She was a tall, dark skin female with black hair in a long pony tail.  She delivered our food to the wrong table next to us, turned around and delivered it to us without bothering to speak or smile.  She returned with our kids food and did the same after a 10 and 4 year old said thank you to the arrival of their food.  She completely ruined our experience and we won&amp;#39;t be returning.  It was appalling how rude she was.  As I&amp;#39;m in the restaurant writing this, the exact same girl just brought the table next to us and handed a woman an extremely hot plate, and ignored her completely.  She has no business working in a restaurant.  This is the same table that had a man get up to refill his own drink.  How embarrassing.", "rating": 1, "date": "2/25/2018"}, {"text": "The only reason I gave the one star was because of the slice of cheesecake. The wait after my wife and I was seated was over twenty minutes. After we ordered our food it was another twenty minutes before it arrived. I had the chicken alfredo which was cold and the noodles were hard. My wife was less than thrilled with her steak and salmon, but at least it was edible. Our waitress...let me stop here it gets worse. That was our first and last time eating at the Cheesecake Factory.", "rating": 1, "date": "12/12/2015"}, {"text": "Not the BEST CF I&amp;#39;ve ever been to, but also definitely not anywhere near the worst. Have had some trouble receiving correct orders (the waiter had it right, so I assume some wires got crossed in the kitchen) and another person in my group got a rather low-quality burger once, but other than that it&amp;#39;s been relatively solid. Just expect to wait awhile for food during busy hours (standard procedure for any CF, really). Definitely worth visiting if you&amp;#39;ve yet to experience a CF or are in town with a craving.", "rating": 3, "date": "6/17/2017"}, {"text": "Came up from Arkansas to go to Ikea for my birthday, decided to eat at The Cheesecake Factory, I&amp;#39;ve haven&amp;#39;t been there in years (I visited the one in Baltimore weekly before we moved to the south) so we arrived impressed no wait! Saw there were empty booths but had to sit at a half booth table because the booth wasn&amp;#39;t wiped down. So we sit. Waitress comes right up, drinks, blah, blah... we&amp;#39;re looking around table next to us has been there for 10 minutes nothing.. other table is leaving and their getting better service. We finally get our drinks! We order an appetizer.. 30 minutes later (still watching our waitress hovering over table that has to go boxes) she comes back and asked if we need refills not are y&amp;#39;all ready to order...? Appetizers delivered food still not ordered... (came out wrong/ waitress still serving table that has now paid for their meal) I was like y&amp;#39;all let&amp;#39;s go to McDonald&amp;#39;s where they decided if your getting onions or not! We been on the road for 3 hours... My mom said no I have what I want made up.. 20 minutes after our order the waitress says we&amp;#39;re out of what you want... mom went with something else.. I ordered the steak Diane good steak couldn&amp;#39;t taste the pepper, was missing vegetable, but tons of mash potatoes that were raw...  just blah..", "rating": 2, "date": "4/22/2018"}, {"text": "My best friend wanted to take me out for my birthday. She wanted it to be a special visit to show appreciation for me. Haven eaten at another Cheesecake Factory we decided to give the one in Memphis a try. First our server seem to be inexperienced or new so service was a little slow to start, then he was sat a nine person table right next to us. He took our order, then came back because they were out of one of the entrees we ordered. I ordered a salad with no olives and an entree. About 30 minutes later our entrees were delivered then my salad came after the entrees arrived...with olives (lots of them). Finally we call manager over and told her situation, even told her we were there for my birthday. She asked if we wanted a different server....at this point only thing left was dessert to order ...we said no (giving server every chance). Another server came and checked on us even discussed my birthday (how they were gonna embarrass me). We ordered dessert (cheesecake go figure). Our server brought us the check before our desserts were delivered, ran the credit card still before desserts arrived. Then brought our desserts over and dropped them off. My best friend started to cry...this build up to special night and you drop off our desserts and don&amp;#39;t say (or sing happy birthday) Now the night is ruined and we are both stunned. I am half way through eating my dessert when server asked my name... with a group of servers to sing happy birthday...I was almost done eating....seemed they missed the moment. Missed the whole concept of &amp;#34;Special Night&amp;#34;. The food was good (except salad) but I can find that type a food in plenty of other restaurants. My recommendation is NOT to go here if your celebrating anything that is important to you or your party!", "rating": 2, "date": "12/20/2016"}, {"text": "Every time I come here I say I&amp;#39;ll never come again because of the service.  The food is consistently good and the people are friendly, but the host and wait staff are mediocre at best. Today we arrived before 5 pm to avoid the Friday dinner crowd and were seated by a &amp;#34;new&amp;#34; host who decided to sit us at a table in a section where the dinner server hadn&amp;#39;t arrived yet. Who knows what time the dinner server is supposed to arrive, and frankly, who cares. It&amp;#39;s just the latest poor host and wait staff dining experience for my family and I. A very nice server named Jessica greeted us, took our drink orders and said our actual server would be here soon. Drinks and bread came fairly quickly and then we proceeded to wait for almost 20 minutes before Jessica realized our server wasn&amp;#39;t here yet.  Almost 40 minutes after we were seated (and 15 minutes after Jessica took our order and said she&amp;#39;d take care of us) our actual server shows up and then I hear her asking Jessica about our table.  Too late. I&amp;#39;ve eaten at the Atlanta, Nashville and Orlando locations dozens of times and I can&amp;#39;t think of a single bad experience, but the Memphis location is a totally different story.", "rating": 3, "date": "10/27/2017"}, {"text": "Took our daughter there for brownie and ice cream. the ice cream is melted we asked three different servers for spoons no one brought any and then when we brought it up to our regular waitress who finally showed up 10 min later she said it&amp;#39;s not her fault normally they set the tables no one fixed it so then we left with a cryingthree-year-old who got no ice cream because all the restaurants ice cream had melted. We just went there for dessert God help anyone that goes there for a full meal", "rating": 1, "date": "3/7/2017"}, {"text": "So I finally stopped by the famous Cheesecake Factory. My curiosity was fueled by the Big Bang Theory as the protagonists often eat there.  The menu is crazy!  It&amp;#39;s got practically everything!  If you can&amp;#39;t find something to eat, you&amp;#39;re not hungry!  I had the bacon burger and it did not disappoint.  It was piled high with bacon and was well cooked and seasoned. Everyone in my party enjoyed their food, but the kid&amp;#39;s quesadilla wasn&amp;#39;t anything spectacular.  The service was excellent. Our server came by every few minutes to check on us (granted they weren&amp;#39;t super slammed).  The only real negative point is the price.  It&amp;#39;s pretty expensive.  I don&amp;#39;t think we&amp;#39;ll go back for a casual dinner.  It&amp;#39;s more of a fancy, special place (think anniversary).", "rating": 4, "date": "1/28/2016"}, {"text": "I like cheesecake factories a lot, this one is ok maybe because they are so new the kitchen isn&amp;#39;t consistent yet. Some days it&amp;#39;s better than others. Also service also depends on luck, sometimes you wait forever and other times ur in and out very quickly. I have tried many things on the menu, my favorites are all appetizers. I like the Thai lettuce wrap, calamari is always good too, avocado egg rolls are good and the tuna tatakki salad is good too. I don&amp;#39;t care for many things on their gigantic menu, I don&amp;#39;t like their fish n chips, chicken dishes, Asian dishes, and I don&amp;#39;t care for their burgers or steaks. But again, I have a difficult palette to please. Other people might really love it. I think with such a huge menu it might be hard to keep everything at the same level. I think this is mostly a pasta and appetizer place. Most of their pastas are great. Speaking of cheesecakes, all of them are pretty epic. You would never know they are all frozen cheesecakes shipped from their California facility. So do not freeze any cheese cakes if you buy them cause you&amp;#39;d be freezing them twice. My favorites are the red velvet and Godiva. When I go there I just stick to what I know is and will be good since I&amp;#39;ve tried so many things already.", "rating": 3, "date": "2/22/2016"}, {"text": "Well, we didn&amp;#39;t have any problems with the service. Our server was downright friendly and efficient. Of course, we visited on a slow Tuesday at 5 pm and it was pretty empty...we were seated immediately. In any case, the food was a bit uneven. The special soup of the day, the Mexican Torilla Soup was pretty awful...it was mostly a pile of cold rice, there was hardly any soup, and a scant one strip of tortilla...and it was way too salty. Special indeed. The Fried Calamari was nice, hot, and crispy, but also way too salty. My Chinese Chicken Salad would have been pretty good except the salad included some extremely wilted/decomposed leaves...kind of yucky. My wife had the Chicken Avocado Club which she actually rather enjoyed as I looked on with envy. We weren&amp;#39;t big fans of the Red Velvet Cheesecake...next time, we will stick with one of the traditional cheesecakes.", "rating": 3, "date": "11/1/2015"}, {"text": "So sad, this had the potential of being the best place in this area..food is great, mostly. We went for my birthday. It was a Monday at 7:00. No crowd, no waiting to be seated, however they chose a less than desirable location first, so we asked for a &amp;#34;booth&amp;#34;. Then they tried to put us out in the Mall, we said no thanks, there were plenty of open tables inside. We picked out a small one, (for2, we&amp;#39;re not trying to tie up a bigger table than we need), but the &amp;#34;hostess&amp;#34; decided to argue with us about it! Unbelievable! Obviously it&amp;#39;s the b- team working on Mon! Table was greasy, so we asked that it be cleaned. Our waiter came by but never a &amp;#34;bus person&amp;#34;, after 10 more minutes we cleaned it ourselves with some lemon juice and a napkin! We had to &amp;#34; steal&amp;#34; clean silverware &amp;amp; napkins from another empty table! Waiter was in no hurry to take care of it for us. In fact, other than bringing water he never asked if we needed anything. Once our food was delivered by kitchen staff, waiter did ask if it came out the way we asked. We couldn&amp;#39;t tell by looking at it , so he went to kitchen to find out if ingredients we&amp;#39;d asked to skip, were, in fact, left out...they should have told us that when it was brought out! It took a while for him to return with an extra plate we&amp;#39;d asked for, so we just began eating. By this time we just wanted this meal to be over with! Never an apology for the crappy service, never an explanation ( short staffed, whatever!)<br&gt;I think we&amp;#39;ll just order &amp;#34; to-go&amp;#34; next time. It really isn&amp;#39;t worth the trouble! Maybe they don&amp;#39;t really want to be a &amp;#34;nice, expensive sit-down restaurant&amp;#34;. Obviously, they don&amp;#39;t know HOW TO TRAIN their staff to an appropriate level of competence! The &amp;#34;managers&amp;#34; need to be fired for NOT doing their jobs!", "rating": 1, "date": "3/15/2016"}, {"text": "The Cheesecake factory has a book filled with different types of dishes. They have excellent mixed drinks too. The atmosphere is loud at times, but the service is usually great. The food is delicious. They have so many different types of Cheesecake, and a few cakes. I like Cumberland, and Perimeter locations.", "rating": 4, "date": "2/11/2017"}, {"text": "Very strange visit.  Long wait for food.  There was yelling in the kitchen.  I was underwhelmed.", "rating": 3, "date": "1/12/2016"}, {"text": "First off, if you enter any Cheesecake Factory on a Friday evening around 6pm and there isn&amp;#39;t a wait or a catastrophic event happening, it&amp;#39;s probably a sign you should eat someplace else. This was the second time in a row at the Cheesecake Factory where my family and I were seated without utensils. Waitress was double-seated so I wasn&amp;#39;t worried she wasn&amp;#39;t going to get to us. However, upon bringing the drinks and later our appetizer, we had to then ask for silverware. What&amp;#39;s up with the hostesses right? Anyway, the chicken in my wife&amp;#39;s salad was a little questionable but she got her answer upon her first bite. We had several dishes arrive at our table that wasn&amp;#39;t ours that were sent back to the kitchen. I can only guess they made their way eventually to the correct table. Memphis is always the bastard stepchild to anything great whether it might be a department store or chain restaurant. The Cheesecake Factory is yet another example. Night and day difference between here and Nashville. This is not a restaurant where a server learns to cut their teeth but it feels like this is training ground for Waiters 101. In fact, I don&amp;#39;t think I&amp;#39;ve seen the same employee twice since the Cheesecake Factory opened. Just an overall disappointment considering my family knows what the other locations are like. Food isn&amp;#39;t bad when it&amp;#39;s cooked to the right temperature and the staff is nice and apologetic but you can only apologize so many times. I&amp;#39;ll be giving Sara Lee a call next time I want cheesecake.", "rating": 2, "date": "8/10/2016"}, {"text": "After over an hour wait, they brought the food out and it was cold.  I had to wait for over 15min. for my drinks and they didn&amp;#39;t bring any water out which I requested.  The service was terrible.  I asked the waiter to take my meal back to the kitchen to warm it up and asked how long it would take because I had been there for over an hour and he couldn&amp;#39;t tell anything other than they had been having trouble with kitchen.  A Bad Experience.  I give a one star rating and that being generous.", "rating": 1, "date": "9/15/2015"}, {"text": "Very good food and great service. I went with a friend for dinner, and I was hesitant because I&amp;#39;m on a diet. However they offer a really nice diet menu. I had a turkey burger. My friend had a combo meal. She loved it, but portions are small. (So was mine, but I expected that.) It&amp;#39;s pricey. We skipped dessert but I&amp;#39;m sure it would have been great. I would definitely go back.", "rating": 5, "date": "1/8/2017"}, {"text": "I have been to many Cheesecake Factories across the U.S but I feel something is missing at this Memphis location. The food has been wonderful with the same great tastes! We haven&amp;#39;t had a bad cheesecake as we try a different one each time! I just feel the staff isn&amp;#39;t as caring or professional. For the money being paid for the plates, I expect a bit of an upscale service. I feel like the bread doesn&amp;#39;t come unless we ask for it(several occasions)", "rating": 3, "date": "8/15/2016"}, {"text": "Bad, bad, bad. My daughter and I were out shopping and decided to stop in for a late lunch. They were packed, so we found a seat in the bar area. The waiter took forever just to come and bring us menus and ask for our drink orders. Then it was another long wait for him to bring those back and take our food orders. Once we finally got those out, it was another ridiculous wait when the waiter came to tell me that what I had ordered was no longer available. He asked if I wanted something else. Well, yeah... How about a menu... Another long wait. I asked where my daughter&amp;#39;s burger was, and they said they were holding it until my food order was ready. Really?? Seeing as how it had already been 45 minutes, I told them to bring hers out while I looked over the menu again. They finally brought her burger which was, no joke, frozen in the middle. Ugh. So, back it went, with my new order. Another burger arrived, better cooked, but still tepid in the middle. My steak finally came after she was finished, and no joke, cold in the middle. At this point I was done. I asked for a box, because, hell, I can cook it better at home than this place. The manager came over and apologized, which I appreciated. He even comped the meal (which he totally should have after the horrendous experience we had), so I tipped the waiter and left. Will not be back.", "rating": 1, "date": "3/20/2016"}, {"text": "Ordered 3 slices of cheesecake to go. Shouldn&amp;#39;t take 30 minutes to put some cake in a box. Need to get a better system. Hopefully it&amp;#39;s worth the wait.", "rating": 3, "date": "8/13/2016"}, {"text": "I want to start off by saying our server Taylor was amazing! I definitely recommend her! The food took awhile but the restraunt was very busy so I understood. Taylor was very attentive and could carry a conversation well. She made us feel welcome and we will definitely be coming back!", "rating": 5, "date": "9/15/2015"}, {"text": "Daughter convinced me to come back. We started out with a waitress named Taylor.  She spent more time texting than serving.  She then told us she was team teaching. We then spent time with an amazing waiter named Jonathan.  Just awesome! Unfortunately, it didn&amp;#39;t help the burnt Tuscan chicken we received. I told my daughter desert only if we come back to this location soon. Disappointed. One of my favorite restaurants... Got to give the m time!", "rating": 1, "date": "9/10/2015"}, {"text": "Tonight my wife and I went to The Cheescake Factory with our 14 year old daughter and her friend. We were seated quickly and the server was very attentive. We received our drinks and bread/appetizer pretty quick. We ordered our food and about 30 minutes later the server came to verify our order because the computer crashed. After an hour some of the food came out but not all. We asked where the rest was and were told it was coming. The ones with food patiently waited without eating to be polite. Twenty minutes later the rest came out and our food was cold. The manager apologized and offered us all cheesecake. He said it was the least he could do. However when the server came he informed us that the manager had only agreed to 2 pieces. I told him that all 4 of us had been inconvenienced. He said he would ask the manager to agree to a piece for each of us. He came back to inform me that the manager refused. It wasn&amp;#39;t the fact that we were only getting 2 pieces of cheesecake. It was that after our food was extremely late and cold, the manager was not even sincerely sorry for our bad experience. He really didn&amp;#39;t care that our food was cold and very late. The Cheescake Factory doesn&amp;#39;t need to make every customer feel valued. I guess they have more customers than they need and can treat some badly and get away with it.", "rating": 1, "date": "11/25/2017"}, {"text": "Soup was cold, mashed potatoes were cold. Waitress was great but took forever to get food. Worst park of town for a restaurant like this. Don&amp;#39;t come at nite.", "rating": 3, "date": "9/23/2015"}, {"text": "LOVE Cheesecake Factory. Food was delicious and our server was great.. Until we watched her get taken away in cuffs. There&amp;#39;s a first for everything!", "rating": 4, "date": "4/1/2016"}, {"text": "This was my second visit to C.F.  The first visit went fairly smooth, with the exception of the check in desk.  They were really flustered &amp;amp; Laurie was rude!!  I know you guys are still new &amp;amp; working out kinks.  But, the 2nd visit was worse.  Again, the check in kiosk is totally out of control.  There were 6 of us asking for outdoor patio.  It took about 40 mins.  When I arrive at the kiosk &amp;#34;Laurie&amp;#34; informs me that it is 2 booths, because you don&amp;#39;t have booths for 6!  I asked why we weren&amp;#39;t told this on the front end, &amp;amp; she said, &amp;#34;Because I didn&amp;#39;t book you&amp;#34;!  Very unprofessional &amp;amp; the whole purpose of 6 of us was to have lunch together.  Then...our food order took around 50 mins.  We ordered cocktails.  They have gone up from 2 weeks ago!!  Now, it&amp;#39;s $12 for a mixed drink &amp;amp; $7.50 for a 16 oz draft beer!!!  That is highway robbery!!  So, your food is not any higher quality than your competition, your hostessing is terrible &amp;amp; your liquor prices are outrageous!!  I&amp;#39;m posting this review else where.  You won&amp;#39;t be getting any more of my business till you guys learn how to treat customers &amp;amp; when your prices become reasonable again!!", "rating": 1, "date": "9/18/2015"}, {"text": "We went there for Valentines Day. We ate at the bar since it would have been a way longer wait for a table &amp;amp; we don&amp;#39;t mind sitting at the bar, we usually do when there is a long wait. We were really looking forward to some cheesecake factory, as it is very far from we live--it was a big deal to drive all the way out there for a special occasion like Valentine&amp;#39;s Day. My husband ordered the Chicken Bellagio, and it was missing the prosciutto when it arrived, he let the bartender know right away. I ordered the crispy Chicken Costoletta &amp;amp; it was missing the lemon sauce or had very very little on one corner piece but I didn&amp;#39;t let them know as I realized it after the server left and they were so busy at the bar I couldn&amp;#39;t get anyones focus. I figured I would let them know when the prosciutto came back. My husband let them know about the prosciutto right away &amp;amp; the bar tender ran back to the kitchen, but nothing was ever done about it. A person a few seats down from us had prosciutto missing on his Bellagio as well. I don&amp;#39;t know if they did anything about his either. Food was sucky, and service was dismissive of it. Nobody brought us the prosciutto and we probably paid a few extra bucks on that dish for the prosciutto that we never got. It was very poor service to ignore the problem. A manger never came to address the issue either. We felt like we could have eaten better at home, as our dishes were plain and or dry due to forgotten ingredients. I wouldn&amp;#39;t eat at this cheesecake factory location again unless I was just ordering a Cheesecake dessert. The entrees are a rip off as they don&amp;#39;t come how they are intended to come out of the kitchen at every other cheesecake location.", "rating": 1, "date": "2/17/2016"}, {"text": "I was hesitant to try a chain place after I have heard the horror wait times, but we were in the area and had a giftcard so we gave it a try. I was very surprised on almost everything. We called ahead and asked if there was a waiting list (Friday night), and to our surprise there was none. We were quickly seated and ordered our drinks. The place was really busy and pretty loud. After looking over the huge menu, I settled on a Cuban sandwich and the wife got chicken pasta. My Cuban was probably the best Cuban I have ever had, my wife&amp;#39;s chicken pasta was plain jane to me. We ordered a slice of the Reeses cheesecake and oh my, talk about rich flavor. It was so sweet as well. Only downfalls were that service was slow once we received our dishes, and that our table was apparently cleared so fast that the silverware was forgotten so we received our food without silverware. Overall I was pleasantly surprised. I probably won&amp;#39;t be back anytime soon, but that is because I live 40 minutes away. Overall a A-.", "rating": 4, "date": "6/6/2016"}, {"text": "I was told my wait would be 1 hour for a party of 5. We waited an hour and twenty minutes. When we were taken to the table it was a 4 person booth with a chair stuck on the end. That would have been ok but it was in the main isle and my son was constantly tripped over. He was sitting so close to the table to try to prevent being hit, that the people on the ends of the booth had to scoot over to have any leg room at all. It was awful. The waitress came to the table after a good 5 minutes and was just plain rude. We went ahead and ordered our food since we had time to look over the menu and decide beforehand. We thought this would help us get our food a bit faster. We were wrong. It took 45 minutes to get our food. Someone else, not our server, brought our food. The food was not bad, it was just bland. It had no seasoning at all. We ate our entire meal with no drinks. Our server was no where to be found. This dinner was for my daughter&amp;#39;s 13th birthday and sadly we could not have been more disgusted with the entire experience at this restaurant.", "rating": 1, "date": "1/8/2016"}]}