{"address": ["5000 Shelbyville Rd", "Ste 1585", "Louisville, KY 40207"], "monthly_reviews": {"2019": [[0, 3.0], [1, 2.5], [2, 3.0], [3, 2.5], [4, 2.5], [5, 3.0], [6, 3.0], [7, 3.5], [8, 3.5], [9, 4.0], [10, 3.5], [11, 3.5]], "2017": [[0, 3.0], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.5], [7, 3.5], [8, 3.5], [9, 3.5], [10, 3.5], [11, 4.0]], "2020": [[0, 4.0], [1, 3.5], [2, 3.0], [3, 3.0], [4, 2.5], [5, 2.0], [6, 2.5], [7, 3.0], [8, 3.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2018": [[0, 3.5], [1, 3.0], [2, 2.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 4.0], [7, 4.0], [8, 4.0], [9, 4.0], [10, 4.0], [11, 4.0]], "2021": [[0, 3.0], [1, 2.5]]}, "reviews": [{"text": "Was so excited to have Cheesecake Factory tonight but our hopes were quickly dashed. We got the wrong order. And it wasn&amp;#39;t very good. And no bread. Luckily, our slice of cheesecake was included- that was my dinner tonight. <br&gt;<br&gt;Restaurants need to remember we&amp;#39;re tired of this take out issue too.", "rating": 2, "date": "11/11/2020"}, {"text": "Really subpar. Sticky table, cold bread, ordered a New York strip cooked medium, was served a well done steak. Next steak they brought out was cooked a little closer to medium but unfortunately had the flavor profile of tap water and was at least 25% fat. Like they don&amp;#39;t even try. A $25 steak should at least taste like half that price. Reminded me of a steak I got at Waffle House a few years back.", "rating": 2, "date": "1/2/2021"}, {"text": "Dined at the bar on a Sunday. It worked well as I was dining alone, was only ordering cheesecake, and required no wait as opposed to the main dining area which was quite busy that afternoon. My usual go-to is the Oreo cheesecake, but I thought I would try something new this time and get the Adam&amp;#39;s Peanut Butter Cup Fudge Ripple. <br&gt;<br&gt;It unfortunately didn&amp;#39;t quite meet my hopes. I did appreciate that it was a smaller cheesecake slice, leaving me feeling less overstuffed afterwords. However, I was hoping for a bit more flavor. The butterfinger and Reese&amp;#39;s cup pieces seemed to be overwhelmed just by the cheesecake. Maybe could have been enhanced by a peanut butter drizzle or giant candy piece. They did fulfill my request for double whipped cream though! Overall I&amp;#39;d give it a 6/10, but I would certainly recommend sitting at the bar and taking advantage of the free vread as always.", "rating": 3, "date": "4/28/2019"}, {"text": "I&amp;#39;ve been going to The Cheesecake Factory for years and have enjoyed their food and atmosphere most of the time. This location isn&amp;#39;t as impressive as ones I&amp;#39;ve visited in other states, but it&amp;#39;s nice enough to where I&amp;#39;ve returned a few times - mainly to satisfy my sudden cravings for their cheesecake.<br&gt;<br&gt;This was a cheesecake visit only. I sat at the bar to order their seasonal cheesecake Peppermint Bark. Rather, I ordered the Coffee &amp;amp; Cream Chocolate Supreme, as I was motioned by someone that the Peppermint Bark wasn&amp;#39;t good. Also, I asked the bartender about this cheesecake and his answer was all over the place. Therefore, I concluded it hasn&amp;#39;t consistently received good feedback. Their cheesecake isn&amp;#39;t cheap and I like to be pretty certain. Well....I ended up not liking the Coffee &amp;amp; Cream cheesecake. I ate it all, as it wasn&amp;#39;t horrible, but I won&amp;#39;t order again. I have a few winning favorites, but my all time go-to is the White Chocolate Caramel Macadamia Nut (so delicious!). You can always rely on their cheesecake presentation being on point. I sometimes hate sticking in the fork the first time, but once I do and take that first bite it&amp;#39;s all over.<br&gt;<br&gt;Just a few extra notes I&amp;#39;ve noticed to be repeats - parking usually requires much  patience unless you valet and the service (bar and dining) are pretty decent.", "rating": 3, "date": "1/5/2019"}, {"text": "The last time I had been to the Cheesecake Factory was high school. Wow! It&amp;#39;s been a really long time.<br&gt;<br&gt;I came for lunch at 11:30 and the parking lot was just fine and dandy. No trouble finding a spot. But as I was leaving close to 2, there were so many cars circling around for a spot.<br&gt;<br&gt;We had no wait when we got in, but as we left, so many people were waiting for a table! And it&amp;#39;s a Wednesday! I guess people were still off work for the holidays.<br&gt;<br&gt;I saw lots of high school students here, girls with their moms, and families. <br&gt;<br&gt;My friend and I both got sweet teas. Yum! It had a nice freshness to it. Not quite like Cunningham&amp;#39;s, but still pretty good.<br&gt;<br&gt;They give complimentary bread with butter. Reminded me of the fresh kind they give at Irish Rover. Still very good!<br&gt;<br&gt;I got me a burger off the skinny menu. The skinny menu has a select few items that are basically healthier versions of stuff on the regular menu but smaller portions. <br&gt;<br&gt;I asked for it medium well and it had mayo, lettuce, and tomato. No onion. And ketchup on the side. It comes with a side salad but I replaced it with steamed broccoli. So good!!<br&gt;<br&gt;My friend got a salad with grilled chicken and balsamic dressing.<br&gt;<br&gt;Their menu is huge! I wasn&amp;#39;t sure what I was going to order. There aren&amp;#39;t really items below $10, so be ready to spend a little. It&amp;#39;s still worth it though! We both liked our food!<br&gt;<br&gt;Again, it&amp;#39;s been years since I&amp;#39;ve been back. I&amp;#39;ve had their cheesecakes before which are huge and delicious and I&amp;#39;ve also had some sort of chicken Parmesan with angel hair pasta a long time ago. It was filling and I remember being unable to finish.<br&gt;<br&gt;These days, I can&amp;#39;t do dairy. <br&gt;<br&gt;My friend got a chocolate mousse cheesecake she couldn&amp;#39;t finish and took home and I ordered the mango key lime cheesecake to take home for my mom.<br&gt;<br&gt;Service was fantastic! The waitress made to sure to keep my glass filled with tea and knew the menu very very well. She had a great attitude and some good recommendations. <br&gt;<br&gt;Can&amp;#39;t wait to go back! I was shocked that I ended up enjoying the food! So glad I came!", "rating": 5, "date": "1/2/2019"}, {"text": "My friend and I brought our friend here for the first time and his birthday a couple weeks ago, I got the BBQ ranch salad, my friend had a grilled chicken sandwich and the other the general Tso chicken. Everything was delicious, the service was a bit slow we were there almost two hours and we didn&amp;#39;t have a appetizer or drinks. <br&gt;<br&gt;The menu is large and overwhelming but there is a wide variety and I have had anything bad here when I have come.", "rating": 3, "date": "7/21/2019"}, {"text": "I&amp;#39;ve always loved the Cheesecake Factory when O was amid, and that hasn&amp;#39;t changed! Service is always great despite the crowd level. The cocktails are always delicious too! I especially love the sangria! I also really appreciate that they have a Skinnilicious menu as I try to watch what I eat. The items on that menu are healthy and delicious especially the turkey burger and enchiladas! Finally, the cheesecake is always impeccable regardless of what flavor I get. For a chain, the Cheesecake Factory does a great job!", "rating": 4, "date": "8/9/2019"}, {"text": "I  love Cheesecake Factory. Amazing bread to start with. Pasta is so good. I always get the red velvet cheesecake (layers of  red velvet and layers of plain cheesecake).  It  is always super crowded because it is located in the mall. I also think it is a touch pricey.", "rating": 4, "date": "2/27/2020"}, {"text": "Love the grandiose atmosphere despite this being a chain restaurant: vaulted ceilings, stained glass light fixtures and vases, large pillars reminiscent of Roman architecture. Interior is beautiful and simplistic. <br&gt;<br&gt;The menu boasts a large variety of dishes - pizza, pastas, chicken dishes, Asian-inspired entrees, sandwiches, burgers, etc. Everyone will find something they enjoy here. <br&gt;<br&gt;I&amp;#39;ve been to CF dozens of times and always look forward to the Firecracker Salmon Rolls, but was sadly informed today that they were taken off the menu (insert sad, confused, and crying emojis). <br&gt;<br&gt;Despite that letdown, we ordered the pasta carbonara with chicken and the Louisiana Chicken pasta (it was a carb-rich day), along with a complimentary basket of bread. The breads were fresh, the butter was the perfect temperature for spreading, and both pastas were rich, creamy, and perfect. The Louisiana carried just enough spice, delicious! The pastas were both lunch portions and were $14 and $17, which was slightly high for a lunch, but they were tasty.<br&gt;<br&gt;No cheesecake was ordered today, but I love every variety on the menu; the Snickers is a top one for me as well as the Tuxedo (yummm). All cheesecakes run between $6-$8 and are gigantic portions (enough to share). <br&gt;<br&gt;Overall this is a place I enjoy and will continue to return, but the price points make it an &amp;#34;occasional&amp;#34; spot that we stop into.", "rating": 4, "date": "11/3/2018"}, {"text": "Don&amp;#39;t come here if you&amp;#39;re looking for an inexpensive date night. Now that the disclaimer is out of the way, I must say, I&amp;#39;ve never had a bad experience or meal here. The food is always good, the menu is so big it&amp;#39;s almost scary, the decor is amazing and the desserts are beyond fabulous. We enjoyed cocktails, entrees and desserts with friends and had a very nice time.", "rating": 4, "date": "12/3/2019"}, {"text": "They have different menu items and the staff is always very helpful. Dessert is always delicious no matter what you choose.", "rating": 5, "date": "11/21/2020"}, {"text": "Had last minute free up of the kids so this became our date night. Decided to come here and have dinner.<br&gt;<br&gt;We arrived and were placed in a waiting queue. We didn&amp;#39;t have too long of a wait.<br&gt;<br&gt;We started off with the Buffalo Chicken Blasts as an appetizer. They were delicious! We loved them. <br&gt;<br&gt;For dinner I ordered the Bacon Bacon Cheeseburger with the fries, I had an Arnold Palmer for my beverage. It had sugar around the brim of the glass which was pretty cool.<br&gt;<br&gt;The food was pretty good, our waitress was awesome, she kept our drinks filled. Our food was hot when it came out, I almost got the cheesecake, but man I&amp;#39;d have been stufffffed! <br&gt;<br&gt;Great date night dinner, now off to see John Wick 3!", "rating": 4, "date": "5/18/2019"}, {"text": "Yes I know it&amp;#39;s a chain- but it&amp;#39;s amazing. They do a great job with food and service! I&amp;#39;ve never been disappointed. The portions are large enough to share. We love to do an app and entree or entree and cheesecake! Chicken and biscuits and chicken Madeira are my faves. The egg rolls, Mac and cheese, and crab dip are awesome apps!", "rating": 5, "date": "12/8/2019"}, {"text": "So far... we waited 5 minutes at the bar to be greeted by the bartender who was talking to the servers in the well. We ordered drinks and food at the same time. 7 more minutes... no bread. There are zero other people at the bar; however, there are still 3 dirty plates on the bar and no bartender to be found. No wait. <br&gt;We&amp;#39;ve had good experiences but so far no good.", "rating": 1, "date": "3/3/2020"}, {"text": "This was the 2nd time I have been here and thought the ambience was nice and intimate. it was an impromptu date with my husband. We had drinks and appetizer. Our waitress (Brenda I think) I ordered medium steak and it came out perfect. I thought it was a great steak and we had desert of a  delicious key lime cheesecake! We literally ate til we were painfully full. It was totally worth it! <br&gt;The whole experience was lovely and we will be back!", "rating": 5, "date": "8/15/2018"}, {"text": "The Cheesecake Factory, at St. Matthews, is clearly following safety standards and the service and food were both terrific.", "rating": 5, "date": "8/2/2020"}, {"text": "Girls Day............who doesn&amp;#39;t love having lunch with their mom and a divine dessert afterwards? <br&gt;<br&gt;We just had to cross the bridge for the Cheesecake Factory. Mom got the Rene special and I got the Louisiana pasta from the lunch menu. Both meals were more than we could eat. Our waiter recommended my meal to me and I have to say I&amp;#39;d definitely recommend it to anyone who likes pasta with a touch of spice. <br&gt;<br&gt;Mom had soup with her meal and the carrots were like boulders. She had to cut them in tiny pieces just to fit them into her spoon. <br&gt;<br&gt;We both drink our tea unsweetened, so we thought we&amp;#39;d try the tropical, bad idea. I usually love a little mango or peach flavor added to my tea. This was an odd flavor that neither of us cared for. <br&gt;<br&gt;We did save room for cheesecake, with the recommendation of our waiter we chose the dulce de leche carmel . It was a grand choice. We absolutely loved it. I could go back for just that and a glass of wine!", "rating": 4, "date": "5/3/2019"}, {"text": "I had them add sun-dried tomatoes to dish and it was amazing!!! By far the best pasta I have ever had at the cheese cake factory.", "rating": 5, "date": "1/23/2020"}, {"text": "It&amp;#39;s hard not to like this place, especially if you are a big fan of cheesecake. I grew up going to the original location in downtown Chicago, where the servings were super plentiful. That isn&amp;#39;t the case now. While the cheesecake slices can be big enough to share, the meal portions are average. I really like the chicken tenders and fries. They are always so crisp and crunchy with the right amount of meat. They give you breads as an appetizer but the bread is the harder crust type that doesn&amp;#39;t appeal to me. As far as the desserts, the caramel turtle cheesecake is my absolute favorite. On this visit I tried the white chocolate caramel macadamia nut. Wow is all I can say. The caramel is cooked into the macadamia in the bottom crust of the cheesecake and it is phenomenal. I haven&amp;#39;t eaten a whole slice of cheesecake in one setting ever but I literally did not want my tastes of this gem to end.", "rating": 4, "date": "10/9/2019"}, {"text": "The menu here is an absurdity. To expect someone to be able to do good versions of all these dishes strains credibility. And everything is a little more expensive than it should be. But I&amp;#39;ve got to say, the cheesecakes are fantastic. And I&amp;#39;ve had some good meals here. And it&amp;#39;s a nice place. So go for it. But if you&amp;#39;re not in the mood for dessert, look elsewhere.", "rating": 4, "date": "12/3/2019"}, {"text": "If your looking for Cheese Cake then look no further! This is your place.   They have a wonderful selection of cheese cake. Your belly will enjoy it! That is if your into cheese cake! If your not. Then there may be something wrong with your mouth. Jk jk okay maybe there is. <br&gt;<br&gt;  The menus has a good selection of food. I myself fancy myself as a steak person and very picky. The steak Dian was my choice. It&amp;#39;s delicious. As it has four slices of steak and a good helping of mash. The sauce they put on it is Devine and will make your mouth water. It has mushrooms in it with some type of greenery to top it off. Which brings the plate together. You don&amp;#39;t believe me? Stop in and try it for yourself you won&amp;#39;t be disappointed. <br&gt;<br&gt;  The food may have been on point but the service was sub par. For such a nice restaurant I expected more out of service. It is connected to a mall. So that should had set my thoughts on standards and service.   I think our server may have had too many tables.   Also a server tray on top of plates that a visiting patron will be eating bread and appetizer on is not okay. It&amp;#39;s not sanitary.  Pretty sure those suckers get thrown around a lot.  At least from what I have seen in other restaurants.", "rating": 3, "date": "4/5/2018"}, {"text": "My wife and I decided to have lunch midweek at this location on Shelbyville Rd; our 1st time. We arrived at 11:00 am and wasn&amp;#39;t very busy with only few customers. The interior is beautiful. We were seated and our server was attentive and we had our drinks quickly. With such an extensive menu, we needed a few monuments to review but what looked good as an appetizer was the Calamari. <br&gt;The Calamari Was served promptly; lightly fried and very good. (wish maybe a sweet chili type sauce rather than cocktail sauce). We were half way through when felt rushed to order our lunch by sever. Regardless, I ordered the Shepherds which is delicious described pie(dinner portion) while my wife the the Caesar salad, Flat bread mushroom pizza with Truffle Oil. <br&gt;The &amp;#34;Shepherd&amp;#39;s pie&amp;#34; I ordered was a huge disappointment; the potato and cheese topping was tasteless and inconsistent warm. The ground beef didn&amp;#39;t taste fresh at all and you could see it sitting in a bowl of liquid fat; the large amount of oily fat can be seen around my dish and throughout. Didn&amp;#39;t appear much vegetables with few peas and the carrots; carrots were semi hard not throughly cooked. <br&gt;I took leftover home and its obvious you can see there was still substantial amount of fat that solidified. <br&gt;My wife&amp;#39;s salad was drenched in Caesar dressing and she didn&amp;#39;t like it so I ate it since it was better than my dish. The mushroom flatbread was the highlight of our meal as we both thought it was very good. Look at the pictures and you be the judge", "rating": 2, "date": "9/6/2019"}, {"text": "I love Cheesecake Factory although their gigantic menu sometimes overwhelms me. I usually stick with my favorites- meatloaf, grilled salmon and the burgers. The egg rolls are great starters! <br&gt;<br&gt;The Chicken Riesling is a very tasty dish. It has chicken pieces sautéed with pieces of bacon in a wine sauce and is served with pasta. Another favorite is Sheila&amp;#39;s Avocado Chicken Salad. Very light and flavorful. We love the bread too. <br&gt;<br&gt;I can honestly say that I have never had a bad meal or bad service at the Cheesecake Factory in Louisville.", "rating": 5, "date": "7/25/2020"}, {"text": "Most of us have been to a Cheesecake Factory so you know what the food is like, but the service at this one in particular is just not worth it. We ordered our food at 5:30...it&amp;#39;s 7:15 and we still don&amp;#39;t have it. Save the time and headache and go to another chain or better yet a local place.", "rating": 1, "date": "6/27/2020"}, {"text": "Literally just waited out in the parking lot for over half an hour on cheese cake they completely forgot I ordered.", "rating": 1, "date": "10/24/2020"}, {"text": "The restaurant was truly out of sorts. Disorganized, servers wearing cheap wigs and head rags like your find at a Halloween party. Some servers were in stained thread bare white shirts and wrinkled black pants. However most of the staff looked very professional. <br&gt;<br&gt;The foyer was a crowded wet mess. No umbrella bags, no &amp;#39;wet floor&amp;#39; signs with standing room only  had the floors ready for a slip n fall. <br&gt;<br&gt;The area had leftover holiday decorations with the cash register sitting on a banquet table covered with gift wrapped advertisement packages. The banquet tables had been shoved in front of the benches in the foyer causing the seating to be unavailable to the waiting guests. <br&gt;<br&gt;Immediately upon being seated we noticed our silverware still had the last guests meal on it and the napkin were stained. <br&gt;<br&gt;The restroom were HORRIBLE. No tissue in two of the 4 stalls, faucets leaking all over the counter tops, soap dispenser empty but the nastiest unhealthiest thing of all were the toilets. <br&gt;<br&gt;The base of the toilets (wax seals) were leaking right onto the floors. Imagine if you&amp;#39;d worn fabric shoes... just soaking up sewage like a sponge. Just disgusting! Any of the 4 hostesses that were giggling and hanging out behind the hostess stand, swapping holiday stories, could have been clearing the foyer or stocking the restrooms or at the very least.. taking notes for the managers to delegate the duties. <br&gt;<br&gt;We had eaten BEFORE I visited the ladies room or we&amp;#39;d have left RIGHT THEN. The food was good BUT our server was AMAZING! We were the party of 3, in the bar area with male in the wheelchair. I didn&amp;#39;t get her name, she was petite, blond, fair skinned and INCREDIBLE!!<br&gt;<br&gt;If your looking for a relaxing enjoyable experience choose another restaurant or at least a different location.", "rating": 1, "date": "12/29/2019"}, {"text": "The last two times my wife and I have went, she has been disappointed with her meal. Her Parmesan crusted chicken was cold and the broccoli looked old and uncooked last night. I had the brick chicken and it was great as always but as the saying goes &amp;#34;if momma ain&amp;#39;t happy ain&amp;#39;t no one happy&amp;#34; so we won&amp;#39;t be back for a while.", "rating": 3, "date": "10/17/2020"}, {"text": "I always forget about Cheesecake Factory--- just cause its a chain restaurant and a little out of my way! But man, everytime I do go I am NEVER disappointed by the food! Its always so full of flavor and just so satisfying! My favorite is the Korean Fried Cauliflower-omg its so good! You would not even know its cauliflower had you not ordered it as that. If they had told me it was chicken in a blind fold taste test, Id believe them! So good! I love all their pastas that Ive tried. And I just recently tried the chicken taquitos, those were superb as well. Ive yet to choose a bad meal here!", "rating": 5, "date": "10/1/2019"}, {"text": "We were seated at the time of our reservation, our food was all delicious. We will be back!", "rating": 5, "date": "6/20/2020"}, {"text": "This is the second time I&amp;#39;ve done DoorDash with Cheesecake Factory and this is the second time to be had issue with the order. Needless to say that I won&amp;#39;t be ordering Cheese Cale Factory from doordash again!!!", "rating": 1, "date": "8/11/2019"}, {"text": "Restaurant chains are always hit or miss. I had a great experience today, but tonight someone might have a different one. <br&gt;But, I have to give credit where it&amp;#39;s due. Had a late lunch here today and everything was exceptional. And, honestly, I&amp;#39;ve never had a bad meal at any Cheesecake Factory. The service was great. Our waitress was not overly friendly, but she was timely and kept our drinks refilled and checked how our food was each time something new came out. I can&amp;#39;t ask for more. All the food was great but let&amp;#39;s be honest, I went for the cheesecake and will keep coming back for it!", "rating": 5, "date": "1/7/2019"}, {"text": "It&amp;#39;s been a while since I&amp;#39;ve visited The Cheesecake Factory. The menu is so large that it can be overwhelming. We had a mediocre experience overall. Our food was very average. The Oreo Cheesecake was the highlight. We ordered it to go and ate it at home.", "rating": 3, "date": "12/27/2018"}, {"text": "Friday after work my friend needed a partner in crime to do a little pre-Christmas shopping. So I joined in. It&amp;#39;s always better to take care of the holiday shopping before the psychotic holiday crowds start and stores jack their prices up in December. We decided to go to St. Mathews Mall to see if anything caught our eyes, but first needed to grab a bite for some after work energy. <br&gt;      We decided to go to Cheesecake Factory, since it&amp;#39;s located in the mall which made it convenient. I like this place because their menu is pretty large and gives you many options. Their were lots of empty tables, but the wait time to be seated was still 20 minutes. It was around 5:30 on a Friday night, and I&amp;#39;m sure the staff was trying to prepare for the Friday crowd about to come in or maybe shift change. Ten minutes into our wait time, it did get extremely crowded. <br&gt;         We decided to get some appetizers and specialities to share. We got samosas with cilantro sauce and a cauliflower dish for the appetizers. They were both good. You can&amp;#39;t go wrong with samosas. They are triangle shaped eggrolls, but Indian/African inspired. The sauce on the cauliflower was addictive. We couldn&amp;#39;t stop eating them. It&amp;#39;s just like their brown starter bread. I could get full eating the bread with butter, before they bring the actual food out. <br&gt;         We then got the cilantro mango dish and the orange chicken. They went really light on the orange sauce which is fine, but next time I will ask for extra orange sauce on the side. Talking about sauce, did you know they sell their sauces in jars for $8-$10? This is a pretty good price and their jars are good sizes. I&amp;#39;ve made their tamarind sauce and their peanut sauce at home before, and the ingredients run you around the same price or more. So if you ever eat one of their dishes and enjoy the sauce in it, you can ask them to purchase a jar to go. Some of the jars are already made up to go, and they sell them at the dessert counter. <br&gt;          The only con: I didn&amp;#39;t even look at the menu and ordered my favorite dish, Firecracker salmon. The lady told me you no longer have that. WHAT HAPPENED TO MY FIRECRACKER SALMON DISH!? Why did you remove this from the menu? I used to purchase this as a salad because the yummy red cabbage bed the fried salmon sat on and the yummy dressing. Please bring it back.", "rating": 5, "date": "11/4/2018"}, {"text": "I love The Cheesecake Factory, their portion sizes are nice considering their food prices are a bit higher than most places. Their staff is typically very friendly, they mostly keep a smile on their face. <br&gt;<br&gt;I love the ambiance in the restaurant, you almost always have to dress up otherwise you&amp;#39;ll feel like a sore thumb sticking out because the place feels upscale. <br&gt;<br&gt;Their food is fantastic when they prep it properly, that&amp;#39;s my biggest issue and grip. They do well most of the time, but sometimes they are inconsistent. I&amp;#39;ve had some of the best shrimp scampi here (what I typically order) and I&amp;#39;ve also had some of the worst. They typically do it well 90% of the time but that last 10% can be a drab sometimes. <br&gt;<br&gt;It won&amp;#39;t stop me from coming here though! I love visiting, to me it&amp;#39;s almost like an event that I have to partake in. I&amp;#39;ll be back fairly soon for some more shrimp scampi. Thank you guys for the good food!", "rating": 4, "date": "1/29/2019"}, {"text": "Most of the food was decent. I ordered some wings and the waitress literally served them to me burnt. It was clearly not something you want to serve to a customer. The service was good and the waitress was attentive. Overall a decent experience.", "rating": 3, "date": "8/21/2019"}, {"text": "I ordered the Fettuccine Alfredo and a slice of Reese&amp;#39;s cheesecake. I ended up feeling really nauseous after eating. Later that day, I kept throwing up, having diarrhea, and sweating profusely. I went to the immediate care center for them to tell me I had food poisoning. I refuse to ever feel that horrible again. I&amp;#39;ve only eaten here a few times, but never again.", "rating": 1, "date": "9/12/2020"}, {"text": "While doing some shopping we decided to pop in for drinks and lunch around 2 pm.   The line was out The door with what I assume was brunch guests.   We proceeded to the bar area and sat at a two top for 5-7 min without so much as a whisper of a server.   Moved to the actual bar.  The bar tender immediately took our drink and food order.    Chardonnay&amp;amp;Bellini. Two small salads and the buffalo blasts.  Drinks and bread came immediately.  Food took another 30 min coming in 3 deliveries 5 min apart.   Salads were great.  Spicy Caesar small plate is huge.   Buffalo blasts were a bit greasy.  Everything was just a bit off from our normal experience.  <br&gt;<br&gt;My wife would like me to mention the bathrooms were horrible.  likely due to crowd, but should always be checked.", "rating": 3, "date": "9/9/2018"}, {"text": "Very good chain restaurant.  Menu variety. Good service. Very good food. I had the jambalaya Cajun pasta with chicken. Wife had 3 taco with seared tuna. I&amp;#39;ll add the pics. Prices seem a little high but probably comparable to other restaurants of this kind. But the portions are huge. I will have lunch leftover today. Also the Oreo cheesecake is 5 star. We come here about every three months.  Satisfied every time. <br&gt;<br&gt;Updating review. Ate here last night. One of our favorite chain restaurants. Food and service were very good. See pics. Only thing about chain restaurants is you get some loud people in sometime who think they are at home    Also wine per glass is as much as some of the fancy restaurants. Otherwise this place is always an option for us!", "rating": 4, "date": "10/20/2017"}, {"text": "Atmosphere was great, wait was a bit long but it was friday so totally understandable, the food was ok but just not what I was expecting, the wine was not well paired to my meal as my server didn&amp;#39;t seem to understand that&amp;#39;s what i was asking for a recommendation for, the cheesecake I ordered was the white chocolate rasberry truffle and I wasnt a fan of the texture or the whipped cream topping it was very googey and jelly like throughout but my dinner date had an oreo dream cheesecake and it was amazing it was much more cheesecake consistency.  I think if you find the right combination of drink, entree, and dessert or a server that can help guide you this restaurant would be a five star easy.", "rating": 3, "date": "1/3/2020"}, {"text": "Great food ... but over priced <br&gt;Manufactured wait bc they can&amp;#39;t run a staff schedule.. 20 min wait for one of the 12 empty tables in the restaurant <br&gt;The female manager was by far one of the rudest self important pieces of shit I&amp;#39;ve dealt with lately if I needed someone to mumble make excuses and faces at me &amp;amp; while I walked away I would go to McDonald&amp;#39;s", "rating": 2, "date": "7/12/2019"}, {"text": "Love the Cheesecake Factory <br&gt;Love the staff<br&gt;Love the menu love the ambiance.<br&gt;We eat here quite a bit and totally enjoy every visit we&amp;#39;ve made.  The food is fantastic and the variety is outstanding.  I started this dinner with a fantastic Cucumber Martini..oh my goodness bring me another one.  Appetizers tonight were those favorite lettuce wraps, try them you&amp;#39;ll fall in food love after the first bite.  For dinner I took a different approach and had the Chicken and Biscuits.  Someone should slap the person who designed this dish...I had to order another martini to wash it down!  We had ten in our group this time and our server Matt did not miss a thing!<br&gt;From the greet he was sharp, informing us of the daily soup and informing us that there were some dishes they were out of.  Matt was great from start to finish.  Matt should be a trainer!<br&gt;Of course we had cheesecake and I could rant about the place forever because I love eating here.  If you haven&amp;#39;t tried CF then you are missing a great establishment.   Why wait any longer", "rating": 5, "date": "8/20/2018"}, {"text": "I think the best advice I can give is be prepared for a wait a come extremely hungry!!! Maybe wait for a day or two to eat, because you won&amp;#39;t be able to decide what you want and it&amp;#39;s going to be delicious at this location. ( That not eating was a joke... it&amp;#39;s seriously not healthy.) <br&gt;<br&gt;I am so excited they have the Incredible Burger here now!!! It makes this one of my favorite places to go!! If you are a vegetarian there are not a ton of options on the menu, but since this latest update they really have added a few options. This being the best! <br&gt;<br&gt;Prior to this addition....to be honest this place wasn&amp;#39;t even on my list of places to dine. I hope they keep adding some vegetarian friendly options, since the dietary trends are continuously moving in that direction, for multiple reasons.", "rating": 5, "date": "12/8/2018"}, {"text": "I try to eat local whenever possible. However, over the weekend my sister-in-law and her family were visiting and they had some dietary restrictions that made it difficult to choose a local place. So we came here based on the 20+page menu. I&amp;#39;ve been here several times with my mom when we were shopping too. I can honestly say I&amp;#39;ve never had a bad experience.<br&gt;<br&gt;On our most recent visit we had a table for ten and a high chair. Some servers would have been frustrated with three kids and a baby in their section. Not ours! He was so friendly and great with the munchkins. He let the kids order while we waited for part of the party to arrive. My husband and I also ordered early because we weren&amp;#39;t sure how long our 10 month old would be on good behavior. Our drinks were refilled constantly and they brought out extra bread when we devoured the first basket. <br&gt;<br&gt;My veggie burger was delicious, but it fell apart so much I had to eat it with a fork. I make homemade veggie burgers, so I know that is tricky. It&amp;#39;s the only qualm we had. My husband loved his entree and we ordered the chocolate truffle tower to go. We fought over who got the last bite of that decadent dessert!", "rating": 4, "date": "6/18/2018"}, {"text": "I hate doing this. I really really do. I don&amp;#39;t like leaving  reviews like this, But this was abysmal, I really don&amp;#39;t know  how else to describe how bad it was besides all I can say is it&amp;#39;s the only food I haven&amp;#39;t finished in years. I tired so hard to finish what I started but I just couldn&amp;#39;t.  And worst of all our waiter was the sweetest she could have been. She was great and I not complain about the service because she was amazing. She even got us bread twice! Although. The first thing that happened was the Drinks though. My fiancé and I both got a sweet tea which was terrible. It tasted dirty and old. I&amp;#39;m guessing they hadn&amp;#39;t made any fresh since we had be there for brunch (around 11am). But It was so bad my fiancé and myself both asked our waiter for different drink. And our super sweet waiter got them, no problem and no questions asked. Now when the food arrived it looked very visually pleasing and was hot and was out in a decent time. My fiancé got chicken and waffles I got chicken and waffle Benedict with a cinnamon roll pancake. But my lord the syrup was more water then syrup! It was wildly runny and was in no way thick. My eggs were repulsive. They were pouched horribly. And both my lady&amp;#39;s&amp;#39; and my own chicken was also just plain disgusting. The chicken had a terrible taste and was very spongy, not a bit of crispiness to the breading just squishy chicken. And now the waffle. It wasn&amp;#39;t much better the outside looked burnt but  the inside was almost doughy or soggy so to say.. legitimately I couldn&amp;#39;t finish the food. It was just truly awful. Lastly the pancake. With the rest of the food being  repulsive I was quite excited to dig into this cinnamon roll pancake. And at first bite I was hit with such a relief it seemed like I was actually about to get into some great food. But after about 3 bites and I worked my way towards the middle the icing became over baring, it was super rich. To the point my mouth had a coating like film in it where it was the only thing I could taste. All in all I&amp;#39;m not a person to go to chain restaurants in the first place but I never had a bad experiences here until now. But I can&amp;#39;t honestly say I would return. Today was rough. Even my coffee( which was my second drink) was burnt and was not filtered correctly, all kinds of particles floating around. I feel bad complaining this way and putting this place down the way I am but this is just unacceptable. The chef couldn&amp;#39;t have tasted the food before it left, because it would have never gotten out of the kitchen. I want this place to be better an I hope it gets better because if it gets worse I can&amp;#39;t imagine people returning. I wouldn&amp;#39;t recommend this place. I feel bad saying it but I doubt I&amp;#39;ll return either.", "rating": 1, "date": "11/24/2019"}, {"text": "The menu is large. The service is hit or miss. The quality is dependent on what you order. My last visit was just very average. From beginning to end just average. The angel hair pasta with shrimp was tasty. The favorite item for my family is the Thai Chicken Lettuce Wraps.", "rating": 3, "date": "11/4/2018"}, {"text": "This place is a joke. Was told a 15 minute wait time, that turned into over an hour. Wife and I left.", "rating": 1, "date": "2/29/2020"}, {"text": "I&amp;#39;m always left pleasantly surprised by The Cheesecake Factory. Even though it is a chain restaurant with a huge menu they execute it very well. I ordered an espresso martini and the chicken costoletta, both were very good. My 2 year old daughter was with us, when they brought out the bread she had her own little plate with sliced banana and her own bread, that was nice touch that kept her occupied and got a little something in her stomach. I was with a large party and our server Hannah was energetic and attentive. For desserts I got the Adams peanut butter cheesecake, it was delicious as always. The Cheesecake Factory has so many different offerings it will fit almost anyone&amp;#39;s palate. Be aware that parking can be difficult since it&amp;#39;s at the mall.", "rating": 4, "date": "5/14/2018"}, {"text": "Fabulous restaurant... food is tasty and portions are huge... wide range of food selection that satisfies all tastes... service is good and somehow fast .... people should pay more attention to cleanliness of the place other than that everything is perfect", "rating": 4, "date": "10/6/2019"}, {"text": "Menu is huge and everything sounds amazing. A good problem to have. Went with the spicy chicken sandwich and substituted sweet potato fries! It was delicious and hit the spot. Fun environment for a casual dinner night.", "rating": 4, "date": "3/9/2018"}, {"text": "The food at Cheesecake Factory is always delicious. With a massive menu, you always have so many different options to choose from. I typically go with a burger or chicken sandwich, or the chicken poppers, all of which are delicious. Adam&amp;#39;s peanut butter cheesecake and the Oreo cheesecake are my two favorite dessert options. <br&gt;We ordered online and used the curbside pickup last time we ate here. We did end up waiting much longer than anticipated, partly due to the fact that they did not have one of the menu items we ordered. Had they told us this beforehand, I wouldn&amp;#39;t have had to wait the extra 20min+. Thankfully they did compensate for the mistake<br&gt;All in all, Cheesecake Factory is a solid choice, especially when going with a large party. Everyone will be able to find something they prefer to eat with such a diverse menu. (PS: adding more gluten free options, including cheesecakes, would be nice!)", "rating": 4, "date": "1/17/2019"}, {"text": "My friends love to come here for special occasions but for myself, I think there&amp;#39;s too many options for better food in Louisville.  That said, the menu here is so vast it&amp;#39;s nearly impossible for anyone to complain about not being able to find something. <br&gt;<br&gt;We were meeting for a birthday with a party of 16 (1 child). The location does not take reservations or call ahead so the Birthday girl got there at 4, telling the rest of us to get there at 5. When putting in the table request we were told to expect a 2 hr wait, and while I realize we were a large group a 2 hr wait time at 4pm seems too long...but, not my bday, not my choice.  We were seated at 2 neighboring tables at about 5:40pm<br&gt;<br&gt;I had already viewed the menu online and knew exactly what I wanted to order, since we were split between 2 tables,  our waiter had 7 adults and 1 child.  When he finally came to get drink orders he seems early confused, like he had some sort of method of sorting us on his note pad but he couldn&amp;#39;t figure it out.  At one point a friend at the other end of the table ordered a bar drink, he got to the person next to me and when she ordered the same he said &amp;#34;I&amp;#39;ve already got that&amp;#34;.  We had to explain that she too wanted the same drink.<br&gt;<br&gt;At some point when delivering said drinks he took appetizer orders but only from 2 ppl at the end of the table.  Rest of us didn&amp;#39;t need any I guess. <br&gt;<br&gt;When he came back to ask if we were ready to order we&amp;#39;d been there for quite some time, a couple from our other table had decided to leave. Anyway, since I had known what I wanted when I got there, YES I am ready...but ge said &amp;#34;hold on, I have a pattern to follow&amp;#34; and whipped out the note pad.<br&gt;<br&gt;Food finally made it out.  I got a salad and the chicken sliders appetizer as my meal. My soda was often empty but luckily the waiter from our other table was on it.  I did get a piece of cheesecake too (lemon mirg) and while the food was good I just feel like I could have had a better experience elsewhere for the  $30 + tip.", "rating": 3, "date": "1/14/2018"}, {"text": "Hmmm... where to start. Went out tonight for a quick meal and introduction of my son to cheesecake. We arrived and were greeted quickly and seated. The service was prompt and adequate. <br&gt;<br&gt;After being seated a moment a very nice waitress took our drink orders and entrees. My son (8 years old) ordered the grilled cheese, my wife, the special and myself, the grilled salmon. We chatted and talked about our day until the food arrived a few minutes later. Surprisingly quickly I might say. <br&gt;<br&gt;Side note, for a place with so many menu choices I was personally amazed at how quickly the food arrived. Makes me think they have everything precooked just waiting in the back. That said, it was fairly tasty. <br&gt;<br&gt;After scarfing down our food we thought about the only purpose for our visiting this establishment -- the cheesecake. As we perused the menu my son spotted what he&amp;#39;d been looking for, Oreo Cheesecake. So we ordered a piece. Well needless to say, it came and was absolutely amazing. The boy was happy, the wife was pleased and I was satisfied. <br&gt;<br&gt;Overall a great night... then the bill came. Why is it that the bill is always such a surprise?  A little high for my expectation at $70 but okay, I&amp;#39;m paying for a decent meal here. Can&amp;#39;t complain. The only thing I regret was not getting a pic of the glorious cake before we dug in.", "rating": 4, "date": "6/21/2018"}, {"text": "Rude receptionist<br&gt;I ask if I can have table right next to window, he just said &amp;#34;no&amp;#34;without checking the system. It is 11:00am and only few people in the Resturant.", "rating": 1, "date": "1/5/2019"}, {"text": "Not a big fan of this chain restaurant. The food never comes out the exact same way as it would the previous time. Over the course of ten years I have had food poisoning twice from this restaurant l. I truly believe it is because of cross contamination, therefore I decided I don&amp;#39;t want to eat here anymore.", "rating": 2, "date": "3/10/2019"}, {"text": "I understand that we are being tested right now and we should give grace to those that are trying to provide a service. This is the last time for this restaurant. This is not the first time encountering horrible service from The Cheesecake Factory but it will be the last. Friday, Apr 17 I attempted to order from your online menu. It kept giving me an error. I called the restaurant and they quickly said well I can get in try again. I hung up and kept trying. I have used this app more times than I would like to admit so I am familiar. I called back and said it is not working can you please take my order. An hour and 3 Cheesecake Factory calls I was still left without food on my birthday! This may seem trivial to you but this is the same type of experience that I have received at carry out and the host desk before. If I dine in it is a better experience. Thankfully Panera bread and Rafferty were able to care for the two of us. Excellent service!", "rating": 1, "date": "4/19/2020"}, {"text": "Many people will roll their eyes when you say Cheesecake Factory. My experience there despite the extensive weight at times have always been good. And, actually if you can swing it getting a seat at the bar will get you not only good service but fast food.<br&gt;<br&gt;These days I am highly recommending the Cajun bites with the mashed potato and roasted corn succotash. There&amp;#39;s enough there for at least two meals if not two meals in a lunch!<br&gt;<br&gt;The bartenders despite being super busy are super helpful, knowledgeable, and have a great sense of humor despite the amazing volume of work that <a href=\"/redir?url=http%3A%2F%2Fthey.do&amp;amp;s=0e8f348764bb4735a9ae4a41b69d79d4bfeb05fc0826d36a6895a29198f4df78\" target=\"_blank\" rel=\"nofollow\"&gt;they.do</a&gt;.<br&gt;<br&gt;Another good way to get food from here is order it online and then pick it up at the Cheesecake counter although I have had super slow experiences there but again not their fault given the volume of people to come to their doors every day!", "rating": 3, "date": "1/14/2019"}, {"text": "Their service and organization is an absolute train wreck. Placed an order on line, was given an &amp;#34;it will be ready by&amp;#34; time, and literally 2+ hours beyond that I was still waiting for the food. Not one offer of a discount to the food for the wait or anything of that sort. There is no food worth this kind of terrible customer experience.", "rating": 1, "date": "5/10/2020"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory on many different occasions and each time I&amp;#39;m reminded why I rarely go there.  What fun is it to wait nearly an hour to eat over-priced, mediocre food with inconsistent service?  I don&amp;#39;t blame the cooks at the Cheesecake Factory.  I think when you have a menu with over a hundred items on it - it&amp;#39;s hard to make dishes stand out.  So everything I&amp;#39;ve ever had on the menu has just been...okay.  I&amp;#39;ve never ordered anything a second time if that says anything.  <br&gt;<br&gt;At my most recent trip I had the Jamaican chicken and shrimp.  It was fine - but it was barely warm when it came to the table and the rice was hard.  However, I liked the spice on the dish and the marinated pineapple was a nice touch.  Our server - well, she just couldn&amp;#39;t be bothered.  It took several minutes for her to approach the table and another ten minutes to get our waters.  She wasn&amp;#39;t friendly or engaging.  She didn&amp;#39;t smile.  She wasn&amp;#39;t necessarily rude, but not exactly a good representative of the company.  <br&gt;<br&gt;Alright, let&amp;#39;s talk what is good and the only reason this place gets three stars - and it&amp;#39;s the cheesecake.  They have a huge variety of cheesecake ranging from plain Jane, strawberry, vanilla, Oreo, red velvet cake, snickers, Godiva chocolate, and the list goes on and on.  I used to be a huge fan of the holiday cheesecake - pumpkin pecan cheesecake.  However, the last two times I&amp;#39;ve ordered it - it tasted of bitter, old pecans.  The pecans that you let go rancid and then they had a nasty aftertaste.  Yeah, those.  But I&amp;#39;ve had red velvet, carrot cake, vanilla bean, Godiva, and raspberry lemon with all good results.  <br&gt;<br&gt;Bottom line - with so many wonderfully amazing restaurants in Louisville, the Cheesecake Factory just can&amp;#39;t hang.  I suggest skipping the food because it&amp;#39;s simply not worth it.  They have a counter where you can order cheesecake slices to go.  That&amp;#39;s your best bet.", "rating": 3, "date": "11/21/2017"}, {"text": "Pretty much every Sunday we order take out from here and it&amp;#39;s always top notch. I&amp;#39;m not usually a cheesecake person but I love that they have options that are a mix of regular cake as well ...the lemon raspberry is my go to and is beyond yummy. The prices here are definitely on the higher side considering this isn&amp;#39;t fine dining, but depending on what you get it can be worth it. Plus the portions here are huge so you will have a meal for later. <br&gt;My favorite part of the restaurant are definitely the staff. Everyone is lovely and accommodating. I personally love Shelby, who works at the take out area and is such a doll! We look forward to seeing and chatting with her whilst we wait for our cheesecakes. Overall always a good experience!", "rating": 4, "date": "10/10/2018"}, {"text": "We have been waiting an hour and literally half of the tables are empty in this restaurant. Very poor customer service! Very frustrating.", "rating": 1, "date": "4/28/2019"}, {"text": "Literally the best waffle I have ever eaten.  I told my husband it will be my last meal if given the option.  My husband got the monte Crisco and the French toast was amazing.  I love the breakfast here.  If you have never eaten the brunch, do so.  You won&amp;#39;t regret it.  My kids loved their burgers as well.  And the fruit for kids places are perfect.  They are chopped up so not a choking hazard.  The waiter staff is hit or miss.  Some great, some not so great.  Food totally with any bad service... ha!", "rating": 5, "date": "9/28/2019"}, {"text": "Have been to this location a handful of times. The food is pretty reliably good, but the cheesecake is the definite draw. The Buffalo blasts and fried Mac n cheese apps are solid, albeit pricey for portions. Good entrees have included: Americana burger, four cheese pasta, chicken carbonara, Cajun chicken littles. The Renee&amp;#39;s special was just ok. Good sandwich and soup, but salad is meh. Sandwich portion was tiny for a $13 meal. <br&gt;<br&gt;The biggest con of TCF for me are the prices. A lot of their entrees and appetizers are really overpriced. Their Cheesecake sizes (depending on flavor) can be vastly different but they all cost $8 per slice. <br&gt;<br&gt;Most recent visit, got the chicken littles dinner which was $15.50. Got a great portion of chicken, but didn&amp;#39;t know until my check that subbing Mac n cheese as a side brought the entree to 18.75! Seriously? Splitting the app, getting this entree and a slice of cheesecake set me back $40 for just my check. For me, TCF is a once in awhile place, not a regular go-to, and that&amp;#39;s almost entirely because they are overpriced.", "rating": 3, "date": "1/14/2017"}, {"text": "Lettuce wraps.. YUM! Good atmosphere, clean restrooms, 5/5 for overall cleanliness. However, my dad couldn&amp;#39;t get past the manager (blue shirt) leaving the restroom without washing his hands. That&amp;#39;s a huge red flag! Hope he had some cheesecake hand sanitizer lol", "rating": 5, "date": "10/12/2018"}, {"text": "I don&amp;#39;t know what happened to this place or if it was the day 2/23/20, but the food was average. My daughters honey truffle chicken was very oily, you could see it plainly. The server that brought it slung it on the table like, here&amp;#39;s you food with attitude. They forgot my wasabe mashed potatoes that went with my hibachi steak, how can you forget that when you pick it up, there is a big void on the plate where it goes! So, anyway the 2 previous times we were there were great, well one in Louisville and one in Fredericksburg, MD. This time, not a great experience, and it so happened to be my daughter&amp;#39;s b-day. So in the future we decided to do our own cooking at home for better value, safety and pleasure, I wish we did take photos. No way that chicken should have been that oily.", "rating": 2, "date": "3/10/2020"}, {"text": "I really like it here. The service is always right on and I don&amp;#39;t know of any other place that has these lettuce wraps that are so good. The laidback atmosphere and unique decor are very pleasant. And to top it off I took home a big size of turtle cheesecake. Very worth the price. I will be back.", "rating": 4, "date": "10/2/2018"}, {"text": "This was my first time here after hearing about it for years. When you walk in its very beautiful and clean, date night kind of atmosphere(but kid friendly). To start we had the macncheese balls and eggroll sampler. The mac balls were the best I have eaten, for the sampler I liked two out of the four the best but all were good. I had the chicken parm&amp;#34;pizza style&amp;#34; and man was it delicious! My boyfriend had the cheesesteak and fries. The cheesesteak was just okay nothing out of this world but the fries were good not just boring ol fries. For last we had to take a couple slices of cheesecake home and it was the best I have ever had. Overall I am very satisfied with the food and the fast service. We only we&amp;#39;re here for about an hour and our waitress was very friendly and helpful.", "rating": 5, "date": "9/27/2018"}, {"text": "Any fan of The Big Bang Theory knows The Cheesecake Factory features prominently in the series... And, things like the enormous size of the establishment&amp;#39;s menu are sometimes discussed.  Having never been to one before, when we found one on our recent trip to Kentucky, we just HAD TO go!<br&gt;<br&gt;It was after noon on a Saturday and the place was HOPPING.  We had a rather large party, so it was a bit of a wait for a table, but, to be honest, they told us 15 minutes, and it didn&amp;#39;t take more than 5.  This allowed us ample time to drool over their Cheesecake display... which is dangerously extensive!  In addition, and I&amp;#39;m not sure if all Cheesecake Factories look alike, but, the decor in this one was an entertainment in itself.  It seriously looked like it belonged in Vegas!<br&gt;<br&gt;Once seated, they were quick to bring us our drink orders and VERY understanding after we sent them away twice so we could read through the book, and I do mean BOOK, that is their menu.  The jokes are true folks... their menu is crazy.  You can pretty much find anything you might be craving...<br&gt;<br&gt;This too, was my first experience with ordering beverages in Kentucky, which was a 2 fold learning experience...  <br&gt;<br&gt;#1 - They do eveything big here and drinks are no exception.  I&amp;#39;m used to having to practically beg for a tiny glass of water everywhere I go in California, but here... they mean business.  You want water?  You get a GIANT glass!  <br&gt;<br&gt;#2 - Sweet Tea versus Unsweet Tea.  If you order Iced Tea, there&amp;#39;s a slight assumption you mean Sweet Tea... If you want what I call Iced Tea... you have to order Unsweet Tea.  Not a big deal, just took my brain a little bit of getting used to.  Also, I had a sip of some sweet tea and damn, do they mean it!  So, if you don&amp;#39;t want to drink tea flavored sugar water, you might want to pass!  And, since they make Tea sweet, I don&amp;#39;t think they get that people might want to sweeten it themselves because there never seemed to be packets of sugar or sweetener anywhere we went... I never ordered coffee, but maybe they bring you some then?<br&gt;<br&gt;Ok, I digress.  We all ordered something different and I will say, despite service being friendly, and them refilling our ginormous drinks promptly whenever we drank 1/2 the glass, no matter what we ordered, the food took FOREVER.  We were later told that Well Done burgers take a minimum of 20 minutes to cook.  Odd.. but... ok...  Since a number of us ordered burgers, we were the hold up?  Also, true to form, everyone at the table was served, except for my husband, despite him ordering what was arguably the simplest thing at the table... We&amp;#39;re not sure why, but this happens to him... a lot!  And, once his food DID arrive they brought it out in stages... which consequently meant he got an extra side dish...  I guess that made up for him having to watch us all eat for 5 minutes?<br&gt;<br&gt;I ordered a Mac &amp;amp; Cheese Burger because I&amp;#39;d had one at a posh joint in Denver and was pretty disappointed.  I was curious if a chain like The Cheesecake Factory could improve on it, and do it cheaper... and boy, did they!  It was arguably the cheesiest burger I&amp;#39;ve ever had.  I had subbed in a side of Sweet Potato Fries and those were excellent as well.  A friend of ours at the table had never had Sweet Potato fries and I guess the ones at Cheesecake Factory made him a believer, because he&amp;#39;s ordering them everywhere now!<br&gt;<br&gt;Everyone seemed to enjoy their choices and we were all stuffed... which was kind of a bummer... I wanted Cheesecake!  Then again... how could you ever choose what kind to try?!?", "rating": 4, "date": "8/26/2016"}, {"text": "The second I walked in I was amazed by the atmosphere. This restaurant is beautiful and feels enchanting. We had the most amazing waiter who took the time to explain in detail a variety of dishes. Food was flavorful and cooked to perfection. The only negative comment I could make is that my daughter refused to eat her spaghetti and meat balls. We thought she was just being picky and reheated it after we got home only to realize it was actually too salty for her to eat. We ordered the 6 inch raspberry white chocolate cheesecake to go. This cheesecake is amazing! The 6 inch was more than enough for the 4 of us.", "rating": 4, "date": "8/25/2018"}, {"text": "This place was amazing. I may be the only person in the world that has not visited until recently. Although choosing was relatively hard with their book menu. I have a inkling that anything I chose would have been great. Only regret not choosing a martini", "rating": 4, "date": "11/26/2018"}, {"text": "I really enjoy this place but sometimes I&amp;#39;m frightened of it, to be honest. Basically, this place is &amp;#39;okay&amp;#39; and in Louisville you need to put a good foot forward with so many independent places.  <br&gt;<br&gt;First, it&amp;#39;s super large and loud.  It&amp;#39;s usually hard to hear the person you&amp;#39;re eating with.  I don&amp;#39;t get to eat with other human beings often so I want to also have a conversation with them.  The interior design is garish and distracting.  <br&gt;<br&gt;Their food is okay - it&amp;#39;s good but not, &amp;#34;OMG&amp;#34; or any conjugation of amazing.  It&amp;#39;s what you expect and since it&amp;#39;s uniform from sea to shining see I&amp;#39;m pretty sure it comes out of a freezer.  <br&gt;<br&gt;Also, their cheesecake selection is why we come here.  It&amp;#39;s a lot of fun.  There are too many choices which is never a bad thing at dessert.  I like the cheesecakes pared with fruit but I&amp;#39;ve never had a bad one. <br&gt;<br&gt;I&amp;#39;ll keep coming back because loads of people like it but I don&amp;#39;t know that I&amp;#39;d pick this on my own.", "rating": 3, "date": "8/21/2016"}, {"text": "Good food but absolutely terrible service. Curbside to go is awful--from how long it takes them to take your call to how long it takes for orders to come out. We&amp;#39;ve given them several chances. Go somewhere else that appreciates your business.", "rating": 2, "date": "6/2/2019"}, {"text": "I have gone to the Cheesecake Factory multiple times..usually to get the cheesecake..they have so many varieties and flavors..they are delicious..the Tiramisu is sweet and tasty..the Dulce de Leche is to die for..<br&gt;As far as the restaurant food itself..it&amp;#39;s nothing to write home about..got the Alfredo I believe..kinda of bland and nothing I would order again..nice atmosphere to be honest!!  I love returning here..the staff is polite and helpful!!!", "rating": 4, "date": "7/30/2018"}, {"text": "Unable to go to link you are asking me to go to. No place for general questions after clicking connect.  If you would like to speak directly with me give me a number with a direct line?", "rating": 2, "date": "1/29/2019"}, {"text": "Host was rude. He should have left his attitude or whatever he had going on at home. Don&amp;#39;t bring it to work. Our server was overwhelmed with tables and was not able to provide any type decent service. There were other servers just standing around instead of helping. Teamwork is the key. Only the guest suffer. I will be returning but only for carry out.", "rating": 2, "date": "8/4/2018"}, {"text": "I was looking forward to my lunch today, but ended up with a subpar experience. I&amp;#39;m in a soft cast, so wanted to do the Curbside takeout to be easy. After 10 min on hold, someone finally took my simple order of the flatbread/salad combo. I was told to come by and park in 20 min, and call back to let them know I was there. I was there in 25 min, called, and then waited in my car for another 20 min and had to call back to get someone to come outside. I&amp;#39;m staying at the hotel basically across the street, and got back to my room to find my flatbread was ice cold and stuck to the cardboard box because it had been in there so long, and there was no silverware or napkins provided. Hard to eat the salad without that. This isn&amp;#39;t my first experience with this location, and they always seem understaffed with inconsistent food.  For sure not worth my time or my $30.", "rating": 1, "date": "1/30/2020"}, {"text": "I&amp;#39;m not too much of a fan of big chain restaurants. I feel they&amp;#39;ve let me down far too many times at this point. The first was Wolfgang Puck, then TGI Friday&amp;#39;s, and now ol&amp;#39; Cheesecake Factory. I hate writing bad reviews. I like having good food. <br&gt;<br&gt;We started with appetizers and were considering how expensive everything is. Should be good right? For what I&amp;#39;m paying for? Quality and tasty food? It let me down. I had a great time here because I came with fantastic company. But the grub was not up to standard. I can make a much better meal from pantry items on the fly.<br&gt;<br&gt;We started with stuffed mushrooms, and the firecracker salmon. The stuffed mushrooms were decent. No real complaint there I suppose. A bit greasy but tasty nonetheless. Now the firecracker salmon was another story. I have to show you and let you decide. Considering what we expected versus what we received... it was a strong fail. Just by the looks of it. Greasy, disproportional portions and oh so sloppy. I thought our waitress just didn&amp;#39;t carry it over straight, so the dish just slid to one side.<br&gt;<br&gt;Then there was the chicken pasta da Vinci. It was just plain pasta noodles with some mushrooms and some chicken. Now this is where I swear I can do better with pantry items. One box of pasta cooked al dente. One can of campbells cream of mushroom and a half can of water. Some fresh whole mushrooms sliced up and sautéed in butter and a bit of salt... And some chicken. Any chicken. Even canned chunk chicken drained and rinsed. Cook it up and serve it. It would be more flavorful than this pasta dish at Cheesecake Factory, and less greasy. It just wasn&amp;#39;t very flavorful. And the amount of chicken and mushrooms in my dish was pitiful.<br&gt;<br&gt;For the price, it could&amp;#39;ve had a garden salad or something thrown in. I feel like I ate unhealthy food, and yet it wasn&amp;#39;t rewarding... like a dirty food truck taco would&amp;#39;ve been a better way to go than this faux fancy place. <br&gt;<br&gt;There are so many restaurateurs in Louisville at a similar price point. I just don&amp;#39;t see the point in spending so much and getting so little in return. Plus, I didn&amp;#39;t feel a whole lot of love from our waitress.<br&gt;<br&gt;The cheesecake was good though. One star for that! I won&amp;#39;t be back though. I want a good pasta place in Louisville... one that makes the pasta in house. If I was by myself, I might&amp;#39;ve sent a dish back.", "rating": 1, "date": "4/30/2017"}, {"text": "This is a fun chain. The place is huge and clean and the staff is pretty good. What I like more than the cheesecake is the pasta though. It all tastes so good. And the portions are huge so you can order a half size and still be full. The prices aren&amp;#39;t bad either. A fun place to go for a nice dinner.", "rating": 4, "date": "9/11/2018"}, {"text": "Overall good, the food was great as always and the menu selection is incomparable. The service was a little sluggish tonight but overall it will not deter us from dining here again! Still one of my favorite restaurants!", "rating": 4, "date": "9/21/2018"}, {"text": "Went for lunch yesterday. There were 3 in our party. Andrea was our server and I couldn&amp;#39;t rate her more highly. Attentive, answered all our questions, asked some of her own, then made recommendations. The food was spot on. Place was clean. We were very impressed. Will definitely go again and hopefully we will get the same server. Hopefully The Cheesecake Factory sees what a gem they have with Andrea as she really is fantastic and represented company well.", "rating": 5, "date": "1/19/2020"}, {"text": "One of my favorite places!! Great fried Mac and cheese balls. Cheese cake to die for!!!", "rating": 5, "date": "6/28/2019"}, {"text": "I&amp;#39;ve been here once and it was around 2:30-3pm. I was surprised to find a bunch (10?) of people waiting. We were given an estimated 20 minute wait. Ironically, there were lots of open tables. I guess wait staff is limited so they make you wait. Its notable that once seated, we waited a LOT to order. When he showed up, he seemed a bit peeved. <br&gt;<br&gt;We had appetizers (which were pretty good and better than the desserts) and desserts. Our waiter never came back to offer refills or inquire about drinks. I was planning to order a cocktail but it took him so long to come back that I decided not to and we were ready to head out. Our desserts were ok...8.50 each for them..<br&gt;<br&gt;Moving on...", "rating": 3, "date": "7/6/2018"}, {"text": "Overpriced suburban wasteland of a restaurant where the food sucks. We got here at 7 and by the time we left it was almost 11 pm! We waited 2 hours for our table, but we were a large party so that was understandable for a Saturday I guess? <br&gt;<br&gt;My husband and I both got pasta dishes. My husband got Chicken Alfredo, the chicken was flavorless, sauce was watery and bland. I ordered Chicken Romano. The chicken was moist, but the breading peeled right off and was soggy, not much flavor there. The pasta was dry like it had been microwaved or was sitting under a heat lamp for a while. The sauce had no tomato flavor even though it was supposed to be a cream tomato sauce, the cheese/creamy flavor wasn&amp;#39;t there either and it was way too sweet no acidity-everything about it was disappointing.                        <br&gt;I requested the manager because of the food and she offered a complimentary piece of cheesecake. We ended up ordering extra cheesecake and wanted it all to go. We waited 30 minutes for our checks and eventually the cheesecake we bought. But I had to remind the waiter about the and finally the manager brought the complimentary cheesecake to me, which I appreciate- that said, should I have to remind them to bring a piece of cheesecake that was supposed to remedy the bad dining experience?<br&gt;<br&gt;The cheesecake was good but not the best I&amp;#39;ve had, so overall not worth the pain of the meal and service we had to endure.", "rating": 1, "date": "4/6/2019"}, {"text": "This restaurants service is SO SLOW. took my mom, her best friend, and I amost an hour to get our appetizers/ entrees and the waiter was rude as well. He would come up to our table and mumble things to us in which we couldn&amp;#39;t understand.", "rating": 2, "date": "4/4/2019"}, {"text": "Let me start by saying this is alongside Bonefish Grill as the only restaurants that aren&amp;#39;t corporate I will visit!!!! Everything on their menu makes me drool and has me day dreaming about their food... daily!<br&gt;<br&gt;My personal favorites for appetizers are the avocado egg rolls, FRIED MAC &amp;amp; CHEESE BALLS, buffalo blasts, corn cakes, crab won tons, fried zucchini, sauteed mushrooms, or the crab cakes... you really can&amp;#39;t go wrong!!!", "rating": 5, "date": "6/3/2017"}, {"text": "Refuses to take reservations for a Saturday night wedding rehearsal dinner with 25. <br&gt;<br&gt;Cheesecake and food is always good though. Wish we could&amp;#39;ve enjoyed it with all of our family and friends.", "rating": 1, "date": "10/7/2018"}, {"text": "Worst experience ever! Ordered through Seamless/ Grubhub.<br&gt;Inedible food, missing food including the desserts. Cheesecake Factory points fingers at driver. Seamless Grubhub say driver not responsible. <br&gt;In the end total expensive garbage.<br&gt;Hockey puck burgers, no fries.<br&gt;Mayo when specifically requested no mayo on burgers. Not even ketchup and I&amp;#39;m in hotel.<br&gt;Run from this place!! Forget ever using Seamless/Grubhub. Incompetent morons.", "rating": 1, "date": "3/11/2018"}, {"text": "Orange chicken is the word for bird, the orange zest was not ovet powering and rice cooked to perfection. Get extra sauce it&amp;#39;s a must combine with pineapple mojito and my life is worth living.", "rating": 5, "date": "7/13/2018"}, {"text": "I had a great experience at the cheesecake factory all three times I have eaten there. <br&gt;<br&gt;Last time i was there, my server Rob did an exceptional job taking care of us. We came in an hour before close and when i come in late I always worry I&amp;#39;m going to have a server who is ready to go home and treats us poorly but this was not the case with Rob. He was kind, thorough and did not make us feel rushed or unwanted. Our experience with Meagan was similar and we left happy that time as well. I cant remember the servers name the other time but I remember it was a good experience then also.<br&gt;<br&gt;The booths are large and the lighting is dim but not too dim, and the place is clean and roomy. The music is not obnoxiously loud and the menus are full of delicious choices.<br&gt;I was sad to see that they were out of a couple things i was interested in trying two of the times but its understandable with it being later in the evening and because this place makes almost everything fresh. Also, there were plenty of other options for me. Being pescatarian, I am thrilled to have more than 2 or 3 options and everything i have tried was delicious. My boyfriend who is not pescatarian loved everything he has tried besides the fried avocado as it was a bit plain. <br&gt;<br&gt;Cheesecake factory, all in all, is a great place to try. Be ready to spend a good amount of money but get ready to have a new late night spot to frequent if you havent already tried this place!", "rating": 5, "date": "4/11/2018"}, {"text": "Returned to the Cheesecake Factory because it was convenient to our main destination.<br&gt;I&amp;#39;m glad we did because I got the opportunity to try their White Chicken Chili. Slightly spicy, full of chunks of chicken and various bits of vegetables, this chili surrounds a mound of rice and hits the spot if you like a little spice in your life. Served with the bread and butter, I wolfed mine down.<br&gt;Service was very friendly and helpful. And as an ending my wife and I shared a White Chocolate, Macadamia Nut, Caramel Cheesecake. I know, it was evil,,,, but good.<br&gt;The only reason I gave it a 4 instead of a 5 was because there were too many offerings on the menu to digest in the short period of time we had.<br&gt;We&amp;#39;ll have to go back now and see what else they have to offer.", "rating": 4, "date": "4/9/2018"}, {"text": "As someone who rarely goes to the Cheesecake Factory it was a very interesting experience when we went last time! The server was great but as we were sitting there a fight broke out in the back of the restaurant with employees. After that I was ready to leave. I will probably not come back to the Louisville location again!", "rating": 2, "date": "10/14/2019"}, {"text": "Singh January him that for training savvy Troy is him Coco ink ten hours doing June him in go office to find a him go confirm good visit coming doing home with boo hoo doing home gonna Bonnie didn&amp;#39;t do good v dunno Coco dildo condo going fine condo going fine condo doing video from y buy buy j him", "rating": 4, "date": "12/22/2018"}, {"text": "First thing first, I&amp;#39;m a serial Cheesecake fac. Connoisseur. Been to many CCF around the USA (amongst others) and can assure you that this location is by far the best, for a number of reasons. <br&gt;Service is immaculate with a tremendous emphasis to detail. (Other locations, especially Chicago and Cincy should take note). Food is always fresh and perfectly made (they actually listen to your request) <br&gt;Servers are immaculate and the management first class. The menu is too extensive to review, I do however recommend the Chicken Madeira and medallion steak combo, With the fried Calamari and chicken samosas. Food always tastes the same no matter what day of the week it is. <br&gt;It&amp;#39;s one of my fav. Chains of restaurants, at least while I reside here in Louisville. 10+", "rating": 5, "date": "7/20/2018"}, {"text": "Food was good, nothing special but the menu is so vast there could be plenty of really good dishes.  Our main issue was service.  4 pm on a Monday and a near empty restraunt, 10 minute wait for a party of 2, so they can find a table for 2 people.  Ordering was quick and our apps came out fast but then we felt ignored.  My drink sat empty for 15 minutes and hers for 10. Our food arrived by a different(and rude)....waitress? Not sure. She left our grilled asparagus in the kitchen so she went to get that and dropped it off at the table while delivering another table&amp;#39;s dessert so we still didn&amp;#39;t get a refill. After ordering dessert we paid the check, dessert came, and when we were ready to leave we waited for our waiter to ask for boxes, only to find out 15 to 20 minutes later that he had gone home.", "rating": 3, "date": "6/23/2019"}, {"text": "I love the lighter fare at the Cheesecake Factory. But even after a light and healthy meal,  i just can&amp;#39;t resist cheesecake.  I mean, with flavors like s&amp;#39;mores,    salted caramel, carrot cake cheesecakes, you can&amp;#39;t go wrong.  Service was fine,  nothing negative,  but neither was it outstanding. I don&amp;#39;t come here frequently but i will continue to eat here multiple times a year.", "rating": 5, "date": "11/4/2018"}, {"text": "Prepare to spend a long time here - not necessarily because service is slow, but their expansive menu takes time to read and digest. My main issue is with so many options how do you choose? In addition, they tend to be hit or miss. The American options are really good, but the Chinese and Mexican options are sub par.<br&gt;<br&gt;My most recent visit was with a large group of about 15. I ordered the Steak Diane and it was delicious. The steak was cooked perfectly, the sauce added a ton of flavor and the mashed potatoes were really good. In addition, I was able to sample a number of appetizers. The crab dip was not very good. It had a very fishy taste and was pretty bland tasting. No one liked it. The spinach dip had an overwhelmingly taste of spinach, which some people like. I was not a fan. The chicken blast were awesome. Probably the highlight of our lunch. Basically, they take buffalo chicken dip and then they fry it. Served with a delicious buffalo sauce and ranch. Lastly, we had the loaded/stuffed tots. Tater tots stuffed with a loaded baked potato. Also very good (especially with the spicy mayo).<br&gt;<br&gt;Everyone&amp;#39;s entree looked good. I can&amp;#39;t wait to go back and try the mac and cheese burger. The fish and shrimp tacos both received praise and I would like to try these as well. As noted above, stay away from the burritos and the orange chicken dishes.<br&gt;<br&gt;The main draw is of course dessert. I was able to sample a variety of cheesecake and they were all phenomenal. I don&amp;#39;t remember the names, but the salted caramel was good as was the lemon raspberry. Our group also had a Reese&amp;#39;s, some kind of chocolate turtle, and a chocolate blonde.<br&gt;<br&gt;One server cared for our group of 15 and she did a great job balancing the group with her other tables. Our drinks were refreshed at the halfway point nearly every time. Empty dishes were promptly removed to make space for the next items<br&gt;<br&gt;All in all, this place is great for dessert, but just OK for lunch and dinner. Prices are a little high for what you get. I would recommend for a date night or some kind of occasion.", "rating": 3, "date": "3/14/2017"}, {"text": "I wish I had perfect words for this legacy restaurant. However the foods I&amp;#39;ve ordered and requested low sodium have been off the last few times. <br&gt;<br&gt;Maybe they just can&amp;#39;t alter the recipes to make them taste good without loading then up with salt, salt and then more salt...  <br&gt;<br&gt;The service was spot on with an adorable young server that my wife and I remarked to her that she is a super star and is headed places in her life (an accounting major working her way through college)<br&gt;<br&gt;She won our heart but the food didn&amp;#39;t. <br&gt;<br&gt;Bottom line... don&amp;#39;t even think about going here if you&amp;#39;re trying to eat healthy for the new year.", "rating": 3, "date": "1/13/2018"}, {"text": "Ehhhh, I&amp;#39;ve been to a lot of Cheesecake factories and while this one isn&amp;#39;t terrible, its not amazing either. It&amp;#39;s literally okay... average... basic.<br&gt;<br&gt;Since I&amp;#39;m swearing off junk food for an entire month, I decided my last fatty meal should be cheesecake factory.<br&gt;<br&gt;So we arrive, parking is ridiculous as St Matthews tends to be during the holidays (no stars knocked off for this). There was a 40 minute wait at cheesecake factory which is normal (again, no stars knocked off for this). They handed us one of those devices that vibrate when your table is ready (I don&amp;#39;t know the name!) and we sat down. About 35 minutes later, we hear &amp;#34;table of Lewis, party of 4&amp;#34; so we go up there. <br&gt;<br&gt;We get up there and they say &amp;#34;ohh.... it must of been 2 parties of Lewis for 4 because someone already came up here. We gave your table to the wrong party&amp;#34;   First of all, whats the point of those vibrating devices if they aren&amp;#39;t being used and secondly, the devices have numbers on them. Couldn&amp;#39;t of you just checked their number?! Anyway, my mom makes a big fuss so they sit up promptly. <br&gt;<br&gt;So once we are seated, I ordered the mac n cheese burger and carrot cake. My burger was okay. Honestly, for it to be my last junk food meal of the year... it kinda sucked lol. The burger was so flavorless. I order burgers from cheesecake factory all the time (in other locations) and they always taste great. This burger was missing some seasoning. I feel like anything I eat at this specific cheesecake factory, its never consistent. <br&gt;<br&gt;Would I come back? Probably... its not horrible. Would I be the one to pick this place out when there are so many better places nearby? Probably No.", "rating": 3, "date": "1/3/2017"}, {"text": "Service was Horrible at best. I went to dinner with 1 other person last night. I tip for the level of service I get. I got no service but was generous and left her a tip although it took 30 minutes to pay and leave after we finished our meal. So we finished eating and waited at least 10 if not 15 minutes for her to come by. Then it took another 10 minutes to get our check. We had ordered appetizers and entrees so we just got our dessert to go. She finally brought our bill. We sat there another 10 minutes and I had cash in the car and was about to go get it just so we could leave. At this point we were ready just to leave the cheesecake as he had been so long . Now we were waiting another 15 minutes  before she collected the check. I wondered how long it would be before she brought my card back. She finally did after a few minutes. Then she said let me see if your cheesecake is ready Are you kidding me , I could have gone home and made one on the amount of time I waited. <br&gt;<br&gt;Keep in mind they were not busy. We went in on a Monday night and there was no wait , plenty of empty tables. My goal as a server while working my way through college was to turn those tables as fast as possible and get more people in there. This was clearly not this servers goal. She was not even friendly or smiling more like ok I&amp;#39;m here did you need anything. Servers name on check was Jordan T.<br&gt;What was to be a simple dinner out turned into a almost 1.5 hour ordeal. We didn&amp;#39;t get anything hard to cook. Fried shrimp for my guest (maybe they had to catch the shrimp) I got the Quesadilla and asked for no chilies. what I got was cheese in a tortilla shell. I don&amp;#39;t even complain about that. <br&gt;I just wanted out of here. It will be a very long time before I ever return to this location.", "rating": 1, "date": "2/26/2019"}, {"text": "I was overcharged for what I think was pasta with whatever was leftover in their kitchen sink. Seriously, I could have and have made much better pasta than what they served. It was so disappointing. <br&gt;<br&gt;The meat in my friend&amp;#39;s shepherd&amp;#39;s pie was undercooked and still raw in the middle. It was a late and rainy night so rather than sending our meals back to the kitchen for a do-over, we just paid and left and called in a pizza on our way home. <br&gt;<br&gt;Oh, and the cheesecake we ordered for dessert (and took home with us) was bland and unimpressive. We won&amp;#39;t be going back.", "rating": 1, "date": "3/3/2018"}, {"text": "For a chain restaurant, this is a place I go for special occasions. The food is good, and the desserts (cheesecakes) are obviously AMAZING. The price range should probably be raised, however. The prices are a little steep for dinner (18$ for pasta?) and depending on the cheesecake slices are also high (some slices are 6$, but some are 9$. You won&amp;#39;t know how much it is until you get your receipt, though.) <br&gt;<br&gt;If you want to eat here for a lower price and a shorter wait, go for Saturday brunch. Not only do you get a lower price and an EVEN bigger menu (over 20 pages!?), you can get lunch portions/prices for some of their most popular dishes.", "rating": 3, "date": "1/26/2018"}, {"text": "I was there a couple months ago, ordered 2 burgers and fries, we had a 3 hour window in our busy day so we decided to stop by. We wait 1 hour and 45 minutes until I asked about our food, the waitress suggested making it to go then she dropped off the food with the check, I&amp;#39;m not one to complain but do you really think the right move is to make someone wait almost 2 hours then make them pay on a carry out. I just wanted to enjoy some burgers and cheese cake", "rating": 1, "date": "1/8/2019"}, {"text": "Very nice place to eat and celebrate your birthday, very nice location and dinner was delicious, everyone was friendly and love the mango lime cheesecake, thanks you all.", "rating": 5, "date": "11/25/2017"}, {"text": "Of course this place gets 5 stars. Can I give them 6? We love going here for special occasions or just for a quick lunch, it&amp;#39;s great for either. The atmosphere is fancy but family friendly. Perfect location if you want to shop after &amp;amp; delicious food. Our favorites are the Alfredo &amp;amp; 4 cheese pasta.", "rating": 5, "date": "9/28/2018"}, {"text": "So I know this place for my family growing up was always a big deal. I vividly remember going in and having similar feelings as when we went to Disney Land. Idk why but as a 10 year old kid that&amp;#39;s just how it felt. <br&gt;<br&gt;Anyways, I bought a cheesecake for a special dinner last night. I didn&amp;#39;t dine in so I&amp;#39;m not sure how this particular location is with their food and service.<br&gt;<br&gt;However, the cheesecake we got was the 6 inch classic. Yes, I know we are lame but that&amp;#39;s how it is. <br&gt;Overall, the flavor and texture was good, but I&amp;#39;m not sure that it is 18 dollar worthy. I bought almost the same cheesecake at Kroger on sale for 3 dollars not too long ago and thought that it was just as good as this cheesecake. <br&gt;<br&gt;So quite honestly, I think I&amp;#39;ll stick with Kroger for 3 bucks in the future, but I know for all of you specialty cheesecake fans, this place is probably a quick resolution to your cheesecake needs.", "rating": 3, "date": "2/13/2019"}, {"text": "I&amp;#39;m currently sitting in the restaurant. My waiter is Tom he has only spoke to us twice that was to get our drinks and that was to take our order. I&amp;#39;ve watched him cater to the other two tables he has next to us. I&amp;#39;ve sat here for about 15 minutes waiting just to ask for bread. My fiancé happen to get more water because he heard the sound of a empty cup that&amp;#39;s the only way I was able to get bread. After our meal was at the table is when he asked how was everything afterwards back down to nothing service.", "rating": 1, "date": "9/23/2019"}, {"text": "This will be my third time coming to this restaurant and I can say I haven&amp;#39;t had a bad experience.   The friendly kind greasing we received from the greater. Seated us and provided was a very welcoming feeling.  Our server Mr Casey (might of spelled name wrong) however today was his first day serving. He did an awesome job!! Provided us with nothing but good service. Checked on us while waiting on our food.  The food was very tasty. My baby enjoyed his salmon and mash potatoes. My salad was as good as it looked!! The cheese cake dessert that we took home did not make it home!!", "rating": 5, "date": "8/19/2016"}, {"text": "Great atmosphere,Great people! The bartender was very professional and funny and didn&amp;#39;t miss a beat. We sat at the bar and enjoyed good food,good company and delicious mojitos. My boyfriend had a bourbon drink that he said was good. I had the spicy crispy sandwich with fries,the sandwich was a bit messy with the spicy buffalo mayo,just need it on the side next time,the fries weren&amp;#39;t the freshest but were ok. It was really busy on a Tuesday night. My mother had the orange chicken,it was good until she found a sticker from the oranges in her food. The manager was called and everything was resolved in timely manner.The meal was free and we got a free piece of oreo dream cheesecake. Mistakes happen and we will defintely return.", "rating": 5, "date": "7/13/2018"}, {"text": "I ordered a grilled chicken sandwich but it had bacon in it. Also the avocado egg rolls were sour. I have ordered dishes before  ..not sure what happened now.", "rating": 2, "date": "8/29/2019"}, {"text": "We are all so extra- they handled us well  fun Xmas lunch, good times and food. I got just salad/pizza  $13 strawberries cheesecake was dro", "rating": 5, "date": "12/20/2018"}, {"text": "We had dinner tonight here after a very long day in the office and it was just ok. <br&gt;<br&gt;I typically can take or leave the Cheesecake Factory so I don&amp;#39;t think this review would be any different if I were in my own home town or a different location. <br&gt;<br&gt;The service was decent. Our server was very nice and checked in is regular. The restaurant was clean and well lit, which I always have a problem with at the Cheesecake Factory because it always seems so dark in there. <br&gt;<br&gt;I ordered the buffalo wings and the grilled salmon and they were both ok. However the mashed potatoes with my salmon was like warm and had a huge under cooked potatoes in it. The salmon lacked flavor. I had to put salt and pepper on it and the broccoli which was very hard. Obtaining he food was fresh but really not to my liking. The wings were delicious and he even brought me extra ranch dressing. <br&gt;<br&gt;I give this Cheesecake Factory 3 stars because the food could have been better.", "rating": 3, "date": "7/8/2015"}, {"text": "The evening was lovely , I beautiful young blonde girl smiles and lead us to our table. She suggested the salmon and crab cake appetizer. Toward the end of the meal she recommended we try or take home a slice of vanilla bean cheesecake!what a wonderful experience! We will be back soon to be greeted by the friendly hostess with the best suggestions !", "rating": 5, "date": "11/3/2018"}, {"text": "Again I&amp;#39;ve been a regular here for over a year. I can&amp;#39;t believe I have not left a review.<br&gt;<br&gt;I usually come at 10pm so my experience isn&amp;#39;t the dinner rush! We chill at the bar with Sergio or Jill. They take great care of us as we are here once or twice a week after work.<br&gt;<br&gt;It&amp;#39;s Cheesecake Factory so expect a huge menu with everything you could ever want.<br&gt;<br&gt;I actually eat off the &amp;#39;low calorie&amp;#39; menu. Lots of great options including GF and other health conscious choices. They even have a gluten free cheesecake option!<br&gt;<br&gt;I&amp;#39;ve always been a fan of Cheesecake Factory. It&amp;#39;s a good spot even if it is a chain ;-)", "rating": 5, "date": "4/27/2016"}, {"text": "This was the best place I have ever ate at and would eat at again! It is really fancy and really nice. Me and my whole family loved this restaurant and the waiters and waitresses where so nice", "rating": 5, "date": "7/26/2019"}, {"text": "Oh my lord a date night was needed and the Cheesecake Factory did not disappoint! We started with the avocado, portobello, zucchini fries app and it was SO good! Then I got the buffalo wings which were good and a big portion- but pretty spicy so mind that. My wife got the skinnylicious grilled salmon and said it was delicious- a beautiful plate too. Service was prompt and polite and dessert was amazing as usual.", "rating": 5, "date": "2/21/2016"}, {"text": "I&amp;#39;ve been to this cheesecake factory twice, the first time the food was not impressive at all but the cheesecake was delicious, and the second time the food was amazing and I didn&amp;#39;t end up getting dessert. It is the only location I&amp;#39;ve ever been, but I&amp;#39;m really not crazy about going to such a lovely restaurant in the mall... just my personal preference. I sort of figure if I&amp;#39;m paying those types of prices I would rather have the experience that goes with it, which is hard to do in a mall parking lot. The inside really is quite pretty and since they have such an interesting variety of foods on their menu of definitely be willing to try it again, especially when I&amp;#39;m in the mood for tasty cheesecake.", "rating": 3, "date": "9/1/2017"}, {"text": "Ok this will be a long review. We used to eat at this location very frequently. Lately there&amp;#39;s always an issue with the food. Today we got the ribeye ordered medium well. We sent it back because it was cooked medium rare (more on the rare side). New steak delivered and it was even more under cooked than the first. Not to mention two people at our table got broccoli that was cold and not the least bit tender or seasoned. A manager came over and apologized for the steak but offered no resolution other than to box up a better cooked steak. Didn&amp;#39;t address the mounds of raw broccoli left on the plates. Two stars were only for the cheesecake. Very disappointing for $30 meals.", "rating": 3, "date": "7/20/2019"}, {"text": "This location is okay... it&amp;#39;s almost funny how they are always out of what we want to order. EVEN ON A TUESDAY NIGHT. The service is great but the food is just meh. We ordered chunky avocado with a 1/4 teaspoon of tuna (TUNA tar tar) for $8 and mushy crab balls for $8 (CRISPY crab bites). The portions and names of the food are hilariously inaccurate. The drinks are great and so is the cheesecake!", "rating": 2, "date": "8/15/2017"}, {"text": "Delicious food, good service. Restaurant was mostly clean except for the floor. Looks like it hadn&amp;#39;t been swept or mopped in days. The food was delicious though.", "rating": 4, "date": "8/3/2017"}, {"text": "Only been in just to get cheese cakes for certain occasions, but this time we decided to have dinner here.  Myself and my 2 college kids were out shopping and deiced we finally try them other then take out desserts. <br&gt;The place is very posh for a Mall restaurant, the menu is GIGANTIC took us almost 20 plus minutes to read through it to decide what we like to eat. The server was nice but seemed annoyed we were taking long time to look over the menu. <br&gt;Once we did ordered it took over 40 minutes for our meal to come out, it was really good.<br&gt;My daughter enjoyed the catfish, son had teriyaki chicken but thought had bit to much sauce, I had a Pit Beef Sandwich which was good but some the meat was kinda tough to chew but took home to the dog (he enjoyed it)<br&gt;We all got a slice of cheesecake to take home which all enjoyed later that night.<br&gt;I know they are a chain but sometimes less is more, their menu is almost to big to decide what to eat. <br&gt;Will continue to come for take out cheesecakes but not sure we will come back for meals.", "rating": 3, "date": "6/7/2017"}, {"text": "Franchises aren&amp;#39;t typically my thing, but I&amp;#39;m slightly partial to Cheesecake Factory. The decor is grand in nature with great color, enormous columns, and nice accents. There is some seating where the tables are very close which is not ideal for conversation and you feel that you are eating with another group or family, but asking for a booth can eliminate that issue. <br&gt;<br&gt;If your not willing to look through a book of a menu, it might not be the place for you. The menu is like 40 pages with food from American, Italian, Mexican, Chinese, to Thai and more. They also offer brunch on Sunday (maybe Saturday too) starting at 10:30am. <br&gt;<br&gt;We&amp;#39;ve ordered many many items over the years; Carmela&amp;#39;s Chicken, Farafelle pasta, lemon piccata, bang bang chicken and shrimp, steak tacos made into a burrito upon request, corn fritters, wontons, nachos, Belgian waffles, pear and blue cheese flatbread, and much more. I absolutely love the pasta, an orange chicken, and flatbread. My husband has also very much enjoyed several dishes. The only &amp;#34;knock&amp;#34; on the food is that some  Thai and Indian dishes could have had more flavor. <br&gt;<br&gt;Through the many experiences, I&amp;#39;ve had a few servers that were not as top-notch as other, but very limited. The prices are a little above average the average franchise, but comparable to an Italian franchise. Of course, then there is the endless list of cheesecakes and other decadent desserts.", "rating": 4, "date": "6/16/2017"}, {"text": "I had a gift card that I got from Christmas so I decided to try this place out! I ordered the shrimp platter to go along with 3 slices of cheese cake! Well the shrimp was over cooked! I paid 18.00 and should of gone to Mike Linings! The celebration cheese cake was just OK and I gave the other two away! Food was way over priced and not worth it!", "rating": 1, "date": "3/19/2018"}, {"text": "We waited for around thirty minutes and were sat at a huge corner table. There was only two + one child in a high chair so it was a little odd. I&amp;#39;m not complaining though- too much room is better than too little. The service was wonderful as usual. Everyone was nice, attentive, and inviting. The food was delicious- especially the &amp;#34;Ultimate Red Velvet Cheesecake.&amp;#34; So yummy! It&amp;#39;s kind of pricey.. Especially for lunch, but worth the splurge.", "rating": 4, "date": "3/1/2015"}, {"text": "I took a group of kids for National Cheesecake Day on July 30. On cheesecake day, the Cheesecake Factory always offers half-price pieces of cheesecake. In order to get the half-price discount, you have to dine in. I always look at this as an opportunityto take a group of kids for a real life &amp;#34;sit down&amp;#34; restaurant experience. <br&gt;<br&gt;The Cheesecake Factory is known to be pricey and I work for a non-profit agency. Each year when I take the kids, I make sure to go during a non-peak time. I know the waiters and waitresses work hard for those really big tips off the typical really big bills. Probably lots of folks take advantage of the more affordable cheesecake deal and do what we did. Every year the servers have always been so nice and accommodating. They told us the wait would be 15 to 20 minutes, but we got our table for 7 in about 10 minutes. Long enough for the kids to catch some Pokemon in the lobby. <br&gt;<br&gt;We had an amazing waitress. She wasn&amp;#39;t upset that we only ordered waters to drink. When we sat down I told her we were going to get a few appetizers and then enjoy some of the cheesecake. She seemed happy to serve us. We ordered two pizzas to share. Each pizza had 8 reasonably size slices. She also was quick to refill our drinks and the bread on the table. <br&gt;<br&gt;She checked on us several times, never making us feel rushed, just being attended to. When the cheesecake came out the kids eyes grew large and their mouths nearly dropped to the table. They&amp;#39;d never seen pieces of cheesecake so big. Having some older kiddos with me, I asked if we could get five coffees. She was quick to bring them along with creamer. The kids, many of them having never been to a &amp;#34;fancy restaurant&amp;#34; before were thoroughly impressed with the real creamer.<br&gt;<br&gt;When the check came it was just under $60 for 2 pizzas and 7 slices of cheesecake. As most people do, I slid my credit card into the book and waited for her to take it away. It wasn&amp;#39;t until after I had paid and was calculating the tip that I noticed she didn&amp;#39;t charge us for coffee.  I&amp;#39;m not sure if she recognized that we were not the typical group of cheesecake factory consumers, but I thought that was really cool of her to not include that on the bill.  I super want to include her name in the review, but don&amp;#39;t want to get her in trouble with her boss. So, I&amp;#39;ll just say to the Cheesecake Factory: you have some really great people working for you. She was extremely patient, very kind, and truly made this group of kids first sit down fancy restaurant experience something they will remember for years to come. Plus -- the $20 you saved us on coffee can now be spent on other great experiences for my kids -- so thank you and Happy Cheesecake Day!", "rating": 5, "date": "7/30/2016"}, {"text": "&amp;#34;No wonder this place is so damn popular.&amp;#34;  I thought to myself as I gobbled down more of the chicken cutlet.  <br&gt;<br&gt;This chicken cutlet from the Chicken Bellagio was so good, I told hubby it is a revelation for someone with a tired, choosy foodie mouth like me.  I never order white meat chicken when dining out cuz 9 out of 10 times it is going to be dry.  Well, I finally met that other 1 out of 10 times with this dish!  At the base is a large serving of capellini pasta flavored with basil; add two of those perfectly tender, flavorful chicken cutlets; add a big slice of prosciutto; then top the whole thing with a small mound of arugula salad.  The peppery bite of the arugula and salty prosciutto perfectly complements the chicken.  One bite of this mix will make you want more and more.  And I really appreciate the care and attention that went into the making of this dish.  They even chopped up the arugula so the diner does not have to wrestle with leaves bigger than their mouths!  <br&gt;<br&gt;We also ordered their Chicken Samosas appetizer.  It was the best version of samosas!  It&amp;#39;s probably not authentic since the shell is made of the really thin, crispy skin, but that made it much more appetizer-appropriate.  We loved every bite of it.   <br&gt;<br&gt;Oh, yes, hubby said his Cuban sandwich was awesome as well.  <br&gt;<br&gt;I&amp;#39;m not a huge fan of cheesecakes so I ordered their tiramisu (not the cheesecake version) instead.  Mehhhhh, it was not that impressive.  I don&amp;#39;t like it when restaurants mess with perfection such as adding chocolate sauce to this tiramisu.  The ladyfingers could have been more moist; the mascarpone layer tasted more like pudding...dont think I will get it again.  But I&amp;#39;m sure hubby liked his cheesecake, though. <br&gt;<br&gt;Service was friendly, efficient and perfectly timed.  Our server gave us plenty of time to peruse the extensive menu.  He was always there at the right time for refills.", "rating": 4, "date": "8/9/2012"}, {"text": "I suppose it&amp;#39;s just not my thing. The decor looks like it was done by a diva, golden girl who was off her meds. I had the Baja tacos which were good yet heavy and served with beans that had been left out for a while. My fiancé had the shrimp scampi and it was just horrible. The whole garlic clove she had to navigate around were burnt and ruined the flavor. The menu was also seven pages long and in no obvious order. All in all I don&amp;#39;t understand this place so I&amp;#39;ll give it a neutral rating.", "rating": 3, "date": "2/10/2017"}, {"text": "My friend and I went to Cheesecake Factory yesterday for my birthday lunch. We were trying to decide what to have and we asked our server about their soups. She told us about the two options so we choose the white chicken chili. We each got s bowl of soup and didn&amp;#39;t ask about the cost. I think we both assumed it would be around $6 or 7 dollars each. The soup was good but was not what we considered to be &amp;#34;white&amp;#34; chicken chili. It was a red sauce with the other ingredients found in white chili. It was tasty and a large serving. <br&gt;<br&gt;My friend was picking up the tab and I was paying the tip. She thought the bill was incorrect and asked me to guess how much a bowl of chili cost. Well, I guessed and her response shocked me when she told me how much we were charged. Each bowl was $$15.00!!  Two bowls of chili cost $30.00!! <br&gt;<br&gt;I asked our server if the price was correct and she said yes and their prices are a little high on their soups!  High is an understatement!!  <br&gt;<br&gt;We wouldn&amp;#39;t pay that much even if we were at a high end steakhouse restaurant!  I just want to share my comments and hope someone else learns from my mistake for assuming the cost   I guess I&amp;#39;ll have to ask in the future!", "rating": 3, "date": "2/23/2018"}, {"text": "If you&amp;#39;ve ever been here before nothing needs to be said. In case you have not, you owe yourself to try it out. <br&gt;<br&gt;I have been a loyal patron and big fan of Cheesecake Factory since I first visited the then new location in Marina del Rey, CA back around 1983. It never ever disappoints. The food is outstanding,  portions are over the top huge, and the service is too notch, all at a very reasonable price. <br&gt;<br&gt;I could literally eat here every day for an entire month, never order the same item twice, and be very satisfied. Some fan favorites are Chicken Costoletta, Orange Chicken, Buffalo Blasts, TexMex Eggrolls, Crispy Mac and Cheese Balls, Sante Fe Salad, Firecracker Salmon...the list goes on and on. <br&gt;<br&gt;Don&amp;#39;t forget to save room for one of the many varieties of their namesake cheesecake! Plan on taking a doggie bag home.", "rating": 5, "date": "9/9/2014"}, {"text": "The food is always good. Never disappoints. However, the staff is very slow. We had to get another waiter to fill our drinks and bread! We see our waitress talking to another table for 10 minutes! When you spend over $50 for dinner you would think the waitress would know the tip meter is going down if you can&amp;#39;t even bother to ask if we refills!", "rating": 3, "date": "4/17/2018"}, {"text": "This place&amp;#39;s food is usually excellent, but I can&amp;#39;t say it was this time. This most recent time I went my pasta was drowning in basil, my mother&amp;#39;s breaded shrimp was soggy, but other than that our food was great. These mishaps won&amp;#39;t stop me from coming here again, I just hope next I come here my food will be more satisfying.", "rating": 4, "date": "7/3/2018"}, {"text": "I&amp;#39;ve been twice, but last night was the first time I actually got the cheesecake.  My daughter and I got a piece to go and three of us shared it.  It was marvelous.  The food though is just okay.  The menu is seriously about 20 pages long it is so big.  I have never seen any other restaurants with that many choices.  I couldn&amp;#39;t decide so we just got the buffalo wings.  The smell of the sauce was so strong it burned my nose hairs, but they weren&amp;#39;t too spicy to eat.  The blue cheese dip was great and tasted homemade.  The service was not so great.  Our waitress checked on us often in the beginning to see if we wanted to order an actual meal, but after we got our wings it was about 30 minutes before she ever checked on us again.  So, when she finally came, that&amp;#39;s why I ordered the cheesecake to go.  We had already been there an hour and a half with just the chicken wings and one beer.", "rating": 3, "date": "8/16/2014"}, {"text": "The Cheese cake factories was not what I had expected. The food was not that great.  I wait for 40  minutes just to be serve warm food. However, my waiter was awesome!", "rating": 3, "date": "1/7/2017"}, {"text": "Cleavon, is the dopest server I&amp;#39;ve ever meet hear at cheesecake! He needs a raise!  He is will to do anything to make us happy and feels bad for the bartender not making our table happy! But as i said he is an amazing server!", "rating": 5, "date": "4/7/2019"}, {"text": "I will never eat at this place again. I have eaten at cheesecake factory&amp;#39;s all over the world and have never experienced such poor customer service from a hostess, but also from the GENERAL MANAGER. VERY RUDE and unapologetic for his lack of customer service skills. And after talking with a few others who were dining they felt the same. Not to mention the silverware and plates were dirty. My fried macaroni appetizer was over cooked and dry. And floor was dirty. No one attempted to clean it the entire hour we were there...What a horrible graduation for my niece to have to see me frustrated because I hate this particular location of cheese cake factory. When ever this location removes the current General Manager named Bill Lockhart then I may consider trying this cheesecake Factory again", "rating": 1, "date": "6/2/2018"}, {"text": "It&amp;#39;s always pretty dark and noisy inside. If you get seated at a table instead of a booth be prepared to practically be sitting on top of the party next to you. Not very enjoyable. The food and service are average, but the cheesecake is pretty great!", "rating": 3, "date": "2/5/2018"}, {"text": "The cheesecake was great got it to go because we actually wanted to see what it looked like. Seriously though if the lights were any lower they would be off. But the fact that you can&amp;#39;t see the food isn&amp;#39;t too much of a problem because it just helps make it easier to forget.", "rating": 2, "date": "1/16/2017"}, {"text": "The food is pricey and just tastes okay.  There was nothing special about it and I probably will never return.", "rating": 3, "date": "6/5/2018"}, {"text": "The hubs and I have started a brunch tradition on Sunday&amp;#39;s since we&amp;#39;re both off of work. We had a gift card to the Cheesecake Factory so this seemed the perfect time to use it. We both got mimosas which were delicious but that was pretty much the only thing that stood out. <br&gt;<br&gt;I got a monte cristo which is a crispy French toast sandwich that has ham and cheese in it and is served with preserves. It&amp;#39;s a super interesting sandwich and the flavors were good. It was just kind of average though, nothing spectacular. You do get a MASSIVE amount of food though. I also got potatoes which were overly salty. <br&gt;<br&gt;I think we&amp;#39;ll stick to trying local places.", "rating": 3, "date": "11/10/2015"}, {"text": "this is a very good place peppa pig tried to steal cheesecake so i said no peppa and then she farted she said it tickled i said same", "rating": 5, "date": "8/30/2019"}, {"text": "The Cheesecake Factory is extremely hyped so I had to finally give it a shot. The restaurant is very large but is still always on a huge wait. I have to say I don&amp;#39;t know what all the fuss is about. I had the pineapple shrimp and chicken and it was not bad but wasn&amp;#39;t amazing. The portion sizes are absolutely huge, which I guess is necessary to justify the very high prices. My wife had a fettuccine Alfredo which wasn&amp;#39;t very good, definitely not even as good as the kind you would make at your house from the can. The kids food was good and the fries were tasty and they serve a grilled cheese very fancy like. I will say that the cheesecake is really superb. We had 3 pieces we split between our family of 5 eaters and had to take much of it home. I guess I will say that the food is mediocre except the cheesecake and the prices are high. My wife and I agreed that we have now done the Cheesecake Factory thing and probably won&amp;#39;t go out of our way to do it again.", "rating": 3, "date": "9/6/2018"}, {"text": "I love this place! It&amp;#39;s slightly expensive but the portions and quality of the food definitely make up for it. Their menu is very large and diverse. The Oreo cheesecake the Red Velvet cheesecakes are my favorite.", "rating": 5, "date": "10/8/2018"}, {"text": "had the chicken salad sandwich. It was marginal, at best. Very bland, too many chunks of fat and gristle in the meat.<br&gt;<br&gt;The french fries were completely dead. <br&gt;<br&gt;Service was adequate.", "rating": 3, "date": "3/16/2016"}, {"text": "Came here for a nice dinner before heading home.  I was surprised to see that a Cheesecake Factory wasn&amp;#39;t packed @6pm. That never has been our experience in Ca. No one greeted us. Matter of fact, we stood there. My whole family decided to go to bathroom. I looked around and saw the restaurant was empty. Figured I could go to the bathroom also. Worst bathroom. The toilets didn&amp;#39;t fully flush, no toilet paper. The faucet was falling off the wall. And water all over the sink. <br&gt;<br&gt;The saving grace to this visit was Rashonda. She was our server. She was quick, friendly &amp;amp; efficient. We loved her. <br&gt;<br&gt;We love the avocado egg rolls.", "rating": 3, "date": "2/17/2016"}, {"text": "I walked into the Cheesecake Factory excited about the happy hour specials I heard about.  I have eaten there before and thought it was good. I walked in around 4:25pm and sat at the bar.  The bar was unattended but I decided to sit because maybe the bartender was just away for a second.  I sat there for around 5 mins.  At least two restaurant workers walked behind the bar, made their drinks and never acknowledged me.  I sat for another 2-3 mins and no one came out or acknowledged me.  I decided to leave and go to another restaurant.  In the future, there should be someone working at the bar especially during the happy hour time frame that has been marketed to us.", "rating": 2, "date": "10/30/2017"}, {"text": "I stopped here for dessert so can&amp;#39;t really give a review on food. I liked that we went at 1:30pm on a week day and there wasn&amp;#39;t a huge line or wait time. Service was good and quick. I had a strawberry lemonade which was too sweet (and I love sweet things but this one was too much). We also ordered the anniversary cheesecake and I wasn&amp;#39;t too impressed. Unfortunately I do not see myself going back.", "rating": 3, "date": "12/4/2015"}, {"text": "So there was a 30 minute wait which wasn&amp;#39;t bad. Our waitress was so sweet and very a good waitress. We got our drinks and food. Our meal was delicious. After paying I accidentally left my debit card and our waitress was kind enough to turn in it which made the experience that much better. It&amp;#39;s hard to find honest people in this world anymore. Will definitely be back!", "rating": 5, "date": "6/4/2016"}, {"text": "This is a very nice place. They have very big portions bigger than I expected. So had To box up half the meal so I could save room for dessert lol  Over all a very good night out for a birthday dinner", "rating": 5, "date": "10/22/2017"}, {"text": "This place is always really really good and everybody who works here is awesome! This is a great place for a casual night out or for a formal family dinner!", "rating": 5, "date": "2/5/2019"}, {"text": "Very slow service. There was 4 of us for a simple birthday dinner and we we there over 2 hours. In addition the food did not come out together.  My son&amp;#39;s food had to be remade because another server took his to another table. Plus I find it strange that I have to explain how to make an Irish coffee. Really?? Probably won&amp;#39;t return unless I&amp;#39;m forced to. That much money I can find better choices. Oh yeah! They were out of her bed chicken so we had to find a substitute which was sub-par.", "rating": 3, "date": "12/9/2017"}, {"text": "We eat here often. Tonight, we started our dinner with stuffed mushrooms and chicken samosas., I ordered the white chicken chili for my main meal. I give this restaurant four stars because I love their cheesecakes.", "rating": 4, "date": "8/1/2016"}, {"text": "I was here on a Saturday evening! The place was packed and we had a 45 min wait. Being new to the area and not wanting to search for another place... we waited. As Cheesecake Factory goes this location has good food. With as busy as it was I would have expected more waiters to be on duty that evening. So the wait continued even after we were seated. With only two people in the party we expected a quick in and out bite. When the waiter finally came to take our drink order we decided to just order quick burgers right away. Bottom line, food was good, service was ok but on a busy night inadequate...", "rating": 3, "date": "1/16/2019"}, {"text": "I love this place they have so much on the menu and today I got the salmon and shrimp scampi with mashed potatoes and extra sauce that&amp;#39;s what I always get in the Firecracker salmon is so good and the dynamite shrimp always a must today was very fast service very impressive this is a place that I will always go to", "rating": 5, "date": "10/2/2015"}, {"text": "Not a good experience. Harassed by flies at my table and a dirty water glass. The Shrimp and Chicken Pad Thai was not good at all. The saving grace was my Celebration Cheesecake and the waiter. I was not really happy with third place and was pretty shocked at the lack of cleanliness of my table and the before mention items.", "rating": 2, "date": "9/5/2017"}, {"text": "Cheesecake Factory is usually hit or miss for me and Saturday night was a hit!  I feel they have a really big menu which allows them to do a lot of things okay but nothing great but not this trip.  Me started with the fried macaroni and cheese and it was perfect.  The macaroni and cheese was cooked perfectly and the tomato sauce was light and a nice compliment.  The wife had Parmesan herb chicken and received a huge portion...really too much to eat.  I had the carne Assad&amp;#39;s medallions which were wonderfully flavored with a tasty corn side dish.  It came with cilantro rice which tasted like it had been sitting for some time which was a bummer.  We both ordered cheesecake to go (celebration and Godiva) which made for good breakfast yesterday.  <br&gt;<br&gt;Our server, whose name I can&amp;#39;t remember, was awesome.  He had several tables but was still attentive and took care of our needs.", "rating": 4, "date": "11/13/2017"}, {"text": "The food is fine at this place, but that menu? Seriously? It has the equivalent of 5 full menus from different restaurants in it? Want pizza? Page 3. Pasta? Page 5. Sandwiches? Page 7. Chinese? Page 9. BBQ? Page 11. Burgers and dogs? Page 13. Breakfast and pancakes? Page 1. Fruit, vegetable, vegan? Page 15. It takes me 15 minutes to get through the menu, and by the time I&amp;#39;m done, I have 10 things I still need to whittle down to 5, 3, and 1 before the waiter comes but DOH, there he is, can we get another 10 minutes please? One word: editing. Part that crap down to your best and most unique or well ordered items. Clean it up. I&amp;#39;d go there 5-10 times as often. It&amp;#39;s just too stressful.", "rating": 2, "date": "12/28/2018"}, {"text": "The Cheesecake Factory is one of the few chain restaurants I eat at regularly. They consistently put out delicious and well prepared food which I appreciate. Service is usually really good but it&amp;#39;s an extremely busy restaurant so patience is a must during peak business hours. The large portions (perfect for sharing) delicious food and beautiful decor make it worth the extra couple dollars you&amp;#39;ll spend here. Don&amp;#39;t pass up on the cheesecake but share its really rich and huge slices.", "rating": 4, "date": "1/4/2016"}, {"text": "My husband and I went for Brunch and the food was wonderful as always. Service was great. We did feel however the drinks from the bar are a little expensive for what you get.", "rating": 4, "date": "11/26/2017"}, {"text": "I don&amp;#39;t know why I even attempt eating at these large chains anymore. The dinner entrees are just terrible. Nothing unique, nothing fresh, and just no passion in any of the food. I realize cheesecake is known for having the obnoxiously large menu with hundreds of options but maybe it&amp;#39;s time for a rebranding and scaling down a little bit bc it&amp;#39;s impossible to put any love into that many items. I&amp;#39;m sorry to say even the cheesecake doesn&amp;#39;t seem to live up to the hype either. Very commercial and marginal service on top of it. Sorry to say will not be back.", "rating": 2, "date": "11/25/2018"}, {"text": "The Cheesecake Factory is typically a go-to spot for families since it has such a large menu. This comes in handy when I have so many picky eaters in my family. 3 stars for service, cleanliness and usually decent food. However, the execution of food the last two visits have been subpar. Ordered the Cajun chicken littles.. nothing Cajun about them. It came with corn and mashed potatoes. Corn had the salt the chicken lacked... the potatoes were hardly mashed.. for the amount of $ spent I would expect such a simple dish to have at least 1 part of the meal to be edible.", "rating": 3, "date": "5/22/2017"}, {"text": "I&amp;#39;ve only been here 3 times I have yet to see any reason to return. Tonight we were there to celebrate a birthday we waited 45 minutes to get our food. A family came in after us and were served before us. The food was ok service was ok. Besides the long wait the manager did adjust the bill however this will never be on my lists of places for dinner.", "rating": 2, "date": "9/28/2017"}, {"text": "Alison R. is the BEST! Attentive and friendly, and knowledgeable about the products. Give this gal a raise!", "rating": 4, "date": "7/31/2017"}, {"text": "Stopped by the CCF while in Louisville and my grandkids absolutely loved it!  The atmosphere is fun and the restaurant is beautiful!  The best food anywhere and who doesn&amp;#39;t love cheesecake !!!", "rating": 5, "date": "9/29/2017"}, {"text": "I hesitate to review the Cheesecake Factory because, well, it&amp;#39;s the Cheesecake Factory.  Nonetheless, here we go: My boyfriend and I came here around 3:15 on a Saturday and there was a 30 minute wait.  No big deal, we just hit the bar and had a beer.  When we were seated we chose the Crab Wontons as our appetizer.  They were good but there was virtually no crab which is a pet peeve of mine!  I ordered the Factory Burger, patties with tomato and onion on a french roll.  It was decent, cooked a little more than my requested medium.  My boyfriend had the Smokehouse BBQ Burger and he enjoyed it.  The best part of the meal was the fries.  They were nice and crispy.  I&amp;#39;m not much on dessert but my boyfriend demolished the Vanilla Bean Cheesecake.  All in all, the experience was good and I&amp;#39;m sure I&amp;#39;ll be back!", "rating": 3, "date": "2/9/2015"}, {"text": "Menu over all a bit overwhelming. But there are Great small plate menu choices. We were there mid day in the middle of the week. There was no wait and service was excellent. The lemon raspberry cheesecake was amazing suggestion from waitress.", "rating": 4, "date": "6/19/2017"}, {"text": "The Cheesecake Factory has never been a favorite for me but it seems that in the past year the quality of the food (not the cheesecake) and service has slipped considerably. I travel for my profession and have visited the CF in Buffalo NY, Cincinnati OH, and Louisville KY in the past 4 months. All of them had slow, and I mean SLOOOOW, service and Improperly cooked food.<br&gt;<br&gt;If I have my way I will never step back in one again. But alas it seems that people love waiting for 30-45 min for a table to wait another 45 min for their poorly prepared dinners.<br&gt;<br&gt;I suggest you only stop there for dessert and spend your hard earned dollars elsewhere for your meal.", "rating": 2, "date": "9/8/2015"}, {"text": "Food and Service is always outstanding been eating here over 7years. My expectations are always exceeded whether I&amp;#39;m dining in or using carry out service!", "rating": 5, "date": "2/2/2017"}, {"text": "I&amp;#39;ve been low carbing for about a month. Imagine my surprise that I was able to have a low carb meal AND cheesecake! YES, low carb cheesecake! Which was preceded by lemon &amp;amp; herb roasted chicken, broccoli &amp;amp; green beans. I&amp;#39;m sure I was out of my carb limit for a usual meal. But this was an awesome treat!!", "rating": 5, "date": "4/29/2017"}, {"text": "Worth the Wait!!! Expect to wait approximately an hour to be seated.<br&gt;Once seated, we were promptly greeted by our server. She brought our drinks and ensured they remained filled.<br&gt;Our appetizer of Buffalo Blasters didn&amp;#39;t take long to arrive. It was delicious!!!<br&gt;My husband ordered the Mac &amp;amp; Cheese burger and I ordered the Parmesan Crusted Chicken. I couldn&amp;#39;t even finish half of my entrée. So filling and yummy!!<br&gt;We did have cheesecake, but it was &amp;#34;to go&amp;#34; as there was no way we could find room.<br&gt;Will definitely visit this Cheesecake Factory when in Louisville again.", "rating": 4, "date": "12/14/2014"}, {"text": "My first time being here and it was excellent! The setting is good for couples and groups. There is plenty of space and the booths are nice. The whole place is fancy. There is even a bar!!. The menu is great, there are literally tons of things in the menu and the prices are somewhat expensive but worth it for the range and quality of food. I give it a solid 5 and I will definitely be coming back to get cheesecake yes sir haha :)", "rating": 5, "date": "11/19/2014"}, {"text": "Recently went to Cheesecake Factory in Louisville, our dinning experience was subpar. The food is the only reason that two stars are given. We decided to go around four to hopefully avoid the dinner rush. The hostess let us know it would be around 10 minutes; 30 minutes later our buzzer went off. Once seated our waiter served us and although he was very nice he seemed very scatterbrained. Our food took around 50 minutes which seems a little ridiculous for coming in around four. The service was slow in general, everything took awhile. Then to top it off we were overcharged on our bill twice. We paid and left, it wasn&amp;#39;t worth waiting another 20 minutes for that to be fixed.", "rating": 2, "date": "1/14/2018"}, {"text": "I don&amp;#39;t like cheesecake. When the GF found this out about me, she gave me this look like I had just drowned a puppy while giggling like a school girl. But we got past that.<br&gt;<br&gt;We came here because she wanted breakfast, I wanted decidedly NOT breakfast, and we needed to eat near Trader Joe&amp;#39;s. It worked.<br&gt;<br&gt;I ordered a burger, medium rare. And it actually came out medium rare. It was amazing. The fries were some of the best fries I&amp;#39;ve ever had. The GF&amp;#39;s breakfast was also cooked to perfection. <br&gt;<br&gt;Service was amazing. Glasses were never empty, food came quickly, and our waitress was really nice and funny. <br&gt;<br&gt;I really had no intention of rating it this highly, but the experience was just so good that I had to. I would still prefer to check out a local restaurant, but I did not regret my time here in the slightest. Good place to come when out at the mall.<br&gt;<br&gt;On a side note, has anyone else noticed that those orange things look like the Eye of Sauron from LoTR? I had to take a picture...", "rating": 4, "date": "3/24/2012"}, {"text": "I have been going to the Cheesecake factory in different cities since 1999 and have never had a bad experience until tonight Saturday June 30.  I had some family in town visiting Kentucky Kingdom and Churchill downs. We arrive to the restaurant around 9:45PM and shortly after being seated we begin to order our beverage and food. A few of the beverages were forgotten but we didn&amp;#39;t sweat it because it could have been an innocent mistake.  However, after our server (Alex M) return for the 3rd or 4th time I reminded him of the water. He finally came back with the water and just threw the straws on the table, I thought it was odd, but I just ignored it.  A few minutes after that, he brought out one of the guest salads and he didn&amp;#39;t put it in front of her, he just put it on the side of the table, which seem kind of strange. Meanwhile, we still haven&amp;#39;t gotten any bread and have been there for a while. We finally ask for some bread because this is something that the restaurant bring out after your order has been taken. <br&gt; <br&gt;The food came out at a decent time and several of the other server&amp;#39;s help place the meals on the table and they did it the right way (in front of the customer).  After eating about half of our food the server (Alex M), stop by our table and ask us if we would like him to take our plates, it seem kind of odd because we still had a lot of food on our plate. He kept coming back and he finally ask us if we need any carry out boxes.  He left and came back with a bunch of carry out boxes and plastic bags and put them on the table. My family started looking at each other and begin having conversation about the server. Everybody at the table was feeling rush. He came back again and took our plates and then ask who names will go on what check. After getting the receipts and providing our credit card, he came back and ask us if he can go ahead and cash out. At this point we just had enough and was frustrated.   When he came back to the table, I ask if I can have my credit card back because I wanted to make a change, he replied by saying the transition had been completed.  I told him I would like to speak to the manager.  Instead of talking to the manager around my family, I got up and spoke with her away from customers so other people wouldn&amp;#39;t be affected.  She listens to me and apologize.  Overall, I&amp;#39;m very disappointed in Alex M behavior tonight and wish management really would resolve this issue. I walk away feeling extremely frustrated.  I really hope this doesn&amp;#39;t happen to anyone else.  I don&amp;#39;t plan to patronize for a while.<br&gt; <br&gt;Thanks<br&gt; <br&gt;Eric", "rating": 1, "date": "7/1/2018"}, {"text": "Just called to attempt to make a reservation for Mother&amp;#39;s Day. I understand having limited reservations, or a limited time to accept reservations. However, rudeness over the phone is neither acceptable nor professional. I love the Cheesecake Factory, but this Mother&amp;#39;s Day my family will be going somewhere else.", "rating": 1, "date": "5/5/2016"}, {"text": "Used to be fantastic back in the &amp;#39;00s.  Kinda falling off beat now, though.  If you like getting food that tastes like it came out of a can, this place is for you.", "rating": 3, "date": "6/17/2017"}, {"text": "Insane wait time, then I found out they skipped over my group of 6!? Whatever...the food is worth the wait...NOT.<br&gt;Their &amp;#34;most popular&amp;#34; entrée is some chicken with mostly mushrooms. Moving on to the cheesecake - just to make this review short and sweet - their portion sizes were reduced by 20% since the last time I came here 6 months prior. The apple streusel cheesecake, although delicious, was mostly just apples with a little bit of actual cheesecake.<br&gt;I&amp;#39;ll just call it the Toppings Factory from here on out. The price that&amp;#39;s paid to dine here I&amp;#39;d expect the meals to be balanced with complementing ingredients.", "rating": 2, "date": "3/1/2014"}, {"text": "The only thing that keeps this place from 5 stars is the spotty service. Our male server was inattentive at first. Then he was okay for a while and then he disappeared for a while... Our party of 3 order the chicken quesadilla as an app. It was light and crispy and cheesy and excellent.. We also ordered the stuff tortillas the chicken teriyaki and the pork chop. everything was excellent.  The cheesecakes were downright sinful. Our server apparently came to the end of the shift and his replacement was more attentive in  10 minutes than he was in an hour and half", "rating": 4, "date": "8/15/2014"}, {"text": "I was promted to write a review following a number of poor service experiences at this location. Sonia L. was our server this particular evening and pretty much treated my mother and I with minimal respect. She did not let us know any specials, our food took longer than 20 minutes to get to the table. When we asked if she knew the status of our order, she may as well have rolled her eyes. When she told us to have a good evening, it was mumbled and she said it after she turned to her other table. This isnt the only poor service experience Ive had at this location and I wouldnt return if the food wasnt always on point. Hostess staff is always very friendly and accommodating, I just wish the servers had the same respect.", "rating": 2, "date": "1/11/2017"}, {"text": "This Thanksgiving I took a little trip with my nephew from Detroit to Louisville, KY to Nashville, TN and back. On the way back we stopped for a bite to eat at The Cheesecake Factory. My 15 yr old nephew had never eaten at The Cheesecake Factory so I thought I&amp;#39;d let him experience the food/cheesecake.<br&gt;<br&gt;We decided to order 4 appetizers and afterwards he ordered a slice of strawberry cheesecake. Everything was awesome from the service, decor, coffee, food and cheesecake. The Chicken Pot Stickers, Chicken Sliders and Sweet Corn Fritters make me want to drive all the way back for more!<br&gt;<br&gt;The parking experience at this mall can be a pain so I was happy to utilize the valet parking outside of The Cheesecake Factory.<br&gt;<br&gt;The tasty little corn fritters were crispy, light, with just right amount of corn inside. Simply delicious!<br&gt;<br&gt;Also, the plain cheesecake with strawberry&amp;#39;s on top was out of this world delicious. Smooth, thick, perfect taste and texture!", "rating": 5, "date": "1/12/2012"}, {"text": "I love the Cheesecake Factory! They have an excellent staff and great food. The fried macaroni  and cheese was good. I enjoyed the macaroni and cheese burger as well! I love their cheesecake selection. They have the best oreo cheesecake ever! This is a good place to go to celebrate a birthday and or a big event in life. I am grateful that Louisville has one in our city.", "rating": 5, "date": "1/25/2017"}, {"text": "Visited the location in the mall and was told strollers weren&amp;#39;t allowed but we had a newborn and the car seat wasn&amp;#39;t close. Luckily the hostess figured out a solution so I could take my daughters there for their birthdays.<br&gt;Food was good. Service was attentive.", "rating": 5, "date": "2/18/2017"}, {"text": "First time EVER, and the Cheesecake was just simply AMAZING! I had the Cuban sandwich, and was only able to finish half. My boyfriend had the Parmesan crusted chicken, which was also delicious as well as a huge portion. The Reece&amp;#39;s peanut butter Cheesecake was the best thing EVER. It is pricey, but well worth it.", "rating": 5, "date": "2/14/2017"}, {"text": "I have been a vegetarian for 2 years now. I went to this Cheesecake Factory about 3 weeks ago and ordered the lasagna and 2 pieces of cheesecake. Don&amp;#39;t get me wrong the food was amazing. Expensive but good. I did not finish all of my lasagna so they took it for me and boxed it up. The next day I reheat it and take a bite of it. I bite into a piece of chicken, now keep in mind my food did not have chicken in it the night I was eating it. So this means they gave me someone else food and not anyone from my tables food.  Not that it would of made it any better. So I bite into a piece of chicken from a strangers left overs, a complete stranger. Being a vegetarian this gross me out then I thought how I just took a bite of a strangers food that they had also ate. I call up the the cheese cake factory to let them know this happen. They were super nice about it and said they would send me a gift card. A week later I still had not received the gift card. I called back up there and the lady informed me no one sent my request into corporate for the gift card and she told me she would make sure it got sent and I would receive a $50 gift card. A week and a half later I receive a gift card for $20. This would not even cover the $56.00 bill I had there that night or even the cost of the lasagna. I will now be calling corporate. The customer service is not good and the communication from corporate to the Louisville store must not be good either. My advice for any vegan or vegetarian going to this place to ask to box up your own food.", "rating": 1, "date": "1/26/2019"}, {"text": "Love the atmosphere and food here.  Fish tacos are my favorite, I even eat the beans and rice, so much flavor!", "rating": 5, "date": "9/6/2014"}, {"text": "I loved everything about this place. Their food was amazing (they give you a ton of food), the workers were very friendly and everything was pretty clean. They also had a huge menu! It was so hard for me to pick just one thing to order!! 10/10 would recommend.", "rating": 5, "date": "12/1/2016"}, {"text": "It was ok. Maybe if I order something different next time, I may have a different opinion.. I don&amp;#39;t exactly remember what I ordered but it was some kind of Mexican dish..The black beans were really good though. The spinach and artichoke dip was good as well, for my first time ever eating it.", "rating": 3, "date": "6/17/2016"}, {"text": "The atmosphere and food here is amazing!  The service not so much.  My wife, son and I wanted to get dinner before we finished our Christmas shopping so we decided to try the Cheesecake Factory.  Now let my be fair it was extremely busy and I don&amp;#39;t want to paint an unclear picture.  Due to the malls parking being crazy I went in and put our name on the list and was giving a 20-30 minute wait estimate.  I thought that sounded good and then I returned to the car and we parked.  We had to park on the other side of the mall so when we finally made it back to the Cheesecake Factory I asked if our name had been called, afraid that our pager had been out of range.  They took several minutes to figure out no that it had not.  To make a long story about our wait short we waited at least an hour before I went back to the hostess and explained we&amp;#39;d been told 20-30 minutes and now been waiting much longer than that. She said they would be seating us soon, so I waited 15 more minutes.  Then we were ready to give up.  I walked up this time ready to just return the pager and before I could finish my sentence the three hostess just kinda said put them at table number whatever.  So they walked us past not one but 5 empty tables and sat us at the last one.  Maybe 5 people got up at once I don&amp;#39;t know but I do know those tables were clean and ready to be sat and we were leaving but they just quickly put us in one when we were ready to give up. <br&gt;   Then the server did an ok job up until the end.  My son is 18 months so he makes a mess.  Because of this I always leave at least a 25% tip, regardless of the service because at the end of the day he causes more work for them.  I asked for the check as soon as we got our food because at this point the mall closed in a little over an hour and we still needed to shop.  I never saw the server again, no how was everything, no did you need anything else, nothing.   <br&gt;   I would give this place one star because of how poor the service was, but I would be cheating the Cheesecake Factory because the food was very good and I forgot to mention the bar tenders were really good.  But the hostesses and at least my server was below average at best.  I get they were busy but give people realistic time frames and don&amp;#39;t get your money and run!!!!!!!!", "rating": 3, "date": "12/13/2015"}, {"text": "Ordered for two using Grubhub since I was recovering from surgery and could not get out and about.  Ordered the Teriyaki chicken and the Shepherds Pie and two cheesecakes.  The food was lukewarm and the cheesecakes were also warm.  The teriyaki chicken was not what I expected, one large piece of skin on chicken and rice, it was very very dry.  The Shepherds Pie was ordered by my mother. She reviewed it very poorly.  Due to the taste she mainly ate the potatoes.  The cheesecakes were ok.  Later in the evening we both had stomach issues.  Needless to say we will not be doing delivery again.", "rating": 3, "date": "12/16/2017"}, {"text": "Cheesecake Factory is a chain.  This visit was in Louisville, KY.  I find the restaurants pretty consistent no matter where you are.  <br&gt;<br&gt;Cheesecake Factory is one of my favorite chain restaurants.  The cheesecake is really good.  I think their food is really good, too.  The portions are HUGE.  They&amp;#39;re often on lists for having the most calories.  It would probably be best to share a meal, but I never have.  I always get my own.  I also always get my own cheesecake.  That&amp;#39;s the fat person inside of me trying to get out.  <br&gt;<br&gt;I was lucky enough to have a gift card from my parents.  <br&gt;They had a sign that said &amp;#34;everyone loves cheesecake.&amp;#34;  The decor is always nice.  <br&gt;<br&gt;I think they have the best brown bread ever.  I don&amp;#39;t even like the white bread they serve when I compare it.  <br&gt;<br&gt;I had the house red wine, which was good.  .  <br&gt;<br&gt;My date had the shepherd&amp;#39;s pie ,which he seemed to enjoy.    <br&gt;<br&gt;I had the burger with blue cheese and bacon.  I also had a side salad instead of fries but with blue cheese dressing.  Normally, I use minimal dressing, but this one was so good, I tore it up.  <br&gt;<br&gt;The burger was loaded with the bacon and blue cheese.  Super yum.  <br&gt;<br&gt;Garrett had the key lime pie cheesecake.  <br&gt;<br&gt;I had the most ratchetly delicious cheesecake.  Oreo!  The oreos were baked inside.  Super good and super fat.  <br&gt;<br&gt;I wish we had one in Memphis.  :)", "rating": 5, "date": "5/20/2013"}, {"text": "Who doesn&amp;#39;t love the Cheesecake Factory? Delicious lemon drops and every cheesecake I&amp;#39;ve had has been perfect. It&amp;#39;s a little expensive, though. Huge, huge portions, but all of It so good.", "rating": 4, "date": "3/26/2016"}, {"text": "My husband and I really enjoyed our very first visit here! Nice atmosphere, friendly staff and awesome food! They have a huge menu! We had an excellent waitress. Lindsey was super! She did her job well. Friendly and funny and took her time to enjoy a short conversation with us!", "rating": 5, "date": "6/11/2016"}, {"text": "One of my favorite chain restaurants. I love this place. <br&gt;<br&gt;An individual can spend $15 (probably a drink an entree only) or easily spend $60. I once heard someone complain that this place is expensive. Yes, it can be... if you let it. A 20 spot will almost always take care of business for me. Sometimes I spend a little more. Bring an extra $10 to cover a slice of cheesecake. <br&gt;<br&gt;Good: <br&gt;<br&gt;The Mediterranean-style (I think) interior and decor does a great job of taking me to another place (Though I am, I don&amp;#39;t feel like I&amp;#39;m at the mall on a busy commercial street.). <br&gt;<br&gt;I swear I think the menu is thicker than a King James Bible. It&amp;#39;s crazy thick with sooooo many ways to please the taste buddies. Like breakfast? Well, I do, and they have a whole page with nothing but omelets served all day. They also have some of the best fish tacos that I&amp;#39;ve ever had. <br&gt;<br&gt;Like booths? Well they have &amp;#39;em. They are big and over-sized. They even have a few round table booths. (Note: regular tables make up most of the seating in this place.) <br&gt;<br&gt;Bad: <br&gt;<br&gt;If you do not have the luxury of eating at a booth and are seated at a regular table... be warned... they are practically on top of each other. It is tight. Once at a table, I found it impossible to not watch a guy eating lettuce wraps who was about three feet from my face. I had to make an extra effort to talk to my friends who seemed further away than the lettuce wrap guy. <br&gt;<br&gt;It gets crowded easy. What do you expect?... it&amp;#39;s a popular place. When there is a crowd, it is standing room only (there are only a couple of small benches. The pages they hand out when reach into the mall enough to find a few more benches... but this is still very limited even when the mall is open. <br&gt;<br&gt;Overall... I love it. When I feel like some excellent, chain-style grub, and I know I&amp;#39;ll be in the neighborhood (the land between the malls!), I try to work in a visit.", "rating": 4, "date": "1/3/2011"}, {"text": "Being an old senior citizen, it is hard to try new things. Grandson gave my wife &amp;amp; I a gift card for Christmas. The Louisville Mall looks like Christmas on a Saturday. Cars are backed up on the X-press way exiting onto Shelbyville Rd. Remember, 90% of the people are working, and few thousand Ford employees just got $8K  bonus.<br&gt;<br&gt;All that might explain the 40 minute wait. No chairs of any kind for old seniors to sit and wait. F. <br&gt;Finally seated, and a waiter is going to impress me with his ability to remember what I ordered without writing it down. That always scares me. True to form, order was wrong.<br&gt;Another F.<br&gt;<br&gt;Didn&amp;#39;t bring the salad until they noticed it was missing after the main meal was served.<br&gt;It included the wrong dressing. Had Blue Cheese, which I detest. My wife tasted it and said it was delicious.<br&gt;<br&gt;Couple 18 inches away in a long line of bench backed seating tables offered us some beans that you sucked out of the shell. Hey, this is KY, I had never heard of them,. They were great.<br&gt;<br&gt;Meals finally arrived, our waiter RENEE (The Mentalist) or something I could not understand, was &amp;#34;On Break&amp;#34; and a nice fellow was serving us. They brought the bread that was suppose to be as an appetizer with the meal.<br&gt;<br&gt;Overall food was very good. The grilled onions on my burger were great. French Fries way above average for Louisville; but leave salt off next time. My wife enjoyed here food too and the portions were such that we took  a doggie Bag home.<br&gt;<br&gt;Tried the &amp;#34;famous Cheese cake. One step above Whipped Jell-O in a box. Save your money for something in the mall.<br&gt;<br&gt;The ambience of the place in noisey and you think your at a Casino in Vegas.<br&gt;<br&gt;I  would give the place another try on a weekday and see how it goes.<br&gt;<br&gt;Hope we get another gift card.<br&gt;<br&gt;Jim &amp;amp; Betty PCIM", "rating": 2, "date": "2/20/2013"}, {"text": "Great selection, so many choices. Everything here is fabulous. Great service and you must try the cheesecake.", "rating": 4, "date": "11/4/2015"}, {"text": "The extensive menu and great service keep me coming back. There is always something new and exciting to try. The servers here go through heavy training so you can count on good service. You must get cheesecake here! Unfortunately you can&amp;#39;t make a reservation so there could be a bit of a wait.", "rating": 5, "date": "2/7/2016"}, {"text": "One might expect that an establishment famous for their desserts would be more receptive to diners who show up just for dessert.<br&gt;<br&gt;Our party (four of us) popped in for dessert before heading to the movies.  We were seated right away by a pleasant hostess.<br&gt;<br&gt;Our waitress, however, was annoyed that we were *only* having dessert.  I imagine that serving us a full dinner along with dessert might have garnered a larger tip.  <br&gt;<br&gt;We&amp;#39;ll never know.", "rating": 1, "date": "7/11/2008"}, {"text": "Great service and food. Waitress was outstanding. This is the 2nd time I have came here the portion is well good for the size", "rating": 5, "date": "7/14/2016"}, {"text": "I had an amazing dining experience tonight at The Cheesecake Factory. Remarkably it was on the 2nd of 2 days celebrating National Cheesecake Day. Our wait during dinner time was relatively short. Our server, Andrea, was fabulous! She came to the table quickly after we were seated, greeted us, and took our drink orders. Within a few minutes, she brought our drinks and a fresh basket of bread. She asked if we wanted to begin with an appetizer, and when declined, she told us about the nightly specials. She took our orders, after I asked a couple questions and asked for her recommendation between two entrees. She kept our drinks filled during our entire meal, and she interacted with us frequently. I ordered the Seared Tuna Tataki Salad and my friend ordered Spicy Cashew Chicken with extra sauce. (This is the dish that I normally order, but I decided to order off of the SkinnyLicious menu to save room for cheesecake.) Both of our entrees were delicious! My friend only ate half of her meal, and Andrea boxed it up. I ate my entire salad. The tuna was fresh, tender, and spicy, and the shallot dressing made for a great finish. After dinner, I debated on which cheesecake to order. I decided to go with the new Chocolate Hazelnut Crunch Cheesecake, and my friend ordered the Godiva Chocolate Cheesecake. My cheesecake had Nutella on top. Mmm. The best part--all cheesecakes were half-price! We both asked for our cheesecakes to be boxed to-go, because we were only planning to eat a few bites before taking the rest home. Both of us were very pleased with our choices. Both of us would recommend our entrees and cheesecakes. Andrea&amp;#39;s attentiveness, humor, kindness, and work ethic made our dining experience quite pleasant. Can&amp;#39;t wait to return!", "rating": 5, "date": "7/31/2017"}, {"text": "I ordered the Louisiana pasta dish and when they brought it to me, my noodles where not done. They were gummy and I had to send it back. I really didn&amp;#39;t like the dish because the sauce was not what I was expecting for a Louisiana type dish. Also,all of out eating utensils were dirty and the waiter had an attitude about bring new silverwear. Not good for the prices.", "rating": 3, "date": "3/20/2016"}, {"text": "Yes, I know it is a chain but obviously they do it right or they wouldn&amp;#39;t have been able to become a chain. Right? Yup! Hubby and I stopped here after eating an anniversary meal at a fancy restaurant and even having desert (that wasn&amp;#39;t very good). I loved our waiter, he sang, he danced, he was as kind as could be! Definitely ended our night on a high note! I have yet to be very disappointed with this restaurant. Oh and this time since we just came for cheesecake we sat at a high top in the bar area and it was great. Nice and relaxed.", "rating": 5, "date": "7/5/2013"}, {"text": "Start with desert because life is short. Delicious cheesecakes!! The menu is oversized and you should order a refreshment before you start looking. One you select your meal be aware that the portions are &amp;#34;american sized&amp;#34; and sail shareable. My kid love the salads", "rating": 3, "date": "6/16/2013"}, {"text": "Husband and I had lunch here and the food is great. We live an hour away so this isn&amp;#39;t a regular treat for us. We had the tex mex egg roll and shared the everything pizza. Both were incredibly delicious. The pizza was huge, neither of us went away hungry. We did not have cheesecake there since we were going to walk around the mall. Our sever was great. The staff was very nice. We went back to purchase a cheesecake to take home. I ordered a whole cheese cake and a slice to go. It was insanely busy when we came back (4:00) the staff at the cheesecake counter were very nice. I did have to wait longer than I thought I would for the cheesecake. It was worth it though.", "rating": 4, "date": "8/23/2014"}, {"text": "Tried it 4 times, never liked it and never will I&amp;#39;ve took a Togo order that was placed 30min before pickup waited for 20min to get it. Spend 120$ for a meal for 4 with 3 salads. Nothing tasted good except the bread. Might as well go to Olive Garden, cheaper and better", "rating": 1, "date": "3/6/2016"}, {"text": "While in Louisville with the swim team for a big swim meet, we went to The Cheesecake Factory for dinner. It has been a tradition for the past two years. The service has always been good and the food is delicious. This year is different. I got my usual, a hamburger on a gluten free bun with lettuce, but I got tomato, onion, pickles, and mayonnaise on it. I&amp;#39;m pretty sure I said none of that stuff. I got it anyway. I picked off the vegetables except the lettuce and mayonnaise. Here&amp;#39;s the thing, I don&amp;#39;t like mayonnaise. I didn&amp;#39;t want to be the one scraping it off of the bun with my cloth napkin, so I ate what I had. Later on, we had to wait forever to get cheesecake to go and our checks. We didn&amp;#39;t get into our hometown until 11:30 because of how the service was just so slow. There should have been more employees working on a Saturday night, so service can be faster.", "rating": 4, "date": "2/29/2016"}, {"text": "My husband and I both ate from the skinny menu and I&amp;#39;m a first timer.  I was disappointed.  My shrimp was over cooked and pasta was dry and sticky. I ate most of my meal before the server came back by to check with us and by then I felt it was to late to say anything. I&amp;#39;ll probably come back for a drink and dessert but we both felt similar dinners at Chili&amp;#39;s was better!", "rating": 3, "date": "9/15/2015"}, {"text": "I have pondered on what to write for this momentous anniversary, my 100th review. And I&amp;#39;ve gone back and forth in regard to which spot I would choose to review, if I would dig from the 2-year vault or simply go with something more recent. So, I decided to basically straddle the fence and review a place I&amp;#39;ve been twice, recently and some time ago.<br&gt;<br&gt;However, this review will be mostly based on my latest visit.<br&gt;<br&gt;It&amp;#39;s rare that I get a relative in town, even rarer that I have the opportunity to join them for a moment or two when they are here. Thankfully, with my new work schedule, I was available to do both. Meeting my aunt while she was in town for a conference was a nice way to spend a part of my evening, no matter the venue, but the Cheesecake Factory made for a pleasant backdrop.<br&gt;<br&gt;Spacious and beautifully appointed, the Cheesecake Factory is perfect for large casual groups or intimate couples. On this occasion, my aunt and I were joined by several of her co-workers. Most were from much smaller areas of Kentucky and the chance to see a little bit of the &amp;#34;big city&amp;#34;, and enjoy some &amp;#34;fine dining&amp;#34; was likely part of the draw to eat here. Personally, I prefer smaller, local restaurants but the Factory was probably better suited to accommodate the group. <br&gt;<br&gt;Because the group was moderately large and each of us were on separate bills, it did take some time for dinner to arrive. Dinner portions are huge. You pay for the size though and I wouldn&amp;#39;t call it gourmet. Like much of the Cheesecake Factory, the food suffers from a bit of puffery, making things appear more than average. Sadly, average is what it is. The fish tacos I had were dry and bland, the chicken pasta my aunt had was swimming in olive oil.<br&gt;<br&gt;The thing about it is you don&amp;#39;t come here for dinner, you truly come for dessert. Unfortunately, you may come away disappointed in that regard too. While the cheesecake is fantastically delicious, this is the one area where the portions are small for what you pay.<br&gt;<br&gt;All in all, while the restaurant experience was somewhat lacking, I came away enjoying the moment and the time spent with my aunt. In my book, that&amp;#39;s a win.", "rating": 3, "date": "5/24/2012"}, {"text": "Food was good, not exceptional.  I had plans for a great, hearty meal but after waiting so long for service I settled on a salad and my friend had appetizers. Nothing else to say, food was ok and service was terrible.", "rating": 3, "date": "10/7/2015"}, {"text": "My favorite is the &amp;#34;Ultimate Red Velvet Cake Cheesecake&amp;#34;.<br&gt;<br&gt;Their food is really great also!", "rating": 5, "date": "7/3/2013"}, {"text": "Wow I have never been to a place that has ran out of food before. Especially a restaurant like the cheesecake factory I am very disappointed.", "rating": 1, "date": "1/2/2016"}, {"text": "Had lunch here today and spent $70 between 2 people. When we got there the place was almost empty but it took an hour to get our food - bowl of chili and a hamburger. The $7 screwdrivers kept showing up promptly though. <br&gt;<br&gt;Won&amp;#39;t be back.", "rating": 1, "date": "8/16/2015"}, {"text": "Not bad ... surprisingly!<br&gt;<br&gt;Had dinner here on Wednesday night - and the only time I&amp;#39;ve gone to the Cheesecake Factory where there hasn&amp;#39;t been a 45 min wait.  <br&gt;<br&gt;Our server was very feisty and friendly and reminded me that the Louisville charm comes in all flavors.  I ordered the hibachi steak which was prepared very well ... well seasoned, tender and a good medium rare.  <br&gt;<br&gt;The menu is a book ... and is way too dense with information (even if you don&amp;#39;t count the 7 pages of advertisements) ... but would appear to contain some pretty tasty entrees.  All this was made sweeter when paid with a work credit card.  I did regret not getting dessert after working in the mall store till midnight though.", "rating": 4, "date": "8/12/2010"}, {"text": "The food is solid.  If you go, you&amp;#39;ll enjoy your food.  But for the love of God, why am I waiting 90 minutes to eat AT THE MALL?<br&gt;<br&gt;It&amp;#39;s loud, it&amp;#39;s overpriced, and the wait is absurd even though they have been open for ages.<br&gt;<br&gt;This is Louisville people!  You can get the same frozen cheesecake at Liquor Barn.  Or, you could get a fresh, awesome, toe curling dessert at Sweet Surrender or Cake Flour or Homemade Ice Cream and Pie Kitchen or...", "rating": 2, "date": "8/25/2012"}, {"text": "what can you say that those before have posted.  my wife and I joined our bfs for an early <br&gt;diner.  I had the combo of  steak diane &amp;amp; herbed salmon which was cooked as ordered and was delicious.  excellent choice!  my wife got fish &amp;amp; chips which were just adequate.  next time she will go back the great club sandwich.<br&gt;<br&gt;the only, and I mean  only,  issue were  the fruit flies/gnats which were a real pain.  I do not mean one or two but a whole gang who really wanted our food.   if we had not driven so far for diner I probably would have gone elsewhere.  this should not be acceptable for a restaurant of this quality.", "rating": 3, "date": "9/10/2014"}, {"text": "MR says... what else? enjoy desserts first!<br&gt;<br&gt;MRS says... food would be 3 stars but to consider desserts, hours of operations and service, we&amp;#39;re giving this 4stars :)<br&gt;<br&gt;we&amp;#39;re a frequent because of cheesecake obviously and we just love it! there are times we get a slice of cheesecake while waiting for our table, we must have tried everything in the menu except the BANG BANG dish<br&gt;<br&gt;i just had a really bad experience with that BANG BANG dish years ago in california and never tried it since<br&gt;<br&gt;anyway what i noticed though is how the appetizers sampler dish varies from time to time. there are times we can nail the sampler by ourselves. serving should actually feed 4 people <br&gt;<br&gt;maybe eating a slice of cheesecake while waiting for our table is a factor (wink!)", "rating": 4, "date": "10/5/2008"}, {"text": "Went there for my daughters 22 birthday celebration. Great busy atmosphere and we loved the food. A little pricey, but it was good and for it being in the Mall St Mathews area  guess its justified. Been there and done that and will do it again on another special occasion!", "rating": 4, "date": "1/28/2014"}, {"text": "We arrived at 6:15 were given a buzzer that didn&amp;#39;t work.  We were told we would be seated. First one hour, then another 1/2 hour then told that my name was called when I was 12 ft away and listening. Then it took 15 min to clear a table.", "rating": 1, "date": "8/8/2015"}, {"text": "I was staying  at a nearby hotel and ordered curbside pick it. Ordered at 6:50 and was told that it would be ready in 10-15 minutes. Arrived at 7:15 and called to let them know. Called again at 7:35 when no one had arrived and they placed me on hold. It&amp;#39;s 7:42 and I was still on hold when they finally brought my food out. Such a disappointment. They didn&amp;#39;t acknowledge the wait or attempt to apologize.  Even worse is that my food is lukewarm at best. I sincerely hope the service inside is better than the Curbside Pick Up", "rating": 1, "date": "11/8/2016"}, {"text": "We stopped in for dinner on a weeknight to celebrate my boyfriend&amp;#39;s birthday.  We were seated in a booth after a very short wait.  I ordered the four cheese pasta with chicken and he ordered the crusted chicken romano.  Both dishes were absolutely delicious.  We finished with the Godiva chocolate cheesecake.   My boyfriend is not a foodie and doensn&amp;#39;t usually get excited about food but he loved the cheesecake (good thing since it was his birthday!).  The service however was a bit slow.  We had the ask the waitress each time we wanted our drinks refilled.  That wouldn&amp;#39;t be a major issue if their prices were significantly lower but at almost $60 for the meal the service should have been impecible.", "rating": 4, "date": "5/20/2012"}, {"text": "Great food, excellent cheesecake choices. Always have a good experience when we come here. Usually approximate 45 minute to 1 hour wait for a table.", "rating": 5, "date": "11/3/2014"}, {"text": "Food quality and service were both excellent. The desserts were fabulous. I highly recommend the Mac and cheese burger.", "rating": 5, "date": "10/22/2014"}, {"text": "This place is so overrated!  <br&gt;<br&gt;In a town where there are so many great places to eat, why would anyone come here?  Why pay this much for run-of-the-mill food?  If you want to eat this type of food find a Chili&amp;#39;s or an Applebee&amp;#39;s and pay much less.<br&gt;<br&gt;Now, the service was fine, the atmosphere is fine, etc.  The desserts were good - it&amp;#39;s the Cheesecake factory, but again, I&amp;#39;m sure you could find a much better spot for good dessert.", "rating": 1, "date": "12/31/2011"}, {"text": "My daughter...being a fan of cheese cake and food chains and wants to eat here every time that we are in the area. She claims that they have the best burger that she has ever eaten. They have the largest menu that I&amp;#39;ve ever seen and I order something different every time that I go. My last experience was &amp;#34;pecan crusted catfish&amp;#34;...recommended by our phenomenal waiter. Usually I&amp;#39;m not a catfish fan because it often has a wild game taste but decided to venture out and I was glad that I did...it was excellent and not like any fish that I&amp;#39;ve tasted.  My husband once got the medallion steak and was disappointed, he didn&amp;#39;t finish it...probably just so that he could have more cheese cake. Speaking of which...Oreo is my favorite. My only complaints are the usually long waits and scarce parking. One time we did the valet parking and waited over 30 minutes after dinner before someone appeared at the valet stand...so I don&amp;#39;t recommend the valet parking and would recommend to go during the week and not during the peak/busiest times.", "rating": 4, "date": "3/21/2013"}, {"text": "I am always leery of a 20 page menu and a restaurant that tries to be all things to everybody. Cheesecake Factory would be the exception to this rule. I support independent places as much as possible. When I choose a chain it needs to be something special. The Cheesecake Factories have never let me down.", "rating": 4, "date": "8/20/2012"}, {"text": "Even as I write this I can&amp;#39;t believe I&amp;#39;m giving the *Cheesecake Factory* a three star rating.  Even the name *Cheesecake Factory* sounds like a Build a Bear workshop for people with too much money but not enough experience to find a good restaurant.  But I&amp;#39;ll be damned... the food is good.  I feel dirty.<br&gt;<br&gt;My wife was given a $50 gift certificate as a Christmas present then my fellow yelper Troy W. said they had the best fish tacos in the city.  I said I&amp;#39;d never go back but here I come, Cheesecake factory.<br&gt;<br&gt;We put our name in and waited for our plastic disc to buzz while we sat at the bar.  Two pints of Sam Adams Boston Lager were ordered.  Turns out Cheesecake Factory charges $5.50 for Sam Adams.  Jesus, daddy and the spook that&amp;#39;s a high mark up!  Disc buzzes, on to the dining round.<br&gt;<br&gt;The dining floor is lit like a crack house.   My wife ordered the chicken thai noodles and I ordered the fish tacos.  I snapped a pick of the fish tacos but it&amp;#39;s too dark to tell what it is.  The fish tacos are good.  Not the best I&amp;#39;ve had but I&amp;#39;d eat them again... if they weren&amp;#39;t $14.99.  They can be ordered grilled or tempura style.  I went with tempura.  My only real complaint is the avocado on the tacos was almost non existent.  Other than that the breading was perfect without any greasy mouth feel or taste.  <br&gt;<br&gt;My wife&amp;#39;s chicken thai noodles were amazing... and they should be for what they cost.  C&amp;#39;mon, man, this is a chain!  We&amp;#39;re not eating at Les Halles!  The portions are huge and the food ranges from good to great.  I just can&amp;#39;t get over the prices.  For two beers, two entrees, and two pieces of cheese cake, we spent over $70.  If prices were more reasonable I would have no problems returning.  I just don&amp;#39;t feel like the cost to quality line up... especially for a chain... a chain at a mall.<br&gt;<br&gt;Oh - the cheesecake that this factory cranks out... just ok.  The key lime cheesecake I got from a Publix grocery in Florida was just as good for half the price.", "rating": 3, "date": "1/22/2011"}, {"text": "My husband and I celebrated my birthday here a few days ago. We had awesome service and food. We had the Spinach and Artichoke Dip which was delicious - must try! My husband had the mushroom burger which was huge and yummy. I had the Shrimp and Chicken Gumbo. My only complaint is that there were 4 pieces of shrimp and like 15 pieces of chicken. For shrimp being the speciality of the dish, I had REALLY hoped for more shrimp. We had been given gift cards, so it was an enjoyable first experience.", "rating": 4, "date": "7/29/2016"}, {"text": "I have been to the Cheesecake Factory before and have had great service, but I need to rant about what happened there tonight with my boyfriend... we got there and were waiting for our table and decided to look at the cheesecake selection. While standing there, a drunken customer stumbles over and starts leaning directly in front of me looking at the cakes. I moved out of the way and he proceeded to lean in front of me even further, with the back of his head inches from my face. After a few minutes of him continuing to do this, my boyfriend who is standing behind me finally says to him, &amp;#34;Excuse you...&amp;#34; and the man looks over at us and literally yells at the top of his lungs, &amp;#34;GET OUT OF MY FACE!!!!&amp;#34; My boyfriend said he was just telling him to watch out because he was about to step on me and the man keeps yelling. We ended up walking away and a worker came over to tell us she saw what happened and she was sorry and she let her manager know. The man was seated before us and nothing was said to him. We were seated and we ordered a calamari appetizer. Our entrees came out but we never got our calamari. I let our server know and she apologized but didn&amp;#39;t seem to care. I worked at a sit down restaurant in college and if something like that happened to a customer, they would have been well taken care of and definitely not forgotten about like we were tonight,  and we probably would have given them a discount off their bill since the expected appetizer never arrived. Although the food is great, I was seriously disappointed with their service tonight.", "rating": 2, "date": "9/24/2016"}, {"text": "I&amp;#39;m traveling from Richmond, VA and stopped in this restaurant for an early dinner with some family in the area. The wait was pretty short at 4:30pm on a Saturday night. Got a table and ordered an appetizer of nachos and then our waiter disappeared on us. Finally, 21 minutes later we asked a waitress passing by if she knew where he went and she said there was a shift change, and didn&amp;#39;t know who our server was but she could help us. Her name was Ebonie A. and she is a wonderful asset to the Cheesecake Factory.  She got our order in quickly and was attentive, professional and gracious. Awesome tasting lemon chicken couscous!  Only 4/5 stars because of the waiter disappearance.", "rating": 4, "date": "9/10/2016"}, {"text": "What can you say...consistent as the sun rising??? Yes, CFs food is always good especially the cheesecake. Tonight we decided to order appetizers and were not disappointed. Plates are large so be careful about ordering a lot of food if you are not hungry. Chicken lettuce wraps were tasty and served with carrots, cucumbers, noodles, cilantro and bean spouts. They offer three sauces, a thai cilantro sauce, peanut sauce and tangy tempura sauce. All were tasty additions to the boston bibb lettuce that was used to wrap it all up. Potstickers were okay but not great. The soy sauce was a bit salty for my taste. An arugula salad with raisons, nuts and slivers of parmesan in a lemon olive oil dressing was light and delish. You cannot pass up the cheesecake so we had the tuxedo and peanut cup renditions they offer. There are so many choices it takes a while to figure which one to order. My friends from Junior&amp;#39;s Restaurant in Brooklyn were shouting at me for eating such a deviation from good old NY cheesecake but when in Rome...<br&gt;CF is always good and you can always expect good service and adequate food. Get here early to avoid the wait and then go see a movie at the new movie theatre!", "rating": 3, "date": "12/27/2013"}, {"text": "I LOVE THE CHEESECAKE FACTORY. The food is really good and there is a lot to choose from on the menu, even a really picky person could find something they like. If you are going for dinner I would recommend calling ahead because that wait can get really long. Also, they are a little expensive, but the portion sizes make up for it.<br&gt;<br&gt;Usually I have a great experience, but this last time our waitress, Tabitha, was terrible. She started off great, but once we got our food she completely forgot about us. Didn&amp;#39;t come back to see if we need anything and we had to flag her down so we could get the dessert menu and our checks. I  had a lot of food left over and she put it in one of the smallest boxes they had and it was running over. Other than that all the food was great", "rating": 4, "date": "10/16/2011"}, {"text": "I visited this restaurant this evening with a party of 7.  I was given a &amp;#34;buzzer&amp;#34; and told my wait would be 1 hour to 1 hour and 15 mins.  I left the restaurant briefly and returned to a bench just outside the restaurant and waited until I was 50 minutes into that 1 hr - 1 hr 15 mins and I went inside and stood and waited, waited, waited, waited, waited, waited, waited, waited, waited, waited, waited, and waited some more.  They were calling names from time to time in spite of the fact that we were given a &amp;#34;buzzer&amp;#34;.  When we approached the hostess table we were told that our names were just called.  In fact, there is no way that this could have occurred.  We were finally seated approx. 1 hour and 45 mins later.  We promptly had water at our place settings and bread waiting on the table.  The waitress did promptly take our order and we were fed very quickly!  Unsure who was working the kitchen, but they made up time with their mad skills.  The manager came by our table and he was very nice.  He offered dessert on The Cheesecake Factory, which tremendously soothed my anger.  I had Chicken Marsala, which was perfect, as it is each and every time. NI believe we had an untrained hostess on a terribly busy night.", "rating": 3, "date": "8/8/2015"}, {"text": "I&amp;#39;m only here visiting and I decided to get lunch here. The staff is extremely courteous and the food was delicious. I just had the shrimp scampi and herb crusted salmon combo, and I order the Godiva cheesecake to go. Everything was great", "rating": 5, "date": "5/1/2014"}, {"text": "Great service, wonderful happy hour, yummy food", "rating": 4, "date": "11/16/2013"}, {"text": "I&amp;#39;m a big fan of The Cheesecake Factory.  It isn&amp;#39;t perfect, and it is most certainly overpriced...but it is a good time, and I get consistently great food.<br&gt;<br&gt;Pros:  The menu is vast (literally something for everyone).  The food is good.  The service is friendly.  The cheesecakes are huge and great quality.  Vegetarian friendly.  Great artichokes - I can&amp;#39;t get those anywhere else (out) consistently! <br&gt;<br&gt;Cons:  The menu is vast (a little too much?).  The food is overpriced.  The tables are tooooo close together.  There isn&amp;#39;t one in Lexington.<br&gt;<br&gt;Pro Tip:  Ask for a booth, it&amp;#39;s worth the wait.  You can eat cheap.  The grilled cheese w/ fries is incredible.  The small plates (tapas) are affordable.  The appetizers are entree sized, just add a side.  Plan to take half of what you order home w/ you for lunch the next day.  If you have a kid with you, ask for free bananas and bread to start.", "rating": 4, "date": "4/4/2010"}, {"text": "You cannot beat the cheesecake at this place!  10 stars!!  My favorite pasta is the New Orleans Pasta which is spiced just right and served in a portion size that is easy to share.", "rating": 5, "date": "12/29/2013"}, {"text": "Same as Cheesecake Factories everywhere. I just wish the portions were smaller. We had a group and literally everyone ordered lunch portions, and they were still ridiculously huge. <br&gt;They took good care of our birthday group and made an appropriate fuss over the 80-yr old birthday girl.", "rating": 3, "date": "7/24/2010"}, {"text": "First visit here . Food very good and hoclean and nice atmosphere. Only complaint not really crowed ,but waited way to long for food.", "rating": 2, "date": "1/30/2016"}, {"text": "Well this was our second visit, most of the food was good but, some of the food was very poor . I ordered appetizers it was the wrong one so they took it back then it came the same time as my meal, I then found 2 big chunks in my potatoes and asked to speak to the manager , They brought me a new bowl of potatoes  and found another big chunk potato. At this time the manager showed up and I told him about all of this . Got my bill the only thing they took off was appetizer . I feel that my meal should have  been free . I feel like it is ran woth very poor mangament.", "rating": 2, "date": "1/9/2016"}, {"text": "Great staff, great food, wonderful environment...a little pricey though. Would definitely recommend and will return!", "rating": 5, "date": "9/25/2015"}, {"text": "There is something for everyone here, from super-large portions to Skinnylicious choices. The filling lettuce wraps and a skinny margarita is a choice I often make on days I&amp;#39;m trying to eat lighter. (Hint: try to avoid glancing at the awesome cheesecakes in the dessert counter on your way to your table!). The pretty decor and sunny bar area is a nice spot on a hot summer late afternoon. Get here during happy hour for a lighter bill.  Service is inconsistent, which can be annoying, but the food tends to make up for that in most cases. And the patio is nice too!", "rating": 4, "date": "5/31/2015"}, {"text": "My fiancé and I have tried a lot of filet mignon and Mac n cheese and we both agree that Cheesecake Factory is our favorite place for both. We also really enjoy the Oreo dream cheesecake. It has a really incredible oreo mousse layer.", "rating": 5, "date": "5/19/2015"}, {"text": "I&amp;#39;ve never had a bad experience or a bad meal at this location, or any other one for that matter.  The food is always great and the service is always friendly and quick, once you are seated.  Sometimes the wait is long, but it&amp;#39;s worth it if you can wait.", "rating": 5, "date": "6/3/2015"}, {"text": "The evening didn&amp;#39;t start off well. There was a very long wait and I discovered they had some sort of glitch in their paging system. They arbitrarily placed us back on the list and advised of an additional wait of 15 to 20 minutes. Drinks and an appetizer came to the table quickly as did fresh hot bread. The meal followed just as quickly and was delicious", "rating": 4, "date": "4/25/2015"}, {"text": "My husband and I went here for our first anniversary. It was very nice. The food was very good. i got the fish and chips. It was a big portion and tasty. Of course we ordered cheesecake. There were so many the choice was overwhelming. I chose the turtle cheesecake. Yummy!", "rating": 4, "date": "9/20/2012"}, {"text": "Loooooool cheesecake factory. <br&gt;<br&gt;Ok kids, first off, you must stop laughing to discuss the cheesecake factory. It&amp;#39;s hard to do :( the cheesecake factory is the Godzilla  that ate PF Changs, the best parts ( gag) of The Olive Garden, and a J. Alexanders. The Cheesecake Factory stomped all over these places and regurgitated them out in a spewing barrage of fire next to a Victoria&amp;#39;s Secret. Plus, cheesecake. <br&gt;<br&gt;Before moving to Louisville, I had never been to one of these places. After the moving truck had left and I was sobbing amidst 89546 boxes my husband looked at me and said HEY, YOU HAVE NEVER BEEN TO A CHEESECAKE FACTORY LET&amp;#39;S GO TO THE CHEESECAKE FACTORY. This from a man who is a regular at Viajante on Picadilly Square. <br&gt;<br&gt;Ummm, parking is never an issue at TCF. It&amp;#39;s got mall parking, plus,valet. The restaurant, Awww shit, we can&amp;#39;t even call it a restaurant... It&amp;#39;s like a COMPOUND. the compound seats roughly the size of a small country. If the people of Monaco ever decided to go out to eat together they could probably fit in TCF. It&amp;#39;s a clean place, with a sort of vaguely Mediterranean feel, and has lots of glass art sort of junk all over. They have GIANT booths that seat like twenty people. <br&gt;<br&gt;The menu weighs roughly the size of a teenager. BUT THEY SERVE BOOZE, and they have about 100 different wines. The cocktails are pretty boozy too, and big, Both the Mojito and Lemon Drop I&amp;#39;ve had were actually quite good. And onto the food...<br&gt;<br&gt;I hate recommending TCF. There are hundreds of independently owned restaurants where you can get a better meal for cheaper. everything at TCF is the WORST part of Amerikkkkka, gigantic portions, sugar in EVERYTHING,  TCF is why you&amp;#39;re fat, but..but...but..<br&gt;<br&gt;The food is pretty good. It&amp;#39;s not exactly innovative or exciting but it&amp;#39;s good. After eating there I actually read a few articles about TCF to like, make myself feel better about not hating it. It turns out TCF is hugely popular with pro athletes due to the portion sizes. NPR had a segment about trying to disparage the food served there and despite terrifying calorie counts they just couldn&amp;#39;t. It&amp;#39;s consistently voted one if the best &amp;#34; chain restaurants&amp;#34; and it&amp;#39;s pretty easy to see why. Stand outs for me include The Vietnamese tacos with Asian pork and lots of fresh cilantro, The spicy cashew chicken, and the Chicken and biscuits, which is perfect, trashy, buttery food coma goodness. They also carry something called a &amp;#34; glamburger&amp;#34; which I have never tried, but I like to imagine it&amp;#39;s a hamburger covered in glitter and rhinestones. the worst part of the meals are the actual cheesecakes, they are just gooey globs of very mild cheesecake usually covered in syrups or stuffed with drugstore candy. <br&gt;<br&gt;You sort of have to at least try TCF. It&amp;#39;s like Disneyworld. You go, you see what all the fuss is about, you never have to go again. But if you do go, get a glamburger and tell me if it comes on a rotating, mirrored platform.", "rating": 4, "date": "8/1/2011"}, {"text": "I went for the first time a week or so ago. The menu is so large it&amp;#39;s hard to decide - you know they can&amp;#39;t do everything really well. I got a salad and my companion ordered the Navajo sandwich. The chicken on both was very dry and we didn&amp;#39;t eat it. Otherwise my salad was good and the service was great.  Sounds like a 3 star review, but the prices knock off a star.  Paying almost $40 after tax + tip for a lunch salad and sandwich just seemed absurd to me. I won&amp;#39;t be back on my own dime.", "rating": 2, "date": "11/28/2011"}, {"text": "I had lunch there today, thanks to a gift card I received for Xmas. There was a ten minute wait for a table for some reason, even though I could see 10-15 empty tables in a section where they just weren&amp;#39;t seating anybody. There wasn&amp;#39;t anywhere to sit during this wait, because there were so many other people waiting, so we stood the entire time. <br&gt;<br&gt;When our food finally arrived 30 minutes after we were seated, our orders were wrong. The food runner set everything down as fast as he could and ran away before we could tell him. He delivered two identical sandwiches, but called one a club and one a blackened chicken. I guess he could only tell the difference because of the side items, which were both NOT the sides we ordered. Five minutes later, our server came to check on us and started to correct our order, That whole process took another ten minutes. The blackened chicken came in two minutes while the sweet potato fries came five minutes after that. So, either the chicken was sitting under a heat lamp the entire time, or it was sitting on another table where someone else touched it and took it apart to realize they had the wrong sandwich. I know they didn&amp;#39;t remake it because it came too quick. I know mistakes happen, but if the food runner had spent more than five seconds delivering our food, it could have worked out better. <br&gt;<br&gt;By the time this was all worked out, we were both so frustrated that we barely ate the bland $12 chicken sandwiches and were ready to leave. The only thing that was faster than the food runner was our server when we asked for our check. She was ready to get us out of there, apparently. I spent 50 minutes of life dealing with this place. I want those 50 minutes back.<br&gt;<br&gt;I will never go back to this place. Ever. You lost me as a customer. Forever.", "rating": 1, "date": "7/21/2012"}, {"text": "The food was excellent, but the service was the worst! My sister and I ate at this Cheesecake Factory Saturday June 30th around 9:00. Our waiter never checked on us once. We were never offered refills. My sister got the wrong food, and it was never corrected. Very slow service as well. The waiter spent a lot of time at the table in front of us, and would walk past our table. We were right next to the computer used to enter orders. Avoid this location!", "rating": 1, "date": "7/3/2012"}, {"text": "I love Cheesecake factory. It&amp;#39;s one of my favorite chain restaurants. They have huge portions and they are USUALLY consistent. However, this cheesecake factory is the least consistent of them all... and their ingredients are below average. I always get the calamari for appetizer, whether I eat in or take it togo. I have noticed that the portions of the calamari here is WAYYY smaller than all the other cheesecake factories. In addition, the last two times I got the calamari togo, it had a bad fishy/seafood taste. I love seafood, so I can take strong seafood taste. The calamari just tasted like they were in the freezer forever. Disgusting. The shepards pie I got last time was so gross. It had a strong meat taste. I dunno how old the ground beef was. NOT RECOMMENDED. I&amp;#39;m too scared to ever get the shepard&amp;#39;s pie here again. I always get the louisiana chicken pasta, it&amp;#39;s usually pretty good here. That&amp;#39;s probably the only thing that&amp;#39;s consistent so I will keep getting the louisiana chicken pasta from here. I&amp;#39;ve gotten the chinese chicken salad from here, it came without chicken. WHAT THE HECK??? Overall, this cheesecake factory is not as good as the other ones. This is the only one in Kentucky so I&amp;#39;m stuck with going to this one. Oh.. and I live like 2 minutes away so it&amp;#39;s pretty convenient to do the curb side order. I just call ahead of time and they take out the food to my car. I do this on really cold or rainy days. hehe.", "rating": 3, "date": "2/21/2013"}, {"text": "Prices are steep, but it can be worth it.  Lots of choices on the menu and the food is pretty good.  Nice open atmosphere and friendly staff.", "rating": 4, "date": "6/25/2013"}, {"text": "Service was slow and steak medallions were tough. I wouln&amp;#39;t reccomend them. The place was very noisy and obviously geared to the younger crowd, not senior citizens. I guess it would be OK for a lunch but not our cup of tea for dinner.", "rating": 3, "date": "11/16/2011"}, {"text": "An impressively large menu, but lacking in quality. I try something different every time I find myself at The Cheesecake Factory yet continuously find myself disappointed. The atmosphere is nice and the service is great, but I enjoyed the lettuce wraps and the pumpernickel bread more than my entree.", "rating": 2, "date": "11/7/2011"}, {"text": "Been there twice and both times the food was amazing! The wait can be a bit long and the price is a bit high but the food makes it well worth it.", "rating": 5, "date": "3/27/2011"}, {"text": "It is usually very busy. The menu is like a novel. Their steak is amazing as well as all their desserts. Service can sometimes be a little slow. Their prices are pretty high too.", "rating": 4, "date": "2/3/2014"}, {"text": "I like the atmosphere of the Cheesecake Factory, besides that the tables are too close together, it&amp;#39;s a cool looking place.  The cheesecake, heaven on a plate.  Love the salads too, very huge.", "rating": 4, "date": "12/28/2008"}, {"text": "I&amp;#39;ve been here about three times for dinner, always because I was with someone else.  The food is definitely not that great at all, especially for the price!  Last time I got a burger, and it was burnt.  I just don&amp;#39;t think it&amp;#39;s worth it and the staff is snobby and it&amp;#39;s always crowded.  The only reason I gave it 2 stars was because the cheesecake is AHMAZING.  My advice, get dinner elsewhere, and stop in and get some cheesecake to go.  The brownie sundae cheesecake is the best!", "rating": 2, "date": "9/8/2012"}, {"text": "BOOOOOOOOOO!  Just asked the manager if he would make an exception and a reservation for Saturday night for a Father/Daughter dance for 5 eight year old girls and Dad&amp;#39;s that have been trying to eat there on a Sat for the dance for two year and he said no. Not good customer service in my opinion and I&amp;#39;ve eaten here before and it wasn&amp;#39;t memorable.", "rating": 1, "date": "1/19/2013"}, {"text": "I have been to a couple different locations and it is definitely one of my top 5 favorite restaurants! It honestly doesn&amp;#39;t matter what you order, everything is amazingly tasty and come in such huge portions that you can take home lunch for the next day! I would like to recommend, our favorite-the Hawaiian Salad-it&amp;#39;s so big that it takes two people to eat it. My husband and I generally go and split meals and leave very full. The menu is very eclectic, so it doesn&amp;#39;t matter what kind of food everyone is craving, you will be able to satisfy a large group of people at this one restaurant! And, of course, you can&amp;#39;t leave without having the famous cheesecake (which comes in so many flavors that you&amp;#39;re sure to find one you like)-even if you just take a slice home for later. These are also plenty big enough to split. We especially like the Key Lime Mango and Godiva Chocolate (be warned that this one is VERY rich!)", "rating": 5, "date": "6/26/2010"}]}