{"address": ["3975 Townsfair Way", "Easton Town Center", "Columbus, OH 43219"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 3.5], [4, 3.0], [5, 3.0], [6, 2.5], [7, 3.0], [8, 2.0], [9, 2.0], [10, 2.5], [11, 3.0]], "2017": [[0, 3.0], [1, 3.0], [2, 2.5], [3, 2.5], [4, 3.0], [5, 3.0], [6, 2.5], [7, 2.0], [8, 2.0], [9, 2.5], [10, 3.0], [11, 3.5]], "2020": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.0], [7, 3.5], [8, 3.0], [9, 2.5], [10, 3.5], [11, 4.0]], "2018": [[0, 4.0], [1, 4.0], [2, 4.0], [3, 3.5], [4, 3.0], [5, 3.0], [6, 3.0], [7, 3.0], [8, 3.0], [9, 2.0], [10, 2.5], [11, 3.5]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "Went here May 29, 2020 on a Friday. They were allowing customers to dine in. It was great... service, safety, food, and cleanliness. Coming out of quarantine was already difficult, but this location made things easy for staff and customers.", "rating": 5, "date": "5/30/2020"}, {"text": "Another day, another cheesecake.  We decided to grab some dinner this past weekend and settled on CF. We generally always go to the Easton  location but went to the Polaris one this time around.  The restaurant itself isn&amp;#39;t quite as big but it&amp;#39;s busy and a fun environment. My favorite part about this menu is how insanely large it is. I ended up getting  the Philly  cheese steak, which was fantastic. Then my wife and I split the tuxedo cheese cake, unfortunately we ate our food before I got a picture but I did grab one of the delicious cheese cake. We love this place.", "rating": 4, "date": "1/28/2020"}, {"text": "Did I already mention that I love chain restaurants?  There is something I really enjoy about knowing what you are going to get and the food tasting the same every time.  I know....kind of boring.  <br&gt;<br&gt;The notoriously long menu here really seems to be love or hate, but I love it.  So many choices!  This time I tried the shepherds pie and it was amazing.  Hot and filling with really fresh vegetables.  It tasted like it had red wine in it as well.  Also if you like having leftovers for lunch the next day, this is your spot.  <br&gt;<br&gt;We went on a weeknight, so there was no wait to be seated and service was excellent.  Some fun holiday cheesecake varieties in the dessert case almost tempted us, but we were too full.", "rating": 4, "date": "11/22/2019"}, {"text": "Bad experience all the way around. I went here today to take advantage of happy hour. I was out on the patio and they told me that I couldn&amp;#39;t take advantage of that pricing because I was not at the bar. I asked in light of the current pandemic if they would make an exception and they said no. I was willing to except that. Although I thought it was kind of crappy. I continued to order the way I was going to order anyways. I then asked if I could get half of a cheesecake to go. I asked if I can get one that is not frozen.  They had enough slices to do so but they told me that they were unable to do it because they would only sell it to me frozen. When I asked them to please give me the unfrozen half they didn&amp;#39;t want to do it and the manager was terse. When he came out to speak to me he was very short condescending and didn&amp;#39;t seem to want to hear what I had to say but just offer me his explanation for not wanting to do the things that I wanted. I told him that maybe he should ask me why I wanted to see him before he started telling me what he couldn&amp;#39;t do. He told me I was getting greatly worked up over this.   In the end he ended up giving me half of a cheese cake unfrozen cheesecake which I paid for. When I brought my cheesecake home there are pieces of paper stuck in my cheesecake as you can see for the picture I posted. The server that I had was very kind he came in it was a substitute server for the one we were supposed to have come to our table for over fifteen minutes. His name was Harrison. He was the real MVP.  Brian was the manager who reluctantly took care of us.", "rating": 2, "date": "6/17/2020"}, {"text": "We sat outside. The food was fantastic. The covid precautions felt safe. They preferred that we view the menu on our phones but brought a paper one when asked. Friendly service.", "rating": 5, "date": "9/24/2020"}, {"text": "We stopped in on a whim and did not know what to expect.  We try to avoid chain restaurants and prefer fresh healthy options.  We were pleasantly surprised.  They had a great decor, a stunning, large and modern menu, and lots of heathy/plant based options.  Our waiter seemed really busy, which is no surprise during covid, but was fantastic and tried really hard.  The food tasted nothing like a chain restaurant (i.e. prepared in a factory, reheated from frozen, and then slapped on a plate under a heat lamp).  Instead everything seemed fresh.  At least the things we ordered.  The only complaint is that the fries tasted like McDonalds, which was great when I was 11.  Today we look for more creative presentations and flavors.  Otherwise we loved it.  Thank you CCF for making a chain restaurant really pretty good.", "rating": 5, "date": "11/28/2020"}, {"text": "My husband and I just had the most amazing lunch.   We just stopped after traveling from St. Louis and wanted a nice meal.  My husband ordered the Breakfast sandwich that was fit for a King.  It was made on toasted Brioche bread,bacon,ham,cheese, eggs, mayo and a slice of fresh tomato.  I had Tuscan chicken entree from the skinny Menu.  There was nothing skinny about the taste.  It consisted of boneless chicken breast with a sauce made of roasted tomatoes, capers , artichokes and basil .  To top it all off I had a red raspberry cocktail.   Our server Naomi was excellent.  She was very attentive and personable .  If you happen to dine here make you ask for her.", "rating": 5, "date": "7/8/2020"}, {"text": "Made us wait an hour just to sit us outside. Not clear or helpful with putting your name in for reservations of any sort or anything. They need to work on being clear with seating an options when people of the party have medical conditions.", "rating": 2, "date": "8/29/2020"}, {"text": "The service sucks from the hostess to the waitress who never followed up with me. I ordered the guacamole salad and added steak....the steak came out raw. I ordered cheesecake and it took 30 mins to come out.", "rating": 1, "date": "8/13/2020"}, {"text": "While I understand the new world of Covid and dining, however when my food arrived cold (mash potatoes hard from sitting under the heat lamp and Madeira sauce on chill) I asked to have another prepared. The manager brought my food back....SAME PLATE REHEATED AND HIDDEN JNDER EXCESS CHEESE...<br&gt;<br&gt;That&amp;#39;s seems unhealthy and dangerous during the pandemic to take food already eaten off of and put in back on the grill or in a microwave where other food is prepared ....DANGEROUS...<br&gt;<br&gt;And I&amp;#39;m still waiting on my new plate...<br&gt;<br&gt;I think this location needs a break.", "rating": 1, "date": "6/23/2020"}, {"text": "Went here with a gal pal for a small lunch after a shopping day. Nice staff, and we actually got seated pretty quickly. I got the fried mac n cheese and she had the Buffalo chicken tenders. The chicken tenders portion was extremely generous, which we were happy about. Our biggest gripe with the meal was that there was too much breading on both the mac n cheese and the chicken. On top of that, the mac n cheese didn&amp;#39;t have a ton of flavor, which was pretty disappointing. This probably won&amp;#39;t be my go-to place, but I&amp;#39;d come back and try something else.", "rating": 2, "date": "12/11/2019"}, {"text": "UPDATE: I was gonna take this to my grave, but it has now happened TWICE. This is the second time in a row where a glass has been shattered around the edges of my beverage. I went to this location a couple of months ago and a jagged corner of my glass cut my mouth. I went to the manager and she was so remorseful and gave us our meal for free that I wasn&amp;#39;t going to hold it against them; after all, they were going to replace all of their glasses as well as retrain employees about checking the cups before they&amp;#39;re on the floor.... you would think. I also laughed it off thinking, &amp;#34;what a weird fluke!&amp;#34; Is it a fluke though? Apparently not.<br&gt;<br&gt;I went there again and obviously checked my glass. It had a huge slice taken out of the rim, sharp as glass (pun intended). NO JOKE. I was furious! Luckily I noticed it was sharp and didn&amp;#39;t hurt myself, but it really could have hurt someone! They obviously don&amp;#39;t care and it&amp;#39;s flat out dangerous. I told the manager, a different one, and he gave me some flimsy smile and took my meal off the bill, still charging my wife. Whatever. I appreciated that, but there&amp;#39;s no excuse for it happening twice! No one should be subject to stitches while they&amp;#39;re enjoying dinner.<br&gt;<br&gt;I&amp;#39;ll never go to this location again and good luck if you do.", "rating": 1, "date": "8/11/2018"}, {"text": "I really enjoyed my last experience at the Cheesecake Factory. Maybe because of the people maybe because of the food. The menu is very overwhelming which is why I did not put 5 stars as there is so much to choose from that I could not pick. I ordered chicken parmigiana which was a great pick as the chicken was cooked to perfection. Everyone enjoyed their meal and I finished it with some chocolate cheesecake to go. Definitely recommend", "rating": 4, "date": "12/23/2019"}, {"text": "I&amp;#39;m super surprised at how very bad the service was.  Especially in this time of Covid where people aren&amp;#39;t going out.  I met a friend of mine for dinner and have ordered a bunch of things, they took forever to come out, not once did the server ask us how our food was and we have been here over two hours and not had our drinks refreshed.  They are still in business in spite of themselves.    Not coming back, good luck CKF", "rating": 1, "date": "9/23/2020"}, {"text": "Good Food, Great Service!<br&gt;<br&gt;They have an expansive menu so they have something for what ever you have a taste for.... oh and they make pretty good cheesecake !!! <br&gt;<br&gt;I ordered the Salmon as my entree, and it was taking a bit longer than expected to come out, so my waitress &amp;amp; the manager comped me a salad while I waited for my Salmon to come up. <br&gt;<br&gt;I love that their selection of cheesecake is always changing while they also maintain a list of &amp;#34;regulars&amp;#34;.", "rating": 4, "date": "9/15/2018"}, {"text": "The Bang Bang chicken and shrimp is by far the tastiest dish I&amp;#39;ve tried. The mango key lime cheesecake is my absolute favorite!", "rating": 5, "date": "1/20/2020"}, {"text": "Well, didn&amp;#39;t start off well. We had a reservation and they apologized and asked if we would want to sit at a high top bar table.  Um, not with our son. Great host &amp;#39;found&amp;#39; a table. I am sure he asked  a server friend to &amp;#39;pick us up&amp;#39;. Whatever, at least we had a table. Server friendly and efficient enough. Bread (that we love) didn&amp;#39;t come out until AFTER our appetizer and main courses were served. Food was hot and good. Host and server made points up because it was my husband&amp;#39;s birthday.", "rating": 3, "date": "10/25/2020"}, {"text": "We had a delightful takeout Tuesday at the Cheesecake Factory. My wife kindly served as my &amp;#34;get away driver. Dropped me off in the front of the restaurant while she picked a close by parking space. I went inside and found the &amp;#34;social distancing carousel&amp;#34; around what is typically the welcome desk. Literal red tape kept us each in our boxes as the prior person got their orders. We hadn&amp;#39;t heard of the free cheesecake slice promotion they are offering on orders of $35 or more, and it certainly wasn&amp;#39;t proactively offered on the website so we paid full price for our two delightful cheesecakes, the pasta carbonara and buffalo blasts. The food was packed well, and I liked that they had different areas set up based on where the order had been placed. I never thought I would look forward to sitting in their shockingly uncomfortable plastic chairs, but it will certainly be something that brings me joy once &amp;#34;social distancing is in the books.&amp;#34;", "rating": 5, "date": "4/11/2020"}, {"text": "It&amp;#39;s been years since I&amp;#39;ve been to The Cheesecake Factory and will likely be even longer before I go back again. Not because I had a bad experience or because the food was awful but because it was just average food with an above average price. I ordered the buffalo wings which were less than stellar. I also had the shrimp with angel hair pasta, also average. And the loaded baked potato tots were decent. We had great service but that was the only thing memorable.", "rating": 3, "date": "1/10/2020"}, {"text": "Food is mediocre and seating is average. Has so much potential to be the best restaurant in Columbus. Our particular meals were fettuccini Alfredo and spaghetti with meatballs. Both meals could have been prepared better. The cheesecake on the other is the most amazing cheesecake I&amp;#39;ve ever had. Still a great place to dine-in", "rating": 4, "date": "8/9/2020"}, {"text": "We went for a birthday celebration, and it has been the best service we have received. Workers wore masks, which ensured their need to protect themselves and others from the spread of COVID-19. They also provide sanitizing stations at the front. <br&gt;One order did come out wrong, but they gave us a free cheesecake on the house, which showed they really care for their customers. The servers were also very sweet which made the experience a whole lot better. In conclusion, it was a really great experience with good food and good service. We will definitely come again.", "rating": 4, "date": "7/25/2020"}, {"text": "I love this restaurant. Not only are there unlimited choices... it&amp;#39;s reliable. I pretty much order the same few things everytime I go, because they are always so good!!! This is my favorite chicken Caesar salad of all time (BOLD STATEMENT I KNOW)! I also love their fries, which I usually get, but opted for the burrata instead. I had never tried it before there! I thought it was pretty good. It doesn&amp;#39;t come with anything (bread/cracker wise) though, but our waitress had some of the sour dough Bread cut up thin for us! I would definitely order it again if I was in the mood! My fiancé always get the four cheese pasta and adds chicken. I didn&amp;#39;t try it but he told me it was good. We both ordered the lunch sized portion of our dishes and it was more than enough. Both ended up taking home leftovers. FYI, this salad is so good, it&amp;#39;s good the next day too!!!", "rating": 5, "date": "12/5/2019"}, {"text": "We had 6 in our party and were seated promptly at our reservation time on a Saturday evening. The service and food were very good and we will return.", "rating": 4, "date": "10/31/2020"}, {"text": "I&amp;#39;ve been coming to this cheesecake for a while now since I&amp;#39;m a local. Out of about 50 times I&amp;#39;d say 45 of those I&amp;#39;ve received very slow, nonchalant, and uncaring service. Food is good so I come back but I&amp;#39;ve reached a breaking point to where I have to give the negative review. I waited in a long line to receive my order tonight then afterwards I asked them to bring me a extra Parmesan cheese (as I usually do because when I place my order I always ask for an extra and they always forget). After waiting in a long line for 20 minutes I waited another 20 minutes to get my cheese. There were a lot of employees that were doing nothing at the time and heard my request and decided to ignore me. Unacceptable and unprofessional but whatever. I&amp;#39;m sure it&amp;#39;ll continue. It is what it is.", "rating": 1, "date": "3/20/2020"}, {"text": "Horrible service today at 4:45 pm. Waited and waited for all aspects of meal. Ordered 2nd cocktail that never came. Manager never offered free anything.  Server talked us into ordering to go cheesecake from him instead of up front. We are still waiting after 40 minutes for our &amp;#34;to go&amp;#34; cheesecake. Last time EVER eating here", "rating": 1, "date": "10/17/2020"}, {"text": "Came here with a group of colleagues my first week on the job in Columbus on a Thursday for a group lunch.  We found parking easily and it wasn&amp;#39;t a long walk to get there (thank you Barnes and Nobles for letting us cross through).  When we reached the restaurant, we were promptly greeted and seated in a nice quiet section of the restaurant.<br&gt;<br&gt;Our waitress was a gem, she took our drink orders quickly and then told us some of the specials and some of the items that they ran out of (and joked with us saying well there are the other hundreds of items to choose from... she had the exact number which was impressive).<br&gt;<br&gt;We waited a short while for our drinks and bread to come but once we were situated she took our orders.  Our food thankfully arrived quickly to our table.<br&gt;<br&gt;We ordered the avocado and chicken rolls for the table as shared apps, both of which were delicious and nice and crispy on the outside but not super greasy either.  The dipping sauces were a great add to enhance the flavors.<br&gt;<br&gt;For my main course I ordered a jambalaya type dish off of the lunch menu.  It was tasty with a nice kick!<br&gt;<br&gt;The waitress also helped a few of us whose coats ended up sliding off and onto the floor, I learned something new with how to secure your coat on the chairs there!<br&gt;<br&gt;While it&amp;#39;s certainly not an every day lunch spot for me, if I had to gather the team for a close by lunch outing, this place would be on my go to list again!", "rating": 5, "date": "3/23/2019"}, {"text": "Some friends and I recently had lunch at The Cheesecake Factory and it was good.  For this reason, we decided to place an order for delivery with the restaurant. <br&gt;<br&gt;We placed an order for 1 entree &amp;amp; 2 orders of &amp;#34;warm apple crisp&amp;#34; from the menu.  We understand that ice cream doesn&amp;#39;t travel well, so we advised to skip the ice cream.  When the order arrived we found two ice cold containers of dessert sitting on top of the driest spaghetti I&amp;#39;ve ever seen.  Not a drop of sauce to be found.  <br&gt;<br&gt;The apple crisp had been taken right from the fridge but there was no &amp;#34;crisp&amp;#34; to the dessert.  What we received (for almost $20) was two containers of cold spiced apples.<br&gt;<br&gt;When I called the restaurant they tried to justify it by saying it is their policy to send it cold.  What? I&amp;#39;m paying the same as a customer in the restaurant so I deserve to have my food served the same way.  My spaghetti didn&amp;#39;t come to me with the intention that I have to warm it up, why should my &amp;#34;warm&amp;#34; apple crisp (minus the crisp) be different?<br&gt;<br&gt;Do NOT order delivery from this restaurant.  I got platitudes and excuses from the manager.  That doesn&amp;#39;t help when I just paid $50 for inedible food.", "rating": 1, "date": "8/11/2019"}, {"text": "Over priced. Over rated. Glorified Ocharleys with a larger menu. Why is the eye of Sauron everywhere? Get your shot together Cheesecake Factory. It ain&amp;#39;t 2003 anymore. Lower your prices and stop posing as a fancy restaurant. Ps your bread is always stale.", "rating": 3, "date": "9/15/2019"}, {"text": "To say that this place is disorderly would be an understatement it is entirely loud. Seating is minimal to none on a Friday evening with ridiculous waiting hours Between 1 to 2 hours before you can even get a seat. This restaurant is not kid friendly just because the atmosphere it&amp;#39;s not kid friendly due to the fact that there Are unreasonable waiting hours. So far the restaurant seems extremely understaffed today. The hostesses dressed inappropriately and talks to the customers in an unprofessional manner. If you&amp;#39;re looking to have dinner and a quiet atmosphere this place is not it.<br&gt;<br&gt;On the plus side. The food is exceptional. The restaurant caters to people with genuine food allergies, and offer a variety of gluten free dishes. For that reason I would recommend this place however, they should really get the noise under control and have more coordinated staff.", "rating": 2, "date": "3/1/2019"}, {"text": "This week, I took my family to celebrate something special and The Easton location was a big disappointment. Specially the quality of the food.  Pasta was gummy, obviously just a plate full of not-fresh bow ties. The cheesesteak sandwich was 90% baguette.  Dry, And again, sat too long waiting for the other orders to get finished.  <br&gt;Family celebration for a new grandson would have been better at home. Not a positive visit.  Probably the last..", "rating": 1, "date": "10/27/2019"}, {"text": "Very poor service and very rude front door Hostess at the Polaris location. Will never go back there and spend my money again.", "rating": 1, "date": "10/9/2020"}, {"text": "The worst experience ever!!  A hour wait that had reservations set, another hour just to place a food order. Received food which was suppose to be shrimp scampi. No sauce just some VERY dry noodles with shrimp on the side. The whole group that i was with complained about their food. I sent my plate back. Definitely didn&amp;#39;t want that mess!!! Most certainly done with food chain restaurants.", "rating": 1, "date": "9/20/2019"}, {"text": "Though I love the Cheesecake Factory, service was mediocre and exceptionally slow and the House wasn&amp;#39;t full. The presentation of the food is excellent and it was delicious. We had only one complaint. We parked at a meter with a max time of 90 minutes. Our food came 12 minutes before the meter expiration. What do we do? Leave our food to get cold to walk to the meter or risk getting a ticket? I would definitely come back.", "rating": 3, "date": "10/16/2019"}, {"text": "Overall the experience was a four.<br&gt;1. Service was very mehhh.  I asked the waitress what she thought about the Mediterranean Chicken and she said:<br&gt;No but that is only because I am picky..<br&gt;<br&gt;Lol, what did that mean????<br&gt;<br&gt;2. I ordered a latte, the Mediterranean Chicken (yes, inspite of the not so glowing review I still tried it), and did salad.<br&gt;<br&gt;The latte was OK.  I would not order it again.  I came in a tall glass?? Confusing. See pic. <br&gt;<br&gt;The Mediterranean Chicken was awesome.  Highly recommended.  Health, light, and flavorful.<br&gt;<br&gt;The side salad was enjoyable.  The  vinaigrette was refreshing.<br&gt;<br&gt;Inspite of my preconceptions I was pleasantly surprised.", "rating": 3, "date": "10/3/2019"}, {"text": "Come for the Cheesecake!! Stay for the lovely decor. Food is also good but I prefer the cheesecake for sure.<br&gt;<br&gt;I like the Cheesecake Factory for the great service and atmosphere that the restaurant provides. But please mind that this isn&amp;#39;t a Guild House type restaurant. It&amp;#39;s low key, and lovely.<br&gt;<br&gt;Two stars, for a couple of reasons.<br&gt;1.) Some of the workers look as though they could be elsewhere and pointedly ignored a couple customers.<br&gt;<br&gt;2.) They had some desserts sitting out for about 5 minutes in a busy area.<br&gt;<br&gt;I worked in restaurant and currently work at one and we would get in trouble for things like that. But most mainstream restaurants can be like that when it&amp;#39;s a busy night.<br&gt;<br&gt;There was a nice lady who finally helped others waiting for more than 10 minutes for a single cheesecake. She was clearly doing other peoples jobs. I like CCF but this was a rare miss. I am sure it&amp;#39;s not always like that.", "rating": 2, "date": "2/2/2018"}, {"text": "So honestly, who doesn&amp;#39;t really enjoy The Cheesecake Factory? I really don&amp;#39;t expect anyone to speak up. Because they do everything so right. The worst part about the factory is the wait. Expect to be waiting some time for a table to free up. Also the place is pretty noisy which can have a negative effect as well. But that&amp;#39;s it for the negatives!<br&gt;<br&gt;Now to the food... it&amp;#39;s pretty good. They have a HUGE selection of foods from different cultures: Asian, American, Spanish, Italian ... etc. so there is definitely something for everyone. But sometimes the menu can feel overwhelming. I find myself having a difficult time deciding between exactly what I want. I&amp;#39;m not saying that as a negative thing. But just a &amp;#34;FYI&amp;#34;. I&amp;#39;d rather have more choices then less. I often find myself on the pasta side of the menu (I love pasta). I&amp;#39;ve been here a couple times and gotten a couple of the pasta dishes (Carbonara, Louisiana Chicken, Alfredo) and I&amp;#39;ve never been disappointed. So it&amp;#39;s safe to say that whatever you choose you should be pretty happy. <br&gt;<br&gt;Now onto the Cheesecake. As you could guess by the name this is there pride and joy. They offer. HUGE selection of cheesecake as well. There is literally a flavor and style for everyone. I had to try the cookie dough the last time I went there. It was pretty good. The prices are also a decent size as well, which makes it better. I&amp;#39;m pretty certain in the front of the place you can order yourself a whole cheesecake if you so choose so. <br&gt;<br&gt;This place is great. I decided to give it 4 stars because they do everything great, but there wasn&amp;#39;t anything that blew my socks off however. I feel like maybe if they took less items off the menu and focused on certain things it could be a better taste and experience overall. But with that being said. There isn&amp;#39;t nothing bad to really complain about. This place perfectly balances quality and price. You feel like your getting what your paying for. If you have never been then it&amp;#39;s a must try in Columbus.", "rating": 4, "date": "3/23/2018"}, {"text": "We wanted to love our experience.  Our waiter was fantastic, our reservation was ready  to the exact minute, however the food was less than desirable.  We chose The Cheesecake Factory for our daughter&amp;#39;s dinner to celebrate a weekend away for her 8th birthday.  She wanted an over the top dessert and we thought this would be perfect for her.  Our appetizer did not come out (although we were ultimately okay with this), our dinners took over 30 minutes for completion, and once done they were served one meal at a time over the course of minutes...  Our daughter wanted breakfast for dinner and was disappointed to received slightly undercooked eggs.  I followed suit with huevos rancheros that I quickly regretted.  The black beans were hard, SSU eggs were undercooked and slimy, and the tortillas were chewy.   On a high note, at least the Reese&amp;#39;s cheesecake was delicious.  We&amp;#39;ll opt for a Carryout cheesecake only in the event we decide to return.", "rating": 2, "date": "9/27/2020"}, {"text": "So the Cheesecake Factory usually is a guaranteed great option. However the food was not that great this time. I ordered the cauliflower and it was just okay. however I think they gave me what was at the bottom of the pan because it was mostly crumbs of cauliflower and I found a French fry in my food. I&amp;#39;m Thankful that it was not something else lol. Also I ordered a veggie burger and it came out cold and it had a huge past noodle stuck on the bottom. Again I&amp;#39;m thankful it was not something worse but it was another disappointment. The waiter did apologize and brought me out another one that was hot but it was not a good veggie burger. The only positive experience was the waiter. She was very nice and attentive. I give her personally a 5 star! But the experience as a whole was a 3", "rating": 3, "date": "7/10/2019"}, {"text": "Cheesecake factory is one my favorite places to dine. The cheesecake is delicious. I traditionally eat the oreo, but I recently tried the Hershey&amp;#39;s chocolate and it was amazing!", "rating": 5, "date": "8/8/2019"}, {"text": "Crazy busy place - but it was an AMAZING meal!  We thought going at 5 pm would beat the crowd - but we were wrong.  Not sure if there were lots out for dinner before a movie or eating after early holiday shopping - or perhaps off school/work for Veterans Day (on a Friday).  Regardless, we think they said it would be a 10 minute wait - and it was eleven.  Not bad, but lobby was crowded as it was SO COLD out that night.<br&gt;<br&gt;We got a nice 2-seater table away for any window - good so we could warm up.  Our waitress was super nice and attentive.  Overall, they did a good job keeping our drinks filled (we got a different waitress half way through our time there - weird.)  <br&gt;<br&gt;Hubby ordered the chicken chipotle pasta dish.  He had ordered it before and remembered it being good.  This meal lived up to his recollection and was very good (EMPTY PLATER).<br&gt;<br&gt;I ordered the Skinnylicious chopped chicken salad dish - dressing on the side.  I think I got what I ordered (no dressing - ever.  but it was fine without).  I question whether it was actually a Skinnylicious under 590 calorie dish as it was SO GOOD.  There was plenty of flavorful bacon and crumbled bleu cheese, as well as chicken, avocado and corn.  It was a huge serving.  I just have trouble believing it was Skinnylicious.  Regardless, I ate EVERY SINGLE BITE OF IT!  I posted a photo - check it out.  You can see al the cheese and the pile of shredded greens.<br&gt;<br&gt;The only very  minor complaint (although it&amp;#39;s more of a strong comment) - was the food seemed to take a while to come out.  Granted we had fresh bread to snack on - so we weren&amp;#39;t dying of hunger.  Also, we really weren&amp;#39;t in a hurry to go back out in the cold to trek back to the garage for our car.<br&gt;<br&gt;I have to remember how much I love the salad so we return more often.", "rating": 5, "date": "11/11/2017"}, {"text": "Don&amp;#39;t order the NY strip! It&amp;#39;s a very thin portion (definitely not worth the price). When we received  our steaks, they were over cooked (actually charred). Our sides of broccoli were dry and not tasty. We planned out a nice lunch and left extremely disappointed.<br&gt;<br&gt;(Responding to Guest Service)<br&gt;<br&gt;We did speak to a manager who was less than helpful. FYI, tell your manager(s) not to kneel on the floor when speaking to a customer. It&amp;#39;s very unprofessional. You must have recruited her from the Waffle House. Anyway, Please consider removing the (thin) NY strip from your menu. When you think of the Cheese Steak Factory, you think of a meal that is grandiose. In fact, people use to brag about the abundance of food that you use to serve. Your NY Strip is a huge disappointment. Even your manager states that it was a hard steak to cook because it is too thin", "rating": 2, "date": "10/3/2019"}, {"text": "Terrible service!   Server messed up order and left one plate out for extended time while waiting for the correct food for the other party   Food was then cold No attempt to compensate for  poor experience.   Poor management at this location!", "rating": 1, "date": "2/9/2020"}, {"text": "One of the things I love about the Cheesecake Factory is that the options are plentiful, both for the meals and the cheesecake! Unfortunately, I think that&amp;#39;s also the drawback. It seems the menu is so big things can&amp;#39;t really be executed well, which is to be expected, but the price and the product don&amp;#39;t match in my opinion. <br&gt;<br&gt;My friend and I came here last night because I had a $50 gift card and we thought we&amp;#39;d be pretty set! Unfortunately, the meal was both much more expensive, and much more underwhelming than anticipated. <br&gt;<br&gt;I started with the loaded tots appetizer which was delicious! Highly recommend! I also had a blood orange margarita which was just okay, and for $11.50 I expected much better! <br&gt;<br&gt;For dinner I had the bang bang chicken and shrimp which was just under $20 and was also just okay. The description said it was a spicy dish which is what sold me, but on a scale of 1-10 of spicy I&amp;#39;d say it was a 1. I&amp;#39;m not sure if they just forgot to put it in, but the whole meal was pretty bland. In addition, the serving size was huge! I took home way more than I ate and 3 people could have easily filled up with this one plate of food. While It&amp;#39;s nice to get your &amp;#34;bang for your buck&amp;#34; in portions, I would have preferred the bang to come from the quality of the meal. I&amp;#39;d be much more inclined to pay more for good food than pay more for a lot of bad food. <br&gt;<br&gt;I&amp;#39;m also still pretty unsure what the ambiance is all about. The chairs are really small and uncomfortable, the tables are really close together and awkward, and the lights are so dimmed the old woman next to us was using her phone light to read the menu! <br&gt;<br&gt;On a brighter note, the Cheesecake was delicious and the service was great! If I ever come back (which I would only do if given another gift card) I would stick with appetizers and cheesecake! All of my favorite things have always been the small plates/appetizers and they&amp;#39;re also much more affordable!", "rating": 2, "date": "8/17/2018"}, {"text": "The front desk person had a attitude then we got seated in the corner and didn&amp;#39;t even get served at all. Waited for a whole 20 minutes then re ask to be seated somewhere else waited 10 more minutes to get re seated. The seated person was rude then re waited another 20 minutes to get served finally. The food was very cold and took a long time to for it to come. BAD SERVICE very disappointed I wanted to spend a lot cause me and my friend was craving it.", "rating": 1, "date": "3/3/2020"}, {"text": "1 star because it can&amp;#39;t be zero. Must be a poorly managed location because employ engagement is horrible. If this wasn&amp;#39;t part of a popular shopping location I&amp;#39;m sure business would fail.", "rating": 1, "date": "12/22/2019"}, {"text": "I had the best filet mignon, good service,  5/5 stars I would recommend this place.  Everything was great.", "rating": 5, "date": "2/15/2020"}, {"text": "Danny the server is amazing! He served my husband and I with a smile and we never had to wait for our drinks. Danny also made good conversation with us &amp;amp; he looked like he was having a good time! We will definitely be back!", "rating": 5, "date": "2/1/2020"}, {"text": "Always amazing food. Make a reservation or be prepared to wait forever. Service is great too. Above and beyond to make sure we had everything we needed", "rating": 5, "date": "6/30/2020"}, {"text": "Service is okay but food prep has gone way downhill lately, my food came out wrong twice. It&amp;#39;s always crowded so there&amp;#39;s no real incentive for them to improve.", "rating": 1, "date": "9/15/2019"}, {"text": "Chris, our server was phenomenal. The greatest guy and really made my birthday one to remember. He was so sweet and fun to talk to! Also so kind and overall a great server. 10/10.", "rating": 5, "date": "7/2/2020"}, {"text": "Whenever I think of The Cheesecake Factory I picture Oprah Winfrey singing lyrics to Drake&amp;#39;s song Childplay (&amp;#34;This is a place for families that drive Camries and go to Disney&amp;#34;) while slicing pieces of cheesecake for her guests. I have no clue why I picture this in my head, but it does sorta set a stage for what I expect when I plan to visit. It&amp;#39;s a very family friendly establishment, it can be rather lavish, and it&amp;#39;s pretty much what folks are deeming &amp;#34;basic&amp;#34; these days.  Now basic isn&amp;#39;t necessarily a bad thing. To me is just means, common or popular. <br&gt;<br&gt;This specific location of The Cheesecake Factory is right in the middle of Easton shopping center. This means there&amp;#39;s a lot of parking surrounding it but depends on the time of year, day, etc. you may have to walk a bit. When you&amp;#39;re walking in to give your name to the host, you&amp;#39;ll notice a great patio! I always choose to sit outside if the weather is nice. This spot also has a good sized bar and an enormous dining area. It honestly feels never ending. This is a good thing considering how busy this location is. It always seems like there&amp;#39;s a line out the door however I never seem to have to wait very long before I&amp;#39;m being taken back to a table. <br&gt;<br&gt;I feel like the last several times I&amp;#39;ve visited I&amp;#39;ve gotten the same waitress. She is a total sweetheart and has definitely been working there for a while. She&amp;#39;s always quick to greet the table, take drink orders, bring out bread, and she regularly checks in to make sure everything is going well. Speaking of bread, I love that they always bring out warm, freshly baked bread. Usually sourdough and honey wheat, both fantastic, especially when you&amp;#39;re starving! I don&amp;#39;t have a go-to menu item when I visit. I tend to try something new each time. I can confidently say that the Almond Crusted Salmon Salad is delicious! Big thumbs up! It comes tossed in a light lemon vinaigrette and it&amp;#39;s very refreshing! I also enjoy the Greek salad on the small plate menu, the avocado eggrolls on the appetizer menu, and the pastas are tasty and filling (the portions feel huge). Now, when it comes to down the actual cheesecake, I could go on and on forever. Every single one I&amp;#39;ve had has been amazing. The white chocolate raspberry truffle cheesecake is absolutely heavenly. I take a bite and it&amp;#39;s pretty close to an outta body experience - no lie. The white chocolate macadamia nut is also a top choice. I love the crunch of the nuts. It gives it some much-needed texture. <br&gt;<br&gt;Overall, I guess what I&amp;#39;m trying to say is the food and the service has always been pretty good here. Its consistent and consistent is nice and comforting. It&amp;#39;s why people visit the same restaurants over and over again. That&amp;#39;s likely why I keep coming back to The Cheesecake Factory when I&amp;#39;m hungry and it&amp;#39;s near by. While the majority of the time I dine out, I go local, I can make an exception to that rule every now and then.", "rating": 4, "date": "1/10/2018"}, {"text": "As usual, this Easton location is always superb.  Every dining experience, I leave happier than I came in  Food , drinks , service     The waiting to get seats are a challenge, BUT that is typical though.  TCF- 100%", "rating": 5, "date": "12/27/2019"}, {"text": "We came for cheesecake for dinner and they delivered. It was very good. My son was happy with his grilled cheese.", "rating": 5, "date": "4/13/2019"}, {"text": "It&amp;#39;s the Cheesecake Factory, they have a lot of things and they do them pretty well. <br&gt;<br&gt;This herb crusted salmon is one of the smaller portions, but isn&amp;#39;t too pricey for being seafood. The salmon is always moist and this sauce is delicious on the potatoes as well. <br&gt;<br&gt;Cheesecake is always on point as well.", "rating": 5, "date": "3/11/2018"}, {"text": "Stopped in Sunday afternoon about 1:00.  This place is busy!  We put our name down and waited about 30 min for our pager to buzz.  We were seated and promptly attended to.  Our drink order was taken and some time was given to review the 30 page menu.  The menu is overwhelming but if you break it down and go directly for the pages that are of interest then you only have about 2-4 pages to look at.  It&amp;#39;s even easier if you decided between dinner or sandwiches.  We chose sandwiches, and the sandwiches that we chose were delicious.  We have eaten here before and had items off the dinner menu.<br&gt; <br&gt;The Cheesecake Factory is pretty expensive but the quality of the meal is worth the price that you pay. The sandwiches are around $14 and the meals are around $20.<br&gt; <br&gt;Our server was fun and attentive. He brought out our drinks and fresh bread. We placed our order, and our sandwiches were brought out in a good amount of time.<br&gt; <br&gt;Our service was great, and the food was fabulous.  We shared a  1/2 sandwich with each other so we could try them both out, but we only ended up eating  1/2 of our own sandwich as we were full.  We both enjoyed our sandwiches and French fries and mentioned how tasty and fresh the ingredients were and the crispiness of the French fries.<br&gt; <br&gt;We did not order any dessert this time but have in the past.  The cheesecake is fantastic and I highly recommend ordering a piece. <br&gt; <br&gt;Order:<br&gt; <br&gt;CUBAN SANDWICH $13.95<br&gt;Slow Roasted Pork, Ham, Swiss cheese, Pickles, Mustard and Mayonnaise on a Grilled and Pressed Roll. Served with French Fries or Green Salad.<br&gt; <br&gt;CHICKEN PARMESAN SANDWICH $13.95<br&gt;Tender Chicken Lightly Coated in Parmesan Breadcrumbs, Roasted Peppers, Tomato Sauce and Melted Cheese on a Freshly Grilled French Roll. Served with French Fries or Green Salad.", "rating": 5, "date": "10/12/2016"}, {"text": "One of my favorite restaurants and I&amp;#39;m glad I only came in to get a to go desert. <br&gt;When I entered, three people st the hostess stand watched me enter without greeting. Thought that was awkward so I went to the cheesecake display and there was a guy who didn&amp;#39;t greet me either. I had to start the conversation. <br&gt;Not sure if it was because it was Monday or maybe they didn&amp;#39;t like my coat but it was a turn off. When I got rang up, he did so but when I paid with a card, he gave me my item (as he was talking to someone else), then had me sign giving me my card last. Just an awkward 10 minutes spent and for this, I&amp;#39;d rather use an app next time. <br&gt;I&amp;#39;m not a local and was in town for work. The key lime was the only sweet taste I had of this place.", "rating": 2, "date": "1/28/2019"}, {"text": "We go to Cheesecake Factories across the country because they are usually consistent in food as well as service. This was not the case with our visit to this location. My husband and I sat at the bar for brunch on a Sunday. Our service was outstanding; as were the Bloody Mary&amp;#39;s we enjoyed. That is where the enjoyment ended. We both ordered the Farm Fresh Eggs over easy. My husbands eggs were cooked correctly but my eggs were quite undercooked (egg whites where still runny).  The bacon was cold and overcooked, like it had been cooked earlier and put in a holding bin waiting to be ordered. I don&amp;#39;t know about you but bacon is sacred food and should be treated as such! The potatoes weren&amp;#39;t bad (crunchy) but lacked any character. The toast was thin and overcooked, which did little for sopping eggs. Overall, not worth the money.", "rating": 1, "date": "11/10/2019"}, {"text": "I&amp;#39;m not one to complain, but this is the 3rd time I have came here for cheesecake and every time something goes wrong. The first time I ordered three slices of cheesecake the weren&amp;#39;t ready when the pickup time said they were going to be. Then they claimed I never ordered online, but I had the online order receipt. The second time we ordered food and cheesecake the food was cold and the order was wrong. The last time was on my birthday on the 26th, I had a gift card that had $10.25 left on in so my mom went in to get the two slices. When she paid the cashier said it was $6.00 left to pay she paid with my card. I happen to look at my bank statement it shows $16 on it. I&amp;#39;m not sure what happened he either gave himself a $10 tip without my permission. I would never tell anyone to go to this location. This is crazy.", "rating": 1, "date": "10/30/2019"}, {"text": "Love the chicken Madeira at Cheesecake Factory   My favorite always. Great service for Valentines Day. Eating at the bar with the wait. Still wonderful.   Recommend at Eaton.", "rating": 5, "date": "2/14/2019"}, {"text": "I had a 4:00 reservation and once there I found out they were running behind. We were finally called back at  5:10. As we walked back to our table the waitress looked flustered and our table was still full of the last patrons stuff still.   So we had to go back up front and wait another 7 minutes. When we got to our table our drinks came out immediately but the bread was hard as a rock. Then we had to hunt our waiter down to place our order. Which was placed at 6:25   The appetizer was nasty. We had nachos and they were burnt. I sent my salad back because I asked for one dressing and got another on it. When the food came out they brought it out one person meal every 5 minutes. So we all got our food separately/ it was  6 of us. Then everything was cold but my chicken salad was warm. We ended up getting full on the lemonade. This was my sons birthday and it was ruined I complained to the manager but he was no help", "rating": 1, "date": "9/24/2020"}, {"text": "As usual, the atmosphere loud but it was okay for Friday night. We ordered Cajun jambalaya pasta and Truffle-honey chicken. Pasta was good but the chicken was little bit sweet and oily in my taste, breading was soggy and oil dripping from the chicken. The service was exceptional. As usual, the atmosphere loud but it was okay for Friday night.  3.5 stars.", "rating": 4, "date": "10/25/2019"}, {"text": "The food are delicious but very expensive. Last time I was here with my friends, we waited for 20 min for a server to come get our orders because we &amp;#34; sat&amp;#34; in the section with no servers. Yeah sure, you guys directed us to that section and now telling us there were no servers there. I would not recommend this place due to long time and how inattentive the staff are", "rating": 3, "date": "12/19/2018"}, {"text": "The menu is quite large. I usually stick my same buffalo blast or chicken samosas for an appetizer. Then I follow with the Jumbo shrimp angel hair pasta dish. But today I tried Chicken Marsala. The sauce was watery and the chicken had no flavor. Decent wine. Great customer service!!", "rating": 3, "date": "10/1/2019"}, {"text": "This is the worst experience i&amp;#39;ve had at a cheesecake factory so far. First we get seated, with our party of 8. We all expect it to take a while since we have a rather large party. We get seated at 6:42 and order at 7:01. Our food takes an hour to arrive which angers us all. The food comes out and it&amp;#39;s good quality. We wait 20 more minutes for our desert. We pay and then the server LOSES MY CHECK and charges me $1. Worst service i&amp;#39;ve ever had.", "rating": 1, "date": "9/28/2019"}, {"text": "I haven&amp;#39;t been here in probably 10 years. Located in the heart of Easton Towne Center. Parking at parking lots located on both sides or street parking with meters.<br&gt;Casual ambience. Warning.. it&amp;#39;s very dark in the restaurant. Guess it&amp;#39;s supposed to help create the mood but i wear super thick glasses and it made me feel blind.<br&gt;They give you bread before the meal, i would have thought it would come out warm but it didnt. Was very hard to spread the butter. I did appreciate the honey wheat bread though.<br&gt;Food didnt take too long. Our waiter was good and gave us a wide range of selections of his preferences. I ordered a chicken dish that was breaded chicken in a lemon sauce with sides of mashed potatoes and asparagus..the chicken was really good.<br&gt;The dish was only $17ish and it was so much food, made it into two meals...lunch for the next day. <br&gt;The menu has a wide variety from seafood, to chicken, to pastas, to steaks and sandwiches. They also offer a skinny meal with a pretty good selection with minimized calories.<br&gt;Looking forward to a return visit to try something else. Not sure why it&amp;#39;s taken me 10 years to return!", "rating": 3, "date": "11/10/2017"}, {"text": "Yesterday was my first time going there!!! Cheesecake was amazing and the service we received from Trae was phenomenal!!! He was super nice and personable", "rating": 5, "date": "3/7/2020"}, {"text": "Nice atmosphere food wasn&amp;#39;t warm but the server was very apologetic told her things happened out of our control. Manager made up by offering complimentary cheesecake. Made worth coming back! Thank you management", "rating": 3, "date": "9/7/2019"}, {"text": "Right across from the Hilton in Easton and open til 1230 am! Made for a perfect stop after the Taylor Swift concert to get ourselves a piece of cheesecake to go and share. The lemon meringue cheesecake is one of our absolute favorites...the sweetness of cheesecake but with a fantastic tang of lemon. Topped with a toasted meringue, whipped cream and candied lemon peels. Try it, it is such a great cheesecake, especially after you&amp;#39;ve had a filling meal.", "rating": 5, "date": "7/8/2018"}, {"text": "This place has nice atmosphere and great dessert. The cake was too big for us, I guess . Spicy chicken chipotle pasta was the point for our whole meal with tasty spicy sauce.", "rating": 3, "date": "12/13/2018"}, {"text": "I&amp;#39;ve been to this location a few times before for lunch and dinner. This time I went for brunch with 4 other people. We all got something different and I got the eggs Benedict with the potatoes and a side of fruit. Pretty standard. <br&gt;<br&gt;We ordered coffee and I also asked for a water. I didn&amp;#39;t get the water until I asked 2 more times toward the end of the meal. I had to ask twice for sweetener. This was frustrating because it took our server a long time to come back. <br&gt;<br&gt;My food arrived before everyone else&amp;#39;s by several minutes. Each persons dish arrived a few minutes after the next, except the breakfast combo. That came about 5 minutes after the 4th meal arrived. A waffle, two scrambled eggs and bacon was the last to arrive. At least it was hot when it came. So if you plan to eat together, good luck because not everyone will get their food together. <br&gt;<br&gt;My meal was pretty good. Still warm by the time we all had our food. It was pretty standard Benedict. Nothing to write home about. <br&gt;<br&gt;One friend got the eggs, toast and bacon and they forgot the bacon. The friend with the waffle had to send it back because it was borderline over cooked. Another friend got the brioche breakfast sandwich and the last friend got the monte cristo. Both sandwiches looked sloppy and haphazard. The monte cristo was not a typical monte cristo, not what you normally would think of and she wasn&amp;#39;t pleased with it. <br&gt;<br&gt;$3.25 for standard drip coffee and a breakfast I can get at the corner spot in a suburb would have been better. You&amp;#39;re definitely paying for the name when you come here. I prefer Cheesecake Factory for dinner.", "rating": 3, "date": "11/4/2017"}, {"text": "No reservations...on the weekend. Miss Anthony Bourdain! We got there 4:45 for date nite and waited 30 minutes for a table on a Saturday. Not bad. Try the bourbon and honey martini. Very good. Ordered warm crab and artichoke dip. Yum! Hubby ordered NY strip steak. i ordered shrimp and pasta. His was very good. Mine not so much. Bland. Asked for more sauce  hoping that would help. Nope. Decided to have boxed so i could fix it up at home. Waiter who took forever to check our table finally came by, took my food to box it up. We ordered lemon meringue cheesecake to take home also. Waited. Waited. Asked where my food was and from the look on the waiter&amp;#39;s face, it was not happening as he figured he had inadvertently thrown it out!  Said he would rush a re order and give me both cheesecake and food at same time. Well we waited and waited. Got bill but no food. Waited. I then spoke to Bryan. I believe he was the manager. We werent gonna make the movie but he got my food together right away and adjusted our bill. Total wait time was approx 35 minutes.  Thank you Bryan. I know they were very busy and i understood that but i kept seeing other tables being taken care of in a timely manner. Fixed up my shrimp and pasta at home and it was tasty.  Oh well. Happy Merry Christmas!", "rating": 3, "date": "12/16/2019"}, {"text": "We had a dinner for 7. <br&gt;<br&gt;The pork belly sliders were very good. Too sweet but that seems to be what people want. Other than that, pretty much no one finished their meal and a lot of wasted food went in the garbage. Not great but better than most meals we&amp;#39;ve had in Columbus. <br&gt;<br&gt;An issue I would like to point out to management: The cookie cutter cutter interior planning that&amp;#39;s used throughout the USA does not work in Columbus. There simply is not enough room in the isles for 2 people to pass each other. Chairs stick way out into isles so people can fit. Even without that, what looks like a 4 foot wide isle may work elsewhere but it does not work here.", "rating": 3, "date": "8/6/2019"}, {"text": "Service was okay but the food was served cold. Bread was so hard I couldn&amp;#39;t eat it. Lost my appetite here but came in very hungry. Disappointed.", "rating": 2, "date": "7/28/2019"}, {"text": "I ordered Cheesecake Factory thru the DoorDash app on Wednesday January 2, 2019. I spent 50.18 on my MasterCard. The Food actually got me sick an this is January 6,2019 and I&amp;#39;m still not feeling any better!! I order the Shrimp &amp;amp; Angel hair Pasta Meal and the Veggie Burger and Fries and my dining partner also made her sick as well.  <br&gt;<br&gt;Today I&amp;#39;m calling the Restaurant to speak with the manager I don&amp;#39;t know what the handling situation was but I&amp;#39;m NOT HAPPY AT ALL!! This happened at the Cheesecake Factory in Easton Towne Mall, Columbus Ohio.", "rating": 1, "date": "1/6/2019"}, {"text": "definelty a 5 star thanks Legrace, my 1st time at this location and i honestly couldnt have asked for a better waiter. So nice,knowledgeable and fast. Thank You Legrace ohh and the food was great lol", "rating": 5, "date": "4/5/2019"}, {"text": "The staff is a little disorganized or just rude. We walked in and waited several minutes for the hostess to arrive. None of the staff acknowledged us. We then went to the bar area. The bartender was condescending when we asked how we would be seated. If you do not want to be in the hospitality business, then you should look for employment elsewhere. Our server, Antoinette, was the  only reason I gave this place 3-stars. She was an excellent server: Very kind, attentive, and professional.", "rating": 3, "date": "6/19/2019"}, {"text": "Our family visits a few times per month. Normally give 4 star, but only 2 or 3 star today. Not fresh salad, found something weird meat in our chicken pasta, which weird meat is definately not chicken... Even pasta is not warm, the temperature is like room temperature food.", "rating": 3, "date": "7/7/2019"}, {"text": "Been to the cheesecake factory several times and it seems to be going on a downhill slope tonight I had the fried shrimp platter which I&amp;#39;ve had better out of box out of the deep freezer then for dessert I had cheesecake their original vanilla cheesecake that I have had better no bake cheesecake&amp;#39;s and what was served to me today our total bill was well over $100 and I don&amp;#39;t think the whole entire check should&amp;#39;ve been more than $20 for what I tried because it tasted like prepackage BS", "rating": 2, "date": "6/9/2018"}, {"text": "The worst service I have ever received. They told us it was a half hour wait... they kept telling us that the table was being cleaned for 30 minutes and then when we went up to ask them if the table was done being cleaned after 15 minutes they told us that &amp;#34;no matter how many times we ask, the answer is going to be the same&amp;#34;. We then waited another 30 minutes for our table and we were so hungry that one person from our group had to Uber to a different restaurant. Our other friend was hyper glycemic and kept requesting food so she wouldn&amp;#39;t pass out. Our 9 party group was so hungry as we ordered our food after AN HOUR AND A HALF, that we got full after eating the complimentary bread and didn&amp;#39;t get to eat our dinners. Terrible experience.", "rating": 1, "date": "3/2/2019"}, {"text": "This place was awful. The only good thing was the waiter. The noodles weren&amp;#39;t cooked all the way. The chicken tenders were brought out after everything else was eaten. The burger wasn&amp;#39;t cooked to standards. The waiting service was horrible, the hostess wasn&amp;#39;t very <br&gt;<br&gt;I will say our waiter tried his best to make sure we left as happy as he could.  It was by no means his fault to the point I felt bad for him. Thank you for your response.", "rating": 1, "date": "10/31/2018"}, {"text": "Since I had a GC, a friend and I decided to eat here. It was pretty busy When we got here, on a Thursday evening at 7 pm, but we got seated right away (simply because we were a party of two). Our waitress was pleasant. <br&gt;<br&gt;Thoughts on the food? This was not my first Time to CCF. And, in fact, after eating the cheesecake when I got home, it seemed lacking compared to my last piece of cc from here. In fact, I wasn&amp;#39;t pleased with the tiramisu taste this time. Change of recipe? Or have my tastebuds changed over the 2 years. And for the $5.95 price, I&amp;#39;m inclined to say I like the Kroger cake better. Yes, you heard me. Unfortunately, this leaves me rather bummed. All the talk and hype, and my tongue didn&amp;#39;t get that experience. <br&gt;<br&gt;Backing up, I got Chicken Carbonara for the main course. Tender chicken cubes. Creamy garlic-cheese sauce. A good amount of bacon bits. Not bad. $18 good? Don&amp;#39;t know if I&amp;#39;d go that far. <br&gt;<br&gt;I&amp;#39;m not sure I&amp;#39;ll be back, unless of course, family decides to meet for a meal. The prices are, I feel, too high. Perhaps they feel it&amp;#39;s warrant, since Easton&amp;#39;s clientele has more income to burn. Who knows. I&amp;#39;m inclined toward the local, mom and pop places, that you know every penny is put back into the establishment, and food!!", "rating": 2, "date": "12/7/2014"}, {"text": "Now, come on, I know I&amp;#39;ve reviewed this.  We go here every few months.  It&amp;#39;s another of Sweetie&amp;#39;s favorites that I am glad to go to, but not at the top of my list.<br&gt;<br&gt;Huge, always busy, always loud.  But, good food, huge slices of an endless variety of cheesecakes, and good service.  This time we just stopped in for cheesecake.  So busy that literally getting us two slices took 10 minutes.  Rich, huge slices, in pretty much any flavor you can think of.<br&gt;<br&gt;When we come for dinner, Sweetie usually gets a steak and salmon combo, and loves it.  I get something spicy- shrimp, jambalaya, etc.  Always good, and plenty for leftovers.  It is expensive, but the quality and quantity make that worth it.  We&amp;#39;ll see how things go with a baby for dining in sometime soon.  <br&gt;<br&gt;Try to come at off hours (still busy, just not crazy.)  Prepare to wait, regardless.  Pick something from the huge menu.  And have some cheesecake, to go.", "rating": 3, "date": "10/26/2016"}, {"text": "Today we made another trip into Columbus and decided to give Cheesecake Factory another shot after their response from the manager or whomever it was.  We decided to go about 2:30,  there was no wait and to be quite honest about it the waiter we got seemed a little cocky maybe even arrogant but didn&amp;#39;t do a bad job.   Other than that stale ass bread he brought out. Not stale just hard as a rock with freezing cold butter what the hell is someone supposed to do with that?  I got the bone-in New York strip and it was a damn good steak.  It had a great flavor cooked perfectly which is pretty rare anymore but this one was in fact cooked perfect it was a little small for the price it was roughly $20 and it couldn&amp;#39;t have been an 8 to 10 oz steak.  My wife got the fish and chips should have been called chips and fish maybe even again fish sticks she&amp;#39;s one of those weird people that don&amp;#39;t like tartar sauce so she has buffalo sauce on her fish.   She said the buffalo sauce was good but really hot which I always thought that was a good thing for her the hotter the better I had a piece of cheesecake since our gift cards were running low this will probably be the last time that we went so I wanted to try a piece of cheesecake to see how it stacked up against hers They have some work to do because hers is so much better and believe it or not she&amp;#39;s not even in the room to hear this, wow that sucks.", "rating": 3, "date": "3/9/2018"}, {"text": "Had very good service on this trip. My wife had meat loaf and I had the fresh grilled salmon. My wife liked her meat loaf and my salmon was good as well but not amazing. <br&gt;<br&gt;Salmon needed some additional seasoning in my opinion. The wife and I also got some cheesecake slices. I got the original and she had the tuxedo. Both of these were excellent.", "rating": 4, "date": "5/17/2017"}, {"text": "Food was amazing, service was great. Only complaint with how loud it is, the music is too high, it&amp;#39;s hard to have a conversation. The menu is also absolutely HUGE, they have every option available. I mentioned to the waiter about the loud music, he agreed, yet nothing was done.", "rating": 4, "date": "11/6/2018"}, {"text": "This poor girl has been on a &amp;#34;healthy-living journey&amp;#34; for a year and a half now (I&amp;#39;ve lost 200 pounds!) so when my birthday rolled around this year, I wanted to be REAL bad. So of course I picked the Cheesecake Factory, America&amp;#39;s biggest guilty pleasure. <br&gt;<br&gt;We went on a Friday at about 2:00pm since this location gets crazy packed on Saturday and Sunday and we quickly got a table for 2. Since I knew I was going to eat a slice of cheesecake with an entire days worth of calories and fat grams, we decided to order the chicken samosas appetizer from the Skinnylicious menu. They were amazing! Full of spiced meat and lightly fried but not dripping in grease. The dipping sauce was great too, so we were very pleased with this low-calorie app. <br&gt;<br&gt;For my meal I ordered the sausage &amp;amp; ricotta flatbread also from the Skinnylicious menu, and my husband had the Cuban sandwich. When they delivered our meals I&amp;#39;m not gonna lie: I was totally jealous of the huge, crusty sandwich my husband received. It looked so unbelievably good! He said it was delicious even though he prefers softer bread (I like it firm and crusty so this looked perfect to me). My flatbread was listed as a small plate and it definitely was small, but it was pretty awesome. The sausage was finely ground and tasted great and the ricotta and kale combo was so tasty. A small dish that packed a ton of flavor, so I was a happy girl.<br&gt;<br&gt;Now, the REAL reason we visited this place...the cheesecake. I had the Oreo dream extreme (covered in thick chocolate and full of soft Oreo bits - EXACTLY what I was craving!) and my husband had the vanilla bean (sounded boring but tasted like the most delicious, whippy scoop of vanilla bean ice cream ever). Both slices were huge and literally too good to put into words. <br&gt;<br&gt;Overall, this Cheesecake Factory visit made this an awesomely delicious birthday!", "rating": 4, "date": "5/23/2016"}, {"text": "No matter the wait at Cheesecake Factory, you can always get in, in a decent amount of time. I love the variety of items on the menu! Several gluten-free options and every server that I&amp;#39;ve ever had at this establishment is very informed with this. I LOVE the Sweet Corn Tamales and the Four Cheese Pasta. I feel like they have always have something for everyone. I wish they took reservations. But I love the Cheesecake Factory. Craving it right now actually.", "rating": 5, "date": "12/18/2018"}, {"text": "Really meh overall. I haven&amp;#39;t been in a Cheesecake Factory in quite sometime and this experience reminded me why. Came in on a busy Saturday and the place was relatively full. Despite this, we were seated quite quickly. That was the only quick thing. Our server was a kind stressed out lady who spent most of her time rushing around and apologizing constantly as everything even drinks were taking an abnormally long time (even for a busy Saturday) In addition there was a massive hold up in the bakery and people were waiting quite some time for coffee drinks, hot chocolate and cheesecake. Apparently the printer ran out of ink and when it was replaced the backed up orders came rushing in. Unfortunate issue, but honestly seemed like a problem that better planning could have circumvented. When our food did make it to us, my partner was not satisfied with his dish and had it sent back (mine was decent! no complaints there). The manager came out and apologized, which was nice and urged him to try something else. In the end he settled on an appetizer portion of chips and guacamole, which was good. The lemon raspberry cheesecake I got at the end of the meal was also good. But overall the experience was rather disappointing. The manager didnt even to bother to offer comping the replacement appetizer,(the only real reason he got something else is because the manager suggested it) and the dining time took way way longer than anticipated even for a Saturday night. No thanks.", "rating": 2, "date": "10/15/2018"}, {"text": "Things started out great; nice evening seated in less than 10 minutes, unfortunately that is where the great experience ended. We waited for 55 minutes for the food and then only half was delivered - with the 2nd half arriving 9 minutes later.  Not a great experience. In terms of the food itself. Chicken avocado club and Tuscan chicken were good, with the latter being Luke warm. The Mexican letus wrap = flavorless, cold and 80% cabbage. Vegie burger = poor. My family had to leave so I settled the bill, as I did the table was bussed while I still sat there. I informed the manager about the experience,  he responded with a 23% discounted bill. Won&amp;#39;t be back for anything other than an occasional dessert.", "rating": 1, "date": "9/14/2019"}, {"text": "Our food and service was wonderful! Christian was our server and he did a great job making sure our drinks were always full and that we were enjoying ourselves! He always had a smile on his face and was polite to all of the tables around us as well! Christian and the cooks deserve 5 stars for sure! <br&gt;<br&gt;I gave 4 stars because we were told a 30 minute wait and waited for an hour. I understand they can&amp;#39;t give you an exact quote of how long it will be but 5 or 6 two tops were seated before us that came in well over 20 minutes AFTER we did. When we asked the hostess about it they sat us within 5 minutes. Need more training up front for sure!", "rating": 4, "date": "11/5/2016"}, {"text": "I&amp;#39;ve always been a fan and probably always will be. I hate waiting to be seated at restaurants and this one is one of the worst. It&amp;#39;s so hard to get into 75% of the time. <br&gt;<br&gt;Their menu is massive. Like ginormous. I&amp;#39;ve tried several things on the menu, but my go to is always the pasta davinci. The portions are rather large and a to go box is usually necessary. Their appetizers are all good too. Most recently tried the Nashville hot chicken bites and enjoyed those. <br&gt;<br&gt;I love that ordering dessert here is the norm and is expected. I don&amp;#39;t feel like others are judging me as much for being a pig at this restaurant. Sometimes my hubs and l will get a piece of cheesecake for the table and a piece to go for the next day. Everything I&amp;#39;ve had here has been solid and the service is always okay. Nothing exceptional, but not bad.", "rating": 4, "date": "12/28/2017"}, {"text": "ANGIE IS THE BEST WAITRESS EVER! I had the best service ever (by any restaurant) by Angie. I&amp;#39;m from LA and visited this location with my mother and grandmother and Angie was absolutely AMAZING!! I can&amp;#39;t say enough positive things about her! She made the whole experience SO enjoyable!", "rating": 5, "date": "6/27/2019"}, {"text": "Last Sunday I met my best friend for brunch.. Another friend had mentioned for me to get the Lemon Ricotta Pancakes; that they were the best she ever had.. So sure enough we both ordered Large Iced Coffees and split the pancakes. She also ordered the Chicken and Waffles which we both enjoyed.. Everything was great.. service and quality of food.. We will definitely be back soon...", "rating": 4, "date": "3/24/2016"}, {"text": "I always have an enjoyable experience coming to The Cheesecake Factory. This most recent visit was no exception, I had a great time. I came with a group of about 10. Our service was great, our server kept our drinks coming and made sure our food was out quickly. Every interaction we had with our server was exciting, she engaged with us and made exciting conversation. The food was prepared to perfection. For anyone who has never been to The Cheesecake Factory, warning it is pricey. Chips and quac are $15 for example, but the serving is a substantial size. We got to-go cheesecake at the front of the restaurant. It&amp;#39;s an efficient system- there&amp;#39;s a roped off line and a counter for anyone who walks in for take out or for those leaving the restaurant wanting a to-go. I would recommend eating here on a date night, the atmosphere is relaxed and somewhat fancy.", "rating": 4, "date": "9/6/2018"}, {"text": "When we made our reservation (party of 2) we were told that it would be a 45 minute wait for outside and 15-20 minute wait for a table inside. There were about 5 people who were seated outside before us and we went to tell the waitress, she told us that it was first come, first serve outside (but that was never relayed to us). At this point, it had been 40 minutes of us waiting. We said we&amp;#39;ll take either inside or outside. A couple was seated outside after we were told we would be next. I have never had such a horrible experience before at this cheesecake factory.", "rating": 1, "date": "9/14/2019"}, {"text": "Worst service I think ever !! I&amp;#39;m a server myself and I just cannot believe how rude the server was. She forgot about our food so it came out cold. She never once asked how everything was. Our mashed potatoes were hard as a rock and she saw us touching them so she actually did bring us new warm and not hard potatoes. But didn&amp;#39;t ask about the rest of the food. I feel like she was pre-judging us but I came in with $350 in cash to spend because it was my friends birthday. My friends steak (rare) came out over cooked and the manager was asking if it needed cooked longer !? I had to explain that &amp;#34;no&amp;#34; being rare... she wants it bloody. My salmon and steak were cold and neither one of our meals came with a steak knife. Plus the food did not come out all at once. Being a server I can understand. But, during that whole meal she never once asked us how everything was. At the very end of the meal she made a rude comment as us how we knew each other. She hadn&amp;#39;t talked to us all night and it just seemed like a bizzar question to ask. I hated my salmon and nobody wants cold food.", "rating": 1, "date": "6/11/2019"}, {"text": "Service was perfect ......server was really on point.  Salmon was good ....food came pretty fast", "rating": 4, "date": "2/3/2019"}, {"text": "The food I had was really good. My table mates though found strange hairs and other substances in their food that didn&amp;#39;t belong. It also takes a really long time to get food and they use straws. I will not be coming back and don&amp;#39;t recommend.", "rating": 2, "date": "3/3/2019"}, {"text": "We had a friend who really wanted to have her birthday dinner at the Cheesecake Factory. So against our better judgement, we signed up for a large group dinner at a restaurant that doesn&amp;#39;t accept reservations.<br&gt;<br&gt;Knowing that there will be a wait, we arrived well ahead of the group at 4:30 to put our name in for our 12-person table.<br&gt;<br&gt;We were advised that a large group had just sat down at 4:30 so that it will be a 2 hour wait. Apparently they designate one specific set of seats at this restaurant for large groups, so we had the wait for the group before us to leave.  Never mind that this is a huge restaurant and could have placed us elsewhere if they&amp;#39;d actually tried. We literally saw over a 100 people seated before us after all.<br&gt;<br&gt;Unfortunately for us, the large group that they allowed to seat before us at the only table we were allowed to sit at was not a complete party, and it apparently took them an hour to even order since not everyone had arrived when they seated this group ahead of us. <br&gt;<br&gt;So we waited and waited and waited. For 3 hours in the end. It could&amp;#39;ve been 2.5 hrs but they didn&amp;#39;t want to hurry the group occupying our table apparently... Which is fair except the birthday girl went to check on our table and found 2 out of 12 table remaining, just texting on their phones. I know you don&amp;#39;t kick people out of their seats at a restaurant usually, but come on!<br&gt;<br&gt;The manager comped us some appetizers, which was nice of him. But 3 hours of my weekend to me is worth a little more than free nachos and chicken tenders. <br&gt;<br&gt;And the final zinger? The birthday girl ordered a veggie burger and they were out. Sigh...", "rating": 1, "date": "3/6/2016"}, {"text": "Recommend the Mac &amp;amp; Cheese bites and the fish Tacos , my waitress was super nice and attentive , EVEN PACKED MY LEFT OVERS, it is very crowded but I mean it THEE CHEESCAKE FACTORY,", "rating": 5, "date": "3/5/2018"}, {"text": "I decided to stop in for dinner and eat on the patio since it was a nice sunny day out. The patio is real nice, but to me i think the servers had to many tables which slowed down the service. <br&gt;<br&gt;My wife and I started off with drinks she had the strawberry Martini i had the red Sangria it took longer than usual to just get two drinks this was not at a peak time it was before the 6pm dinner crowd. I ordered a side salad i say about 20 mins had past no salad the next thing i know here comes our food never brought out my salad. The food was delicious and our server was nice.<br&gt;<br&gt;The bill came and my wife and I was shocked on how much our drinks cost her Martini was 11.95 and my Sangria was 10.95 let me say this the drinks are way to expensive and not worth it. The drinks are to pricey, so beware before you order a drink.", "rating": 3, "date": "4/21/2016"}, {"text": "We love The Cheesecake Factory and it&amp;#39;s our go-to <br&gt;place with our kids.  The menu is vast and servings are large.  This past visit we went on a rainy Saturday night.  Wait was typical to be seated. Our wit for bread was 40 minutes.  With 4 very hungry kids that was ridiculous.  Our server said he would bring it in 2-3 minutes after ordering.  I finally went by the kitchen to ask for crackers and the server said they didn&amp;#39;t have crackers, but she would get me some bread!  So very frustrating for something patrons expect quickly at this restaurant.  <br&gt;The restaurant has great food and amazing cheesecake but I don&amp;#39;t recommend going at busy times.", "rating": 3, "date": "7/15/2017"}, {"text": "Try the Jamaican shrimp<br&gt;<br&gt;I always like Caribbean food and they did a nice job with it. I&amp;#39;m not a big fan of national chains like this but always enjoy the food if it&amp;#39;s prepared to the quality that they execute. Service was also very good and we barely had to wait for anything. <br&gt;<br&gt;At the end of the meal our table ordered three pieces of Cheesecake to try out which was the best. The red velvet won for our table against the tiramasu and some other chocolatey chocolate cake. <br&gt;<br&gt;I&amp;#39;d recommend the place if your in a bind for a food place to try.", "rating": 4, "date": "8/7/2017"}, {"text": "I never been to a cheesecake factory in my entire life. I always wanted to go. I love cheesecake, my favorite is strawberry cheesecake. I haven&amp;#39;t tried the other kinds yet. I want to try and experience new restaraunts and they foods. I&amp;#39;m hoping I can go to the cheesecake factory one day.", "rating": 5, "date": "12/20/2018"}, {"text": "Let me just preface by saying that my husband and I came here a few months ago and had an awful experience. Our waiter forgot to put our appetizer in, and it took a long time to get our food (like over an hour and a half long)<br&gt;<br&gt;Today, we had family come in to town that really wanted to come to the Cheesecake Factory to eat. I called and they said the wait would be an hour and a half. We rushed over and there was literally no waiting. The hostess said they would seat us in a few minutes. We put our name in. There was a big rush of people that came in after and all of which were continuously getting seated before we did. I understand maybe couples and small parties, but there were 6 of us and I heard two other parties of six being called before us. I had to check on it twice before they seated us. Overall we probably waited 30 minutes.<br&gt;<br&gt; It took us a while to get settled and place our order. We had people all around us getting orders that had been seated after us. Our waiter came by about an hour in and said, &amp;#34;we&amp;#39;re just waiting on three plates, it will be out soon&amp;#34;. 25 more minutes go by and we see people leaving that we saw walk in after us. Our waiter stops by again and says, &amp;#34;we&amp;#39;re waiting on one more plate, it&amp;#39;ll be out soon&amp;#34;. I get that he is trying to communicate, but you are basically telling us the first plate has been sitting there for AT LEAST 25 minutes. This is not something you should tell people. My dad asked for a manager and he came over after a long wait. We explained what was going on, and he apologized and said our food would be out shortly (keep in mind, we had already heard this TWICE). He said he would pull the plates out that we&amp;#39;re done and once we all got our food he would come check on us. Most of the food was fine, but my husbands Mac and cheese was cold and his chicken was extremely hot like it had been microwaved. <br&gt;<br&gt;To make matters worse, the manager never stopped back. I know it&amp;#39;s insanely busy, but why I&amp;#39;m the world would you even say that and not follow through? That was probably the most frustrating part. <br&gt;<br&gt;I wish I could give this place 0 stars. One bad experience I will give you the benefit of the doubt, but two bad experiences and we&amp;#39;re done. Id rather take my business to the million other restaurants in Easton.", "rating": 1, "date": "10/7/2018"}, {"text": "I really enjoy this location...  they are open late, but due to their location - in the heart of Easton - they are ALWAYS busy!  It would be SO great if you were able to make a reservation.<br&gt;I have been here several times, and it took a little while to find an entree that I loved.  There are several great appetizers, but again, I had a tough time with my entree... then I found it!  I love, LOVE the Hibachi steak.  The combined spices are phenomenal... They chef manages to get a nice, crisp outer edge while the meat is still tender and flavorful.<br&gt;The Thai lettuce wraps are excellent, and large enough for an entree with left overs, or excellent to share as an appetizer<br&gt;And of course, the cheesecake is awesome... two full pages!", "rating": 4, "date": "7/23/2013"}, {"text": "We waited an hour for our food when the waiter brought out our kid&amp;#39;s meal--grilled cheese. It was cold. The fruit looked like it was cut up a week ago or from a can.  The manager then came out asked what my brother-in-law got to eat because it hadn&amp;#39;t came out in an hour and a half. Brother-in-law actually forgot because it had been so long since we ordered. The manager laughingly apologized and came back fifteen minutes later with his order--SLIDERS--an appetizer! We got cheesecake to go thinking it would be faster--nope. Another 25 minute wait. No manager to be found at this point to tell him about our disappointment. Nothing comped. First and last trip ever. Dinner food was OK. Staffed terribly. Cheesecake exceptional.", "rating": 1, "date": "7/26/2019"}, {"text": "Amazing service and management! I called from out of state to ask them to send a cheesecake to my girlfriend&amp;#39;s table who was eating there. They worked with me, decorated it, and sent it over with candles! Looked great - awesome team of people!", "rating": 5, "date": "11/4/2018"}, {"text": "Nothing pleases me more than the abundance of portions not just with their cheesecake alone but their salad can be eaten for a dinner serving. The ambience is nice,always busy but the workers are always smiling and on point, food comes out hot hot hot and the cheesecake selection is to die for!!!", "rating": 4, "date": "5/26/2017"}, {"text": "I love this place. The menu is huge so there is something for everyone...and everything I&amp;#39;ve tried has been very good!  Definitely don&amp;#39;t forget the cheesecake...oh my!!  The selection is expansive and they are all wonderful!!  You can order them to go if you are too full from your meal and they package them perfectly!!", "rating": 5, "date": "12/3/2018"}, {"text": "I&amp;#39;ve always loved cheesecake factory, especially their pasta dishes. My favorite is the shrimp bistro pasta (pictured). The shrimp is battered and fried, and the pasta is based with a buttery and delicious sauce. Definitely not for those who are trying to be healthy, but soooo worth the splurge. Although the pasta dishes are on the higher end in price ($16-$19), the portion is large and their complimentary bread makes it worth the trip.<br&gt;Cheesecake factory is great for a large party, but the service is not quick. Every time I&amp;#39;ve gone, the wait for food has often been 40 minutes after ordering. If you&amp;#39;re a fan of cheesecake, then you should DEFINITELY try one of their selections. One slice is quite large, so you can split with someone and share the cost. But it&amp;#39;s so good you might just want to eat it all or take it home.<br&gt;I&amp;#39;ve always loved my experiences here, and I would recommend this place to anyone!", "rating": 5, "date": "6/24/2018"}, {"text": "Caveat - I&amp;#39;ve been to the Cheesecake Factory twice before many years ago when I lived in a different state.  Was not impressed AT ALL then.  Because of that I never go there.  The only reason why I went there recently is because I wanted a salad for lunch &amp;amp; I was trying to find places around where I work that had good salads.  A friend suggested the Cheesecake Factory, as large as their menu is, I knew they would probably have a salad that I may like.<br&gt;<br&gt;Ordered the anti-oxidant salad, here is the description:  A Delicious Blend of Salad Greens, Spinach, Kale, Avocado, Broccoli, Grapes, Roasted Pear, Blueberries, Onion, Sunflower Seeds and Almonds with Lemon-Blueberry Vinaigrette.<br&gt;<br&gt;Sounds appetizing right???  NOT.  This was basically a blend of salad greens.  I requested no avocado or almonds.  There were NO blueberries at all.  There were all of 8 grapes cut in half, the roasted pear was diced so tiny that as I was eating I remembered it was supposed to have pear and I had to dig for these miniscule pieces that basically added no flavor to all that kale and spinach.  There was also no broccoli in the salad!  The ONLY good thing was the dressing.  If I&amp;#39;d wanted a kale &amp;amp; spinach salad I would&amp;#39;ve ordered that!  <br&gt;<br&gt;Anyone whose ever been to the Cheesecake Factory knows they give large portion.  So I had this huge takeout of basically spinach &amp;amp; kale with a few sunflower seeds, grapes &amp;amp; diced pears with fabulous dressing.  Once AGAIN - I will not go to the cheesecake factory for the next 30 years.  Maybe they will improve by then.", "rating": 2, "date": "4/1/2017"}, {"text": "This factory was crazy busy. Server was great, food was pretty good like usual.  Lettuce chicken wraps were a bit skimpy for price. 2 of the lettuces were almost too small to pick up. Taquitos were good but needed more filling.", "rating": 4, "date": "5/21/2017"}, {"text": "We always eat here for business when in town, they have such a large menu everyone can find something they like. I had Evelyn&amp;#39;s favorite pasta, it was just ok. It&amp;#39;s a pasta dish in olive oil and garlic with pine nuts and veggies. I get it every time not remembering that it doesn&amp;#39;t have much flavor, they could stand to add more garlic and herbs, or even better vegan cheese! I had a pineapple vodka drink and it was amazing, I went back later and sat at the bar awhile just so I could have one.", "rating": 3, "date": "7/30/2018"}, {"text": "Everything about our experience here was toeing the line of a disaster.<br&gt;<br&gt;We were told it would be a 30-40 minute wait, but were then seated within 3 minutes. The host staff clearly have some work to do on estimating wait times. Though, I suppose it&amp;#39;s better to under promise and then over deliver.<br&gt;<br&gt;Our server seemed to think we needed the entire evening to read the menu since he made himself too scarce after taking our beverage order. He (or the kitchen?) managed to screw up almost order -- my brother&amp;#39;s sweet potato fries &amp;#34;fell off&amp;#34; the plate on the way to the table and then they forgot to bring more; my salad came with the dressing on it instead of on the side; my nephew&amp;#39;s hot fudge sundae showed up without hot fudge.<br&gt;<br&gt;I know why people like this -- fake upscale with huge portions -- but I&amp;#39;d skip it in favor of a local Columbus establishment any day.", "rating": 3, "date": "5/6/2015"}, {"text": "I just don&amp;#39;t really understand why chicken soft tacos need 45 minutes to be ready. And those tacos taste so bad.... <br&gt;My server didn&amp;#39;t check if I need refill at all through the whole process, in the end she just gave me one box for leftover instead of packing for me.", "rating": 1, "date": "10/7/2018"}, {"text": "A.) Our app took 15 mins before they even came to tell us it wasn&amp;#39;t available. <br&gt;B.) A large piece of paper was found in my food (after I got it partially in my mouth). Management said, &amp;#34;Sorry...&amp;#34;  And took that item off our bill. Took my fries from me. Maybe the entire experience warranted a free meal. Good damage control would have made us return. We spend money and tip GREAT!<br&gt;Both my boyfriend and I work in restaurants and are forgiving of mistakes, but not being dismissed. <br&gt;<br&gt;Food was good enough that we might try Polaris CheeFact", "rating": 2, "date": "6/4/2016"}, {"text": "Very quick to get seated for two.   Noise level is higher than I prefer but tolerable.  I had a glass of wine and water within 10 minutes.   Very impressed.<br&gt;<br&gt;Very dark, bring a flashlight if you have poor eyesight.<br&gt;<br&gt;I orderes the Thai Glazed Salmon and it was absolutely wonderful.  So large a portion that I brought half my meal plus a slice of cheesecake home.<br&gt;<br&gt;I would definitely recommend this location.  Just be prepared to walk after you find parking, wait a while to be seated and get cozy with the table next to you.", "rating": 4, "date": "11/17/2015"}, {"text": "It had been years since I had eaten at a Cheesecake Factory, but my mom was in visiting and we needed a place that a wide variety of choices for all the picky eaters in my family, so we came here. I remember CF being a good place to eat for special occasions like birthdays and date nights. That still seems to be the case because the servers were performing off-key renditions of Happy Birthday about every 5 minutes. However, the quality of food and service was not what I remember. The food was bland and greasy. Our server seemed bored and was slow on food/drink delivery, despite the restaurant not being all that busy. The prices have gone up quite a bit, too, since the last time we ate here. <br&gt;At least the cheesecake is still really good. Their mac &amp;amp; cheese was super yummy too.<br&gt;Overall, if you&amp;#39;re at Easton and are craving dessert, stop on by, however, there are better, cheaper, non-chain restaurant options in Columbus to try.", "rating": 3, "date": "11/8/2016"}, {"text": "Decision making: a skill that is elusive for some. Holiday weekend in Columbus. Easton center is slammed ; as it should be! Every eatery is jammed as it should be! So let go to the cheese cake factory where they have the patio closed and 30 sets of people jammed in lobby..... 25% of the seating closed to the public on a holiday weekend. I know , it might rain later today at 6 pm . So let create an environment where people wait and then feel rushed to order and subsequently eat fast. I guess they could turn tables faster this way and generate more volume with implied or applied stressors. Not sure about service though. It&amp;#39;s now been almost 40minutes on a 30 minute wait. Mo managers checking on patrons waiting. Joke<br&gt;Everyone in my group is frantically looking at menu so they can order as soon as we sit. Like that will improve the situation for us or the kitchen.<br&gt;Awful experience.", "rating": 1, "date": "5/26/2018"}, {"text": "I love TCF and every chance I get, I am there! Stopped in for dinner with my mom and sister. The wait was about 20 minutes and our waiter was great. Of course, my libation of choice is the J.W.&amp;#39;s Pink Lemonade and I am currently loving the Chicken Littles entree that comes with corn succotash and mashed potatoes. The food and service was great. One of my go-to places whenever I am in Columbus (:", "rating": 4, "date": "8/1/2016"}, {"text": "Today my family and I ate at the location in Columbus. OH. We were seated within 15min. It took nearly an hour to get our food. The food came out cold and my daughter&amp;#39;s food was not prepared the way we requested. <br&gt;It was absolutely the worst Cheesecake Factory experience I&amp;#39;ve ever had, and we&amp;#39;ve eaten  at locations all around the country. Will not be returning to this location ever again.", "rating": 1, "date": "8/19/2018"}, {"text": "Went to TCF for brunch with the boyfriend. We were seated promptly and didn&amp;#39;t wait long before Harrison, our server greeted us and got our drink orders. Initially I ordered the Bloody Mary, but I wasn&amp;#39;t feeling it. Harrison recommended the mimosa and it was amazing! I had 2 of them! For brunch I ordered the chicken &amp;amp; waffles with eggs Benedict... so delicious! I liked the variety of options on the menu, there&amp;#39;s something on there for everyone. Special thanks to Harrison for treating us so well!", "rating": 4, "date": "2/13/2018"}, {"text": "one of the worst experiences we&amp;#39;ve had.  waited long time for poor food.  noodles were undercooked and chicken was rubbery.   salad had no dressing.  when we told the waitress about the food she didn&amp;#39;t even ask if we wanted anything else.  will never go to any of these again. <br&gt;<br&gt;your response doesn&amp;#39;t help us any.  you robbed us of our $$.   and that is all you have to say.  no thanks.", "rating": 1, "date": "5/2/2019"}, {"text": "This place rocks in being able to eat very well (healthy) and the environment is great!  If cheesecake is your gig then you have a ton of choices!   We split a huge salad , an appetizer, and fillet mignon!    Totally great!   Wait staff is amazing!   Will definitely go back.", "rating": 5, "date": "12/11/2017"}, {"text": "Cheesecake Factory is my favorite place to eat. I always get the shrimp scampi bistro style. I am disappointed though because I feel like their portion sizes are getting smaller and smaller but the prices remain high. This particular location is great. The staff is amazing and it doesn&amp;#39;t take too long to be seated on a regular night. If it&amp;#39;s a holiday, be prepared to wait up to 2 hours to be seated. The cheesecake is divine. The ambiance is great.", "rating": 5, "date": "7/11/2018"}, {"text": "Very very long wait when I went to this location and staff was not attentive, except for the waiter. New manager used his newness as an excuse for other staff incompetence. Mashed potatoes were just warm and looked glazed over from a heat lamp. Steak was good.", "rating": 2, "date": "4/6/2019"}, {"text": "I received gift cards for this restaurant. My wife and I went there and were pleased. The funny thing is that we did not order any cheesecake. We both love cheesecake but the food was so good and filling that we had no room. If you are at the Easton town-center this is the place to eat at.", "rating": 4, "date": "4/4/2018"}, {"text": "We frequent this Cheesecake location often since we live close. EVERY experience, our waiter comes back and tells us they are out of something (chicken and biscuits...stuffed chicken tortillas). It never fails. We are actually moving soon so we&amp;#39;re excited to try a different location.", "rating": 3, "date": "10/26/2017"}, {"text": "The Cheesecake Factory always has great food. They have an extensive menu and I have yet to order an item I did not enjoy. The meals/flavors are consistent. Service has always been good in my experience. Portions tend to be too large for a single (normal) person so I&amp;#39;d plan on sharing. <br&gt;<br&gt;Of course the Cheesecake is what they&amp;#39;re really known for and it is delicious. So try to save room. Otherwise, you can always order a slice for carry out.", "rating": 4, "date": "5/6/2014"}, {"text": "I&amp;#39;m not going to blow everyone&amp;#39;s mind with this but it&amp;#39;s Cheesecake Factory. It&amp;#39;s completely medium at best. It&amp;#39;s good for a well priced family meal, first date, or a lunch with friends for cheap. The fries are the good kind though so that is a star on its own. And the chicken Madeira and garlic bread are pretty top notch.", "rating": 3, "date": "1/21/2018"}, {"text": "Great American Eatery! Yes, a chain restaurant that beat their rivals. The pages on pages of options appease a lot of appetites. The cheesecake and large portions bring us back time after time. The drawbacks are the high drink prices,  both alcohol and non alcohol drinks and lengthy waits without reservation or call ahead capabilities. The service is prompt, friendly and very knowledgeable. The food is made to order and can be modify based on diet restrictions and/or allergies.  Fact: menus across the nation vary depending on regions to cater to the population. The menu will vary depending on if your in Hawaii, California, Florida, Ohio, etc. Make sure you visit another cheesecake factory to check out the variation. Can&amp;#39;t believe it took me so long to review. We adore this restaurant for all of its glory. The changing menu is enough to keep us coming back but the classics will always be there.", "rating": 4, "date": "1/10/2016"}, {"text": "Yesterday we made the poor decision to eat at The Cheesecake Factory. We were with extended family so neither my husband nor I spoke up about the quality of our food. I ordered Green Chilaquiles with Carnitas and Eggs.  By the time I got my order the food was cold. The tortilla chips were soggy. It was very unappetizing. My husband ordered the Brunch Combo which is eggs, bacon, and pancakes. He told me his food was cold, as well. I realize that some of the fault lies with us for not speaking up. I did not want to embarrass the others in our party by saying anything. One may be assured I doubt my husband or I will go back.", "rating": 1, "date": "9/4/2017"}, {"text": "We came here for lunch on a Saturday around one and this place was packed. Regardless,  the wait for a party of seven was only forty-five minutes. <br&gt;<br&gt;The menu here is huge. Overwhelmingly huge. Our waitress was able to name a few of her favorites, but with a menu this big, I feel like you are taking a gamble on quantity over quality. Either way, I had the cashew chicken with brown rice, extra spicy. The sauce was more toward sweet than spicy, but still good. If you like spicy food, I would recommend emphasizing that when you order. For an appetizer, we had the corn tamales. I would not really call them corn tamales. They were more like a sweet corn cake, but they were still good. Everyone at the table seemed pleased with what they ordered. <br&gt;<br&gt;Now for the best part, the cheesecake. Order the cheesecake. Is it a little expensive? yes. But just do it. You won&amp;#39;t regret it. So pick one of the many different flavors and ignore the sheer amount of calories. You&amp;#39;ll be glad you did.", "rating": 3, "date": "3/5/2017"}, {"text": "Beautiful restaurant, Good cheesecake, food was okay. We had the Mac n cheese burger, but they didn&amp;#39;t put much Mac n cheese on it. The chicken and biscuits was terrible, hard biscuits and not much chicken at all. and Alfredo, which was also just ok, on the dry side. Our server was all over the place, not the greatest service.", "rating": 3, "date": "4/30/2018"}, {"text": "The food was decent, the cheesecake was good! The food took too long though. I realize it&amp;#39;s expensive to make a cheesecake but I didn&amp;#39;t think it was THAT expensive... <br&gt;The place was hard to get around and the floor was slippery. I had to look both ways as if I was crossing the street to avoid running into wait staff and/or other patrons. <br&gt;I recommend the Reese&amp;#39;s peanut butter cheesecake if you like the combination of chocolate and peanut butter (and aren&amp;#39;t allergic to peanuts)", "rating": 3, "date": "4/24/2017"}, {"text": "Nicolette is a terrible person to have representing your brand. My pager went off so I made my way to the counter. Stood there and waited patiently. They were busy. Nicolette didn&amp;#39;t look up from her computer other than to take my blinking pager without a word to me. I stood there waiting for about 5 minutes after she took my pager as they took table after table. I Said excuse me miss. She did not look up nor acknowledge me. So I said ma&amp;#39;am in a little louder voice still no acknowledgment but this time the lady farther away heard me and said I can help you. I said I&amp;#39;m trying to get this lady&amp;#39;s attention who took my blinking pager. At this point Nicolette has a smirk on her face. She finally looked up at me and I said this is no way to treat a customer. She just looked at me with her smirk not saying a word still, so realizing I am making no progress I ask for the manager. Who happened to walk up. I explained to him what had transpired he did apologize and I asked for her name. Which he gave me. He explained to me that she takes the pager prints out a paper and puts it in a stager which is then taken by the other hostesses who seat you in order. I told him the hostess station is no place for a passive aggressive personality and maybe he should redistribute her elsewhere for someone who enjoys customer interaction. Doubt he will have time to do it since he was working harder than she was. Turns out he is the restaurants GM. The GM stopped by several times checking on us. The food we ordered came out quick and tasty as it always does at this Cheesecake Factory. We will be back but hopefully we won&amp;#39;t run into Nicolette.", "rating": 1, "date": "11/17/2018"}, {"text": "My order was wrong, waiter was rude, food sucked, and way over priced.", "rating": 1, "date": "5/17/2018"}, {"text": "The food and drinks are are always on point. However, be prepared to wait for about an hour or more on the weekends. The Asian pear martini is really good but a bit on the sweet side. We also got a few apps like the fried Mac and cheese, avocado egg rolls, and the buffalo blasts. All delicious!", "rating": 4, "date": "12/18/2017"}, {"text": "After waiting for about 10 minutes to even be greeted by the busy staff, we were led to our table by a frazzled host who kept either changing his mind or was confused about where to seat us. <br&gt;<br&gt;Once we were seated, we noticed that the restaurant was cramped and loud. The din of room was saturated with the sounds of screaming kids, the bustling, open kitchen, and harried servers which made it feel like a hospital cafeteria.  We couldn&amp;#39;t decide on the theme of the decor, either. Egyptian? Havana? Tropical? Ancient Roman? <br&gt;<br&gt;Anyway, the place was so busy that the servers seemed to not be able to keep up. Our server was pleasant, but forgetful. We were finished eating for almost 30 minutes receiving our check while we watched other tables come and go. <br&gt;<br&gt;The food was ok, chain restaurant quality.  Portions were small for the price, but my blueberry mojito was pretty good. Overall, I was underwhelmed yet overestimulated by the busy, noisy atmosphere.", "rating": 2, "date": "9/24/2016"}, {"text": "I don&amp;#39;t think anyone needs another review for this chain,  but I wanted to review the &amp;#34;skinny menu&amp;#34;. Be very careful if you are trying to be healthy at the Cheesecake factory and ordering off their regular menu.  Even some of their salads are over 1700 calories! I have tried 3 things from the skinny menu and each dish has been great. I have tried two salads and the turkey burger.  Everything was excellent which surprised me considering how low in calories and fat they all are.  I definitely recommend their skinny menu. Don&amp;#39;t be afraid to try it because I am a fat kid and I honestly enjoyed everything I have tried from this menu. Since you are ordering from the skinny menu, you might as well split a piece of cheesecake with someone. Just don&amp;#39;t look at the calories,  sugar, fat, or carbohydrates unless you want to cry.", "rating": 4, "date": "7/7/2016"}, {"text": "I have to update my review. This location just can&amp;#39;t handle that traffic it seems. We&amp;#39;ve been here several times in the last two years, because it is closer than that Polaris location, and everyone we say we won&amp;#39;t come back. We mean it this time. We don&amp;#39;t mind waiting to be seated. That&amp;#39;s to be expected. But the quality of service here is despicable. Yes, it&amp;#39;s that bad. Maybe it is a hiring issue. A training issue. I have no idea. I get better service at Applebee&amp;#39;s or any other cheaper restaurant than at this location. And for the prices here...they should be ashamed. I&amp;#39;ll go to Polaris from here out...totally worth the extra 20 minute or so drive. What a shame! I do not recommend this to anyone who would like to be greeted, have their drink orders taken, or have bread to munch on within 10 of being seated.", "rating": 1, "date": "7/16/2017"}, {"text": "The atmosphere is nice nut food just a little above average. I mean nothing tjat blows your mind and I&amp;#39;ve had several dishes here. Today I ordered the orange chicken and was not impressed. The chicken was hard and lack flavor. The glaze was barely on the chicken so I had to request more. The cheese cake was just ok which was the carmel salted version. The sweetness of the glaze and the crust fought each other way too much. Now the service was excellent no complaints what so ever. Order was correct and she recommended the lunch portion which was still huge. I say come give it a whirl and enjoy an outing.", "rating": 4, "date": "6/5/2016"}, {"text": "Had the fried chicken sliders which were the best chicken sandwiches any of us have ever had - total perfection.  I also had mac and cheese which was just good - nothing overly impressive.  My wife had chicken and mushroom wraps and did not care for them much due to an undesirable aftertaste.  My daughter had a grilled chicken salad which she must of liked as she finished most of it.<br&gt;<br&gt;Our biggest problem wasn&amp;#39;t the food but was the location of our table.  We were sandwiched in between two tables of people and there was zero privacy.  When the waitress would wait on either of the tables to the left or right of us, her butt was way too close to me - very uncomfortable.  The second issue was the noise level.  I hate being stressed out when I&amp;#39;m eating.  I&amp;#39;m stressed out enough at my job and don&amp;#39;t have the desire to deal with more stress when I&amp;#39;m trying to relax in my limited time off.  Those sliders were damn good, but I don&amp;#39;t think I could go through that again.  Maybe next time I&amp;#39;ll have a glass of wine before we go so I won&amp;#39;t be so stressed.  Do people actually like eating in this type of environment?  I certainly don&amp;#39;t get it.", "rating": 3, "date": "11/15/2015"}, {"text": "Went in and got a slice of Smores Cheesecake. Took a while just to get a slice with no communication, but boy was it good! Very rich with a good presentation.", "rating": 4, "date": "9/5/2015"}, {"text": "Really can&amp;#39;t rate this place since we never ate. Upon arrival we told them we wanted a table in the bar the hostess said it would be a few minutes. We&amp;#39;ll after 45 minutes and watching droves of people come and go I still waited because no one was coming and going from the bar area were we was wanting to be seated. Then all of a sudden they started taking couples to the bar. My husband asked why we had been over looked. She asked his name, then could not find it. I was ready to leave then they found us a table so off I went, only to be seated in a cramped little half table up against a wall with children jumping on the seats next to me. I got up and left. I&amp;#39;m not rating the food here since I never had any but I will rate the staff. I will not go back.", "rating": 1, "date": "7/16/2017"}, {"text": "So..I hear they have a HUGE menu?! ;) We stopped to have a piece of cheesecake and a drink. Now, I don&amp;#39;t mind paying top $$ for food and/or drink but this caught me off guard. CF is known for their cheesecake and I don&amp;#39;t mind paying $7-$8 for it, it&amp;#39;s all spectacular. We ordered 2 pieces of Cheesecake, 1 glass of sangria and some fruity drink for the little lady...$38. Which was expected until I noticed the drinks were $10 each?! I am more than happy to pay $10<br&gt;for their AWESOME cheesecakes but not for watered down desert drinks. But I still love the cheesecake, unfortunately.", "rating": 3, "date": "9/5/2014"}, {"text": "The Corn fritter platter was outstanding the taste is extremely authentic and it&amp;#39;s quite large it was amazing home cooked meal feel , the chicken tacos from the skinny menu are wrapped in lettuce and have avocado chicken and veggies inside , they  were great and healthy ! Finally the dulce de leche cheesecake was ridiculously great SO good! For a chain restaurant this place has my vote !", "rating": 4, "date": "4/13/2016"}, {"text": "My wife and I were visiting my sister-in-law in New Albany, Ohio. We went to the afternoon show today (Sunday) in Easton and afterwards stopped at the Cheesecake Factory for cocktails and dinner. When we sat down and ordered drinks we asked the waitress for some bread to absorb the alcohol since we had not eaten today.  Her response was they only had some hard bread but would bring us some once she had some fresh.  We asked her several times during our drinks and then dinner and still no bread.  When we were finished after close to an hour still waiting for bread.  I asked for the manager before we paid the check.  He approached the table with an artificial frozen smile on his face and responded we can take bread home I told him we were not looking for a carry out and would have liked a piece of bread during our drinks or over dinner.  That was his answer to our complaint.  I told him it would ha have been easier just to leave and never come back to Cheesecake Factory but I was more concerned to share our experience about the evidently poor kitchen management for the future.  I really don&amp;#39;t think he fully understood customer satisfaction and the value of feedback.  Not sure if it&amp;#39;s a way to cut cost or what but poor experience especially when you pay a tab around one hundred bucks,  I would not recommend Cheesecake Factory  Easton location.", "rating": 2, "date": "7/28/2019"}, {"text": "My favorite restaurant in the world...lol I always enjoy the food here and this time in OH wasn&amp;#39;t any different. This time I had Philly cheesesteak and it was just as good the next day we I reheated it. Waiter was a bit slow but hey it what it is.", "rating": 5, "date": "7/4/2016"}, {"text": "I thought it was great. The wait wasn&amp;#39;t long, our waitress was nice and the food tasted wonderful. I had the veggie burger, mom had the turkey burger, dad had the Cuban sandwich, and my niece had a kids cheese pizza. The prices are fair because you get quite a lot. Didn&amp;#39;t really like the strawberry lemonade and my mom didn&amp;#39;t like the garden house salad because it was romaine lettuce. Oh she was also disappointed in the cheese cake because it wasn&amp;#39;t all that but she like it. Overall nice.", "rating": 5, "date": "7/10/2013"}, {"text": "I normally love the Cheesecake and always end an evening of Easton shopping by picking my up a few pieces of cheesecake and taking them back to the hotel.<br&gt;However on this particular night I had a takeout piece of Red Velvet. Service was horrific and they kind of threw the cheesecake upside down in the box.<br&gt;Once I settled in at the hotel , I noticed the frosting had an off taste but plowed forward - bad decision. About 4 hours later I was awoken with an uncontrollable need to upchuck which lasted about an hour.<br&gt;I then remember the weird, sour frosting.<br&gt; No more Cheesecake Factory for me.", "rating": 1, "date": "8/4/2015"}, {"text": "Service at this place is terrible even on weekdays when the restaurant is nearly empty. The place is empty on a Monday &amp;amp; we had to wait 15 minutes for bread that we were told was being baked only to get stale bread. We ordered one dish that took 45 minutes to serve.", "rating": 1, "date": "12/24/2018"}, {"text": "This is strictly for the bartender.  Be friendlier!  I decided to get my food to go!  Not sure if she was having a bad day or not, but she was putting off some bad vibes.", "rating": 1, "date": "7/25/2017"}, {"text": "I thought their hostess was a bit unfriendly and could have sworn a couple of other groups who came in after were seated before us... but I won&amp;#39;t hold a grudge because everything else was satisfactory.<br&gt;<br&gt;I wanted to sit outside on a patio somewhere in Easton to have a drink or two. The Cheesecake Factory has a fairly large outside seating area so we opted for them.  I was glad to have a much friendlier waiter!  I&amp;#39;m a fan of their &amp;#39;small plates and snacks&amp;#39; page in their menu.  We ordered the Warm Crab and Artichoke Dip as well as their pear and brie pizzette. The dip is addicting (as expected) and the pizzette is not for everyone. It may be an acquired taste for some but i like brie cheese and thought it was a creative addition to their menu.<br&gt;<br&gt;I like this restaurant because it&amp;#39;s for everyone and I think everyone can find something they like. It may be a chain but it&amp;#39;s a notch above and certainly not an Applebee&amp;#39;s or a TGIFriday. It&amp;#39;s great because they were able to create a place where people will come so many reasons. Whether it&amp;#39;s celebrating important events like their birthday or anniversary, a place to have a drink at the bar, just to buy a cheesecake, or to dine with their little kids and know they&amp;#39;ll make a huge mess!", "rating": 3, "date": "9/14/2010"}, {"text": "One word: AMAZING! <br&gt;<br&gt;My first time going, and LOVED it. <br&gt;<br&gt;To start off we had the fried calamari which was fantastic. They have really good lemonade and I ordered their jalapeño pineapple margarita they have which was quite interesting. <br&gt;<br&gt;My date ordered filet mignon, Medium Rare and it was to die for! Melt in your mouth, cooked phenomenally! I ordered the Steak Diana, cooked Medium with Salmon. The Steak was ok. And the salmon was good without the lemon sauce they put underneath. Didn&amp;#39;t care for it at all. <br&gt;<br&gt;Their mashed potato&amp;#39;s were way too salty and my date pointed it out to the manager and the manager asked to take them back and we declined just letting him know so he could tell his cooks. The manager then told us he would give us a piece of cheesecake on the house. <br&gt;<br&gt;We also had a plate of macaroni and cheese which I must say was the best Mac n cheese I&amp;#39;ve ever had in my life. Order it! You&amp;#39;ll thank me later.<br&gt;<br&gt;At the end we ordered a piece of lemon meringue cheesecake and white chocolate chip macadamia nut. Both...... Out of this world. Could be just because I&amp;#39;m a cheesecake fanatic! <br&gt;<br&gt;I wish I could remember our waiters name cause he was pretty awesome!", "rating": 5, "date": "3/7/2015"}, {"text": "Stopped in for dinner with some friends.  The meal was pretty good overall, but the cheesecake was the star of the show.  The menu is huge which can make it hard to narrow down what you want, but also to maintain standards of quality.", "rating": 3, "date": "7/15/2017"}, {"text": "I&amp;#39;m giving this four stars only because the service was a bit slow, and our daughters&amp;#39; orange chicken entree&amp;#39; that they split wasn&amp;#39;t &amp;#34;orange chicken&amp;#34; according to them, it wasn&amp;#39;t sweet or tangy enough.  <br&gt;<br&gt;Other than that this place is amazing! I ordered a slice of the Godiva chocolate cheesecake that was way off the charts - it was heavenly! I love very rich decadent chocolate...the &amp;#34;crust&amp;#34; or whatever was what I believe to be dark chocolate and the middle part like a chocolate mousse (it is flourless), also with a chocolate wafer square on top of it!  It was so rich that my daughter and I had to get a box and there was still 1/4 left which we shared the next day, lol.  My other daughter and her boyfriend ordered the tuxedo cheesecake which they very much enjoyed.  It was my older daughter&amp;#39;s birthday so I told the server then about five or six wait staff came out and sang happy birthday with her cheesecake decorated with some sprinkles and a candle in the whipped cream, a very nice festive touch! It was definitely a birthday to remember for her and we most likely will come back next year for her Sweet 16th!", "rating": 4, "date": "6/8/2015"}, {"text": "I love Cheesecake Factory because of the vast menu and the chicken maderia is my go-to dish. Still great food at this location but the service was slow and we were not served the bread. Not exactly a good situation when you&amp;#39;re starving.", "rating": 3, "date": "8/8/2017"}, {"text": "I usually love this place but I am now considering going to other restaurants in the area after my visit today. After church my husband, mother and I decided to go to the Easton Towne Center location and it was not a good experience. Service was extremely slow! It took so long for our food that we forgot that we were hungry. Then when our food came, my husbands food was missing main items in his dish. He ordered the Jambalaya Hash and Eggs (not sure if this is the correct name but it&amp;#39;s close and on the brunch menu) Well, there were no potatoes or sausage in his meal...That was very odd. I ordered the Eggplant Parmesan and it wasn&amp;#39;t good at all...I should have stuck to what I normally get. We did not want to return the food because that&amp;#39;s pretty annoying and will be thrown out. There are people less fortunate in the world who are not able to enjoy a meal so we try not to waste food. Our waitress told us that she would speak to the manager to see if anything could be done but she never gave updates and brought our bill. I spent $74 on poor service and bad food today...That really bothers me.", "rating": 1, "date": "8/5/2018"}, {"text": "I am usually a fan of TCF - I have been to locations all over So Cal. This one is located inside Easton Town Center and perhaps that is why it is so hard to get good service.<br&gt;<br&gt;We had a group of about 10 and had to wait almost 40 minutes for a table. We actually only got seated after talking to the manager.<br&gt;<br&gt;Once we were seated, they were pretty quick taking the orders and bringing us some complimentary apps, however it took a long time for us to get the entrees... a one hour lunch ended up taking us 3 hours.<br&gt;<br&gt;The food was fine and as usual the menu is massive. I always have The Navajo sandwich when I go there, fry bread and avocado (you can&amp;#39;t hate that). It was good.<br&gt;<br&gt;Parking was torture. People were actually stalking everyone who would leave the shops to see where they were parked and try to get their spot. I think the service really suffers from the location, but then again.. that is why it is so popular as well.", "rating": 2, "date": "12/9/2012"}, {"text": "Food was good. We were full so we got our cheesecakes to go. Mine (chocolate mousse) tasted freezer burnt but the Oreo did not.", "rating": 3, "date": "10/20/2017"}, {"text": "I&amp;#39;m not much of a chain-goer, but I have to admit I do really like The Cheesecake Factory.  A year or so ago I would have given around 3 stars for not really being my thing, but ever since they introduced the small-plates and &amp;#39;skinnylicious&amp;#39; (questionable marketing decision there) menus, I&amp;#39;m a fan! <br&gt;<br&gt;My favorite way to dine here is to order a bottle of their house Cabernet (around $30), split one of the bigger appetizer salads (~$10) and then a few small plates to share (ranging from $4-$8). It&amp;#39;s for sure enough to share between 2 people and we leave feeling great - not uncomfortably full with 3 pounds of leftovers in a to-go bag. <br&gt;<br&gt;Service is usually pretty great and no one seems to mind a couple of people enjoying a leisurely shared dinner, even on a  semi-busy night. <br&gt;<br&gt;Seriously, try the small plates!", "rating": 4, "date": "11/12/2012"}, {"text": "I will never come here again. We have been here for almost an hour without anyone let know what is going on. To top it all off my friend order crisp Cuban rolls and she was told they were out and she ordered an another item and then they came back they were out. Not happy!", "rating": 1, "date": "8/26/2017"}, {"text": "I would give 0 stars if I could. Every time we eat here, dine in or carry out, we have an issue. Last time my quesadilla was soggy because the salsa soaked into it. Once we waited over an hour for food when two tables seated after us got there&amp;#39;s just fine. This time I&amp;#39;m done. I will never go to this location again. My steak was supposed to be medium well, NOT burnt on the outside. I have two mushrooms and a disgusting pile of salty onions. This is beyond ridiculous and j paid $20 for this!!! - See picture!!!", "rating": 1, "date": "11/11/2015"}, {"text": "I&amp;#39;ve eaten at cheesecake factory many times over the years and this restaurant about 6. <br&gt;  I have to say this was by far the worst service I have ever had at ccf.   The server seemed annoyed by us from the start.   The restaurant wasn&amp;#39;t that busy even though it is close to Christmas. We were there at an off peak time.   <br&gt;<br&gt;Our food arrived at a reasonable time except for one meal.   It took another 7 minutes for the last meal to arrive. I swear they must have dropped it or forgot it (it was the lunch portion of the full meal I had. Go figure!). We all tried to be polite and wait but our food was getting cold. <br&gt;<br&gt;Once the food arrived our server disappeared.  We asked a different server for more bread but ccf must be on a cost cutting program.   It never arrived.   When our server finally came back we asked for more bread again.   She repeated the request, asking in an incredulous tone, &amp;#34;MORE bread? &amp;#34;, like we couldn&amp;#39;t possibly need more.<br&gt;<br&gt;On to desert.   It is, after all, the reason you go there. The cheesecake was solid and did not disappoint. Cost cutting is going on with the cheesecake as well. No longer are the portions overflowing the plate! Normal portions! Price is the same, however.   And, note to staff, unless you plan to eat it with your fingers one needs a fork.   We had none.   A fact the server could have noted when she cleaned our plates.  So being the patient customer I am, I asked for forks.   She said she&amp;#39;d go find some and brought back 2.  Only 1 problem, there were 5 of us! So I sent her scurrying off in a huff for 3 more. <br&gt;<br&gt;Needles to say her tip reflected her level of poor service. I won&amp;#39;t be back anytime soon.", "rating": 2, "date": "12/23/2014"}, {"text": "All my my the food was terrific!! My wife and I were expecting good food but &amp;#34;Bam&amp;#34;It was very almost perfect!!! Highly recommend the New York,but really dont think you can go wrong with anything they offer! Also the folks working their tale off from kitchen to waitresses&amp;amp;waiters all deserve a raise!! great experience,most definitely going back!! Whatcha waiting for?!?!get off your tail and go &amp;#34;GETCHA SUM&amp;#34;!!", "rating": 4, "date": "5/14/2017"}, {"text": "Bang Bang Chicken! Yummy! Hubby enjoyed his Hibachi Steak as well! Very busy! Waiter was disappointing... never came back for refills. Nice Easton location! Beautiful decor.", "rating": 4, "date": "7/12/2015"}, {"text": "I remember my first visit, it was great. Now it&amp;#39;s just loud, uncomfortable seating next to strangers, so so food with giant portions.  The menu is all over the board, way too many items to do a good job.  <br&gt;<br&gt;I ordered the Southern Catfish, very over cooked, served with a pound of mashed potatoes, corn and green beans.  My wife had corn chowder.  We both ordered cheesecake.  60.00 later we head home to eat our cheesecake at home without two families sitting on both sides of us stare at our plates.<br&gt;<br&gt;The pumpkin cheesecake is wonderful. Next time I&amp;#39;ll pickup a salad at Wendy&amp;#39;s then swing by for dessert to go.", "rating": 2, "date": "10/13/2014"}, {"text": "I have been to the Cheesecake Factory a hand full of times now. It&amp;#39;s never my suggestion to go there but I have never had a bad experience. I have sampled drinks, appetizers and deserts only....so I cannot speak for their dinner or lunch plates.<br&gt;<br&gt;Drinks - are pretty good, no unique drinks on the menu but the classics are pretty solid. They even have a happy hour with some good deals from 4-6.<br&gt;<br&gt;Appetizers - I have tried several and they were all yummy. The chicken pot stickers were probably my favorite, crab drip is great.<br&gt;<br&gt;Desserts - are of course the hi-light. cheesecake of countless varieties - The Lemon Raspberry Creme is so good but none will disappoint you, count on that. Their tiramisu was also really good - I was really surprised.<br&gt;<br&gt;The vibe inside is chill and the service has always been good whether I was at the bar or a table.", "rating": 4, "date": "7/10/2014"}, {"text": "this place was really good the portions are HUGE it really filled me up not to mention to great service with waiters and waitresses always checking in :) the cheesecake is really good too this was a great place to eat at. the prices weren&amp;#39;t crazy at all and everyone here was very polite. glad i stopped by 11/10 u keep doing u cheesecake factory", "rating": 5, "date": "7/14/2018"}, {"text": "Excited to see that they take reservations for parties of 7 or more... <br&gt;<br&gt;...LESS exited to find out that it&amp;#39;s only before 4pm.  <br&gt;<br&gt;I was trying to book ahead of time for a party of ten, on a Wednesday, for a special event where I&amp;#39;ll have older family members in town.  I had hoped to be able to bring them in and sit down.  Why take reservations at all?<br&gt;<br&gt;This is a review based on company policy... not based on food.", "rating": 2, "date": "5/26/2015"}, {"text": "I would give it zero stars if I could but that would be completely fair to the waiter who was great. They don&amp;#39;t have enough staff to meet business needs. The waiting time was terrible. The food was a disaster. My omelette was so bad I wouldn&amp;#39;t feed it to a starving child in Africa and my sister&amp;#39;s meatloaf was burnt more than a hippy at Woodstock.", "rating": 1, "date": "7/6/2018"}, {"text": "The cheesecakes here are really good. My favorite is the new york cheesecake or the chocolate raspberry, both are quite decadent. The food is standard fare. Gigantic portions, generally taste fine but nothing stands out and the pasta dishes can be quite greasy. Unless you&amp;#39;re really hungry, plan on taking some home. The cocktail menu is extensive and the mimosa and  the margaritas are quite good. Nice place but I wouldn&amp;#39;t wait for an hour to be seated, which is what you should expect on a weekend night.", "rating": 3, "date": "6/25/2014"}, {"text": "Love the Shepard&amp;#39;s Pie. Great for Gluten Free folks. The menu is massive, but lots of good things for us Gluten Free eaters. I say it&amp;#39;s a must.BTW our server was so nice. Really went out of his way to make sure our business meal went well.", "rating": 4, "date": "11/11/2014"}, {"text": "For a chain restaurant I would give it 5 stars but overall a solid 4 stars.<br&gt;We hadn&amp;#39;t been to Cheesecake Factory in years (last time in Beveryly Hills, CA) and didn&amp;#39;t remember it being anything special.<br&gt;This time we had a gift card and were shopping at Easton and figured to give it another chance.<br&gt;We got there monday at 5 with minimal wait and once we saw the happy hour menu decided to sit at the bar.<br&gt;Service was very nice and super fast, we were on an out in an hour.<br&gt;The prices are steep for a chain restaurant, there was no way I was going to pay $25+ for some fish so once I saw they have a housemade veggie burger I had to give it a try.<br&gt;It was pretty good, not as good as Northstar or some others but descent.<br&gt;The house sald with ginger soy super yummy, best dressing ever!<br&gt;We got a bunch of $5 plates the guys favorite was the mac n cheese balls, the burger sliders were also pretty good, the chicken sliders ok but not much chicken, really more bread and breading than anything else.<br&gt;The tex mex egg rolls were fine, I loved the avocado spread with it.<br&gt;The chicken potstickers were also good.<br&gt;Portions for apps were pretty big, you get alot more than at any other restaurant we&amp;#39;ve been to and for $5 a good deal.<br&gt;I just can&amp;#39;t jutify paying $7 for a slice of cake so I&amp;#39;ve yet to try that but I did stand there and drool for a few minutes....", "rating": 4, "date": "5/29/2012"}, {"text": "Many already know what The Cheesecake Factory is all about-a lot of love/hate out there. Consensus is that they have a huge menu (and servings) of food-burgers, pasta, pizza, salads, seafood, steaks, etc, etc. Not great on beer selection-Blue Moon is as &amp;#34;exotic&amp;#34; as they get. However, many don&amp;#39;t know of their Sunday Brunch-that&amp;#39;s right, Sunday Brunch. <br&gt;<br&gt;One of the cool things about Yelping is hearing something many don&amp;#39;t know about, hopping on here and sharing that info. Lemon Ricotta Pancakes. Sorry, I was rambling so I jumped straight to it. This is my favorite item on their brunch menu. Pancakes? Yes. So what. So what? Here&amp;#39;s what-buttermilk pancakes with ricotta cheese and lemon zest. Sounds so simple doesn&amp;#39;t it? Is it Sunday yet? They&amp;#39;re so light, fluffy, moist and ...refreshing? It&amp;#39;s the lemon zest-so good. A must try.<br&gt;<br&gt;...also, the Pineapple Upside Down Cheesecake. Dear God. I grew up loving this cake and when I tried CF&amp;#39;s cheesecake version I just stared at it after one bite.", "rating": 4, "date": "1/23/2014"}, {"text": "Nice setting, waiter was friendly. Wait was over 1.2hrs to seat. Food took another hour to arrive. Food quality was average. (Had a lone burger and enchilada). Honestly is it worth the wait? No", "rating": 3, "date": "10/11/2014"}, {"text": "Another good place to enjoy variety and quality of food.  It does get crowded and wait time varies it can be up to 20 minutes or more but I assure you it is all worth it.  Friendly staff huge menu loaded with delicious food order anything it is a win win you will be walking out with a happy face:-) . Make sure you are starving when you want to get there because they are quite generous in food portion :-)", "rating": 4, "date": "5/22/2017"}, {"text": "I&amp;#39;ve been to at least 20 different Cheesecake Factories across the country since I travel a lot for work, and this is hands down the worst one. I honestly didn&amp;#39;t think the food and service could be so different, but wow, the food was almost inedible.<br&gt;<br&gt;I always order the same things - miso salmon, dynamite shrimp and carrot cake. The salmon and miso sauce were literally disgusting. Not even sure what I was eating and pray I don&amp;#39;t get sick later tonight. The dynamite shrimp was far from dynamite. I just left there and am so disappointed to have to write this terrible review, but THE FOOD WAS AWFUL. I come to Columbus a few times a month and will never dine here again. There are much better options at Easton.", "rating": 2, "date": "3/6/2017"}, {"text": "There&amp;#39;s an endless amount of national chains available for lunch or dinner when shopping in Easton. Some are good. Others, not so much. Meanwhile, there&amp;#39;s two things you can count on at this Cheesecake Factory: an endless amount of choices and consistency. This is one of the better Cheesecake Factory&amp;#39;s in the country, and I&amp;#39;ve been to many of them over the years. Great location, too. <br&gt;<br&gt;There&amp;#39;s no point in going through what&amp;#39;s good and bad on the menu. I&amp;#39;m guessing anyone that would shop in this area has been here or to one of the many locations nationwide before. We all know there&amp;#39;s nothing bad on the menu and portions are huge!", "rating": 4, "date": "11/28/2014"}, {"text": "Food poisoning! My best friend and I had a birthday lunch this afternoon. I got the orange chicken and she got chicken carbonara. I immediately felt ill so much I couldn&amp;#39;t finish. My best friend called me later today to say she&amp;#39;s been vomiting all evening. Not sure what&amp;#39;s going on there, maybe they&amp;#39;re not cleaning or prepping food right. Skip this place.", "rating": 1, "date": "4/22/2018"}, {"text": "I love the food at the Cheesecake factory!! My favorite is the bang bang chicken and shrimp. And it&amp;#39;s one of the best things for you (calorie-wise) on the menu. <br&gt;<br&gt;This particular location is usually rather busy, being in Easton and all. I went on a Thursday evening with my parents and our wait was around 30-35 minutes.....but the people watching was good....plus, we also had a menu and it took about that long to look through it to find out what we wanted! :o)<br&gt;<br&gt;The only thing I don&amp;#39;t like about this place is that their prices keep going up. I&amp;#39;m kind&amp;#39;ve a tight-wad...especially around the holidays. My favorite dish (bang bang chicken &amp;amp; shrimp) is now $17.95. And that&amp;#39;s just for the actual meal. If you want a caesar salad (side salad) is $8.95. Really??!! And then of course you have to have dessert. In my case it&amp;#39;s either carrot cake or one of the chocolate cakes because I just don&amp;#39;t like cheesecake. <br&gt;<br&gt;This is a good place to go one in a while....but I&amp;#39;m not willing to submit to the rediculous prices on a routine basis.", "rating": 3, "date": "12/11/2011"}, {"text": "This is the first time I ate a Cheesecake Factory and it didn&amp;#39;t disappoint. The menu could be a bit overwhelming because of all number of selections and to make it worse everything looked good. I ended up going with the Pasta Carbonara which was beyond amazing. The service was friendly and even though it was busy our food came out pretty quick. To top it off I had a piece of vanilla bean cheesecake. My only complaint was that the unsweetened tea tasted more like green tea then black but not the end of the world. Would definitely return!", "rating": 5, "date": "1/1/2015"}, {"text": "What you expect from a Cheesecake Factory is what you get.  The food was actually slightly above average, which was a pleasant surprise.  No surprise on the bill; for one entree, water and dessert the bill was still $25 before tip! High, I think, but oh well.<br&gt;Service was good.", "rating": 3, "date": "10/29/2013"}, {"text": "Always good at accommodating big parties. Enjoy going here after church with the family.", "rating": 4, "date": "11/18/2016"}, {"text": "Visited on March 5th. A nice weather day, Easton and the  resteraunt were both very busy. I submitted my name for the 20 minutes wait. Went to the bar and ordered a Kentucky mule,a bourbon drink. The drink was 10$ it tasted terrible, worse I&amp;#39;ve ever had, I paid with a hundred dollar bill, and was given my change in one&amp;#39;s and fives. When we got our booth, the waiter was rushing back and forth, was definitely not interested in spending time with us. The entire visit we were made to feel as though we were in the way. This used to be a great place to go. And it may still be, just not on Sunday March 5th 2017. As expensive as this place is, service should be better.. This was probably our last visit. Too many other options in cbus", "rating": 2, "date": "3/6/2017"}, {"text": "One of my all time favorite restaurants!  I am 100% in love with the Cheesecake Factory, and I am NOT afraid to admit it.<br&gt;<br&gt;1st up:  APPETIZERS  YAY!!, Ok, so I have only had 1 of their appetizers, but after tasting their chicken quesadilla why would I ever get anything else???  I have been to several Mexican restaurants and have NEVER had one as good as this.  I have even tried to duplicate it at home (to no avail) it&amp;#39;s so good.  <br&gt;<br&gt;Next up:  Main Courses!!  Chicken &amp;amp; Biscuits.  So good, so so good.  My mouth is watering just thinking about the super moist chicken, sweet carrots, flaky biscuits and unique gravy.  This dish makes my taste buds sing. This is definitely my favorite entree-period.<br&gt;<br&gt;I have also had their Chicken &amp;amp; Avocado sandwich that comes with french fries.  This sandwich, my friends, is super tasty.  When I first ordered this I was slightly leary of the combination, but don&amp;#39;t be hesitant like I was.  Jump into it full force because it is the shiznit.<br&gt;<br&gt;My husband gets their shrimp bistro pasta.  He says it has a great flavor to it and he orders this every time we go.  I CANNOT vouch for this because I will NEVER taste it, because as most of you know you eat with your eyes first and something about this dish just appears unappealing to me and I refuse to put a bite of it anywhere near my mouth.  Sorry, I&amp;#39;m just weird like that.<br&gt;<br&gt;I have tasted their pizza, it&amp;#39;s mighty good too.  My kids have gotten their chicken fingers on MANY occasions, and they always gobble them up with a quickness.<br&gt;<br&gt;Their brown bread is soft, and just plain good.  We always ask for all brown bread when we go here because we are not big fans of the harder sourdough bread (they can keep that stuff).<br&gt;<br&gt;Now to my favorite part. What they are known best for...CHEESECAKE!  I have tried so many I don&amp;#39;t even know where to start.  I will tell you my absolute favorite is the lemon raspberry one.  It is so light and fluffy and not as heavy as most of the other flavors.  Others I have tried that are fabulous as well are,  Adam&amp;#39;s<br&gt;Peanut Butter Cup Fudge Ripple, Ultimate Red Velvet, Oreo (the regular one is good, the chocolate oreo one is gross--tell them no thank you on that one), Chocolate Tuxedo (yuk--avoid this one too), White Chocolate Blueberry, Carmel Pecan Turtle Cheesecake, and I am sure there are many other.  All of the cheesecakes I have tasted (other than the ones listed with bad comments beside them) and been wonderful.<br&gt;<br&gt;I would recommend this spot for a friends night out or a family outing.  Either way, you will get good food.", "rating": 5, "date": "7/23/2014"}, {"text": "Was this for real? I went with my two daughters for a Sunday brunch. I ordered a black coffee for myself and water for the table. Later I ordered the Lemon Ricotta Pancakes to split with my daughter and another kids&amp;#39; French toast. When the food came 30 minutes later we noticed the food tasted like coffee. Both of the small metal carafes that were supposed to be filled with syrup were filled with black coffee instead! Needless to say both of our meals were ruined when we poured coffee over our food. When I told the waiter about the problem he said that I ordered it that way. What??? I have never even heard of pouring coffee over lemon pancakes let alone ordering coffee to pour over my 11 year old&amp;#39;s French toast. The manager at first was going to comp us for only one meal until I had to explain again that both meals were ruined. I wish we were more patient and had waited in the line at North Star. There is a reason their line is out the door and not at Cheesecake.", "rating": 1, "date": "5/7/2017"}, {"text": "My husband, daughter and I went here the other night. My husband had some gift cards he wanted to use. Typically, we don&amp;#39;t come to the Cheesecake Factory for dinner. When we were in there, that&amp;#39;s what we wanted.<br&gt;Their food is... okay. Their menu is huge, and it&amp;#39;s almost as if they are trying to cater to whatever you have a craving for. This makes it a bit hard to choose what you want. I ordered the Shepard&amp;#39;s pie - and it was... eh. I have never had Shepard&amp;#39;s pie before, but I would definitely say that it&amp;#39;s not very authentic. It seemed like it was something that they had thrown together in the kitchen, and topped with Mashed potatoes. The Potatoes were fine, but I wasn&amp;#39;t too keen on eating the rest of it. <br&gt;The waitstaff was pretty good, considering we arrived a half hour before close. The food took a bit longer to come out, and it was whatever for us.<br&gt;The Cheesecake is amazing though! I would definitely recommend coming for Cheesecake, but if you want a meal, go somewhere else.", "rating": 3, "date": "4/26/2016"}, {"text": "I ordered a Creamsicle from the bar while waiting for a table outside on the patio by the fire.  It was delicious but since it was  $11,  I only had one.  We were seated, asked for water, and 20 minutes later received water.  We had the firecracker salmon for an appetizer.  It was very delicious.  They brought out my steak before my salad so I sent the salad back.  The steak was very yummy and so were the green beans, even though I ordered broccoli.  Halfway through the meal I had to tell the waiter our drink glasses were empty and he also forgot to give us bread. My bf did not enjoy his chicken  Marsala.  The sauce was very thin.  He said olive garden is so much better.  We also  got a raspberry white chocolate cheesecake to go and they were out of plastic forks. Excellent food.  Very poor service.", "rating": 3, "date": "6/18/2016"}, {"text": "Our waitress was Patricia and she did a fantastic job!!  The restaurant was extremely busy but Patricia seemed calm, collective, and friendly.  I do think the restaurant had difficulty keeping up with the pace of customer orders.  Orders were not coming out together and people had to wait while others in their groups were eating.  As did I have to wait while my table received their food first.  But Patricia was so gracious that I didn&amp;#39;t mind :)<br&gt;<br&gt;And they really should have wifi - who doens&amp;#39;t have wifi nowadays :)", "rating": 4, "date": "5/4/2013"}, {"text": "Burger wasn&amp;#39;t cooked. Came out raw in the middle. Sent it back and when it came back out it was nasty. Instead of making a new burger, they brought out the one I had taken a bite out of. They obviously put it back on the grill to cook it a bit more. Waitress treated me as if I didn&amp;#39;t know what I was talking about and gave me a nasty look. She said I had ordered it like that. Not once did I say I wanted it raw in the middle. Fries and cheesecake was the only good thing about my order. The other 3 orders were fine.", "rating": 1, "date": "10/6/2016"}, {"text": "This location is always very crowded. With that being said, the Cheesecake is amazing. My favorite on the menu is the bang bang chicken and shrimp. Tastes like curry, which I love. Can&amp;#39;t really go wrong here, unless you&amp;#39;re in a hurry", "rating": 4, "date": "1/22/2017"}, {"text": "Ordered simple spaghetti. They brought out a small plate of noodles with a side of spaghetti sauce that was in a condiment dish? I asked for more sauce, was brought another condiment size marinara sauce that was cold. At this point my noodles are cold and I&amp;#39;m over the whole meal. Asked the waiter to just take it off my bill and bring me the check. This just seems like too easy of a dish to be screwed up this badly.", "rating": 1, "date": "4/16/2016"}, {"text": "I&amp;#39;ve been a fan of the Cheesecake Factory for years. I have never had a bad experience and I&amp;#39;ve been to several in multiple states. I don&amp;#39;t care that the menu gives War and Peace a run for it&amp;#39;s money, I don&amp;#39;t care that one meal likely meets a weeks worth of calories, and I definitely don&amp;#39;t care that it&amp;#39;s a chain.<br&gt;<br&gt;The phrase jack of all trades master of none does not apply to Cheesecake Factory because everything they do, they do well. From appetizer to dessert it is can&amp;#39;t miss. AND THE PORTIONS ARE SO LARGE THEY DESERVE A SENTENCE IN ALL CAPS. <br&gt;<br&gt;The chicken madiera is one of their most popular dishes and if you try it you will see why. My favorite menu item has actually been of the menu for years, but as sad as that is, I can always drown out the memory with an appetizer, entree and dessert. And of course, cheesecakes are their namesake, and the have about a billion to choose from. But seriously, the list is 50+ cheesecakes of which I&amp;#39;ve probably had between 10-15. My favorite is the Red Velvet and it is not so rich that I can&amp;#39;t eat it in a single sitting. Some cheesecakes, like the Godiva or Tuxedo are too rich not to be spread out over the next day or so. The Linda&amp;#39;s Fudge Cake is always a good choice if you opt not to go the cheesecake route.<br&gt;<br&gt;The one downside is that this place is always packed during peak hours but it is worth the wait. We will definitely be back which is probably the most important test of any restaurant.", "rating": 5, "date": "9/23/2014"}, {"text": "Great food, seating methods needs some work since our table was given away. All worth the cheesecake.", "rating": 4, "date": "1/20/2018"}, {"text": "Usually this is a decent place, but the service was horrible! They were out of food at 12p on a Monday! Someone in the party upcharged on their drink refill &amp;amp; they charged for both. This customer didn&amp;#39;t even eat!!! The manager Brittany drug a napkin through someone&amp;#39;s plate &amp;amp; laughed about. Epic fail today!", "rating": 1, "date": "6/5/2017"}, {"text": "There is really only one word to describe The Cheesecake Factory: M&amp;#39;eh. Judging from the ambiance and prices, this restaurant attempts to market itself as a sophisticated, up-scale dining option. What this restaurant achieves superficially, it missed the mark in substance. Unfortunately, there isn&amp;#39;t much about this place that would commend itself to those seeking an enjoyable night out - especially considering what you&amp;#39;ll end up paying. <br&gt;<br&gt;On the few occasions I&amp;#39;ve eaten here, it has always been exceedingly crowded regardless of the day. On my most recent visit, my wife and I were packed into a row of tables like sardines. We ended sitting elbow-to-elbow with a group of rambunctious, Australian muscle-heads who spent the evening bragging about their most recent DUIs. The whole restaurant was extremely loud (Australians notwithstanding) so much so that we could barely carry on a private conversation. <br&gt;<br&gt;The food was overall very average. The offerings and quality are about what you might expect from TGI Fridays, just 50% more expensive. The service was okay, and the wait times were a bit longer than what you&amp;#39;d like.<br&gt;<br&gt;The only reason I bumped this review up to 3 stars was because of the cheesecake. In this realm, they certainly live up to their reputation. The variety and overall deliciousness of the dessert menu was the evening&amp;#39;s saving grace. But, you can always just buy a cheesecake to go, and skip the unwanted invasions on your wallet and personal space.", "rating": 3, "date": "4/17/2013"}, {"text": "Had dinner here last night celebrating a friend&amp;#39;s birthday. Sat us in the very back of the restaurant. Our table was under an air conditioning vent and it was freezing cold. Complained to the waitress who told us the air conditioning was controlled out of state so they couldn&amp;#39;t do anything. We all basically ordered appetizers for dinner and it took over a half hour to get our food. I ordered salad and the sausage ricotta Flatbread, brought the Flatbread out before the salad and it was just warm, didn&amp;#39;t seem to be cooked all the way. Unfortunately, I was on a time constraints so didn&amp;#39;t have time to wait for another. Another girl in the group had to wait 20 min for a refill and her food was also just warm. We only had 5 in our group so not a big amount to wait on. Service very slow. Was not happy at all with this visit.", "rating": 2, "date": "8/17/2016"}, {"text": "Went for happy hour,  the J.W. lemonade was great,  and the variety of appetizers are delicious especially the sweet corn tamales,  yummo! Had the salted carmel cheesecake wasn&amp;#39;t at all salted carmel, they should just say carmel cheesecake,  but was so happy that the waitress gave me extra carmel, Fun time all the way around.", "rating": 4, "date": "4/9/2016"}, {"text": "In the afternoon, on a weekday, my wife and I stopped here to eat a late lunch. The place was not busy and we saw that only a few people were outside eating. We decided to ask for outside seating. Even though there were seats galore inside and out, we were told that there would be a 15 minute wait no matter what area we chose.<br&gt;<br&gt;There were a few people ahead of us and were being called.  While waiting, we looked outside and felt like it might rain so we approached the desk to tell them that we would like to change to an inside table.  At that time we were told that our name had already been called. There was absolutely no way we had been called since we had not left the area.<br&gt;<br&gt;Since we had supposedly missed our call, the lady told us that we would then be &amp;#34;put back into the rotation.&amp;#34; We didn&amp;#39;t know what that meant, but soon found out. The next name called was that of a couple who came after us. The next name was another couple after us. We got the idea.  At that point we decided that a table for us could not be found and that our business was not desired.  We got up to walk out and once they saw us leaving, they quickly called our name, but we continued to walk out.  We took a short walk to PF Changs, walked directly in, was immediately waited on and had a great meal.<br&gt;<br&gt;If you want to be told to sit and cool your heals go here, otherwise go somewhere else.", "rating": 1, "date": "7/26/2016"}, {"text": "This is another chain restaurant that I love to visit! The times that I&amp;#39;ve gone to this location, the employees have been friendly and attentive. The last time I was there, the waiter was overly friendly but I guess that&amp;#39;s better than being rude. <br&gt;<br&gt;They have such a large variety of foods from Asian dishes to Mexican and even comfort food like meatloaf &amp;amp; shepherd&amp;#39;s pie. Yum- meatloaf!!<br&gt; <br&gt;And their cheesecake! Delish! Love the fresh strawberry and the vanilla bean! I wish we had a Cheesecake Factory where I lived!", "rating": 4, "date": "12/3/2011"}, {"text": "I waited in line for over 30 minutes just to put my name down on the waiting list. Only to find out that it was a 5 HOUR wait for a party of 8. I NEVER should have needed to wait that long to put our name on the list. There were PLENTY of open tables and the party of 4 in front of me was told 15 minutes yet the manager wouldn&amp;#39;t apologize or do anything to accommodate our party. We usually like the restaurant and have been often but we will not return", "rating": 1, "date": "4/16/2016"}, {"text": "The service here is beyond poor. Trying to leave, let alone get food is unbelievably slow. If you don&amp;#39;t have an entire afternoon to devote to mediocre food, go somewhere else.", "rating": 1, "date": "11/6/2016"}, {"text": "When ever I want to treat myself or someone in my family to a great dinner out we go to the Cheesecake Factory! I&amp;#39;m amazed that they can offer such an extensive menu and everything I&amp;#39;ve ever gotten there has been wonderful. We always get cheesecake for dessert and I&amp;#39;ve learned when in doubt, get the Godiva! It&amp;#39;s a 40 minute drive for us but so worth it.", "rating": 5, "date": "11/4/2016"}, {"text": "Been here several times and have had very good experiences. Our waiter Sean is awesome, always making solid recommendations and even highlighting good local spots to check out. We once had an issue where two of our free cheesecake coupons came back as invalid for some reason. The manager Brian waived it and comped us two cheesecakes without any challenge.", "rating": 5, "date": "3/30/2016"}, {"text": "When it comes to chain restaurants, The Cheesecake Factory is in my top 5.<br&gt;<br&gt;It&amp;#39;s clean, the servers are attentive and efficient, and the menu is always exciting with each visit (I mean, come on, there is almost 10 pages)!<br&gt;<br&gt;I&amp;#39;m also always super impressed with the servers, and how they maintain CLEAN and SPOTLESS white uniforms - props, Cheesecake staff!<br&gt;<br&gt;My favorite entree is the Chicken Madeira. My favorite cheesecake is the Lemon Raspberry.<br&gt;<br&gt;Parking is a PAIN for this location (same with Polaris), but I deal with it.", "rating": 3, "date": "6/6/2013"}, {"text": "I fucking love cake. <br&gt;I will do a lot of shit for cake. <br&gt;It&amp;#39;s the only reason and the best part of braving polar temperatures and snow monsters, bearing hordes of white people who can neither parallel park nor be successful pedestrians (by successful, I mean, behaving in crosswalks in a way suggesting one chooses life), eventually just leaving your car wherever because &amp;#34;officer, frankly, I am feeling rather handicapped, yes. Also, I&amp;#39;ve no loose change&amp;#34;, shoving your way past all the assholes who can find no other place to loiter in the restaurant lobby of the Cheesecake Factory but in the clearly marked ROPED OFF line for desserts and carryout, watching as a gainfully employed young black man slices a curiously small $10 piece of cake and proceeds to manhandle said piece like it&amp;#39;s meatloaf, and you&amp;#39;ll notice this started with &amp;#34;the best part&amp;#34; and you&amp;#39;ll notice I can&amp;#39;t finish the sentence because what the FUCK. <br&gt;I never want to watch someone PALM a piece of cake, MY piece, like it&amp;#39;s a motherfucking steak; and when I say no whipped cream, I never want anyone to roll their eyes and attempt to scrape the whipped cream off of the palmed piece of cake; and I never want to have to say &amp;#34;NO THAT&amp;#39;S NOT A THING CUT ANOTHER PIECE YOU ARE THE REASON WE CAN&amp;#39;T HAVE NICE THINGS&amp;#34;; and I never want to start having symptoms of a rage stroke in a motherfucking Cheesecake Factory lobby as I watch the same asshole cut a new smaller piece (BECAUSE IT&amp;#39;S EASIER TO PALM, I ASSUME) and all without ever changing gloves. <br&gt;Please promptly message me if you can direct me to a place where I might address the increasing urgency of my carrot cake needs because I don&amp;#39;t know what in the living fuck that nonsense last night was but the devil is a lie. <br&gt;<br&gt;#THESTRUGGLE", "rating": 1, "date": "12/31/2014"}, {"text": "THE GOOD: The food was good, as it always is. Their portions are typically large but I opted for the lunch menu so it was appropriately sized. The cheesecake was excellent, as expected. <br&gt;<br&gt;THE BAD: Took us forever to be seated, the food took a while and even getting water took at least 15 minutes. The worse has got to be the service - our server was horrible. I suppose he was having a bad day but I&amp;#39;d would have rather he didn&amp;#39;t take it out on us. He threw the menus down, he threw the glasses of water causing it to spill and just had a sour disposition all together. He would even slightly throw out food when they arrived. This restaurant would be 5-star worthy if not for the server. <br&gt;<br&gt;OVERALL: I personally won&amp;#39;t be returning anytime soon.", "rating": 3, "date": "12/22/2013"}, {"text": "Favorite restaurant EVER! Have not had one bad thing here. Service is always great and fast. The burgers here are also the best burgers I&amp;#39;ve ever had in my entire life! I&amp;#39;ve had burgers from the top steak places and none of them can even come close to being as mouth watering as theirs. Love this place!", "rating": 5, "date": "1/15/2016"}, {"text": "Great place with good food. The cheesecake is the real star though. You can look at all of the pies for sale as soon as you walk in. There&amp;#39;s always a wait so make sure to give yourself some extra time This is a chain restaurant so you know it&amp;#39;s going to be the same across the board.", "rating": 4, "date": "11/5/2015"}, {"text": "we&amp;#39;ve been waiting for your food for over an hour! didn&amp;#39;t have to wait to be seated. Ordered an appetizer for my entree and took 20 minutes to get after everyone received their food. Beyond disappointed, management did not even care.", "rating": 1, "date": "3/12/2017"}, {"text": "There was a bit of a wait, but once we were seated we were served right away. Got the avocado rolls, they we great. Definitely recommend.", "rating": 4, "date": "6/22/2016"}, {"text": "Food was extremely salty. Terrible service. Will not be coming back! Way overpriced for what it is!", "rating": 1, "date": "9/24/2015"}, {"text": "Great food but service was extremely slow.  We waited 15 minutes to order and another hour to get our food- 3 salads and 5 kids meals.  No explanation or apology for slow service.", "rating": 3, "date": "8/8/2017"}, {"text": "A 10 minute wait at 7:00pm on a Friday in Easton?!? That&amp;#39;s worth 4 stars alone. <br&gt;<br&gt;That was the wait length for seating inside and outside. We wanted outside so we could enjoy the beautiful weather and people watch the Easton Art Festival goers. We got exactly what we wanted. With an excellent waiter and cocktails to boot. <br&gt;<br&gt;I had the chicken parm sandwich which was pretty tasty. The boyfriend had the luau salad which was massive and incredibly good. And, when I say massive, I meant it... it was 3 stories high. For drinks, I skipped the wine and went with J.W.&amp;#39;s pink lemonade which tasted exactly like pink lemonade despite being entirely alcohol. I don&amp;#39;t remember the name of the drink my bf had but it was tropical and wonderful. No cheesecake on this visit but I pressed my face against the case so I know what I am having for dinner next time.", "rating": 4, "date": "6/24/2013"}, {"text": "The wait to get a table takes a long time. Staff pleasant, delicious food, the pumpernickel bread is amazing! Menu is huge. Their vegetable salad is incredible, portions are huge. They have a skinny menu which is delicious. Cheesecake good, but rich. I can only eat a few bites and usually share with someone. Decor beautiful.", "rating": 4, "date": "7/19/2015"}, {"text": "I hadn&amp;#39;t been here in quite a while so I decided to come over tonight for dinner.  My biggest problem was 1) finding it. and 2) getting back to it after looking for a parking space.  But I managed to do both.  Finding a seat has never been a problem for me since I&amp;#39;ve always been content to eat at the bar and that&amp;#39;s what I did tonight.  And they were CROWDED!!  <br&gt;<br&gt;But I sat at the bar and ordered a number of small plates.  I got the corn fritters (these were the best of the bunch), the beets and goat cheese, and the small house salad.  For dessert I got a piece of cheesecake to bring home and I haven&amp;#39;t been hungry enough to even look at it yet.<br&gt;<br&gt;The small house salad would have been plenty large for me under any conditons and the beets, well, there could have been a few more of them.  But it was a good meal and I&amp;#39;ll likely go back again.", "rating": 4, "date": "2/20/2011"}, {"text": "I went to Cheesecake Factory just for dessert.  Though it was very busy, we were able to get a table for two at 9pm on a Saturday night in about 5 minutes.  We already knew exactly what we wanted to order but we had to wait at least 10 minutes for our server to come.  <br&gt;<br&gt;There were many more tempting options than the last time we were there - I ended up getting the smores cheesecake and it was incredible.  There were small chunks of chocolate and a toasted marshmallow on top - a very accurate take on a smore.  <br&gt;<br&gt;Different people tried bringing other tables&amp;#39; dinners to us 2-3 times - one time while we were in the middle of eating our dessert (try and use some common sense).  <br&gt;<br&gt;Overall, the cheesecake is amazing.  The restaurant could benefit from better organization.  I would have just got my cheesecake to go and sat outside by the fountains but it was raining.", "rating": 4, "date": "6/6/2016"}, {"text": "You can&amp;#39;t go wrong at the Cheese Cake Factory, I mean the name just makes you hungry. My family and I was able to go out for brunch and I enjoyed the make your own omelet and it was delicious. My wife got the Eggs Benedict. <br&gt;Great service too, waitress was very helpful and took the time to answer any questions we had about the menu. <br&gt;We will defiantly come back for a return visit.", "rating": 5, "date": "3/9/2014"}, {"text": "I love eating in Cheesecake factory because the quality and taste of food,  yet, today the restaurant fails to deliver good service which I noticed to be the case during busy times!", "rating": 3, "date": "9/7/2015"}, {"text": "Not thrilled. Quility of food is not represented by the high prices. My $15 fish tacos should have been $7. Same for my husband and daughters meals. Over priced for not great food. Not surprised though anybody with that many items on there menu usually don&amp;#39;t hit the mark on all of it. There known for cheesecake so that&amp;#39;s all they should do.", "rating": 2, "date": "10/31/2015"}, {"text": "Menu full of nothing I like<br&gt;<br&gt;  For such a large menu, I can never find anything that I like from Cheesecake.  It is just not good to me.  I don&amp;#39;t eat cheesecake either, and the desserts I have had weren&amp;#39;t very good.  Maybe next time, sike there won&amp;#39;t be a next time.", "rating": 2, "date": "3/26/2013"}, {"text": "Great location.  Size is a little small when it comes to the wait.  I have had to wait outside during the winter because there was no more room on the inside.  Great food, large portions.  Always stick with the classic cheesecake.", "rating": 3, "date": "4/4/2015"}, {"text": "They were out of several dishes our party of 9 tried to order last evening.  All salmon dishes and shrimp platters. That was disappointing but mostly that they did not tell the people who ordered the shrimp platters they did not have them until right when everyone else was receiving their food. So these people had to wait for the new food to be made. While we ate. They got their food much later. Nothing was offered to them. We had to ask. When we did and the manager came. He was surprised no one had told him much earlier so he could have handled. Food was good but they handled the situation poorly.", "rating": 3, "date": "9/21/2015"}, {"text": "Food was good but overpriced.  Our server, Charles, acted annoyed the whole time with our family of three.  He didn&amp;#39;t even bag our food but bagged the table next to us.  I am sure we won&amp;#39;t be frequenting this establishment.", "rating": 2, "date": "12/31/2015"}, {"text": "I&amp;#39;ve only dined-in a couple of times and I&amp;#39;ve had good food.  They are always very busy.  I especially like the Avocado Eggrolls on the appetizer menu, which are to-die-for.  If I am at Easton (which is not often at all because I hate people) I will get them as carryout.  One of my favorite dishes ever.", "rating": 4, "date": "1/8/2013"}, {"text": "I really do like their food, and of course cheesecake, but they lose a star for the  dreadful wait. I know it&amp;#39;s great to be busy, but I hate waiting forever and then having to swim my way through a stupid busy sea of people and tables and chairs to get to where I&amp;#39;m going. <br&gt;I did visit once on a Monday morning I believe? It was pretty slow, and THAT was nice. So maybe I should only go on weekday mornings or afternoons.", "rating": 4, "date": "6/3/2010"}, {"text": "Not one to write reviews (for anything) but felt compelled to write this one. Came at 4:15 today and was asked to wait 15 min with a wide open restaurant. We literally passed empty booth after empty booth while walking to our seats ... Upon arrival, our booth was layered with crumbs and our dish ware was stained and crusted. We were so disgusted that we looked at each other and without saying anything just walked out. Thanks for taking 20 min of my Friday evening and reminding me why I hate corporate restaurants. Please fail soon", "rating": 1, "date": "6/30/2017"}, {"text": "Got lucky to find two seats right away at the bar for dinner with my wife. Overall a great experience. Drinks were sizable and tasty and served quickly as was our food and all refills thanks to Matthew. Bang Bang Chicken and Shrimp was well prepared and served around a giant mound of rice - plenty enough to have leftovers for lunch tomorrow. My go-to Veggie Burger with an excellent side salad hit the spot as usual. It falls apart a little too easily but is just as delicious when eaten with a fork and knife. It&amp;#39;s even better when I add mustard or hot sauce. It may not always be worth the long wait (1 hour or more) but it consistently makes for a great experience, especially when the entire family goes and has so many options.", "rating": 4, "date": "3/12/2015"}, {"text": "This was an extremely bad experience for me and my family, especially since we were coming here for a couple of birthdays. I concede that it was very busy at the time but we waited over an hour for our food and all the dishes were cold by the time we got them. I&amp;#39;m trying not to blame the waiter (who&amp;#39;s name I did not get), but he did not offer any excuse as to why our food was late or why they were all cold. And it especially didn&amp;#39;t help when he almost put his tie into my food several times when he was trying to refill some waters at our table. I&amp;#39;ve had decent experiences here before but we spent about an hour and a half from being seated to getting our food. This will most likely be my last time I go here and I can&amp;#39;t recommend anyone going here for a larger party because you will be waiting for an extremely long time.", "rating": 1, "date": "11/14/2015"}, {"text": "I&amp;#39;m not a huge fan as I think their menu is just a little overwhelming and nothing stands out or is exemplary.  I had the chicken katsu this time and it was rather tasty. However the 1900 calorie count was a bit of a sticker shock.  They are a solid restaurant but I&amp;#39;m more a mom and pop type of guy.  Now the cheesecake is rather unique and delish.  Overall a little pricey but enough variety that just about anyone can find something to dine on.", "rating": 3, "date": "11/21/2014"}, {"text": "Stopped for a late lunch with wife. We were seated immediately and approached within a minute by server. He was a very happy and knowledgeable young man. After a few suggestions we ordered the potstickers as an app as well as asian lettuce wraps and turkey avocado sandwich. All items delivered in a timely manner, presented well and tasted delicious. We finished the meal with a lemon meringue cheesecake and coffee. What could be better. This location never disappoints.", "rating": 5, "date": "3/14/2015"}, {"text": "Love love love the smokehouse bbq burger.  This is our go_to place for gurlie gatherings.  The brown bread loaf is the best. White vested waiters leave you feeling pampered.  Prices are on the high end which is why we save this for special gatherings.  Expect $50 for 2 if ur going for the dessert (and who isnt?) Plus $10 tip.  Worth it occasionally !", "rating": 5, "date": "5/16/2014"}, {"text": "20 minutes 20 more minutes after 20 minutes. Management.... as a consumer I do not ask how long as a formality I ask how long the wait is to see if I want to wait for your services...... very poor customer service.", "rating": 1, "date": "8/8/2015"}, {"text": "I been basly ALL The Cheesecake Factory! This place is AWESOME! Its abit price in some things! They just open a pice colser where I live in FL and LORD there was one  hell of a line! Then there was 2nd line FULL of SENIORS! Come EARLY to any these store near by you! The food is OUTSTANDING but the lines are a BARE!<br&gt;<br&gt;Some these store DO caters other not! You may need to ask hold a table for you with a small nice fee!", "rating": 5, "date": "11/20/2011"}, {"text": "Went to Cheesecake Factory because we had a gift card. It was OK, but not great. Had either the food or service been better, they likely would have gotten 3 stars. <br&gt;<br&gt;First issue, we waited more than 20 minutes for our appetizer. Then, our entrees came before we had finished the appetizer. <br&gt;<br&gt;Our buffalo blasts appetizer was pretty good, but could have used a bit more spice. I had the &amp;#34;spicy&amp;#34; chicken tacos for my entree. It was not spicy, was pretty much tasteless and was dry. The biggest taste I got was from the tortilla, instead of everything in it. <br&gt;<br&gt;Next issue was with the service. Our waitress was friendly and nice, but I think she had too many tables. We were both completely out of water. She stopped to check on the food and mentioned she would get more, but it never came. <br&gt;<br&gt;The best part of the meal was the cheesecake. I got the pumpkin cheesecake, and it was delicious. We also finally got some more water- we asked for it when our cheesecake was delivered. <br&gt;<br&gt;Not terrible, but I&amp;#39;m glad I didn&amp;#39;t pay for most of the meal. Probably won&amp;#39;t go back for dinner.", "rating": 2, "date": "10/9/2011"}, {"text": "Went to the Cheesecake Factory at the Greene in Dayton and it was the worst experience. My waitress dumped 5 drinks on me and ran off to the kitchen never came back out to say sorry. The manager moved us to a different table and apologized for her.after all of that all I got was one free piece of cheesecake.", "rating": 2, "date": "1/31/2017"}, {"text": "We had read previous reviews and thought we&amp;#39;d try it out this past Sunday afternoon.  The place was packed, but because we were just a twosome we were seated immediately.  The seating is what I call picnic style.  You are  essentially sharing a table with strangers.<br&gt;<br&gt;I ordered a Swiss/ mushroom burger that came with fries, and the wife got a pecan covered French Toast dish with bacon.  The food wasn&amp;#39;t bad - average, a bit pricy ($12.50 for the burger &amp;amp; fries), decent atmosphere if you love crowds, and slightly above average service.  We didn&amp;#39;t try the cheesecake but it sure looked good.  I felt like the whole experience was kind of &amp;#34;yuppy&amp;#34;, but hey we were in that kind of area.  Will we go back?  For the price and type of food available here, probably not.  There are to many other choices in this area of Columbus.", "rating": 3, "date": "9/2/2014"}, {"text": "On a Saturday afternoon at 3,  we waited 52 minutes for a seat,  and then another 30 minutes for food.  No wonder the wait to be seated was so long! The waitress was passable. The food was good.", "rating": 2, "date": "1/17/2015"}, {"text": "Food was great. The steak diane and shrimp scampi are delicious and well prepared as well as the buffalo bites and stuffed  mushrooms. We were looking forward to drinks, dinner,and cheesecake to celebrate a birthday. After waiting an hour to get seated (no big deal,they were super busy) we had what may be the worst service I&amp;#39;ve received by Adalina. We ordered appetizers and our meals which were both delivered quickly by the food runners. Our waitress was at our table only when taking our order, when the food was delivered, and when we finally flagged her down 20 minutes after everyone was done eating. One of the guests at our table went his entire meal without anything to drink. We told her he never got his second beer (he had ordered when the food arrived)to which she responded &amp;#34;Oh okay&amp;#34; and then proceeded to inform us she had been taking care of a tables order with a food allergy. Apparently it&amp;#39;s ok to neglect your other tables if someone is allergic to something. Everyone had planned to order cheesecake but chose not to considering how long it took for Adalina to return to her tables. It took another 10 minutes to get the checks and when they were brought she made sure to inform us she had taken off that second beer you know the one we never received. Really disappointed.", "rating": 2, "date": "1/14/2017"}, {"text": "Yum - the cheesecake factory<br&gt;Awesome menu - Consistently good food, service, and atmosphere.<br&gt;Same here as the other ones I have been to.", "rating": 4, "date": "7/14/2012"}, {"text": "First time going to this restaurant and i must say everything was delicious except for the customer service. Our server was beyond rude, he couldn&amp;#39;t recommend anything on the menu and then he did not attend to us like he did the a table that was right next to us. Im completely unsatisfied with the service but I can say the food was on point. Next time i&amp;#39;ll have to just order out to enjoy my meal completely.", "rating": 3, "date": "4/16/2015"}, {"text": "Whatever. Too any choices on the menu (do something good and stick to that, not try and have it all), too expensive, so-so service, why go? Ugh.", "rating": 2, "date": "8/27/2011"}, {"text": "Horrible brunch! He ordered blueberry pancakes, I ordered a spinach,bacon,mushroom omelet w fruit. Fruit looked and tasted canned and there were only a few pieces in little bowl. Omelet was cold. Mentioned this to server Carla, she took omelet &amp;amp; fruit back. Fruit came back with frozen blueberries dumped over it...gross! He was done with his pancakes by the time I got my 2nd omelet. Had no flavor, totally unseasoned, inedible. Mentioned this to Carla, she said &amp;#34;sorry!&amp;#34; and waled away. Rip off for $14.00 meal, never again!", "rating": 2, "date": "1/23/2017"}, {"text": "It was really good I got the burrito it was really good then for cheese cake I got the taremisu sorry for my spelling not sure how to spell that but anyway it was really good service too", "rating": 5, "date": "10/12/2013"}, {"text": "Every once in a while I review a place and I look at the star rating and I go &amp;#39;huh..I really don&amp;#39;t know&amp;#39; and then you weigh the pros and the cons. I had this issue with this place.<br&gt;<br&gt;I LOVE this place but this location wasn&amp;#39;t as good as what I remember back east. The wait at 6pm was an hour and half so we walked over to barnes and noble and browsed, which is always nice for a mall restaurant... there&amp;#39;s distractions. When our names were called we noticed the wait went up to 3 hours. THAT IS NUTS!!! I don&amp;#39;t care how good the cheesecake is, 3 hours is NUTS!! <br&gt;<br&gt;So we get in at about 7:30 and our waitress took a considerable amount of time to get to us and was in a rush the whole night, often forgetting we asked for things like napkins or more bread. She needed a break to say the least....badly! The bread that was on the table was stale; like 2 days ago type stale. For an app we all shared the buffalo blasts (Chicken, Cheese and Our Spicy Buffalo Sauce all Stuffed in a Spiced Wrapper and Fried until Crisp. Served with Celery Sticks and Blue Cheese Dressing) which was tasty... a lot tastier then I thought they would be. The dipping sauce was bad though. They didn&amp;#39;t go together at all. <br&gt;<br&gt;I ordered the chicken romano (Breast of Chicken Coated with a Romano-Parmesan Cheese Crust. Served with Pasta w/ Tomato Sauce.)  It was 2 flattened pieces of dried out chicken with panko bread crumbs (tasted no cheese) with a huge (like 4 servings) of pasta with a creamy red sauce. The sauce was good but there was barely any at all on the pasta and the chicken was drier then a boot so I asked for more sauce not wanting to send the food back; it took long enough to get to us the first time. The hubby got some kind of pasta and had the same issue I did; didn&amp;#39;t realize what he was ordering and it came out dry and without much sauce. We both asked for more sauce which came out quick. <br&gt;Dad got a salad which was large, but not enough food for a man in his eyes. He didn&amp;#39;t say much else about it apart from complaining about prices for bad food. My mom order mac and cheese, which came out deep fried. She was horrified by the calories but her face showed she was in heaven. <br&gt;<br&gt;The reason we go back is the cheesecake. I got the red velvet cheese cake this time. My favorite so far, although their blueberry cheese cake is so heavenly that I may have two favorites. Then again, every new flavor I try ends up being my new favorite so oh well. Mom got a huge piece of carrot cake and dam near licked the plate clean. I think next time I&amp;#39;ll just go back for apps and cheesecake.", "rating": 3, "date": "5/14/2013"}, {"text": "The Cheesecake Factory at Easton is ALWAYS packed, but I don&amp;#39;t mind because the food is amazing. The servers are very attentive and always extremely grateful when you leave a good tip. The bread is warm and soft. My favorite is the fried mac and cheese, but all of their pastas are great. I rarely have room left in my stomach for cheesecake, but it&amp;#39;s worth the stomachache.", "rating": 5, "date": "11/29/2014"}, {"text": "Best cheesecake ever!  Good food, but a bit pricey!  The best thing is their cheesecake and the many different flavors of cheesecake!  Best cheesecake in the world!  I personally love the plain cheesecake with fruit on top but the other kinds are also delicious!!!", "rating": 5, "date": "11/7/2016"}, {"text": "I have eaten at this easton cheesecake factory many times- and each time we had great service until last night. I have been a server for the past 5 years, so I know when another server says the same B.S lines to me and I know they messed up. I understand that mistakes happen, things in the kitchen can get crazy, people run food they weren&amp;#39;t suppose to. <br&gt;i get it. But our server never apologized during the meal and neither did management. <br&gt;it took almost 10 minutes- once again if she would have apologized in her greet &amp;#34;thank you so much for your patience this evening I&amp;#39;m Tianna&amp;#34;- i get it. full section. running around.<br&gt;nothing. <br&gt;It took quiet awhile after that to receive our drinks...1 ice water and 3 unsweetened ice teas.  *do the servers/management at cheesecake factory not help one another when they are slammed?*  when she finally came back to us we gave her our full order- apps and all. <br&gt;this is where the service and management failed. <br&gt;Our appetizers never came because our entree&amp;#39;s came out first. two other servers ran our dinner out in which we asked what happened to our appetizers. They were being plated. Our server didn&amp;#39;t come over to say &amp;#34;I am so sorry!&amp;#34; nadda. The manager who I assume was running the line that evening came over right when our food was dropped off to inform us that our appetizers were coming out, in which we said no. we had our dinner. no thanks. He honestly didn&amp;#39;t looked surprised that she messed up. But no apology just a &amp;#34;I&amp;#39;ll take those off the check for you&amp;#34; and walked away. <br&gt;we were half way done with our meal when our server came back to see how everything was tasting-no mention of the appetizers mix up. dropped off the bread that we had asked for when we ordered our food over 20 minutes prior....filled up drinks and walked away and didn&amp;#39;t come back until we boxed up our food. <br&gt;we all ordered a cheesecake, my boyfriend a cup of coffee. My friends across from me said &amp;#34;yes, two pumpkin cheesecakes because we don&amp;#39;t share&amp;#34;- she misunderstood, this I wasn&amp;#39;t as mad because I once again understand that it&amp;#39;s loud and the other cheesecake came out somewhat quicker *I understand you have to rush the order* - since only three cheesecakes came out not 4.<br&gt;but my boyfriend never got his coffee. no apology. <br&gt;so we paid and hung out in the booth- we were actually ok with how everything happened for our meals. we haven&amp;#39;t see each other and it was actually my friends taking me and my boyfriend out as my boyfriends belated birthday present to us from them. well needless to say...<br&gt;I caught our server and another server at a terminal staring at us- I can only speculate that they were sh** talking us because she saw her 10% tip, but they made it pretty obvious, my jaw dropped. Go to the back ladies. <br&gt;Our server did apologize once though- at the end after we paid about the appetizers but it wasn&amp;#39;t sincere, quick, and she promptly walked away. <br&gt;I was just going to write this off as one bad trip, as I&amp;#39;ve gone before and my service was great- I wasn&amp;#39;t going to write a review but the last straw was when our server came back to us to ask us why she received such a bad tip..which is that cheesecake factory policy? because...it should have been obvious- well my friend that paid went on to explain why she received a bad tip- about how the appetizers, the coffee- she tried to say she can&amp;#39;t control when the food comes out- which is somewhat true-but in this circumstance no. I don&amp;#39;t know if you use micros or aloha but any server knows not to put appetizers and pasta in at the same time- as most places you have the pasta pre-cooked so all you have to do is deep fry the chicken, toss in the sauce and plate them- so yeah they cook way faster than all of the appetizers we ordered. She either put them in at the same time or  way too close to one another- like she rang them in less then five minutes later. Management never came back either to check on us.<br&gt;honestly we could have solved this problem if management would have been better and expressed ANY apologies but none. I hope next time I go back this issues will be resolved with service and management.", "rating": 1, "date": "10/10/2016"}, {"text": "Great pasta!  Excellent servers!  Love going here.  I do think for the price of the pasta dishes a salad should be included.  Haven&amp;#39;t had anything but the Pasta but it is delicious.  The décor is a little cheesy but nice.", "rating": 4, "date": "10/3/2016"}, {"text": "The first time I tried the Cheesecake Factory I ordered something called the California Guacamole and Brie melt and it was life-changing.  Hand to heaven it was one of the best foods I&amp;#39;ve ever tried in my life.  And then they got rid of it.  So Cheesecake Factory and I stopped being friends.<br&gt;<br&gt;But it&amp;#39;s one of those breakups, where we still run into each other now and then.  Inevitably someone from back home will be coming to Columbus and insist we eat there and I&amp;#39;ll smile and agree, and enjoy the complimentary bread, which is really quite good, but then I&amp;#39;ll take one look at the menu and remember why the Cheesecake Factory and I are no longer on speaking terms.<br&gt;<br&gt;For such a long menu, they have very little that appeals to me.  I eat meat, but only when I&amp;#39;m sure of the quality, and since I&amp;#39;m not sure of it at CF that leaves me with the veggie options, and the veggie options get no love from me.<br&gt;<br&gt;The cheesecake is good, the waits are annoying, and a visit once a year seems like enough.  I&amp;#39;m giving them three stars for the bread and the dessert, but everything in between is meh at best.", "rating": 3, "date": "7/29/2010"}, {"text": "I love Cheesecake Factory, and especially the one at Easton. We always get great service there and the waiters and waitresses spend the perfect amount of time at the table. Some restaurants you get annoyed by constantly getting asked if everything is okay, or sometimes they don&amp;#39;t come to your table quite enough. Every time we are at Easton they stop by and fill drinks and I sometimes don&amp;#39;t even realize it. Maybe one or two stops by the table making sure everything is okay. It&amp;#39;s very nice! Can actually enjoy my dinner and have conversations without interruptions every 5/10 minutes, but still have full drinks and see them walk by if we need to stop them. <br&gt;<br&gt;Not to mention their food is to die for. Haven&amp;#39;t had one thing yet that I don&amp;#39;t like from any Cheesecake Factory!", "rating": 5, "date": "9/24/2014"}, {"text": "Tried to call an order for cheesecake  pick up was put on hold for seven minutes with no answer so I walked into the store. Spoke to Michael D in bakery who then said that there wasn&amp;#39;t any call transferred to him for a cheesecake order and was also informed that they do not do carry out order for cheesecake over the phone. Michael D then took our order, never got an apology for being put on hold or misinformed. Very poor customer service.", "rating": 3, "date": "2/26/2016"}, {"text": "There was no wait at 5 pm on a Wednesday!  Service was good but hard to hear with the loudness of the music.  Had the skinnyliciousness tacos with chicken, pretty good!  The Cuban is what my boyfriend ordered.  It was very tasty.  I would definitely come back again.", "rating": 3, "date": "8/14/2013"}, {"text": "OK, it seems like you have seem one Cheesecake Factory you have seem them all.  The interior may be different, but the concept is the same.  My experience with this part of the chain was to help my very pregnant friend satisfy a craving.  We (her husband and I) ran in, waited in line, placed our order and got back to the car in 5 minutes.  Yeah!!! for the Low Carb Cheesecake with Strawberries and Bananas.  (Did I really say yeah for Bananas???? I guess that shows how much I treasure my friend, that I even cheer for bananas when they satisfy my friend&amp;#39;s cravings.)<br&gt;<br&gt;It was very easy to order desert for take out.   Kudos to the staff for great service!!!", "rating": 4, "date": "4/16/2007"}, {"text": "While the wait was over an hour saturday evening the meal was worth the wait.  What I enjoy most about CF is that there is something on the menu for everyone.  <br&gt;I had the Petit Filet and it was very tender and cooked perfectly.  My father really liked his fish tacos, my husband was disappointed in the Ahi Tuna, but realized he shouldn&amp;#39;t have expected sushi grade at this restaurant.  My Aunt loved the Factory Chopped Salad, which is my usual...best salad on the menu - page 9.<br&gt;My Passion Fruit Mojitos were not too strong, and not too weak. <br&gt;<br&gt;Our server was excellent and as busy as it was he took the time to answer all of our questions, make great suggestions, and keep our glasses filled.  <br&gt;<br&gt;This is an excellent choice if going out with a large group or people with varying tastes.  And don&amp;#39;t forget to order the cheesecake, it is really good.  The strawberry is my favorite, my parents love the Chocolate Mousse.  <br&gt;<br&gt;I&amp;#39;ve also ordered their cheesecakes online for birthdays and they arrive fresh!", "rating": 4, "date": "5/12/2008"}, {"text": "Here are the top six things you should know before visiting The Cheesecake Factory in Easton (or any Cheesecake Factory, really):<br&gt;<br&gt;1.) This place is always seems to be pretty busy, but I can&amp;#39;t seem to understand why. My excuse was that I had a gift certificate, but I imagine most people are choosing to send their dining dollars to Cheesecake Factory over one of the local great restaurants they could discover through Yelp.<br&gt;2.) They&amp;#39;re obviously known for their large portions, and the food is actually pretty good, but everything tastes good when it&amp;#39;s made with two sticks of butter and topped with cheddar cheese. The menu is also very large, which would be good if you&amp;#39;re with a bunch of picky eaters, but it was honestly a bit overwhelming and hard to figure out which items would be the best choices.<br&gt;3.) The decor in this place seems to be having some identity issues. There seemed to be Mediterranean, Egyptian, Italian, French, and possibly Jersey Shore influence in the design. Again, it seems like they&amp;#39;re trying to have as many concepts as possible to please everyone, but it just comes off strange and identity-less.<br&gt;4.) The prices are a little high, but I guess many find comfort knowing that they are going to get a decent meal and plenty of leftovers.<br&gt;5.) The service is pretty good. No complaints from my visit. <br&gt;6.) By the end of our meal we were stuffed, but since it&amp;#39;s The Cheesecake Factory, we felt obligated to get a slice (plus cheesecake is delicious). We got a piece of chocolate mousse cheesecake to go and it tasted great. For being called The Cheesecake Factory, that does seem to be where their strength is. If I had a craving I could see myself stopping back in to get a slice, but I wouldn&amp;#39;t come back for the rest of the menu.<br&gt;<br&gt;Got your six,<br&gt;Neal", "rating": 2, "date": "7/27/2013"}, {"text": "Taste: 3<br&gt;Value: 5<br&gt;Service: 4<br&gt;<br&gt;Since it was the pre-anniversary and they had a special, I decided to drop here after eating at Brio. Huge mistake. I was completely full after Brio, and I was so stuffed after eating a slice of cheesecake it almost hurt to walk around. Interestingly enough, this was actually my first time at a Cheesecake Factory chain.<br&gt;<br&gt;Quality-wise, it&amp;#39;s pretty good. I ordered the Fresh Strawberry, which came with a ton of whipped cream and 3-4 strawberries. However, I wasn&amp;#39;t amazed by it, hence no 4-star rating. They also took nearly 10 minutes to find a seat for me, even though it was just for one. Afterwards, I felt a bit guilty dropping in for just cheesecake, so I gave my waitress a nice tip.", "rating": 3, "date": "7/30/2010"}, {"text": "Ten tragedies. The Cheesecake Factory at this location has been going downhill for a while now. Today just took the cake. It took forever to get us seated. We had to get up and ask for a high chair for our son. I ordered the Louisiana Chicken Pasta, sans chicken, sub shrimp. It came out and the shrimp weren&amp;#39;t cleaned properly, and the sauce was like water. It was ridiculous. I know it was Sunday afternoon. I realize that we were seated during a shift change. But there was really no excuse for the subpar food. I ended up sending it back and gnoshed on some of my guy&amp;#39;s fries. Disappointing.", "rating": 2, "date": "12/15/2013"}, {"text": "I love this place...their food is delicious and their cheesecakes even more so, they are AMAZING!  The only complaint is that there are so many calories in this so I only eat half of the slice and save the rest for the next day so that I can actually eat part of a meal.  Next time I&amp;#39;m having them cut it in half and put half in  to-go box since its sooo hard to be self disciplined lol", "rating": 5, "date": "7/31/2016"}, {"text": "Ordered a cheesecake on Friday night to pick up Monday at 5:00. I think that&amp;#39;s a fair notice. I left work early to pick it up and it wasn&amp;#39;t ready- which ended up being fine since they had extra in the back. I also ordered a chocolate block on the side to read &amp;#34;happy birthday brian&amp;#34;. I kid you not it took the red headed baker 30 minutes to write on it. She had one that would have been fine. It was sloppy but I would have taken it. But no, she wiped the writing off and started over. I only put 20 minutes in my meter thinking I&amp;#39;d be in and out to pick up my order. So I told them I had to pay my meter and I&amp;#39;d be back. I came back and she was starting over on a whole new chocolate block. I mean come on. So I waited another 10 minutes and then said &amp;#34;look forget about the chocolate block&amp;#34;. Took my cake and left. I&amp;#39;m pretty upset actually. I paid for that block and tipped the bakers before any of this and I 100% regret it. It&amp;#39;d be one thing if hey were just running behind schedule but if the new girl takes more than 4 attempts at writing &amp;#34;happy birthday brian&amp;#34; on a block then for the love of god take pity on the customer and help her out. Wasted money. The cake was fine but I won&amp;#39;t be coming back to that location again.", "rating": 3, "date": "10/30/2017"}, {"text": "Our family a party of 5 went to this resturant to celebrate out daughters 20th birthday. After Looking over the menu and talking we realized that 30 minutes had passed and we did not have a server. I stopped a passing server who said she did not know who our server was, that she would check . When she returned she said she did not know who it was  but would take our drink order. She did that and our appetizer order. Meanwhile I stopped a hostess and asked who was our server and told her how long we have been waiting. She said she would check, she came to our table a short while later said Nathan was our server and he would be with us shortly. He never came, but the server who took our initial order delivered an appetizer and said she would take care of us.meanwhile people all around us were being seated and served.  I asked the hostess for the manager, who arrived and was apologetic and would take care of our appetizer. Our food was slow to come, but tasty as usual. When our check came the appetizer was still on our check. I told the server about the error, she had to check with the manager. That was an awful evening . Never should a customer have to chase down for a server!", "rating": 2, "date": "7/27/2016"}, {"text": "I felt morally obligated to update this review because of a change in my diet. In my previous review, I described the world&amp;#39;s most amazing sandwich, known as the Navajo. -  Warm, crunchy fry bread. Perfectly ripened avocado. Grilled chicken. Lettuce. Tomato. Herb mayo. Served with amazing french fries, and the most incredibly rich ranch dressing to dunk them in.<br&gt;<br&gt;Well... I don&amp;#39;t eat MEAT anymore, so when I was at Cheesecake Factory the other day, it physically pained me to know that I couldn&amp;#39;t eat this sandwich. I made a last-minute decision when the waitress arrived back at our table - I asked for the Navajo, with no chicken, and added swiss cheese and mushrooms (and the obligatory side of ranch.) She only hesitated for a fraction of a second at me ordering a chicken sandwich sans chicken, then smiled and said &amp;#34;Of course!&amp;#34; <br&gt;<br&gt;When my Navajo came out, it was PACKED with veggies so that it was just as fulfilling as if it had chicken. And, if possible... even better than I remembered it. :)", "rating": 4, "date": "3/14/2010"}, {"text": "Just went here for a few drinks after walking around Easton. The martinis were tasty and the people watching was very entertaining. The best recommendation I have for any Cheesecake Factory is come with the mindset to wait- because it&amp;#39;s going to be a while.", "rating": 3, "date": "1/31/2011"}, {"text": "Huge menu.  I got the lunch size of the Cobb salad and it was HUGE.  No clue what the full sized portion would be.  Everyone loved their entrees and then on to the cheesecake.   <br&gt;<br&gt;Lots of choices here too.  I am a big Key Lime Pie fan, so I got their cheesecake version of that.  I highly recommend.", "rating": 5, "date": "3/23/2011"}, {"text": "The place was packed for Valentine&amp;#39;s day. Despite that fact, there were plenty of servers, and we didnt have to wait long for anything. our waitress was very sweet, and did an adequate job. The food was amazing. I had the Chicken Di Pana. Delicious! If there weren&amp;#39;t so many places to eat in Columbus, I&amp;#39;d be back again today.", "rating": 4, "date": "2/15/2014"}, {"text": "I always enjoying going to the Cheesecake Factory! The warming environment in the restaurant makes me and my partner relief! Their pasta, especially Pasta Da Vinchi is fabulous! It has the taste which you will never get tired of. The sauce and the ingredients also put the pasta to a better space! This is a recommended restaurant for any occasion! Definitely try their cheesecakes out to!", "rating": 4, "date": "12/9/2013"}, {"text": "I&amp;#39;ve eaten in house a few times, but mostly takeout.. just for the reason that it was so packed that I didn&amp;#39;t want to wait 2 hours for a table. This is just one of those restaurants that reviews really don&amp;#39;t matter because people will go there anyway.. <br&gt;They&amp;#39;ll go just for the sake of going because it&amp;#39;s the Cheesecake Factory. <br&gt;There&amp;#39;s nothing wrong with that- CF has built such a reputation that they have become &amp;#34;review-proof&amp;#34; in a way. <br&gt;<br&gt;The service is decent, but it&amp;#39;s clearly obvious that the servers make their money on quantity, not quality- a direct opposition from the Fish Market.. CF service has the turn em and burn em approach and it&amp;#39;s sad. <br&gt;<br&gt;There menu is such a novel that it would be hard to find something even the pickiest eater didn&amp;#39;t like.  <br&gt;<br&gt;At CF, it&amp;#39;s easy to make an appetizer a meal because the portions are huge...  beyond huge. The price is definitely in line with the portion sizes. <br&gt;<br&gt;Their takeout leaves a little to be desired, but it&amp;#39;s not the food-  it&amp;#39;s the accuracy...", "rating": 3, "date": "6/3/2010"}, {"text": "Quoted 30 minutes waited 45-50 minutes.  Seated and greeted. Order app and meal. <br&gt;Food took FOREVR! Our food came out before kids. Husband food cold. Ordered cheesecake and after 25 min waiting for it finally got up to find a manager. 3 hrs later we were finally out of there.", "rating": 1, "date": "10/7/2012"}, {"text": "We LOVE the Cheesecake Factory. Have been to them from Hawaii to Florida, but THIS ONE IS SO SLOW AND INEFFICIENT for some reason. We have gone here repeatedly and it is ALWAYS the same-SLOW and they get the orders WRONG", "rating": 3, "date": "7/27/2014"}, {"text": "I ordered a ribeye.  The good news:  I ordered it medium rare and it was prepared properly.  The bad news:  It was way too salty.  I&amp;#39;m not sure if it was the sauce--seemed like a wine sauce or demi-glace of some type, or it was some type of rub they prepped it with, but whatever they doused it in spoiled the taste of an otherwise perfectly prepared cut of meat.  The mashed potatoes, bread and salad were good, but that does not offset the price of the meal.  For the price of the steak, comparable to restaurants for which steak is their specialty, it shouldn&amp;#39;t taste like salt pork.", "rating": 2, "date": "5/31/2016"}, {"text": "always a grand slam with a large group.  we each can order different items - chicken, pasta, asian, etc.  everything you could want!  we very much enjoy all of the options.  drinks are great and HUGE.  service was great.  our waiter was hysterical and quick with service and we were there!", "rating": 5, "date": "8/3/2015"}, {"text": "Love it here! I have never been disappointed before with them and this past Sunday was excellent all around. Our server was fantastic, our pizza and salads were delicious, as well as our cheesecake and the fresh bread they bring to the table. Our server was very attentive and seemed to enjoy his job and be super friendly. Will return in the future for sure!!", "rating": 5, "date": "10/19/2015"}, {"text": "Terrible lunch experience. Our team of 10 colleagues chose Cheesecake Factory for a noon send-off event because the venue can accommodate large groups. However, we had to wait nearly an hour to get seated, with only scant apologies from the manager. And although two complimentary appetizers were provided, our meals came very slowly and we had to rush to finish in order to get back for meetings. By the time we got out of there, with ice tea running down the pants of one of our group members because our waiter knocked over her glass, it was nearly 2:30 and our work day was shot. The manager adjusted the bill only when we brought attention to our frustration, and we were numb to his mumbled apologies by that time. I am never returning, I don&amp;#39;t care what time of day.", "rating": 1, "date": "12/8/2012"}, {"text": "I&amp;#39;ll jump on the &amp;#34;meh, Cheesecake Factory&amp;#34; bandwagon.  I&amp;#39;ve always found the food to be very satisfying, once I navigated through the huge menu.  The prices are a little high and the portions are huge, however, which means it&amp;#39;s best if you plan from the start to take half of your food home.<br&gt;<br&gt;Of course, even after half a meal here, you might not be able to fit the cheesecake in your belly.  But odds are you&amp;#39;ll order it anyway, and it&amp;#39;ll be delicious.  The pieces are also quite large, however, so it&amp;#39;s best to share them.  In other words, everything at this restaurant is twice as big as it should be.<br&gt;<br&gt;So, yeah, I like the food fine, but as others have said the place is huge and loud and frequently has an hour wait.  I&amp;#39;d sooner go almost anywhere else at Easton - Restaurant Hama and Cafe Istanbul in particular are both very good and far, far less populated than Cheesecake Factory, PF Chang&amp;#39;s, or California Pizza Kitchen usually are.", "rating": 3, "date": "5/23/2008"}, {"text": "I&amp;#39;ve always been a fan of the Cheesecake Factory, in Columbus, in Atlanta, and in any other city that I&amp;#39;ve been too lol.  <br&gt;<br&gt;I love the versatility of the menu!  I&amp;#39;m world&amp;#39;s pickiest eater &amp;amp; seriously, they offer a little something for everyone!<br&gt;<br&gt;As long as they continue to serve good food and for the most part have good customer service, I&amp;#39;ll continue to be a Cheesecake Factory fan!", "rating": 4, "date": "12/7/2008"}, {"text": "I was so disappointed with this restaurant.  Have been wanting to try it for years.  We were in Columbus for a few days and made a special trip to Easton Center to try it.  When we were being seated I asked for a booth and was told none were available.  I saw plenty open so I pointed this out to her.  She said those seated six people and since we only had three people we couldn&amp;#39;t sit there.  I have a bad back and booths are generally more comfortable for me.  After we were seated I noticed parties with only two people being seated in the booths.  Wow... Really?  The food here was ok.. But definitely not worth being treated so rudely.  If I am going to drop $70 on a Monday afternoon for lunch I think I should be treated better by the staf", "rating": 1, "date": "11/4/2013"}, {"text": "Why is this restaurant always crowded?  I&amp;#39;m having difficulty thinking of a time I ate here or even walked past when the lobby wasn&amp;#39;t packed shoulder-to-shoulder with people, spilling out onto the patio.  Sometimes you even have to get on a waiting list for a beeper!  People wait hours to eat here.  I don&amp;#39;t get it.  I mean, the food is quite good, much better than average for a national chain, but it&amp;#39;s not THAT good.  And waiting in that lobby is stressful.  There&amp;#39;s a constant stream of servers running back and forth from the dining room to the case the holds the cheesecake, and there are very few places to sit.  They need to have a dedicated waiting room here, like a doctor&amp;#39;s office.<br&gt;<br&gt;I also hate the portion sizes here.  When you get a &amp;#34;lunch-sized&amp;#34; salad for your meal, and you eat until you&amp;#39;re stuffed and the bowl is still three-quarters full, it&amp;#39;s too much.  The serving sizes are big at many chain restaurants, but here they&amp;#39;re out of control.  It&amp;#39;s like the poster child for American gluttony.<br&gt;<br&gt;All that said, the food here really is quite good.  With a name like Cheesecake Factory, your cheesecake better be awesome, and it is (you ever wonder why almost nothing at Olive Garden contains olives?).  I always settle on the banana cream, and it&amp;#39;s good enough to daydream about.  As for entrees, I&amp;#39;ve never had anything I disliked.  The best thing I&amp;#39;ve ever had here is the pizza with goat cheese and roasted veggies.  It&amp;#39;s very, very rare I order vegetarian dishes, but the description was so mouth-watering, I had to try it.  I don&amp;#39;t know if they still serve cole slaw, but I hope so, because it&amp;#39;s the only restaurant cole slaw I&amp;#39;ve ever liked in my life... made with crisp, fresh cabbage and a light dressing.<br&gt;<br&gt;I just wish you could eat here without wasting an hour of your life standing around.", "rating": 3, "date": "7/29/2010"}, {"text": "A little overpriced. Portions are large but food isn&amp;#39;t amazing.", "rating": 3, "date": "6/2/2013"}, {"text": "Great place. Awesome interior ambiance, very extensive menu, and killer cheesecake.", "rating": 5, "date": "5/28/2012"}, {"text": "I&amp;#39;m a fan of Cheesecake Factories.  Unfortunately this location is packed on weekends.  We got to experience a 2 hour wait for a table.  Totally crazy, but since we were from out of town and with a group we were patient.  As always, food comes in large portions. FYI gratuity automatically added on with larger groups.", "rating": 3, "date": "3/16/2012"}, {"text": "The Cheesecake Factory is one of my favorite restaurants. Because almost every dish have a good flavor and the amount of the food is really large. I love the brown bread before the dinner, which is very soft and savory. However,  the serve speed is not so good. Maybe there are too many big fans every day and the restaurant is always loud and full of people. But, it&amp;#39;s worth to try the famous cheesecake. The cheese is vey light and not greasy. I&amp;#39;d like to eat one there and take off another.", "rating": 5, "date": "11/23/2014"}, {"text": "This place is great! If you&amp;#39;ve never been to a Cheesecake Factory you have to go, it&amp;#39;s an important life experience. The one in Easton is very nice. The decorations are kind of Egyptian meets Aztec-ish. The wait time varies. In the evenings on weekends, when Easton is packed, there is usually a 2 hour wait (and they do not take reservations). But if you go on off hours there is hardly any wait at all. The service can be either amazing or disappointing depending on how busy they are. But never mind the service, the food is always amazing! My favorite entree is the Teriyaki Chicken (which comes with grilled pineapple and bananas on the side - Yum). The Cheescake menu spans 2 pages and there are so many different types. But my favorite deserts on the menu are the Tiramisu and Original Cheesecake w/cherry topping.", "rating": 4, "date": "8/3/2012"}, {"text": "Went to CCF yesterday with 4 other friends for lunch. Ordered an item that came with soup and salad. They only had one soup option, which I found to be odd. Then when I got home, the strawberry cheesecake that I got to go and paid 7.95 for was just a sliver... not at all worth that price. IF I ever go back to CCF, I will not order the cheesecake. Though it was good, not worth the price for such a small slice.", "rating": 2, "date": "1/18/2015"}, {"text": "My food appeared to have been old .. Like sitting from an earlier cancelled order or something :( everyone else at the table liked there food.", "rating": 1, "date": "6/17/2012"}, {"text": "Dear Cheesecake Factory,<br&gt;<br&gt;Thank you for the chopped-up caterpillar--that was still wiggling nonetheless--the last time I ordered your Luau Salad. The fact that Twin discovered it as he was finishing up the salad for me was not at all comforting; it only led us to question ourselves as to who ate the other half of the caterpillar. Me or him? It&amp;#39;s a great appetite killer, I tell ya. So yes, CF, I am now scarred for life and will never ever order salads anywhere else.<br&gt;<br&gt;I realize that such insects are easily overlooked in green salad leaves and the like, but having one of them on display in my dish (and quite possibly moving its way to my stomach) is one hell of a different story... and a revolting one for that matter.<br&gt;<br&gt;I have not been back ever since and will have to find other ways to satisfy my white chocolate macadamia nut cheesecake cravings. Sadness.<br&gt;<br&gt;Sincerely,<br&gt;<br&gt;A Former Faithful Customer", "rating": 1, "date": "5/22/2008"}, {"text": "Just like every other Cheesecake Factory. Food was good. Service was good. The place was packed, but the wait wasn&amp;#39;t too terrible.", "rating": 3, "date": "12/29/2011"}, {"text": "Only go here for the cheesecake.  The actual food is blah-boring and greasy/salty/etc...", "rating": 1, "date": "9/3/2011"}, {"text": "Love the portions and the variety in the menu.  Service is always top-notch and food is good as well.  Each plate will last you 2-3 meals which is nice to take home for leftovers.", "rating": 4, "date": "11/14/2011"}, {"text": "This was my first time at the Cheesecake Factory and overall, it should get more than 5 stars. What a great place to come to for dinner. They have an extensive menu and you could pretty much find a little bit of everything on there from mexican to italian to good &amp;#39;ol American food. We arrived last night (Saturday night) around 6 pm and we only had to wait 20 minutes for our table. We were seated quickly and the waitress was great. I asked her what she recommended, which was the Chicken Midiera. Yum with a capital Y! We also chose to get a piece of cheesecake. Unfortunately the Oreo cheesecake had been sold out already. (boo!), but we ended up having the chocolate mousse cheesecake. Yeah, didnt think there was any room for cheesecake, but there was!! Overall the atmosphere was pleasing and very nice. It almost felt like we were out of town on vacation to a nice casual restaurant. We&amp;#39;ll definitely be going there again soon!", "rating": 5, "date": "8/21/2011"}, {"text": "I had a nice experience here. 4 stars for:<br&gt;<br&gt;1) Very friendly (but not annoying) workers! <br&gt;I believe everyone on staff said &amp;#34;Welcome,&amp;#34; &amp;#34;Good Afternoon,&amp;#34; or &amp;#34;Have a good day!&amp;#34;<br&gt;<br&gt;2) Accomodating waitress.<br&gt; I got the raspberry lemonade- which is possibly my favorite drink in the world- and it was never even close to being empty- plus the sugar sprinkled along the rim of the glass (which is part of the drink&amp;#39;s appeal for me) was always there. The waitress was also very kind and friendly but NOT fake.<br&gt;<br&gt;3) The food was awesome<br&gt;It was flavorful, delicious and piping hot (when appropriate). I left happily full. I&amp;#39;ll rarely say no if someone suggests eating at the cheesecake factory.  <br&gt;<br&gt;4) Fast service<br&gt;I was there on a weekday afternoon and the place was fairly crowded with lunch-ers, yet everything came out to the table so quickly, the thought crossed my mind that maybe they had some wizards working back in the kitchen....<br&gt;<br&gt;Overall a very pleasant experience. I would not be opposed to a repeat meal.", "rating": 4, "date": "4/27/2011"}, {"text": "It is really nice. Not only the cheese cake but also the curry food. I love it! The second reason I love it is because of the location. It is in the heart of Easton. After shopping, we can have a good meal. But, there are always many people. I need wait long time.", "rating": 4, "date": "12/1/2013"}, {"text": "Why is this place always busy? There is always a wait. I guess the tourists that flock to Easton must love it. Me? Not so much. The food is good, but overpriced and not really worth the wait. The portions are ridiculously huge and so is the menu. This means everyone can find something and you have lunch for the next day. The service is usually underwhelming. I usually go for a pasta dish or salad. In the summer they had delicious fried zucchini. The cheesecake, of course doesn&amp;#39;t disappoint.", "rating": 3, "date": "12/30/2010"}, {"text": "Awesome cheesecake. Way overpriced for cheesecake and the food. The seating is cramped. Your table spills into the other tables. You might as well be dining with strangers because they are so close to you that their elbows touch yours when you eat. The service is slow and there is always a wait for a table.", "rating": 2, "date": "5/27/2011"}, {"text": "Holy crap, why are so many people willing to shell out big bucks for this place? Look, if someone else was paying, I would enjoy  it, but I went with a large gift card and still payed a lot. The food is good, and so is the service, but come on, nothing daring is going on here, it&amp;#39;s a chain!", "rating": 3, "date": "11/15/2010"}, {"text": "The food is fantastic! Our service was very good as well (at least from the server). Getting a drink at the bar took 20 minutes though, and they weren&amp;#39;t overly busy. Bartender paid attention only to the people sitting at the bar and didn&amp;#39;t acknowledge those waiting for drinks who couldn&amp;#39;t sit.  This restaurant is very busy all the time and our &amp;#34;40 minute&amp;#34; wait time ended up being about 60 minutes. This is a good place to eat during off-peak times.", "rating": 3, "date": "10/5/2013"}, {"text": "Personal biases of mine that impact my review of this restaurant:<br&gt;<br&gt;I try to avoid Easton like the plague.<br&gt;I&amp;#39;m a vegetarian.<br&gt;I prefer small cozy restaurants to giant amusement park sized establishments.<br&gt;<br&gt;I&amp;#39;ve eaten at CF once in my life, and I doubt I&amp;#39;ll ever go back.  Some friends of mine invited me one Friday evening last summer, so I sucked up my courage and braved the traffic and drove out to Easton.  Found parking with no more than normal difficulty, and successfully navigated the mazelike restaurant to the table where my friends were seated.  The free bread was quite tasty, so things got off to a good start.  The service must have been fine because I don&amp;#39;t remember anything particular about it.  We ordered drinks, which were very expensive and not all that strong, though tasty.  Those things, and the cheesecake itself, were the plusses.  On the minus side: the menu was gigantic and not vegetarian-friendly.  I tend to find large menus, like large restaurants, a bit overwhelming.  I ordered the grilled eggplant sandwich which sounded like a manageable veggie dinner to eat and still have room for cheesecake.  Not so much!  I ended up with a huge pile of fries surrounding what seemed like a loaf of greasy bread filled with eggplant, red peppers, and a half a pound of cheese.  It was the greasiest, messiest, most unmanageable &amp;#34;sandwich&amp;#34; I&amp;#39;ve ever seen.  I think I ate a third of the sandwich, half the fries, and of course a slice of cheesecake, and consumed more fat than I&amp;#39;d had all week.  Yuck!  The restaurant was very loud and crowded, and, like I said earlier, had all the ambience of a theme park.<br&gt;<br&gt;Two stars - one for the cheesecake, one for the free bread and fancy drinks.  Nothing for the food or the atmosphere.  But maybe that&amp;#39;s just me.", "rating": 2, "date": "5/23/2008"}, {"text": "I like this place for dinner with the in-laws there is something for everyone on the 20 page menu. It does get crowded around dinner so get your name on the list early!", "rating": 4, "date": "12/9/2010"}, {"text": "Extensive menu. Portions are way too big but that&amp;#39;s not a bad thing if you like leftovers for two nights like I do. The food is above quality bar and grill fare. Not very many low-fat options but I generally don&amp;#39;t go out to eat for low-fat meals as I eat enough of those at home.", "rating": 3, "date": "2/4/2011"}, {"text": "The food is excellent, the atmosphere is beautiful, and the service is always much greater than the service I get at other chain restaurants. I have been here about five or more times and each time it has been awesome.", "rating": 5, "date": "3/11/2012"}, {"text": "Cheesecake Factory isn&amp;#39;t a favorite of mine, but somehow I end up going there about 5 or 6 times a year. I don&amp;#39;t complian. It&amp;#39;s always a decent experience. This is how it goes down. There&amp;#39;s always an annoying wait evern if it&amp;#39;s 3PM on Friday or 10PM on Saturday, and fuggedaboudit during peak times. So, anyway, you&amp;#39;re waiting and people are everywhere, not dressed appropriately for dinner, carrying shopping bags and pushing strollers. That&amp;#39;s Easton for ya! Then your name gets called and you&amp;#39;re so excited! The seating is meant to get as many people in as possible which takes away from the ambiance, but you get over it when you get your bread (eat the brown kind) and then order drinks. Their mixed drinks are THE BEST! Whoever is their bartender, they should get 5 stars! Anyway, you go through the HUGE menu, pick something that sounds good, you get the huge plate of food. It is pretty good. You can&amp;#39;t finish, you may or may not get cheesecake to-go. You get the bill and are shocked at how much you&amp;#39;ve spent. Pay and tip for the attentive service and try to rush out through the crowded hostess coral. That&amp;#39;s was a nice time, wasn&amp;#39;t it?", "rating": 3, "date": "6/21/2010"}, {"text": "I&amp;#39;m not a huge Cheesecake Factory fan but this one was bad even for me.  The service is painfully slow and the servers have an attitude every time.  Food is decent but nothing fantastic.  Best thing is the cheesecake, as you would expect, but even that is not mind-blowing.", "rating": 2, "date": "8/18/2010"}, {"text": "No matter what you&amp;#39;re in the mood for, they&amp;#39;re going to have a large portion and it&amp;#39;s going to taste great!  Drinks are over-priced but it&amp;#39;s a great place for dinner.", "rating": 4, "date": "6/23/2009"}, {"text": "My wife and I have been searching for a place that offers the classic Eggs Benedict.  Since The Cheesecake Factory offers this item on their Sunday Brunch menu, we decided to give it a try on 12/2/2012.  I couldn&amp;#39;t have been more disappointed.  My wife ordered French Toast and bacon, and I ordered the Eggs Benedict with Canadian Bacon and Hollandaise sauce.  After an extremely long wait for our food to arrive (it wasn&amp;#39;t crowded or busy at 10 AM), my wife was presented with her French Toast, but no bacon.  Apparently, the bacon was not ready.  The worst offense was my Eggs Benedict was presented with a greasy and broken Hollandaise sauce.  When our waitress came back to ask if everything was okay, I informed her that my dish had to go back to the kitchen.  She didn&amp;#39;t ask why, and picked it up and returned to the kitchen.  I did overhear her saying the sauce was broken, so at least our waitress knew the dish was unacceptable.  What I can&amp;#39;t fathom is why the kitchen would send such a disaster out to the table in the first place.  The second attempt was no better than the first.  The sauce was again broken.  Apparently, there was no chef working that had passed basic sauces at culinary school.  Now here is the absolute worst offense.  As I had been craving Eggs Benedict, I decided to eat the second dish as I was also hungry and didn&amp;#39;t want to waste further time having them fix me something else.  During my meal, I was presented with a flour-thickened Hollandaise sauce.  That should have been criminal!  It isn&amp;#39;t called Hollandaise GRAVY, it&amp;#39;s supposed to be an emulsification!  That had to be the worst offense from the kitchen.  Needless to say, the manager did remove the Eggs Benedict from the check - I wouldn&amp;#39;t have paid for it anyway.  The service was good. The waitress was sympathetic.  The transgressions on the kitchen were unforgivable.  We had been past fans of The Cheesecake Factory, but after this experience, we won&amp;#39;t be going back.  I cannot suffer a kitchen that just doesn&amp;#39;t care about the quality of the food they are producing.", "rating": 2, "date": "12/4/2012"}]}