{"address": ["1566 Polaris Pkwy", "Ste 124", "Columbus, OH 43240"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.0], [7, 2.5], [8, 2.0], [9, 2.0], [10, 2.5], [11, 2.5]], "2017": [[0, 3.5], [1, 3.0], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 2.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 2.5], [11, 2.5]], "2020": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.5], [6, 3.0], [7, 3.0], [8, 3.5], [9, 3.5], [10, 3.0], [11, 3.5]], "2018": [[0, 3.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.0], [11, 3.0]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "Oh my gosh, this place was packed tonight!! We arrived just before 5:30 and we waited about an hour to be seated. My husband and I had a $25 gift card to spend, so we spent a good bit of our wait going over the lengthy menu and deciding what to order without going too much over that.<br&gt;<br&gt;In the end, we decided to get a couple of appetizers and split a piece of cheesecake. We ordered the Dynamite Shrimp, which is tempura breaded shrimp with a side of what the menu describes as &amp;#34;our spicy Dynamite sauce.&amp;#34; The shrimp was absolutely delicious. The sauce was also very good, but I would not have described it as spicy.<br&gt;<br&gt;The other appetizer we ordered was the Factory Nachos, which comes with cheese, guacamole, pico de gallo, sour cream, jalapeños, and green onion. The chips were on the thick side and very crispy, so they held up well to the cheese and other items on the nachos. This was a delicious plate of nachos, and it included a big &amp;#39;ol dollop of sour cream, but sadly they really skimped on the guacamole, pico de gallo, and other items. At almost $13 for a dish with no meat, I really didn&amp;#39;t feel like we got what we paid for. It was especially disappointing because the guac and pico were so doggone good.<br&gt;<br&gt;Lastly, the strawberry cheesecake. The strawberries on ours were plump and perfectly ripe and included a nice sauce. As for the cheesecake itself, I have always felt that the cheesecake here is fine, but quite a bit dryer than some I&amp;#39;ve had at other places that was better. As you would expect from their name, they do have a wide variety of different cheesecakes.<br&gt;<br&gt;Overall, good food and friendly service, but I will say I agree with some of the other reviewers who have said it&amp;#39;s overpriced. I certainly appreciate receiving the gift card someone gave us, but I don&amp;#39;t know that I would come here without one and pay full price.", "rating": 3, "date": "1/5/2019"}, {"text": "Went with my family for my birthday, the hosted asked us to wait outside of the restaurant because we didn&amp;#39;t have masks. After an hour of waiting they denied us to come back in because we didn&amp;#39;t have a mask to walk from the entrance to the table. She never said we needed masks just to walk to our table.", "rating": 1, "date": "7/5/2020"}, {"text": "Food was outstanding as always. <br&gt;<br&gt;Went inside to pick up an online order. Stood there for over ten minutes - was never greeted or acknowledged (I literally stood by the host stand while several employees continuously walked by me/ignored me over and over again. I finally forced myself to get someone&amp;#39;s attention, who showed me to the area by the bakery with lots of pickup orders and said &amp;#34;yup, they&amp;#39;re arranged alphabetically so yeah..&amp;#34; and left it at that. So, half confused, I began to sift through the orders to find my name. Immediately I was approached by another staff member who, in an almost perturbed tone, asked me &amp;#34;can I help you sir...?&amp;#34;. I was then directed to the appropriate pick up spot which was the cash register at the bakery. <br&gt;<br&gt;This whole experience was a little more than frustrating. I was ignored by multiple staff for over ten minutes; then misdirected to the wrong area/method of pickup. <br&gt;<br&gt;I understand COVID is a major issue/source of stress, and I am appreciative of restaurant employees that continue to work to provide us with good food, but I do not think a customer should be ignored for over ten minutes until they have to speak up to get their order. I have been coming to this location for a couple years now and will be rethinking things.", "rating": 2, "date": "4/26/2020"}, {"text": "I visited Columbus from Michigan.  My first Encounter with the person that seated me wasn&amp;#39;t pleasant.  But then God sent Josh P. my  waiter who smoothed things over. He noticed from a far the conversation and immediately turned things around and made me feel like a Queen amongst others.  He was patience. Make some fantastic recommendations. The food was delicious.  The manager was also Accommdating as well.  The next time I&amp;#39;m here visiting. I will definitely reserve a seat at Josh P&amp;#39;s table.", "rating": 5, "date": "8/22/2020"}, {"text": "I ordered chicken fettuccine and it was bland bland bland. The best part of my meal was the bread. Season your pastas. It&amp;#39;s like you just poured 3% milk on your pasta. I used to order this all the time and now I know why I stopped. I&amp;#39;m politely asking you to get your crap together. I just wasted money trusting you. The only thing good about cheesecake factory is the cheesecake. I&amp;#39;m Beginning to believe it&amp;#39;s better to order food elsewhere and get dessert at cheesecake factory.", "rating": 1, "date": "7/6/2020"}, {"text": "Ate here on an early Saturday evening with a group of 8. The wait for our table was about 75 minutes, understandable. They are famous for their huge menu and large portions. Once we were seated, everything clicked. I had a bowl of loaded potato soup and shared Thai lettuce wraps with  wife. That plus the bread and I was full. (Their dark wheat bread is awesome.) Got the lemoncello cake for dessert (to go).<br&gt;Service was friendly, efficient and attentive. We had no complaints about anything. Several first timers in our group that were impressed. (Don&amp;#39;t complain about the wait at peak times--this is a sign of a popular restaurant)", "rating": 4, "date": "3/28/2019"}, {"text": "Food was good but the place was disgusting. There were crumbs all over the floor and it looked like it hasn&amp;#39;t been vacuumed in a month. Bathrooms were disgusting as well. Go to another location.", "rating": 1, "date": "11/7/2020"}, {"text": "I swore if never eat at cheesecake factory ever again. Because of the number of people we had and variety of tastes in food, we decided on CF. Big mistake! The food just is not good at all and for what you get, it&amp;#39;s easy overpriced.", "rating": 1, "date": "12/24/2019"}, {"text": "Took my wife to the cheesecake factory the food and service was the best I every had. Well go back very soon", "rating": 5, "date": "7/21/2020"}, {"text": "Came here for my birthday dinner about a month and a half ago, but didn&amp;#39;t have time to write a review until now.<br&gt;<br&gt;The thing about Cheesecake Factory is that there&amp;#39;s always a long line. According to my friend, the Polaris location has a shorter wait time compared to the one in Easton. <br&gt;<br&gt;Food was good, albeit expensive. I&amp;#39;ve always loved their chicken carbonara and so I opted to order my usual. Food had good flavor and enough creaminess. Portions were big enough to have leftovers. <br&gt;<br&gt;Our server was the absolute best! She was hilarious and attentive. She brought our hungry group more bread and butter and even sang me happy birthday!  Kudos to her for her excellent service.", "rating": 4, "date": "7/31/2018"}, {"text": "Came in for a late dinner on Saturday night,  I love how late they are open.  We were seated really quickly and the service was great!! Our witness was super attentive, our drinks were refilled without having to ask, the bread was warm and fresh.  I ordered a chicken dish and it was great. My husband ordered the spicy chicken sandwich which was huge! He also ordered the loaded potato soup and it tasted great.<br&gt;Very good experience unfortunately we were too full for dessert!!", "rating": 4, "date": "3/18/2018"}, {"text": "Great server!! Had an awesome conversation with the lady at the front desk. If i lived in Tennessee I&amp;#39;d frequent tbat location more often :)", "rating": 5, "date": "6/23/2020"}, {"text": "REFUSED BAR SERVICE AND TABLE CLEARED WHILE IN BATHROOM WITHOUT MY CONSENT!! I have been a customer of Cheesecake Factory be for years. This was the worst location I&amp;#39;ve visited in North America! When I arrived I was read my rights about wearing a mask. The manager seated me near a very busy, loud, noisy location which I thought was odd. Of course Cheesecake Factory is loud but this particular area is where servers and bar hops work out of. The bread was cold when it arrived. I was not given straws for the drinks I ordered. Of course I sent asked for straws and I sent the bread back to the kitchen. There was a very hostile and over intrusive Caucasian female manager who constantly cane to my table and harassed me about mundane things. I believe she might have thought she was being helpful but she was not. It was harassment. I then proceeded to the bar while waiting for my food to arrive (which is my custom). The same manager came to the bar and again lectured me about rules, wearing a mask (I was wearing one the entire time) and she told me I could not order at the bar. I then proceeded to the restroom and she told me GOOD NIGHT! My food had not arrived so again, I struggled her rude and unwelcoming behavior off. When I returned my table had been cleared off and the manager stated she thought I was leaving. First, I had not paid my bill yet and I was waiting for a drink at the bar. I ordered the Fillet Mignon Entree and the steak was dry, unseasoned and the vegetables and mashed potatoes were not like any of the other locations. The food was awful and I was entirely disappointed. I confronted the female manager about her unwelcoming, rude and obnoxious behavior and she gave me one excuse after another but insisted that I was not a problem and she had no issues with me. Finally, a make manager came to my attention and asked if everything was okay. I td him about my experience and then I requested my bill. The manager had removed some items from my bill. I did not request this and I requested he put them back on the bill. Instead of him doing this he just printed out a duplicate copy of the original bill with all of my charges so as to mislead me to believe he charged me. I checked my bank account orior to leaving and behold it was the discounted charge that I objected to originally. I confronted him and he was embarrassed that I caught him. The entire experience was TERRIBLE, AWFUL and UNWELCOMING! I will return to this location but I will not be treated this way again. I like Cheesecake Factory but management will not treat customers, especially Black customers this way ever again! Trust and believe that. Derrick D. Blassingame, for the People!", "rating": 1, "date": "8/30/2020"}, {"text": "Our server, Jordan H, was excellent! He was very friendly, professional, and very considerate. We&amp;#39;ve been to this restaurant so many times but he left us very deep impression. His service made our dinner very enjoyable. The food were great and the sizes were still large. The only reason I didn&amp;#39;t leave 5 star was the slippery floor!!!!! Be extremely cautious at the corner of each aisle because my friend almost fell there. And we heard the plates fell on the floor twice during our 1.5-hour stay. For the customers and the employees safety, the management may want to solve the slippery floor problem.", "rating": 4, "date": "1/6/2019"}, {"text": "One of the worst Cheesecake Factories I&amp;#39;ve been to. It was a very slow weekday night and the service was still awful. 3/3 times I&amp;#39;ve been here, the service has always been poor. We always have to ask for refills and ask for items from another server. <br&gt;Our server was no where to be found. Our food was good, just like any other Cheesecake, but the accommodations we asked for was not met. I assume the server just forgot to ring in &amp;#34;sauce on the side&amp;#34; or &amp;#34;no peas&amp;#34;. For the price we pay, we expect so much more. Giving 2 stars for how great their cheesecake is, the bakery always does a great job at plating them. I have had plenty of friends work at different Cheesecake Factories and I know their training is intense and very thorough. I don&amp;#39;t know what happened with this location. It just wasn&amp;#39;t great and after reading the replies from the managers, they don&amp;#39;t really do anything about it. It&amp;#39;s usually just &amp;#34;Sorry, hope you come back. Don&amp;#39;t forget to come during our discount days or Happy Hours&amp;#34;. Like no, do something about the problem, saying sorry doesn&amp;#39;t bring customers back.", "rating": 2, "date": "1/25/2019"}, {"text": "I&amp;#39;m generally not crazy about chain places, but I&amp;#39;ve been to this location several times because if I give my kid the opportunity to pick where to eat, 9/10 we&amp;#39;re eating at the Cheesecake Factory. Usually everything is fine. Overpriced, nothing super amazing but it&amp;#39;s perfectly fine. <br&gt;<br&gt;Our last visit was pretty nightmarish though. Slow, slow service. Less than enthusiastic server. My daughter had to ask for bread twice, we had to ask for refills. The appetizer came out way overcooked (Tex Mex eggrolls). The kids pizzas came out overcooked too. <br&gt;<br&gt;I ordered the four cheese pasta, light sauce. I was given fettuccine alfredo. It took several minutes to get my servers attention as she dropped the plates and left before I could say anything. I told her I had ordered the four cheese pasta, and she said I had four cheese pasta. I asked about the marinara and ricotta it usually comes with and mentioned that it was usually penne. She said they must have mixed it up and said she&amp;#39;d fix it. She left, and just came back with a bowl of ricotta. <br&gt;<br&gt;Okay, fine, I like fettuccine alfredo. The kids start acting up toward the end of the meal so I hurry up and pay and leave. When I get home, I realize I&amp;#39;ve been charged for four cheese pasta with chicken. <br&gt;<br&gt;I&amp;#39;ve emailed them twice about this and no one has ever responded so I guess I&amp;#39;m going to air my grievances on yelp.", "rating": 1, "date": "10/29/2018"}, {"text": "I had no idea this was here.  Since it was Sweetie&amp;#39;s birthday, she picked where we would eat (who are we kidding, she always picks.)  She knew it was here, and we were nearby, so of course we went.  It&amp;#39;s one of her favorites.  I would pick other places first, but I never object to TCF because I can always find something to eat and it&amp;#39;s always at least good. <br&gt;<br&gt;Huge menu, some pretty interesting items.  Kind of expensive.  Okay, very expensive for the portion size.  But, hey, sometimes you have to splurge.  Service was great, the booth was comfy, and Baby K had a menu to choose from.  She got mac and cheese, and a side of strawberries, and loved them.  I tried some mac and it was pretty darn good.  Sweetie got a Cobb salad and the stuffed mushrooms, and liked both.  I had the crab artichoke app, with a Dynamite Shrimp small plate.<br&gt;<br&gt;The dip was excellent.  Lots of crab, lots of cheese, lots of artichoke.  Served with crispy bread slices.  The shrimp were... okay.  Not bad, but not at all spicy, and a very small portion.  But, hey, small plates.<br&gt;<br&gt;We got cheesecake to go, because birthday, and Baby K wanted &amp;#34;pink cake.&amp;#34;  That turned out to be cherry cheesecake.  Haven&amp;#39;t tasted that yet, but hopefully she lets me have some.  They are of course specialists, and the cheesecake is always good, and huge portions.<br&gt;<br&gt;So.  A fun birthday dinner.  Not a place to go often, at those prices.  Something for everyone.  Good service.  We&amp;#39;ll be back, I&amp;#39;m sure.", "rating": 4, "date": "10/25/2018"}, {"text": "One of my favorite places to eat with friends or family. Their menu is extensive and there is something to find for everyone. Plus, when you are craving cheesecake there is not many other options that compare. <br&gt;<br&gt;A favorite to many, there is usually some sort of wait time. Don&amp;#39;t go expecting to be seated right away and if you do consider it a bonus. The staff is friendly. Cheesecake staff seem to thrive in the busy environment. Every time I have gone the waitstaff has been attentive and always has a smile for their patrons. <br&gt;<br&gt;I love going here to catch up with those I don&amp;#39;t see often. It is a nice meeting place.", "rating": 5, "date": "9/13/2018"}, {"text": "Great food and service was out of this world! The fresh strawberry shortcake for desert is the perfect way to top of your meal.", "rating": 5, "date": "9/8/2020"}, {"text": "Sat at the bar with Joseph and had a great experience! Very attentive, good conversation without being overbearing. The pork chop was excellent as well! Will be back!", "rating": 5, "date": "12/5/2019"}, {"text": "It&amp;#39;s a Cheesecake Factory...pretty standard. But what I found disappointing was that I paid $17.00 for a &amp;#34;Chicken Avocado Salad&amp;#34; that probably had 3 ounces of chicken on it and MAYBE 1/4 of an avocado. The rest of the bowl was all greens and carrots. Now I DID tell them to hold the tortilla strips (I&amp;#39;m low carb), but this salad was so sparse on chicken and avocado that it was ridiculous. It probably cost them less than $3.00 to make it-WAY overpriced. But again, it&amp;#39;s a Cheesecake Factory. I should have known better. I will NOT go back if I want a salad. And since I don&amp;#39;t eat desserts, there isn&amp;#39;t really ay draw for me to go back ever.<br&gt;<br&gt;The salad tasted fine. It was just too sparse.", "rating": 2, "date": "10/24/2019"}, {"text": "Unfortunately I got serious food poisoning from this location this week. I ordered the &amp;#34;skinnylicious chopped salad&amp;#34; but substituted ranch dressing. It tasted fine, but within 6 hours of my meal, I was vomiting, etc. I felt like I was dying. I do not recommend :(", "rating": 1, "date": "12/11/2019"}, {"text": "Wait time - 20+ minutes<br&gt;Service - 3 stars. Took a while just to get the water.<br&gt;Blue moon out of stock. Bread was too hard to bite.<br&gt;Appetizers- Korean Cauliflower was too raw to eat that they hv to take it back.<br&gt;Egg rolls were kind of soggy, no flavor.<br&gt;Margarita Pizza- worst pizza ever had. Even papa john makes better pizza than this. Crest was raw. U can actually see the rawness. Pizza sauce was falling all over. Totally spoiler for my wife&amp;#39;s birthday dinner. Never going to come here again.<br&gt;I had better experiences in other cities but this was a disaster.", "rating": 2, "date": "8/21/2018"}, {"text": "Everything was just great!! The food was fabulous as always! Our server was very attentive but not annoying either. Perfect! Very similar decor as other Cheesecake Factory&amp;#39;s close to my house. Their menu is always insane!! I love having different choices but really! I had the Salted Caramel Cheesecake- it was absolutely divine!!", "rating": 5, "date": "10/14/2018"}, {"text": "Stopped by after work and placed a carry out order. It was 5:30, I waited 25 minutes for just an order of the chicken taquitos &amp;amp; 2 slices of cheesecake. Once I got home &amp;amp; opened the bag, I realized I should have checked my order before leaving. The taquitos appetizer was so unappealing, it looked half eaten!! It was so sloppy (and trust me I am one to avoid tipping the bag)! Why would 4 little portions be placed in such a large container. Threw it out!", "rating": 1, "date": "5/14/2018"}, {"text": "I ordered from this location after a couple of months and I am very unsatisfied with the service they provided. The Caesar&amp;#39;s salad was missing the croutons. There was no bread with the order and when I inquired about the bread, they said they no longer give bread with the orders. I&amp;#39;m very disappointed.", "rating": 2, "date": "7/17/2020"}, {"text": "Amy was our server. Did okay, nothing special. We ordered the Renee&amp;#39;s Special. I had the chicken salad, Lynnette had the turkey. Both of us had the salad and baked potato soup. Everything was great. Love the starter bread the best. Also ordered desert for later. Who doesn&amp;#39;t get desert when coming here. Yummy!!", "rating": 4, "date": "6/9/2018"}, {"text": "I am a huge fan of the Cheesecake Factory but I know it&amp;#39;s never going to be much more than a fancy chain restaurant.<br&gt;<br&gt;The portions are huge (and very expensive), so I recommend either eating an app and cheesecake or an entree and getting the cheesecake to go.<br&gt;<br&gt;This experience was ok. We didn&amp;#39;t wait for more than 30 minutes, our waitress, Marcella was very friendly and very attentive to the details of our orders. When the food arrived, they tried to place it at the table next to us (the couple was very confused). The same thing happened to us after we paid and the table next to us received their food (guess the runners aren&amp;#39;t very attentive to table number?)<br&gt;<br&gt;There are so many cheesecake options, I&amp;#39;ll always be back for more.", "rating": 4, "date": "7/16/2018"}, {"text": "LOVE THE FOOD HERE. Always outstanding dishes with good service. Our food was slow coming out (watched my fiancée eat a delicious Belgian Waffle in front of my face whilst waiting for my meal). But it&amp;#39;s the holidays and IT&amp;#39;S BUSY!! Definitely coming back", "rating": 3, "date": "12/22/2019"}, {"text": "For years The Cheesecake Factory has been a favorite of ours whether just a night out or on vacation. We always knew we would get good food, whatever we chose on the menu. I&amp;#39;m sad to see they seem to be on a downhill slide. Inconsistent in many ways. Last night, had it been my first visit would have certainly made me think never again. <br&gt;<br&gt;I ordered an old favorite the Factory Burrito. It came out after obviously sitting way to long. It was semi warm at best. The side of black beans had so much smoke flavoring they were inedible. The guacamole was brown, past it&amp;#39;s prime. I ate half the burrito and had the server box the rest. As I sit here now eating the reheated half, I cut through it to discover it is literally nothing but white rice, a few corn kernels and a tablespoon of chicken. <br&gt;<br&gt;They seem to be going the way of so many chains- cutting corners to make profit. I guess the killing they&amp;#39;re making on the cheesecake  just isn&amp;#39;t enough. Won&amp;#39;t be going back, and it&amp;#39;s not just this location.", "rating": 2, "date": "11/20/2019"}, {"text": "Can&amp;#39;t ever go wrong with this place because the menu is so massive. Be prepared for a wait time on weekend nights. Favorite appetizers are: avocado egg rolls, egg roll sampler (best way to try four different types), and favorite dishes are: Louisiana chicken pasta (love the flavor), chicken madeira, and Jamaican black peppered shrimp (I usually get the combo with shrimp and chicken). The cheesecake selection is massive, so far my favorites have been: chocolate mousse, tiramisu, and salted caramel.", "rating": 5, "date": "3/24/2019"}, {"text": "Went here today for lunch. Food and service were both great. Our waiter, Cayson, was on top of everything, checking in on us frequently, refilling drinks and very friendly. My only criticisms would be that the tops of the green beans still had the stems on them and the waiting area was very crowded. With people coming and going, waitresses going back and forth trying to get cheesecake for guests and people trying to get to the restroom it was a mess. They have that long hallway of an entry, which I feel would cut down on some crowdedness by adding some benches for people to sit while waiting.", "rating": 4, "date": "3/24/2019"}, {"text": "Meh. My entree was under seasoned and there were several pieces of fat in the chicken. I seriously had to spit food discretely into my napkin while at lunch with several coworkers. Gross. The chicken lettuce wraps were amazing as an appetizer, which is why I am giving 3 starts instead of 2. No complaints about my sever at all. Friendly and kept the water coming. $20 for a pile of rice and some chicken should mean that I don&amp;#39;t have to spit any of it out.", "rating": 3, "date": "12/18/2018"}, {"text": "This was my first time going to the cheesecake factory and I wasn&amp;#39;t very impressed. The portion sizes are ridiculous. That&amp;#39;s why it&amp;#39;s so expensive. I don&amp;#39;t get it. I mean who eats that much in one sitting? I got spaghetti and meatballs. The sauce was super watery and flavorless on the pasta. Idk if they put a different sauce on the meatballs or what because that sauce was thick and pretty good there. Maybe I got two different batches? Not sure. The spaghetti was cold  except for underneath the meatballs so I have a feeling my food was sitting for awhile before it was served. It took an hour to get our food so don&amp;#39;t go if you want a quick dinner. My BF got a stuffed cheese burger which was really good but the fries didn&amp;#39;t have any seasoning at all... not even salt. I will say that the strawberry cheesecake was super good. I&amp;#39;ll go back for that cheesecake alone.", "rating": 2, "date": "12/23/2018"}, {"text": "I know they say eat local. I did for my daughter&amp;#39;s 12th birthday and had terrible experience at the original pancake house in upper arlington close to where I live. So i decided to make it up to her a day later (still her birthday weekend) so I drove all the way to Polaris Cheesecake Factory because I knew from years ago they do a little birthday song and they have amazing cheesecake. <br&gt;<br&gt;Our server Jordan H was very attentive and provided awesome service. Him and a group of theirs sang for my daughter and we were all cheerful and happy. Food was great and everything just made up for the humiliating dining experienced we had a day earlier. <br&gt;<br&gt;I know people say chain restaurants can be boring but this one isn&amp;#39;t. Also I know that CF as a publicly traded corporation would make sure they have the best hired staff and management to rectify situations should a problem during your dining visit occur. <br&gt;<br&gt;Will definitely be back again!", "rating": 5, "date": "5/14/2018"}, {"text": "Birthday date night with my wife. We arrived Friday night about 6:50p and were seated at 7:35. This place was packed and super busy, but the service was top notch, and the staff were very attentive. It&amp;#39;s somewhat dark which makes it a bit hard to see the menu, and the menu is 19 pages long! That&amp;#39;s a bit overwhelming, however there are only about 4 pages that are specific for food and the rest is appetizers, desserts, and other things. Once we figured out the 2 pages that interested us we decided quickly on what to eat. I chose the Chicken Madeira which according to the menu was sauteed chicken breast topped with asparagus and melted mozzarella cheese, covered with fresh mushroom madeira sauce and a side of mashed potatoes.<br&gt; <br&gt;This meal was very tasty and the portion size was rather large. I was able to take home half of my meal and have it for lunch the next day.<br&gt; <br&gt;We shared the Adam&amp;#39;s Peanut Butter Cup Fudge Ripple (Cheesecake with Caramel, peanut butter, Butterfinger and Reese&amp;#39;s peanut butter cups).  What a wonderful piece of heaven this cheesecake was.<br&gt; <br&gt;The food is very good and the portion sizes are very large, however the price for the meals and the cheesecake are also high.  I would like to see a place like this reduce the size of their meals, which would allow the price to come down as well.<br&gt; <br&gt;We had a wonderful visit and enjoyed our date night.", "rating": 5, "date": "2/19/2016"}, {"text": "My favorite book? The Cheesecake Factory menu.  <br&gt;<br&gt;When you&amp;#39;re with your friends and your conversation transitions into the inevitable &amp;#34;where do you want to go?&amp;#34;, &amp;#34;I don&amp;#39;t know, where do you want to go?&amp;#34;-- this is the place you go.  <br&gt;<br&gt;There isn&amp;#39;t anything I find particularly special about their food (with the exception of their cheesecakes), other than the fact that there is literally something for everyone, and you&amp;#39;ll never hate what you order.  It&amp;#39;s incredibly consistent and you&amp;#39;ll never leave hungry.  Like, ever.  The only thing you&amp;#39;ll hate is deciding what to order because there are SO many options.  <br&gt;<br&gt;Also, portions.. WHO EATS THIS MUCH FOOD??  Each entree is large enough to feed a small village and then some.  Now, their cheesecake is above par, although I don&amp;#39;t recall actually ever eating cheesecake at the Cheesecake Factory, because there is simply no room left after dinner.  But I&amp;#39;m resourceful, so I always order it to goooo! And enjoy it as a midnight snack.<br&gt;<br&gt;Do make sure you eat the bread.  Always so warm and SO delicious.  <br&gt;<br&gt;Favorite apps: <br&gt;1. avocado rolls- if you haven&amp;#39;t tried them yet, you&amp;#39;re missing out. <br&gt;2. Calamari- perfectly crispy and so very tasty.<br&gt;3. Warm crab and Artichoke dip- I could eat this all day, every day.  <br&gt;<br&gt;As for the entrees, I mean, I&amp;#39;ve never gotten anything I haven&amp;#39;t liked, and as far as I&amp;#39;m concerned  neither will you!  My go-to is definitely the chicken Alfredo or the Thai salmon, both good.  <br&gt;<br&gt;If you&amp;#39;re going on a Friday or Saturday night, make sure you call ahead and make a reservation. It tends to get quite crowded.  Give their Nutella cheesecake a try. It&amp;#39;s pretty spectacular!!", "rating": 4, "date": "8/3/2017"}, {"text": "All around average. Usually go to Easton. Main dishes were great, got pineapple chicken and my man got the steak...appetizer nacho was not that good wouldn&amp;#39;t recommend also Mac n cheese is sub par. A little under whelmed on this visit not gonna lie.", "rating": 3, "date": "1/13/2020"}, {"text": "It&amp;#39;s great and the same and expensive and exactly what you remember every time you go .  The menu is massive the Cheesecake is delicious but $7-$8 a slice is ridiculous in my opinion.  The pasta and shrimp are good and the portions are big.  Never feel cheated and the service is always great .  Once a year is enough for me but if you&amp;#39;ve never been it&amp;#39;s worth it.", "rating": 4, "date": "1/5/2019"}, {"text": "I don&amp;#39;t know what happened but the food used to be better and the portions bigger. Used to like this restaurant by last couple times I was disappointed. Service was terrible. Ordered two appetizers and two entrees and waiter brings entrees and I ask about appetizers and they forgot to put in the order. Manager apologized but when I go out I just want people to do their job", "rating": 3, "date": "9/6/2019"}, {"text": "Everytime we want to eat here it is too full. THERE IS ALWAYS A WAIT. Haven`t got a chance to sit down inside for a year. Couldn&amp;#39;t even get in around my birthday. But maybe that means the food and service is good. I&amp;#39;v only ate here twice when I got lucky when it wasn&amp;#39;t crowded. However, when it&amp;#39;s too full I just stick with the cheesecake since it takes me an hour to drive over here. I hardly ever get out but maybe I will get a chance this year to dine in. With the virus and everything going on I`m hoping that more people will quit filling up restaurants and stay at home saving money. I`m trying to say this nicely and I hope I get my chance this year but those of you that are so dependent on eating out please please at stay home!", "rating": 3, "date": "3/22/2020"}, {"text": "First time coming to a Cheesecake Factory in about 10 years. Forgot how massive the menu is and how big the portions are. Same as any other Cheesecake Factory I&amp;#39;m sure but just felt the need to point out the great service we received. The service was phenomenal on a busy day at the mall, the bartender Shontaye was covering our section and even though they were down a team member she busted her tail and did a great job.", "rating": 5, "date": "11/30/2018"}, {"text": "Don&amp;#39;t order from Door Dash because the Cheese Cake Factory will not address the issue. You have to be there. Even if you can take a pic of clearly a bone in your pork.", "rating": 1, "date": "3/1/2019"}, {"text": "Way over priced for just okay/maybe a bit on the rich side cheese cake.  I think this chains head has swollen and it&amp;#39;s quality has shrunk and the prices have grown with its head. Unless I&amp;#39;m out voted when picking a place to eat, I won&amp;#39;t spend my money here. Much better food and cheese cake at much more reasonably priced restaurants.", "rating": 2, "date": "8/10/2019"}, {"text": "There are so many options it&amp;#39;s difficult to know what to eat. Everything is flavorful and you always come home with a to go box.  The specialty cheesecakes are amazing though the simple cheesecake is just alright.  The service is good and quick.  Though it seems they don&amp;#39;t really go out of their way to make your visit exceptional.", "rating": 3, "date": "9/16/2018"}, {"text": "Okay it&amp;#39;s a chain so my expectations aren&amp;#39;t really high but it&amp;#39;s usually consistently good. We were really hungry so we ordered two appetizers &amp;amp; our entrees. The appetizers took a long time to get to us. Then of course the entrees came 2 minutes later which left us no room on our table to even set our drinks &amp;amp; a choice of whether to eat our appetizers &amp;amp; let our entrees get cold or skip the appetizers. We expressed our feelings about it to a manager &amp;amp; he offered to comp an appetizer. That wasn&amp;#39;t satisfactory since both were going to waste. He didn&amp;#39;t seem to care. Our waitress with the Amy Winehouse tattoo was blasé about it, &amp;#34;not my fault.&amp;#34;  Ended up just sending one entree back. On top of it, my daughter&amp;#39;s pasta Alfredo was flavorless. I would go back to Cheesecake Factory but not this location.", "rating": 2, "date": "6/10/2018"}, {"text": "It&amp;#39;s already been a hectic day, you would like to go to a nice restaurant but can&amp;#39;t because your family took forever getting ready and everything of quality is closed, you go to cheesecake factory because they stay open a little later, right? WRONG! Horrible customer service/attitude at the hostess stand, horrible/lazy server, horrible wait time and HORRIBLE food. (NO steaks on the menu tonight because the stove/grill is exerting smoke throughout the restaurant and 2 apps they couldn&amp;#39;t serve because they ran out.) Never again.", "rating": 1, "date": "8/10/2019"}, {"text": "The food is very good, consistently.  However, over the past 6 months the time from order to table is sooooooo long. This is true even during off times.  Come on guys, pick up the pace.  Tired of hearing, &amp;#34;sorry about the wait.&amp;#34;", "rating": 3, "date": "5/25/2019"}, {"text": "OMG!! We are so happy with the cake and cookies in The Cheesecake Factory.  The great taste and combinations are so awesome. <br&gt;<br&gt;The cake chocolate fudge cake is so tasty I love it!!", "rating": 5, "date": "6/10/2018"}, {"text": "Fantastic.<br&gt;<br&gt;Absolutely reeks of quality, outstanding service, and value.  One of the better meals I have had in a while.  Coupled with outstanding service, this was a win.  I don&amp;#39;t often leave a five-star review, but this one was earned.<br&gt;<br&gt;The food was perfect, the atmosphere was great.  Resulting in, a wonderful evening.<br&gt;<br&gt;You will not be disappointed to dine here.", "rating": 5, "date": "8/4/2017"}, {"text": "This is a solid Cheesecake Factory.  I have been here quite a few times, and haven&amp;#39;t had any real issues.  The only actual complaint that I ever have is the wait times.  <br&gt;Other than that, I have had great meals and drinks here.  They get my order right every time.<br&gt;They can be considered on the more expensive side of things, but usually things around Polaris are.  So, use this as a celebration or special night out meal only if needed.<br&gt;<br&gt;Try the RED VELVET cheesecake!  Quite decedent.", "rating": 4, "date": "3/22/2017"}, {"text": "Curbside pickup on busy day it wonderful to pull up and have food delivered. <br&gt;Things I love to eat. Hibachi steak wonderful meal with mashed potato and asparagus. Fire roasted artichokes are seasonal great if you know how to eat artichokes. Cheesecake is always wonderful but try there chocolate cake yummy!", "rating": 4, "date": "6/28/2018"}, {"text": "This review is for this location.<br&gt;<br&gt;One can never go wrong with the Cheesecake Factory. We came here for dinner this evening (Saturday). There were 7 of us, and we knew there would be something for everyone here. We ordered the buffalo chicken blasts, tex mex egg rolls and the guacamole egg rolls as appetizers. All were yummy as usual. For dinner I had the southern fried catfish dinner. The fish was nice and juicy, and not too doughy. Strawberry lemonade was fantastic! My family ordered dessert but I didn&amp;#39;t try any as I was full from appetizers and dinner.<br&gt;<br&gt;Service was excellent... Thank you Megan!<br&gt;<br&gt;As we can here later in the evening (around 9:30 pm) there was ample parking. However, I am sure parking is scarcer during peak dinner or mall hours.", "rating": 4, "date": "9/5/2015"}, {"text": "I haven&amp;#39;t been to The Cheesecake Factory for a while. One things that I like is their menu is endless and have so much selection. Of course, I can&amp;#39;t finish the meal without ordering their cheesecake.", "rating": 3, "date": "2/1/2017"}, {"text": "Go for the cheesecake and eat dinner elsewhere. Food was mediocre. Our food arrived about 15 minutes apart so we were eating at different times. The milkshake was just milk with Oreos smashed (it was warm so the ice cream was completely melted).<br&gt;<br&gt;Overall, for the price there are many other options to get better food in Columbus. The cheesecake isn&amp;#39;t really worth the long wait.", "rating": 2, "date": "11/11/2017"}, {"text": "This was the slowest CF I have ever been in. OMGOODNESS if I had been with my spouse on a date I would have been furious because this is all you was able to do. The wait for a table Saturday night wasn&amp;#39;t bad however the wait for everything else was horrible. My fries was so salty they were disgusting. When I needed a water refill no ice was ever added and the last refill the water was pee warm. I would think it would be common sense to put ice in with an ice water. I specifically asked for a refill of ICE WATER. I had to wait forever to ask for some ice. I mean everything took forever. We got our cheesecake for to go and was told that&amp;#39;s why our wait was so long for it. We spent hours and only one of us had a meal the other had a drink and dessert. So if you plan a dinner and a movie or something kiss that goodbye or plan for dinner to take hours. I&amp;#39;m a slow eater and this was off the charts. I needed so much water cause the fries was so salty and I didn&amp;#39;t want to waste more time by having that fixed. Asked for some mayo and it was forever getting it for my sandwich then it wasn&amp;#39;t what my sandwich had but I used it. There was so much fat and gristle I had a sandwich worth of it piled up that was inedible. This was ridiculous for the price. Horrible not worth it!", "rating": 2, "date": "9/16/2019"}, {"text": "Every time I come here I don&amp;#39;t have to wait long to get seated, the service is always great and so is the food. :) :) My favorite dish here is orange chicken with rice. Love it!", "rating": 5, "date": "12/28/2018"}, {"text": "Last night, I had the worst dinner ever. An hour and 20min till the food was served. Food was cold and tasteless. Don&amp;#39;t waste your money", "rating": 1, "date": "10/21/2019"}, {"text": "We go to Cheesecake Factory ALL OVER, but for some strange reason this one consistently drops the ball. Does this one have a different kind of staff than ANY OTHER one in the World????<br&gt;All orders are slow in coming,, or  they mess it up,. Because it&amp;#39;s Cheesecake Factory and we are usually fans we keep trying, but it&amp;#39;s annoying!!<br&gt;Wish someone from Corporate would come out and shake this .<br&gt;<br&gt;WELL!!!........ The above was my former review, but I got a call from one of the managers Jordan&amp;#39;s who I was able to talk to-about the problem and they have really made an effort to improve this cheesecake factory We are in Ohio right now visiting again and we have gone there twice and it has been much better. So I&amp;#39;m raising my former  review to four stars because they deserve it<br&gt;<br&gt;Thanks again Cheesecake Factory and Jordana for being on top of what&amp;#39;s going on!!!!!", "rating": 4, "date": "3/10/2019"}, {"text": "We stopped by for coffee and cheesecake, and received what amounts to hot water/food color for coffee.  Oh yeah, I don&amp;#39;t need to be told 2-3 times that it takes 10 minutes to brew coffee.   Finally got the cheesecake which looks great. Will update once the &amp;#34;10 minute&amp;#34; coffee arrives.", "rating": 2, "date": "10/30/2018"}, {"text": "I have never been to this location before, and took my girlfriend for her first visit. The food was great. I had a combo plate with steak and shrimp, she had some avocado rolls.  We ended with some nice pieces of cheesecake. Price was what we expected. The room was nice the restaurant was nice.  Our experience was just average.  There were visible open tables, but we had to wait when we arrived.  After a 30 minute wait we landed some seats at the bar. The bartender just recited caned lines, forgot to bring a drink, and was not responsive. We asked for some decaf coffee with our deserts and that was almost unacceptable to the bartender. We are very sure he just gave us regular after waiting forever for coffee.  Our bill was wrong and the bartender couldn&amp;#39;t care less. And that was our experience, the people were meh at best, they have a packed house and were making money, not customers. The food is excellent but expensive. I&amp;#39;ll return, but won&amp;#39;t beat a path back.", "rating": 3, "date": "9/28/2019"}, {"text": "Loud music, very dim lights, very hot and stuffy. If I wanted these things I would go to a club. This is my first and last visit to this place. <a href=\"/redir?url=http%3A%2F%2FNot.to&amp;amp;s=440fb0ab2201f8431fea3c1dd464792947128660417fe7566a17160fc8a8a511\" target=\"_blank\" rel=\"nofollow\"&gt;Not.to</a&gt; mentoon I have been waiting on my food for over 30 minutes.", "rating": 1, "date": "3/22/2019"}, {"text": "I&amp;#39;ve always enjoyed the Cheesecake Factory and I was again very pleased with my cheesecake...the cafe au lait one this time. Delicious! The food was just ok (and I expect very good food from this restaurant). I will say the manager impressed me, I had originally ordered the cauliflower appetizer, and she came out to let me know the cauliflower was not up to par. She then asked if I&amp;#39;d like to try another appetizer. I appreciate the attention to detail and quality.", "rating": 4, "date": "11/9/2017"}, {"text": "Great menu. Beautiful restaurant. Great service. Do not sit in the bar. They have CNN news on. Fake and lying news. I cannot believe a restaurant  bar would have this nonsense on. How demoralizing.", "rating": 3, "date": "10/18/2018"}, {"text": "We originally had a group of 10 people and one of my friends didn&amp;#39;t attempt to place a reservation so they said there was about an hour wait for us, which was perfectly fine by us. We were celebrating my friends birthday. We found out some of our friends weren&amp;#39;t coming so we told them the update and they said it was helpful and seated us almost immediately. We had a bunch of balloons for the birthday girl and they had nothing against us bringing them in which was good. The waitress was really nice and the food was really good. I do believe the food was a little bit overpriced, at least the crab bites that we got. They were almost $9 for 5 small crab bites. They were delicious though. When they brought our desserts, they sang Happy Birthday with our friends and helped us celebrate. We also heard at least 3 other birthday celebrations going on there. A great place for celebrations, but it is expensive.", "rating": 4, "date": "3/9/2020"}, {"text": "Amazing food... we had Nate as a waiter and the service was terrible. We were forgotten about and ruined the experience of the day with my family. Will I go back? Yes, but only because it&amp;#39;s normally not the experience we have there", "rating": 1, "date": "9/1/2019"}, {"text": "sat at the bar, placed an order for pulled pork sliders...after waiting THIRTY FIVE mins (my lunch is only an hour) they came after i bothered bartender/waitress again..the fries were cold and they were missing slaw! Was told that it &amp;#39;takes time&amp;#39; to get the pulled pork right...yeah right, how long does it really take for 3 freakin&amp;#39; sliders?!", "rating": 1, "date": "8/26/2019"}, {"text": "A restaurant of this caliber , known for their good food and variety , should NEVER have such inconsistency in their meals and carry out meals especially. After good experiences carrying out with these items a week ago , last night = Almost raw avocado egg rolls. Poorly done Korean cauliflower. <br&gt;We eat there very often and may decrease that significantly now. Be careful. It can be great. Or terrible.", "rating": 2, "date": "9/2/2018"}, {"text": "Our waitress completely ignored us &amp;amp; when she would stop at our table her face would turn from a smile to a frown after she has been nice to the surrounding tables &amp;amp; she would look away while we were speaking to her. We are always respectful at any place &amp;amp; this treatment is absolutely unacceptable &amp;amp; won&amp;#39;t be tolerated; therefore, we&amp;#39;ll never step into a cheesecake unless corrective action is taken by this company.", "rating": 1, "date": "8/17/2019"}, {"text": "There were flies all over the restaurant ... about 20 that I could see from my seat. They kept trying to land in our food. If it&amp;#39;s this bad in the dining room, I wonder what the kitchen must look like....", "rating": 1, "date": "8/2/2019"}, {"text": "Come here if you want cheesecake. If you want anything that demands more service than that, this is not the place. Especially if you&amp;#39;re hungry. My friend and I started out with an order of the lettuce wraps. We saw a small short white &amp;#34;hair&amp;#34; in the dead center of the dish. Normally wouldn&amp;#39;t say anything, but it was touching the chicken and dipped in the sauce. We know this is no fault of our server. A manager comes over and apologizes and explains to us that he thinks it was a single corn silk. I am all about benefit of the doubt, but why would we have a single 1 in. cornsilk on our dish of lettuce wraps that does not involve corn? <br&gt;<br&gt;My friend orders the pork chop and subs the mashed potatoes for roasted broccoli. I ordered the carbonara pasta with red pepper flakes. Food comes out and my friend receives mashed potatoes. We kindly told the food runner that she had broccoli. He returns with steamed broccoli. Again, normally wouldn&amp;#39;t care, but our server had specifically asked if she wanted roasted or steamed. If you&amp;#39;re not going to get it right, don&amp;#39;t bother asking. Her pork chop was not served with a steak knife and I was left with a disappointingly bland pasta because I wasn&amp;#39;t given the red pepper flakes either. My friend was attempting to cut her meat with a butter knife while I was tossing my pasta. The server has yet to check on us or our food. People who we should not have had to disturb: the food runner for our broccoli, the hostess for pepper flakes/ steak knife (who asked another server for assistance), another server passing by for the correct broccoli, and another server for the missing sauce cups. That&amp;#39;s FIVE people we had to ask because of the absence of our server. <br&gt;<br&gt;The second round of lettuce wraps is out--this time with no sauce. I found this ironic because when our first round of lettuce wraps with a single one inch corn silk came out, our server scoffed at it and noted that the plating was wrong. How can you notice that, but not notice that our second round had zero out of three sauces on it? Overall we had poor service. We are usually both understanding as we both work in high volume bars as well. We were disappointed in the poor service, the excuses, and were overall surprised that we had to pay for the lettuce wraps (missing all the sauces) that didn&amp;#39;t come out until after our meal. I hate resorting to asking other servers to get things for us because we were not their table, but our server was inattentive and made the overall experience dreadful. I&amp;#39;m disappointed that I paid money to once again have a terrible Cheesecake Factory experience.", "rating": 1, "date": "6/21/2018"}, {"text": "This experience was a roller coaster experience for us. It started with an extensively long wait (like 25 minutes longer than we were quoted), and while I know some things are beyond their control, they needed to consider a plan B when the large party tables were full and the people at them were not leaving as quickly as they anticipated. We were a group of six, they could have put two of the little tables together. And while I appreciate all the options, the menu is way too long, and it is too difficult to choose... But I guess when you go to the Cheesecake Factory you aren&amp;#39;t really going for the food anyway. By the time the dessert showed up, we were happy, but it took a long time to get there.", "rating": 3, "date": "6/9/2018"}, {"text": "I have actually never been to Cheesecake Factory in all of my 27 years. We got a gift card from coworkers for our recent marriage &amp;amp; decided to use it for date night. We were sat right away. Holy moly was it cold in there! Our waiter, Jeremy C, was great the entire time. No complaints there. We had two drinks &amp;amp; an appetizer right away. Unfortunately the alcoholic beverages don&amp;#39;t have a price beside them, so we were ordering blind. When we got our check, they were $12 a piece for a mixed drink! They were good, but not $12 good. So we had two drinks, one appetizer, two entrees, and 2 pieces of cheesecake for the road. After tax and tip, we spent $120 for the two of us. The food was EXTREMELY bland, nothing special that&amp;#39;s for sure. All in all, not worth a $120 meal, definitely overpriced and under spiced. Glad we had a gift card, won&amp;#39;t be returning.", "rating": 2, "date": "6/2/2018"}, {"text": "Everything here was great except for our initial encounter, which is why I can&amp;#39;t give it more than three stars. The good - Our waitress was good. She was efficient. It was late and my kids were hungry. She could tell and got everything out ASAP. The food was good.  Cheesecake was obviously good. <br&gt;<br&gt;The bad - As much as we liked our waitress, she couldn&amp;#39;t get our wine bottle open. No big deal. My husband handled it, but then she just left the bottle on the table and didn&amp;#39;t pour it. Again, no big deal, but not what you are really expecting. My son has a shellfish allergy. I asked right off what our options were. Waitress informed us that everything is made to order and his meal would be made on a separate grill, cooks would switch gloves and to order whatever we would like. Awesome! That was great. But, I have a sneaking suspicion that didn&amp;#39;t actually happen. I&amp;#39;m not sure, but I just didn&amp;#39;t get that feeling. Regardless, his meal was great so I can&amp;#39;t comment more on that. <br&gt;<br&gt;The worst part though was the banter between the hostesses. We had about a 20 minute wait to be seated. Now I get that this is in Ohio and they may not be used to the southern accent. But as we stood next to the hostess station and waited, a woman with a very southern accent came up and spoke to the hostess. The hostess immediately turned around and made fun of that woman with the other hostess. Very unprofessional. That really shouldn&amp;#39;t happen. This lady wasn&amp;#39;t rude or demanding. And she got made fun of right off the bat. And loud enough that I could hear it. Would it make me never go here again? No. But, it just didn&amp;#39;t sit well. The staff should be better trained.", "rating": 3, "date": "11/7/2017"}, {"text": "Ugh.  I stopped reading the menu on page 10.  The good news, our waiter was well trained and he knew the pages cold.  Really do you need such a huge menu.  Ugh.<br&gt;<br&gt;It was a Saturday lunch and the wait approached an hour.  Where do they come from.<br&gt;<br&gt;I opted for a garden salad.  It was huge and delicious.  Good choice.<br&gt;<br&gt;Of course cheesecake, regular NY style.  Delicious.<br&gt;<br&gt;I&amp;#39;m not sure what i think of CF.  What I had was 4*.  Cheesecake 4*.  Menu 1*.  My server 4*.", "rating": 3, "date": "3/12/2015"}, {"text": "Terrible service. I got the fish tacos. Definite thumbs down. VERY skimpy with the toppings. Definitely nothing like the description in the menu. And the ranch dressing on the salsas had a weird taste. The cheesecake however is yummy!!", "rating": 2, "date": "8/4/2018"}, {"text": "Meh. Wasn&amp;#39;t impressed. Service was great. The food was so-so. The salad was overdressed, absolutely drenched. Fries were cold. I dont think we will be back unless it&amp;#39;s just for coffee and cheesecake...", "rating": 3, "date": "9/16/2018"}, {"text": "This is not the best Cheesecake Factory I&amp;#39;ve visited. Every time I go, they seem to be out of something. This time they were out of the brown bread and ice cream. On top of that the women&amp;#39;s restroom was disgusting...and out of toilet paper.<br&gt;<br&gt;Do not recommend this location at all.", "rating": 2, "date": "7/15/2017"}, {"text": "We had a bad experience here. It took forever to get our food. One meal was brought out first and it just sat there while we waited for the other five. Two were completely mixed up. With so many other options available and the possibility of a bad review like this one, why would you half ass your service?  We won&amp;#39;t be back.", "rating": 2, "date": "9/1/2018"}, {"text": "Absolutely love the Cheesecake Factory. Wonderful service, wonderful food. I will always recommend this place. Always spotless, kid friendly, and the workers are always phenomenal.", "rating": 5, "date": "5/2/2018"}, {"text": "A very nice restaurant uniforms are nice u come down a long hallway leading to the hostess stand if the line is back at the front door it&amp;#39;s busy. Walking down the long hallway is nice stone is all around u. Marble or granite  or looks like it.on ur right the slices of heaven. In front of u the dining room low lighting is good they have it.  They have nine types of cheese cake maybe more drinks are good food is a lot your going to take some home. I know they aren&amp;#39;t the healthiest of places to eat some times u might over indulge&amp;#34; eat this not that&amp;#34; the books don&amp;#39;t like them at all so maybe read some of he menu before<br&gt;Going out but other then that a great place to eat and sample some slices of heaven!", "rating": 4, "date": "7/2/2015"}, {"text": "I had a great dinner with my friends! Went in around 5:00pm and didn&amp;#39;t have to wait. Service wasn&amp;#39;t the fastest but our waiter was very sweet and made sure we had bread and drinks refilled. The dinners and desserts were delicious but a little over priced as expected, but everything was pretty good and I can&amp;#39;t complain! Always worth the drive from Toledo.", "rating": 5, "date": "7/2/2018"}, {"text": "Usually I love this place but I just spent 30 dollars on a steak that had to be sent back 3 times. Can&amp;#39;t believe I didn&amp;#39;t get my meal for free. Not to happy. <br&gt;P.s. I&amp;#39;m usually not one to complain", "rating": 2, "date": "12/23/2016"}, {"text": "I honestly haven&amp;#39;t been to Cheesecake Factory for over 5 years. If you&amp;#39;ve been to Cheesecake Factory, then you&amp;#39;ve been to them all. The ambience is same everywhere. It&amp;#39;s nice and casual with food for everyone. It&amp;#39;s a great place to sit down with your friends to eat after shopping. That&amp;#39;s probably why every Cheesecake Factory is always packed with long lines, so always prepare to wait! I think they&amp;#39;ve expanded their menu since 5 years ago. It&amp;#39;s now 20 pages long with more choices!", "rating": 4, "date": "11/11/2017"}, {"text": "We come here monthly. By far the best nachos in Columbus. When you order a burger medium rare, that&amp;#39;s how it comes. Love this place!!", "rating": 5, "date": "12/26/2016"}, {"text": "This was my very first time eating at Cheesecake Factory after it being on my bucket list for years! I&amp;#39;m disappointed to say that it wasn&amp;#39;t all that great. My main meal (Shrimp Angel Pasta with Tomato and Basil Sauce) was so bland that I could hardly taste it. I had to put a lot of salt and pepper on it and even ask the waiter to bring more sauce. The Greek salad was also bland tasting, like hardly any dressing was used. The best part was the Chocolate Mousse cheesecake! It was delicious! The service was alright. Contemplating whether to make a trip out here again.", "rating": 3, "date": "5/26/2018"}, {"text": "This place is WAY overrated. I was hardly impressed. They should call this place The Sugar Factory<br&gt;<br&gt;I had dinner at a Japanese restaurant in the Polaris mall food court where I got a huge portion of food at a great price, I decided to come here for dessert. All I could taste in the two different cheesecakes I ordered were just huge amounts of sugar. The pieces of cheesecake I ordered were caramel pecan and some kind of truffle, they&amp;#39;re supposed to be different from each other but tasted nearly exactly the same and each layer I bit into had hardly any difference in taste besides just tasting like different textures of sugar. I could hear my kidneys and liver shrieking in pain because of the sugar overload from each bite.<br&gt;<br&gt;This stuff is EXPENSIVE too! Totally not worth the money. they charge a fortune for just one piece of cheesecake, if it tasted amazing I wouldn&amp;#39;t mind that, when I go to a grocery store though and buy a mass-produced piece of cheesecake for 1/5 of the cost it should NOT taste better than the one that costs a fortune that i ordered from this restaurant. One of the bakery staff had an attitude with me when I tried ordering too. I was standing in front of the bakery where there were two or three people working on the other side and I waited for someone to ask me if I needed help, I wasn&amp;#39;t sure if this where I was supposed to order. No one asks me if I need anything after standing for a good moment. It seems like they assume people go out of their way to stare and admire their cheesecake in the bakery display like it&amp;#39;s the Mona Lisa or something. I ask one of the women behind the counter if I can order cheesecake to go from the bakery counter and with an attitude she says &amp;#34;she needs to help you&amp;#34;. <br&gt;<br&gt;If you want a nice sit-down restaurant experience there are TONS of other options near by and if you want a great value for your money the food court in the mall has good options too.", "rating": 1, "date": "11/5/2017"}, {"text": "Our first trip tonight, we&amp;#39;re excited to try it..  Will be our last.  Start out with being told a 40min to 1 hr wait.  That alone isn&amp;#39;t to bad, but they have little room to stand and wait, so we head over to Barnes and noble to kill some time.  20 min later, we are back, standing in the long hallway waiting for our buzzer.  40 minutes of that sardine can joy, an hour since we checked in originally, I check in again.  Lady at the front counter had attitude, said we must have been paged while out of the building.  We took our reprimanding, decided to wait for that next available table.  30 more minutes, this time standing right by the counter, the attitude lady realizes we had been paged again, but it never went off.  This is where it went south.  Only a lip service apology, and we still had to wait, because others who had a similar issue were all trying to get seated at the same time.  <br&gt;<br&gt;Finally get a table, the booth for two is cramped.  Waitress asks how things are going, but shrugs off our complaint.  Decided to avoid us since we were grumpy, our service was subpar, even though we cheered ourselves up and became pleasant to be around.<br&gt;<br&gt;Then the food came out, and it was very average at best.  The crusted parmesan chicken was way to salty, the egg roll appetizer was pretty good, the eggplant Parmesan was very plain and average.  Took nearly 45 minutes to get dinner, and with the slow service we skipped desert .  After all, just going out to dinner on date night took up almost 4 hours.  But at least we had those 20 minutes at Barnes and noble.", "rating": 1, "date": "2/13/2016"}, {"text": "Okay, you know what you&amp;#39;re getting at Cheesecake Factory, right?  It&amp;#39;s a chain.  I have no problem with mistakes in business - we all have &amp;#39;em and the measure of our character is how we respond to them.  <br&gt;<br&gt;So I ordered the Buffalo Burger on Oct 5th for a late lunch while my wife ordered a pizza and salad combo.  The buffalo burger has onion rings on it.  The food was delivered, I took my first bite and couldn&amp;#39;t sink my teeth in - something hard was blocking it.  So I pulled out a long strip of hardened onion skin from one of the rings and set that aside.  Things happen I thought - it&amp;#39;s just an onion.  Then again and again as each of the four onion rings had a strip of impenetrable onion skin that hadn&amp;#39;t been peeled off until I had a small pile of them (see picture).<br&gt;<br&gt;The waiter failed to return to check on me until I was three-fourths done with the burger.  At which time I *finally* got to ask for the ketchup for the fries and pointed out there was a problem with the food.  I said I didn&amp;#39;t want to send it back (it was far too late and the rest was okay), but that he really should alert the kitchen that they&amp;#39;d made a mistake.  I even picked up an onion skin strip and demonstrated that you could try to pull it apart but it was very strong and unchewable. <br&gt;<br&gt;This should have set off alarm bells, but he said something like, &amp;#34;oh, okay&amp;#34; and left.  I would&amp;#39;ve expected a manager to drop by within minutes but that didn&amp;#39;t happen, meaning he didn&amp;#39;t tell anyone.  Which means that serving bad food wasn&amp;#39;t taken seriously.  To be clear, I did not want any sort of comp - no free food or desserts.  I only wanted the business to know about the mistake, take quality seriously and take steps to correct it.  But that did not happen, so we&amp;#39;re done with Cheesecake Factory.  I&amp;#39;m going to upload a pic - I think Yelp hooks that to my review.", "rating": 2, "date": "10/6/2013"}, {"text": "This location has its cons and pros. <br&gt;<br&gt;On the bright side their bread is amazing, there are also couple good things on the menu. Avocado toast is my fav for now.<br&gt;Service is also pretty good<br&gt;<br&gt;For some reason in summer it is ABSOLUTELY FREEZING inside, when it&amp;#39;s hot and you wear tshirt and shorts you will most likely freeze in the first 10 minutes there. <br&gt;In winter it is super cold, especially the waiting area. I&amp;#39;m not sure if it&amp;#39;s just the building designed that way or they are trying to make customers feel uncomfortable so they can leave sooner and there would be more rotation. <br&gt;I don&amp;#39;t like being cold or waiting over an hour for a table and than another 40 minutes for my food to come out.<br&gt;<br&gt;Most possibly be back as the food is decent and desserts are good but it&amp;#39;s not my favorite spot", "rating": 3, "date": "6/19/2016"}, {"text": "Seeing as though Cheesecake Factory is historically like a fine tuned machine, this was not the case AT ALL for this location. Our party arrived at 5pm on Christmas Eve to many empty tables yet we were not seated until 5:50. After waiting with three children, we were finally seated. Drink orders were placed and did not arrive for 15 minutes. In between drinks being ordered and arriving we ordered dinner. We would like to believe that one of the reasons for the slowdown that was about to occur was due to our party of 12 + 3 kids being seated in the bar area (again, on Christmas Eve after waiting 55 mins). But alas, it&amp;#39;s the Cheesecake Factory so we had faith. This faith quickly diminished as we waited over 50 minutes for food that arrived cold, missing ingredients (my lemon garlic shrimp had no sauce and the noodles were hard and lukewarm) and all at different times. The kids who ordered butter noodles had their meals arrive 35 minutes prior to the adult meals. They were finished and started squirming while the rest of us waited much longer. Even after the first round of meals were delivered and eaten (with mine being sent back) three others still had not gotten their food. Once those meals arrived, they were cold. By that time, half of our party had to get up and leave. We had been there an hour and a half and nothing was going right. We still wait another 20 minutes for our check in to settle up. The restaurant had given us a discount, but only for the food that come out cold or that nobody had eaten due to having to leave. We wound up on Christmas Eve with three other in our party never have eaten dinner. Frustrating to say the least. We won&amp;#39;t be going back. It&amp;#39;s one night later and we are across the street at Benihana. They told us that our reservation would not be seated for 45 minutes. We&amp;#39;re still waiting for food 1.5 hours later", "rating": 1, "date": "12/26/2018"}, {"text": "The bartender was really nice even while swamped with orders. If you like fruity drinks then I suggest the passion fruit mojito and typhoon punch. As for cheesecake the smores was great. My husband and I had a great time for our one year anniversary date. The place was beautiful, the atmosphere had a great vibe and I would definitely recommend to eat here.", "rating": 5, "date": "12/20/2016"}, {"text": "Met friends here for lunch. Had great service and the Chicken Parm sandwich was wonderful! Also had Chris&amp;#39;s Outragous Cheesecake! Superb!<br&gt;Great experience.", "rating": 5, "date": "3/26/2017"}, {"text": "I&amp;#39;ve been here quite a few times even when it was extremely busy but today I was very disappointed today. I went in with my parents around 4 pm an it wasn&amp;#39;t even crowded. The hostess asked how many and my mom said three and she said it would be a few minutes. I was extremely pissed off when there were other people that got seated and even a party of nine that just walked in got seated before us. The restaurant wasn&amp;#39;t full at all. I asked to be seated and I was told that it would be another few minutes. Those extra few minutes turned out to be a full wasted 15 minutes. I hope that the manager reads this because I was highly displeased. I won&amp;#39;t be coming back to this location because of this experience", "rating": 1, "date": "10/4/2015"}, {"text": "My girlfriend and I stopped here for a late-night snack and dessert.  We ordered a chicken quesadilla, two pops and a slice of cheesecake.  It was $30+ for the stop.<br&gt;<br&gt;The service was GREAT.  We loved our server.  She was fun, energetic, helpful, and all of the other words that go with a great server.  She even pointed out that she was a SERVER, NOT a waitress.  She served people.  Fantastic.<br&gt;<br&gt;The patio was also a nice atmosphere for our late night visit.<br&gt;<br&gt;When the check came though, we remembered why we only go to Cheesecake Factory occasionally.  Wow is it overpriced.", "rating": 4, "date": "8/28/2016"}, {"text": "The wait time was 1 1/2 hours. After that another hour to get your food. Drinks didn&amp;#39;t come out together. Oh yea, ended up throwing up half the night after eating here. Pick another spot.", "rating": 1, "date": "3/17/2018"}, {"text": "Went to the Polaris location for my daughters birthday dinner. Disappointing to say the least. Service was marginal. Silverware was dirty. Left a spoon and knife on tables edge for replacement. Server never looked at it. Finally, pointed it out and he did not replace.  Food was OK. Burger was overcooked. Chicken in salad was horrible. Fried shrimp was very good. Worst of all was the dessert. Found a long piece of paper in the cheesecake. Server saw it left on plate and said &amp;#34;was that in the cheesecake?&amp;#34; When we answered yes, he said nothing further, shook his head and left. Will not be returning...", "rating": 2, "date": "9/7/2015"}, {"text": "The Cheesecake Factory outdoes themselves every time and this time is no exception. We Doordashed them while hanging out at Level One at Crosswoods. It arrived much sooner than expected, the warm food was still warm. If you are an avocado-file like me, you MUST try the Avocado Spring Rolls!! I don&amp;#39;t know what the sauce is that comes with them, but it&amp;#39;s REALLY good!!  The BaconBacon Burger was thoroughly enjoyed and of course the Oreo Cheesecake was the bomb. Thanks Cheesecake Factory! Unfortunately, I was so ravenous that I forgot to take photos of our beautiful food, but I&amp;#39;ll catch them next time.", "rating": 5, "date": "1/12/2018"}, {"text": "Very disappointing. Ordered the $20 Fettuccini Alfredo with blackened chicken.  First of all, the chicken was not blackened, but the worst part was the sauce. It had no flavor and was water thin. I expressed my disappointment to the waitress, and after seeing that I barely ate any, I thought she&amp;#39;d take it off my bill, but she charged me full price. I will never go back to the Cheesecake Factory. Never.", "rating": 1, "date": "8/15/2017"}, {"text": "The cheesecake is good, don&amp;#39;t get me wrong, but nothing special above store bought.  It&amp;#39;s always too busy to just come in and sit down-always a wait.", "rating": 3, "date": "8/3/2017"}, {"text": "Bang for your buck: 3/10<br&gt;Quality: 5.5/10<br&gt;Service: 8/10<br&gt;Ambiance/Location: 7/10<br&gt;Overall: 6/10", "rating": 3, "date": "6/25/2016"}, {"text": "Very disappointing, wont return. Prices were too high for the quality of the food. The cheesecake was the highlight though. <br&gt;The server was nice but food...no Bueno!<br&gt;Menu is too big to execute at high quality..160+items. I ordered a pasta dish that was priced at $17.95. The shrimp in the pasta were &amp;#34;bay&amp;#34; shrimp...very small that are usually used for shrimp salad, some were over cooked. Sent dish back and got meatloaf...tasted ok, not great, but portion size was huge...id rather a smaller portion for less money. Husband ordered a French dip sandwich...usually on a baguette of sorts but came out on a sesame seed bun, like a burger bun, which the menu did not state, and my husband cant eat seeds. Our bill was over $100 and when we left we were very disappointed. Next time we want a nice dinner we&amp;#39;ll stick to Bravo and Hyde Park.", "rating": 2, "date": "7/27/2015"}, {"text": "I come here becuase I always look &amp;#34;the big bang theory&amp;#34; on italian tv. So I really MUST come. <br&gt;The restaurant is a bit big for my standard. Seems a big chain rest.  But waiters was really nice and professional. Food was really good. <br&gt;<br&gt;One thing. One night my choice was finished. A teryaky steak or something like that. They refuse to serve me this with a different cut but same treatmen because they wasn&amp;#39;t sure that can be good as the standard. <br&gt;<br&gt;I never eat it so they can serve me anything (remember I&amp;#39;m italian and we don&amp;#39;t have cheescake factory). But they prefer keep they standard at high level. <br&gt;<br&gt;And this for me is very professional.", "rating": 4, "date": "8/16/2016"}, {"text": "We waited over an hour to be seated and our server was a little slow! But the food was so so so so good. I ordered the macaroni and cheese burger and it was absolutely amazing! The burger was juicy and flavorful and the macaroni and cheese on it was an amazing touch. I loved the ambiance.", "rating": 4, "date": "1/28/2018"}, {"text": "Do NOT recommend take-out from here! This use to be my absolute favorite place. I have come here for my birthday every year for the past 7 years. Each year the quality has progressively gotten worse. From finding hair&amp;#39;s in my food, the tiny portions, and getting the cold &amp;amp; sloppy take-out it makes coming here WAY less enjoyable. <br&gt;The inconsistency in the staff is mentionable as well. Sometimes you get a waiter/waitress that follows the rules and makes for a memorable experience. Other times NOT so much; sometimes you get waiter/waitress willing to cut corners not, giving you the full experience. It&amp;#39;d be nice to know that (on average) every time you go in you&amp;#39;re getting someone who pleasant and willing to do job. Genuinely sad that my business will be spent elsewhere because this was my go-to choice for the longest time. Step it up, Cheesecake.", "rating": 2, "date": "1/23/2018"}, {"text": "It shocks me that The Cheesecake Factory does not filter their water!? Columbus water is not healthy and tastes horrible! It&amp;#39;s just tacky to offer gross city water!? Get it together people!", "rating": 1, "date": "4/21/2017"}, {"text": "First everything  was dirty from the forks to the plates.Then after we got new everything we ordered it took way to long and then the cheese stuffed burger when i took a bite the little bit of cheese that was in it fell onto the plate. It was just bad all around.", "rating": 1, "date": "1/1/2019"}, {"text": "We have been to Cheesecake Factory a bunch of times. The last few times we have visited the experience has gone downhill a little each time. This time tonite was the worst. Being a Tuesday we thought it would be in and out. We sat down in a timely manner but everything else was super super slow. We waited about 10 minutes before our waiter came over. When he finally came we ordered our drinks and our food. The people next to us got their food right after we ordered. They ate, paid and left. Still no food for us. The waiter said it&amp;#39;s coming about 3 times. Then the manager came and apologized and said it&amp;#39;s coming. Then another couple sat down next to us. We finally got our food, about 50 minutes later. Meanwhile the couple next to us ate, paid and left before we got our check paid so we could leave. We assumed that after all that we would have some kind of comp on our bill. We did not. Then, to make things worse, I left my (very sentimental) birthday card on the booth seat when we got up. I realized when we were pulling out of the parking lot. I called to have them grab it and the hostess said no one has seen it. I spoke to a manager and she finally admitted that the buser saw it, said there was nothing in it so he threw it away. Super disappointed. The food was okay.", "rating": 2, "date": "7/25/2017"}, {"text": "I&amp;#39;m noticing a theme here with the online menus not posting prices. This makes it very frustrating when deciding on trying new things at new places. *Edit* Since customer service responded within 24 hours of this review and showed me where I was wrong initially the rating goes from one star to 5 stars. Kudos Cheesecake Factory great customer service goes a long way! :-)", "rating": 5, "date": "8/12/2017"}, {"text": "Ok food.  Exceedingly slow service and very little follow-up attention from our waitress.  It took almost 40 minutes for our food to arrive.  My wife and I were about to leave when the food arrived.  Not what one would expect from this chain.", "rating": 2, "date": "10/14/2018"}, {"text": "Had dinner there today.  Awful awful AWFUL food!!<br&gt;<br&gt;My son&amp;#39;s chicken tenders were over-fried and there was more crispy batter than chicken in the tenders.<br&gt;<br&gt;I had the large chicken burrito.  BIG mistake!  It was full of plain white rice which was so undercooked that it was crunchy in my mouth! 75% of the burrito was filled with the hard white rice and it had no seasoning!  I think there were 2 tiny pieces of chicken in the entire large burrito!  <br&gt;<br&gt;I haven&amp;#39;t been to a Cheesecake Factory in almost a decade and I definitely won&amp;#39;t be back!", "rating": 1, "date": "10/9/2017"}, {"text": "Love the location of this place right next to the mall! All he cheesecakes are amazing and they have so many options! Prices for everything can be pretty expensive here though. Probably around $30+ after taxes and tips just for an entree and cheesecake. It gets really busy and crowded sometimes and it&amp;#39;s hard to hear with all the TVs playing at once and servers bustling around", "rating": 5, "date": "9/3/2017"}, {"text": "***3.5 stars***<br&gt;<br&gt;It&amp;#39;s not local... I know I shouldn&amp;#39;t be here... I&amp;#39;m full of shame... BLAH BLAH BLAH. <br&gt;<br&gt;I haven&amp;#39;t been to a Cheesecake Factory in at least 6 years. It&amp;#39;s not that I hate it; it&amp;#39;s just not really my thing. Big portions, big chain, big prices, etc. <br&gt;<br&gt;Well tonight I was at Polaris mall getting a massage at Comfort Zone (trust me--don&amp;#39;t judge), and the Mister and I needed dinner. He wanted pasta, and since I have this wheat thing, he rarely gets it. <br&gt;<br&gt;It dawned on me that CF probably had a gluten-free menu, so I gave them a quick call--and they did! I placed our order, and then they told me I could PARK OUTSIDE AND THEY WOULD BRING MY FOOD. <br&gt;<br&gt;What?!<br&gt;<br&gt;Maybe I&amp;#39;m just easily amused, but the Cheesecake Factory impressed me tonight with their GF menu and the way they let me be lazy. <br&gt;<br&gt;As for the food, it&amp;#39;s your typical CF fare. Everything was good. Not amazing, but still tasty. I definitely don&amp;#39;t think I&amp;#39;ll wait another 6 years before heading back!", "rating": 3, "date": "10/17/2014"}, {"text": "My drink was really good and the lights are really low and the place has this cool vibe, but my food was cold and when i had it sent back they just microwaved it for a minute.  I know because the shrimp was too chewy to eat.  Our waitress was really nice about it, but for the price i feel like the food should be better quality than what was brought to me.  Never even got to speak to a manager about it", "rating": 2, "date": "10/18/2018"}, {"text": "Let&amp;#39;s get straight to the point...the Cheesecake is the best part about this place. <br&gt;<br&gt;Don&amp;#39;t be fooled by the ambiance, the decor, or the biblical sized menu,<br&gt;-- side note: I&amp;#39;ve never understood restaurants with 15 page menus. How can you boast having good food when you have to be able to cook that many items. I&amp;#39;d rather sacrifice quantity for a little quality. --<br&gt;because all that really matters is the cheesecake. <br&gt;<br&gt;My recommendation: order the cheesecake first and your entrée second. You don&amp;#39;t want to fill up on bread and food and then miss the best part. <br&gt;<br&gt;Personal favorite, the raspberry and lemon cheesecake. Light, tangy, fruity, and smooth.", "rating": 3, "date": "11/5/2014"}, {"text": "My sister and I frequent the Cheesecake Factory as a tradition to celebrate our birthdays.  We were seated at 12:20pm in a section that was full of 2-top and 4-top tables. There was no indication, to us, that the entire left side of this section was all one group. <br&gt;<br&gt;The waitress took our order in a timely manner, but after about 20 minutes, the wrong appetizer was delivered to our table. The correct appetizer didn&amp;#39;t arrive until 1:15 - just 2-3 minutes before our main entrees were served.  <br&gt;<br&gt;We noticed that around 12:45, the waiters were yelling, &amp;#34;Who had the....&amp;#34; to the group of small tables, as they served their meals and realized the section was filled with a business group. <br&gt; <br&gt;Once the group finished eating (at about the time we were being served), an awards meeting began.  The leader was standing right by my seat, (with her &amp;#34;behind&amp;#34; in my face) calling people up for awards, hugs, and photos.  This STOPPED the wait staff from checking on our table, and stopped our ability to hold a conversation. <br&gt;<br&gt;The manager who said that she had already dealt with a previous problem regarding that group offered us a weak apology and a slice of cheesecake. Pathetic. <br&gt;<br&gt;It looks like we&amp;#39;ll find a new venue for our traditional birthday lunch.", "rating": 2, "date": "10/14/2017"}, {"text": "I order from the skinny menu and my boyfriend gets the honey chicken or something from the pasta. I enjoy that the calories are printed in the menu so you know how many are in each product. The menu selection is plentiful and the service is okay. I tried the cheesecake once and it was very sweet so I made two desserts out of it. The wait is very long most of the times went (granted we eat during normal dinner hours so we expect it). The portion sizes are large so there are always leftovers.", "rating": 4, "date": "6/22/2017"}, {"text": "Since I don&amp;#39;t believe in providing a 1- or 5-star review upon one visit to a restaurant, I&amp;#39;ll refrain from doing so this time. However, if I were to do that, I&amp;#39;d grade my latest experience 1-star. <br&gt;<br&gt;As far as the pros go, the menu is filled with so many options, no matter how picky one might be, he/she is bound to find something to their liking. The server was also quite friendly.<br&gt;<br&gt;In saying all of that, however, as I was in the mood for something &amp;#34;Cajun&amp;#34; and I stumbled upon a speciality dish called &amp;#34;Cajun Chicken Littles,&amp;#34; I ordered that and came away extremely disappointed. The dish is described on the menu as: &amp;#34;Boneless Breast of Chicken Pieces, Spiced, Breaded and Fried Crisp...&amp;#34; When I took my first bite, I could tell there was absolutely nothing &amp;#34;Cajun&amp;#34; about it and nothing &amp;#34;little&amp;#34; about it either. When the waitress returned, I asked for some Cajun seasoning, since it had appeared I was served two orders of regular chicken tenders with barbecue sauce on the side. When she returned, she said, &amp;#34;I&amp;#39;m sorry, but this order isn&amp;#39;t Cajun and isn&amp;#39;t little. Here&amp;#39;s some blackened seasoning. Hopefully that helps.&amp;#34; Really? A dish is called &amp;#34;Cajun Chicken Littles&amp;#34; and 2/3 of the title is inaccurate? If I had known the &amp;#34;Cajun Chicken&amp;#34; wasn&amp;#39;t Cajun, I would have ordered something else. Not only that, but while I quickly lost my appetite and didn&amp;#39;t eat much of the disappointing meal, I wasn&amp;#39;t offered a discount for the slip-up. Hopefully my dog likes the leftovers...", "rating": 2, "date": "7/9/2017"}, {"text": "A quick note here: Eat at the Easton location if you can. Polaris has the worst layout ever. I won&amp;#39;t go back again if I can help it.<br&gt;<br&gt;I&amp;#39;ve always enjoyed this restaurant. This time around was no different. The server was a super friendly &amp;amp; attentive Eastern European woman - best server I&amp;#39;ve had in a while!<br&gt;<br&gt;I love the bread, but it wasn&amp;#39;t as hot &amp;amp; fresh as it should be (on every refill). My dish was very good (spicy cashew chicken). It was well cooked &amp;amp; presented. Could be spicy for your average joe, but I&amp;#39;m a spice freak, so I would&amp;#39;ve preferred more. My Sam Adams seasonal beer was very crisp &amp;amp; refreshing. For dessert, I got the strawberry cheesecake. It was absolutely to die for. Thick, rich body, fresh strawberries in a sauce, thick &amp;amp; generous whipped cream, &amp;amp; a tasty crust.<br&gt;<br&gt;Overall a good experience. Another note: they don&amp;#39;t take reservations on the weekend.", "rating": 4, "date": "3/12/2015"}, {"text": "Decided to skip the crowd &amp;amp; do carryout for Valentine&amp;#39;s Day dinner.  Called &amp;amp; ordering was fast &amp;amp; easy.  Pulled up to the to-go parking and called to let them know I was waiting.  About 10 minutes later a girl came out with the food &amp;amp; took another 5 minutes to run my credit card.  I got there right at the quoted time, but food didn&amp;#39;t feel very warm.  Got home a few minutes later &amp;amp; it was pretty cold &amp;amp; mashed potatoes were super lumpy.  Portions seem much smaller than when you dine-in.  Also they should put sauces on the side so food doesn&amp;#39;t get soggy.  Overall it was an ok experience, but definitely not worth $57.", "rating": 2, "date": "2/15/2017"}, {"text": "Not one of my favorites anymore didn&amp;#39;t know what to order so I asked about their new Korean  fried cauliflower that my daughters rave about and he was telling me that it wasn&amp;#39;t good that he would never order it so I ordered the dynamite shrimp which is supposed to be crispy temper and there was nothing crispy about it at all it was a very lack luster appetizer my husband&amp;#39;s hamburger was supposed to be meeting him and was more well done and his fries didn&amp;#39;t come out until he was halfway done with that very  attentive waiter", "rating": 3, "date": "9/5/2017"}, {"text": "Dear Cheesecake Factory,<br&gt;I did contact you...you assured me that<br&gt;You were very sorry for our experience,and sent us a whole $10 dollars as an &amp;#34;apology&amp;#34; Considering we spent $70 on dinner $10 is quite a slap in the face! A restaurant that can&amp;#39;t refill drinks or bring hot food to the table,yet expect us to return because you sent $10 ?You should really be a comedy club.", "rating": 1, "date": "2/14/2017"}, {"text": "The food is good, and the service is excellent. I prefer this location to the one near my home (Cincinnati).", "rating": 4, "date": "10/22/2014"}, {"text": "Made the mistake of coming here the day of OSU graduation, so everyone and their mothers decided to eat here. The wait was over an hour. Four people at my table ended up getting sick. I have a fever and pretty bad muscle aches. Maybe in the mad rush to serve the crowd, no one followed food safety guidelines.", "rating": 3, "date": "5/10/2017"}, {"text": "The Cheesecake Factory at Polaris hosted myself and the fetching Mrs. Rat on 5/14/16 for dinner. We arrived at 5:45pm to find the place overrun with Prom goers. While waiting to get to the reservation station, a group in front of us offered their buzzer as they were not going to wait the 90 minutes predicted by the hostess. We passed the buzzer to a party of four. After waiting 8 minutes we were escorted to our table. We ordered iced tea and pot-stickers. They arrived in a timely fashion and the pot-stickers were very good. Our waitress was superb and did not hover around, she gave us plenty of time to peruse the vast menu. The fetching Mrs. Rat ordered steak medallions with grilled spring vegetables. The presentation was pleasing to the eye and the food was tasty to the tongue. I had the steak Diane &amp;amp; salmon combination with mashed potatoes and asparagus. The steak was grilled to perfection. The salmon was a bit more done for my taste. I don&amp;#39;t fault the cook though as I should have ordered it medium rare. We both ordered cheesecake and coffee to end the meal. I had traditional with cherry topping. The fetching Mrs. Rat had vanilla bean with strawberries on the side.<br&gt;<br&gt;I see that some reviews say that service was slow. We had no problems whatsoever. As I mentioned earlier, it was prom night so the place was packed. Food was very good, service was great, atmosphere was fine. I think we shall return.", "rating": 4, "date": "9/1/2016"}, {"text": "The cheesecake and desserts far outweigh the blandness of their menu.  The dinner menu tries to be something for everyone, and doing so they fail to do anything spectacular. The burgers aren&amp;#39;t great, just ok. The pasta isn&amp;#39;t spectacular,  just ok. When your menu is thicker than a 3 subject notebook,  you&amp;#39;re trying to be all things to all people. <br&gt;<br&gt;The service at this location is train going up a hill slow. FYI. I am not from Columbus so I probably won&amp;#39;t be back here, but it kind of turned me off from trying the one where I live.", "rating": 3, "date": "7/15/2014"}, {"text": "I didn&amp;#39;t like this place, at all.<br&gt;<br&gt;Came here with a coworker for lunch, met our server in five minutes, was served our drinks 30 minutes later, our lunch 30 minutes after that.<br&gt;<br&gt;Normally, two people can do lunch at nearly every place in Polaris in an hour or less. Larger groups? Yeah, maybe a little longer. here? Two people. No crazy requests. Ordered from the lunch menu, and it took over 90 minutes.<br&gt;<br&gt;The food was meh, but filling (I had the blackened chicken sandwich).<br&gt;<br&gt;Plain and simple, I&amp;#39;ll be skipping it for lunch from now on.", "rating": 2, "date": "8/17/2012"}, {"text": "As expected the cheesecake was really good. The entrees were just ok with two of the five in our party receiving their food less than warm.", "rating": 3, "date": "6/17/2018"}, {"text": "Best happy hour around! 4-6pm weekdays. $6 for most apps. We orders the nachos and they are huge and delicious! Brought leftovers home. Also ordered sliders and figured there would be 1 or 2 but there were 4 sliders and they were delicious! Great value! Definitely will be back. Note the happy hour is only good in the bar area but we had a nice table in a quiet area. Only complaint was that it was cold inside, but just know to being a coat next time.", "rating": 5, "date": "6/9/2017"}, {"text": "What I don&amp;#39;t understand is why all these people who profess disdain for this place, why don&amp;#39;t they go elsewhere???  I came up to get a couple of pieces of chesecake, which I did, and if I hated it as much as some of the HATERS do, there are a lot of other restaurants the would be glad to take my money.  <br&gt;<br&gt;If I had to pick a nit, it&amp;#39;s that the Cheesecake Factory is a tad to expensive for my wallet.  So I restrict those trips until I really need a piece and then I buy TWO of them.  That&amp;#39;ll hold me until the next time the craving hits.", "rating": 4, "date": "1/18/2014"}, {"text": "I was in Cheesecake today I waited for 15 minutes just for some to say that my server will be with me shortly and had to wait another 10 minutes for some one to show up very bad way to treating guests. While I sit there and watch I see servers are taking care of other guests who came after us but ignored us. Is it because of the color of my skin that made me treated the way I was treated? Or dose Cheescake factory dose not good customer service? <br&gt;<br&gt;I walked out because I do not want to eat in a place where there no basic courtesy and had my brunch at Brio where I was treated really well. <br&gt;<br&gt;It was refreshing to see some one caring for you. You guys need to learn from your competitor how to treat your guests.", "rating": 1, "date": "5/22/2017"}, {"text": "We stopped after a trip to the columbus zoo. It was 3pm on a beautiful Saturday. We were told the wait was at least 40 min. We decided to wait since we had never been here before. We were given a menu on request to pass the time. After our 40 min wait we were taken to a table. We were promptly greeted by our waitress who took our drink order and we went ahead and gave our meal order as well since we had ample time to view the menu. Everything came in a timely fashion. Drinks then the mac and cheese balls (delicious). With in moments our meal arrived. Our choices were the bacon burger with fries and a meal of steak Diane/ shrimp scampi with red mashed potatoes. Crusty bread was served on the side. The food was amazing with the exception on the fries. we had a great waitress. A piece of Adam&amp;#39;s pb/cho cheesecake was taken home. The meal was excellent but pricey. No alcohol was ordered and our bill was 66.00 for 2 people. If we are ever in the area we will be back.", "rating": 5, "date": "2/20/2017"}, {"text": "Foods decent, one of the employees, Justin McNeal, makes the place worth going to. You can&amp;#39;t beat hard work and dedication, honestly the only reason I would gonback", "rating": 5, "date": "2/9/2016"}, {"text": "I&amp;#39;ll give my review as I&amp;#39;m sitting (for 10 minutes now) for my check. <br&gt;<br&gt;I came here with my GF for lunch while out running errands. I wish we would&amp;#39;ve went elsewhere, but she seemed to enjoy herself. <br&gt;<br&gt;I&amp;#39;ll run though my complaints fairly quickly - the decor is gross, the wait was way too long for the place to be this empty, and the food was so-so. <br&gt;<br&gt;We started off with the fried cheese and it was nothing to brag about. The sauce was too sweet and the outside was burnt. For our lunches, I ordered the herb encrusted salmon and the GF ordered the gumbo. As stated, my food was so-so, the highlight being the mashed potatoes. The portion sizes were alright. <br&gt;<br&gt;Now my major complaint is how absolutely long it took for this entire process. Our waitress seemed so impatient, yet took forever once we placed an order or asked for something. Cool the attitude, missy, I&amp;#39;ll be sure to not return and assist in your Monday blues.", "rating": 3, "date": "9/16/2013"}, {"text": "Dragged here by co-workers. Safely ordered the chicken piccata. Who could ruin that? CF can. Zero sauce on the pasta, mushrooms in the dish? Why? And completely flavorless sauce. Also I would like to meet the employee whose job it is to pound the snot out of the chicken breasts. Cheers dude, you&amp;#39;re the reason this review got any stars at all.", "rating": 1, "date": "3/5/2018"}, {"text": "The service is good, our server was very friendly, however the food was disappointing. The fried cod was very dry and flavorless even after salt on it. It did not fall apart at all and was not flaky.", "rating": 2, "date": "11/26/2016"}, {"text": "Came in before noon on a Sunday and we didn&amp;#39;t have to wait which was nice. Only complaint was the bread came out slow. Everything else was good. A little expensive for what we got but that&amp;#39;s to be expected here.", "rating": 4, "date": "11/15/2016"}, {"text": "One star food, three star decor.<br&gt;<br&gt;The bang bang chicken and shrimp used to be pretty good, but everything had been cheapened here aside from the cheesecake. The quality of the entire chain really has declined.", "rating": 2, "date": "11/17/2013"}, {"text": "Was in town for the Arnold Classic and decided to come here for dinner. It was a great pleasure having  Alena as our server! Although she was busy and had many other tables to deal with, she still managed to provide us with 5 star service! She was so friendly and she consistently checked in on us to make sure we were enjoying our food. Next time I&amp;#39;m in Columbus I will be back thanks to the wonderful service.", "rating": 5, "date": "3/5/2017"}, {"text": "3rd attempt at the Polaris location last night .We had a party of 5 and luckily found 2spots at the bar to wait. The bartender( I did not catch his name because I&amp;#39;m not sure he could speak) was rude and completely ignored us. The other bartender had to stop what she was doing to wait on us. our waitress was pleasant but could hardly hear us. The accustics in that building are awful!  I ordered a chop salad. Chopped is right! It was chopped so fine I couldn&amp;#39;t tell what was in it. My husband got a filet. It was cooked perfectly but a 30 dollar steak, you would think it would have come with a side? nope, just a hunk of meat on a plate! We spent $100. 3rd time NOT a charm. Won&amp;#39;t go back....OK maybe for cheesecake.", "rating": 1, "date": "5/10/2015"}, {"text": "usually this is a favorite place to go, but my family went on 10/7/17 and were disappointed... I tried the gumbo for the first time and it just tasted like chicken broth with a lot of pepper... I&amp;#39;ve had authentic gumbo and can make good gumbo... it was no where close... I took only 2 bites. my daughter had the Louisiana pasta... the chicken was good but the pasta was watery and bland , she only ate the chicken. my waiter was nice but never offered a substitute dish or comp. I would have at least expected that he offer to get the manager. I hate wasting money but that&amp;#39;s exactly what I feel I did with my dish. and because they didn&amp;#39;t try to make things right... I will look to other places to eat before going there. just grab the cheesecake as carry out.", "rating": 2, "date": "10/7/2017"}, {"text": "Very disappointed with visit. This is not our first time. We wer out for our Birthday dinner. There were 3 of us with Birthdays. Out of the five dinners that were ordered, only 2 were correct. We asked to speak with the manager ( Ashton ) and she was very rude. Very disappointed as this was always a group favorite. There are so many choices in the Columbus area and we will not be back.", "rating": 1, "date": "11/20/2016"}, {"text": "Great Cheesecake Factory with the normal great service and food. Never disappointed by this location!", "rating": 4, "date": "10/13/2016"}, {"text": "Had really bad service &amp;amp; food today. I felt like only this location (Polaris) though. The one in Easton is constantly good never had a problem. Polaris location is unorganized &amp;amp; you have to get on their case before you get service. I don&amp;#39;t like to input  bad reviews but if it gets really bad I have to. Not coming back to this (Polaris) location.", "rating": 1, "date": "9/6/2015"}, {"text": "We just stopped here for a little birthday dessert.  Unfortunately, it was unnecessarily sweet; and let me tell you, I love sweets but these cheesecake slices just screamed manufactured.  I, surprisingly, had never had cheesecake from TCF.  In my world of trying to eat well, TCF seems to be one of the worse offenders because of calories and excessive use of salt and sugar.  My experience confirms all that I&amp;#39;ve heard and I think we all can do better, people.  Seriously-- the taste is not worth it.  If it was yummy, I would totally sacrifice health for occasional treat but it&amp;#39;s not.", "rating": 1, "date": "1/20/2013"}, {"text": "I am not a fan of chain restaurants. This place is average. I would really give it 2.5 stars.  The bang bang chicken is a good dish. Not being a fan of cheesecake may have something to do with my rating.  Service is generally very good.", "rating": 3, "date": "1/9/2016"}, {"text": "Need to figure out how to maintain seating flow properly.  Been a few times with large parties and have waitied at least 30 minutes beyond predicted wait time.  One time they forgot to tell us our table was ready for 20 minutes and we had already waited 1hr 45mins.", "rating": 1, "date": "8/13/2016"}, {"text": "There&amp;#39;s nothing more enjoyable than going to a restaurant where a waitress never comes back and then when your food is finally delivered there is hair cooked into the chicken. Once I was able to find my waitress and alert her of the situation she was only able to mutter &amp;#34;Sorry&amp;#34; while not looking in my eye and not offering a solution to the hair being in my food. Completely disgusted. Get your cooks hair nets.", "rating": 1, "date": "5/15/2015"}, {"text": "We always come to the Cheesecake Factory but tonight was the Worse service in the entire world!!!!!!!!! I have served and bartended for over 2.5 years so I completely understand what it is like and I&amp;#39;m not one to complain but tonight was unreal!!!!...I ordered a lettuce wrap with no chicken just fresh veggies and my boyfriend ordered a ribeye steak with mash potatoes and green beans...our food took over an hr to receive on a Wednesday night that was not busy by any means. We have been here on many weekends where our food never took this long..We got our food and my boyfriend only got his steak and green beans. I asked our server what took so long he said he was waiting on the mashed potatoes and didn&amp;#39;t want to wait any longer so he brought out our food...which was fine. He said he would bring out the mashed potatoes as soon as they were done.....But of course By the time he was about done with his steak and green beans he THEN got his mash potatoes....mind you this was after waiting already an hour for our food. The manager brought it out and asked us if we were doing ok still, we said yes. He Did not even bother to apologize for the long wait nor did the server even bother to ask us if we wanted a salad or more bread as we were waiting for our food. We had to ASK him if we could have more bread!!!!....So ridiculous on both their parts.....How is it that The table that sat across from us arrived 20 minutes after we did and received their food before us ??? Completely unacceptable .....Service was far too slow....worse dining experience.", "rating": 1, "date": "8/16/2017"}, {"text": "been waiting an hour for my table and we made a reservation at 3. shitty ass service. i&amp;#39;ve seen people walk in after me and get seated before our party. trash.", "rating": 1, "date": "11/19/2017"}, {"text": "This place is very good food and decent price and the service was good.......bad side is don&amp;#39;t order a drink from the bar cause it takes way to long for a drink from the bar", "rating": 4, "date": "5/30/2016"}, {"text": "I haven&amp;#39;t been to the Cheesecake Factory in a long time.  The menu is overwhelming so much stuff to pick from.  I got the stuffed mushrooms they were ok but a bit over cooked, and I order the lemon shrimp ok the light menu the sauce was great I would like liked the tail off on the shrimp it mixes better with the pasta that way. The food came out very quickly not much wait however our server may have had too many tables or something we didn&amp;#39;t see her much at all.", "rating": 3, "date": "8/6/2017"}, {"text": "We tried to book my daughter&amp;#39;s bachelorette dinner here but was told they couldn&amp;#39;t accommodate us. They told us that we were welcome to come in and out out names...all 20 .....on the list and they&amp;#39;d be glad to accommodate us. It would take about 2 hours. They said they were quite busy and this would accept their sales. Don&amp;#39;t worry! We wouldn&amp;#39;t want to affect their sales....they just lost a guaranteed party of 20&amp;#39;", "rating": 1, "date": "4/6/2016"}, {"text": "Was very impressed with the brunch. The mimosas were flowing and the Huevos Rancheros was delicious. Black beans and melted cheese made this breakfast experience perfect. Would defiantly recommend this brunch to anyone looking for a quick b fast fix!", "rating": 4, "date": "8/3/2015"}, {"text": "Located in Polaris mall&amp;#39;s dining sector, this cheesecake factory has ample seating both indoor and outdoor.  Parking is shared with nearby Barnes and Noble and it is usually easy to find a spot.  Food is typical of other cheesecake factories with a GINORMOUS menu, and the cheesecake selection and larger than life portions do not disappoint a hungry diner.  Service here is not the best, as waiters and waitresses seem disinterested and forget requests easily.  For example we were seated outside during a hot day and did not receive waters until we asked for it.", "rating": 2, "date": "1/5/2015"}, {"text": "Sometimes we come here for food.  Sometimes after we&amp;#39;ve eaten somewhere else, just to get dessert.  Lately, it&amp;#39;s been more of the latter.<br&gt;<br&gt;The food is just &amp;#34;too much.&amp;#34;  It&amp;#39;s good, don&amp;#39;t get me wrong, but like Champp&amp;#39;s on steroids.  The portions are made for Biggest Loser dropouts and the prices are a little high for what you get.  This is one of those places that seems to justify its high prices on the ambiance and portion sizes, neither of which the consumer can control... or can we??  <br&gt;<br&gt;Okay, so you can&amp;#39;t re-paint the ceiling at Cheesecake, but why would you?  It&amp;#39;s beautiful.  However, if you can get your date or someone in your party to decide on a dish to share, this is the way to go.  Chances are, you&amp;#39;ll eat your 1/2 and still feel like a fata$$ anyway.  <br&gt;<br&gt;I&amp;#39;m not into fancy desserts - in fact, I&amp;#39;m not much of a sweets person, so I typically don&amp;#39;t eat the cheesecake, but when I do (a la Dos Equis), I just get a plain one.  Typically, I just get drinks, though... they have great cocktails.", "rating": 4, "date": "4/23/2013"}, {"text": "My fiance and I absolutely love ordering from the cheesecake factory. We decided to order to gobinstead of dining in. We both wanted to order the factory combos. I got the chicken Madeira and shrimp scampi. It was delicous. I love their shrimp scampi. My fiance got the steak diane and herb crusted salmon. He absolutely loved it. I tried a bite of his plate... I was a bit jealous of his salmon. It was amazing!! Let me tell you if you come here the food will be good and they have not once messed up our orders. Also if you really like cheesecake this is the place to go. I have not tried many flavors. But i know they have the best cheesecake in town. My personsal favorite is the chocolate tuxedo cheesecake. It is so good!!", "rating": 5, "date": "7/10/2015"}, {"text": "I think the food there is really delicious and the Pumpkin cheesecake is awesome! I really enjoyed the meal with my friends there.<br&gt;However, because it was weekend and many people were waiting there, my friends and I waited about half an hour. Chinese people are anxious about waiting for such a long time. And the food is too much and most of us had to waste it. <br&gt;But I still want to say it is worth to waiting. The food there is yummy flavor and the cheesecake is unbelievable. Moreover, the waiters of The Cheesecake Factory were really nice and hospitable. Although we have looked for the menu for a long time, they still showed great patience to us. They gave us some good recommendations as well.", "rating": 4, "date": "11/18/2013"}, {"text": "The place was packed tonight and I was told it would be an hour wait so we ventured next door to Barnes and Noble with the pager they gave us. I was also told that the pager would not work in Barnes and Noble and that I should return before the hour so we don&amp;#39;t lose our spot. <br&gt;<br&gt;So we arrived at Barnes and Noble and decide to buy some chai tea and coffee from Starbucks and low and behold our pager goes off. I had to power walk in five inch heels and throw away my chai tea. I was a little irritated that the employee kind of lied to us but also happy that the wait was far less than an hour.<br&gt;<br&gt;The waitress was very attentive and always kept our beverages full at all times. We had ordered calamari and it was overly greasy and the breading kept coming off which exposed the rubbery concoction. I don&amp;#39;t like knowing what calamari looks like without its clothes on. On the upper hand, I ordered the filet mignon and of course it was it was amazing. I love the way filet mignon just almost melts in your mouth. The fries that accompanied my steak were far less impressive and had two random onion rings with them. (I loathe onions). By the end of all that my stomach was pushing for a food baby so I got my cheesecake to go. Dulce de leche was my poison of choice. I still have yet to eat my cheesecake, it&amp;#39;s sitting in the fridge haunting me but I know it will be a delight.", "rating": 5, "date": "3/2/2013"}, {"text": "The lobby is one of worst set up I have seen for a restaurant this size. Needs more seating. People looking at the cheese cake display are in the way of someone trying to get to the other side", "rating": 2, "date": "5/7/2017"}, {"text": "The Cheesecake Factory- Polaris is fantastic. I mean, if you haven&amp;#39;t been to a Cheesecake Factory yet, run as fast as you can to get to one! The menu itself is like a novel, its the largest menu I&amp;#39;ve ever seen. I always have to get the mac and cheese bites as an appetizer because they come perfectly made and the sauce they are served on is impeccable! I think it&amp;#39;s important to note also that I DO NOT LIKE CHEESECAKE! How crazy is that?! BUT they have the BEST carrot cake I&amp;#39;ve ever had. Sometimes I call the take out line and have them bring me out a slice of their to die for carrot cake to the curb side parking. I mean, don&amp;#39;t judge. It&amp;#39;s just THAT good.", "rating": 5, "date": "9/13/2015"}, {"text": "Just got through having lunch with family and am purty disappointed. The food was okay but service wasn&amp;#39;t great. First they took a long time to get food out then finally they told us that they had over cooked my brothers food and it would be a while longer.  When his food arrived the manager came and said that he was disappointed how the mashed potatoes looked so he sent them back and that they would be coming soon. After all this they overcharged our bill and we had to wait to have it fixed. They did comp my brother a piece of cheesecake for his wait that why they get 2 stars", "rating": 2, "date": "12/11/2014"}, {"text": "Love Cheesecake Factory but Brunch today was awful.  Cold food, incomplete order, so so service.  Columbus likes to brag about being a restaurant market, it&amp;#39;s a shame it&amp;#39;s not known as an good operations market", "rating": 1, "date": "11/16/2014"}, {"text": "My boyfriend and I went to the Polaris mall Cheesecake Factory for dinner yesterday, after all day of work, just want to have little joy and relax! <br&gt;Normally I&amp;#39;m very happy with the foods and servers, yesterday we had the waiter name Chris, he is horrible, he Is so rude to us the whole dinner. First, we ordered crabcakes, it came out pretty fast, so we are so happy, because after all day of work, we are hungry, we took the first bite, it tasted good as usual, but this time in the middle of crabcakes still cold, so we return the crabcakes. The manager bring out the new order of crabcakes, and apology to us. <br&gt;With our reminder, the rude waiter Chris just remember to bring us bread, that&amp;#39;s after half and hour later after we been sited, and put in order, and the appetizer already been out and return, plus he didn&amp;#39;t give us any plates and he throw the bread to our table and walk away, not even say a word! So we asked other staff to bring us plates, omg, one of the plate are so dirty! <br&gt;Of course when the manager here, we have to tell him that, the manager explain why the bread took half and hour, because they are out and still in the oven?! Ok, we accept that explanation, at least he tried, he continue about the cold crabcakes and dirty plate, he said shouldn&amp;#39;t happened! He took the dirty plate and tell us he will bring a new one, oh well, he didn&amp;#39;t. <br&gt;In some way, the manager is professional, we give the manger some credit, so we didn&amp;#39;t tip badly to that rude waiter &amp;#34;Chris&amp;#34; I don&amp;#39;t know you are racist or you have bad experience about Asain tipper, because I don&amp;#39;t see you have a bad day, you handle the table across to us very well, just because they are your people? Then you should tell your company to put up a sign, no other races allowed in our restaurant but white.<br&gt;That&amp;#39;s all I can think of you are being racist, because you showing me your attitude between us to the other table! But I really don&amp;#39;t need to come to the restaurant to see such thing, you can keep it at home! What a trash!", "rating": 1, "date": "7/17/2016"}, {"text": "The past recent visit at the Cheesecake Factory was a very unpleasant experience. I was there with my brother and sisters, we were seated there on a Thursday night so it wasn&amp;#39;t busy. We sat for about 10 mins till we had to get up and look for a server to get our drinks. Me and my sisters ordered strawberry lemonades when they arrived we all took a sip, they all tasted like a rubber hose. we asked for a replacement of sprite and asked for it to not be from the bar. I then ordered a margarita pizza. It looked and tasted like it was frozen food that they just warmed up. My brother ordered the cashew chicken, let&amp;#39;s just say they can&amp;#39;t do chinese food, we&amp;#39;ll stick to Molly Woo&amp;#39;s. We defeniatly won&amp;#39;t be returning.", "rating": 1, "date": "11/23/2014"}, {"text": "we went to this location for valentines day. this was not our first visit to the cheesecake factory. however, this was one our favorite visits. we were greeted almost immediately after being seated. our server was very informative. if you have read my other reviews you know i like (love) Nashville hot chicken. they had Nashville hot chicken nuggets on the small plates menu so i had to order those. i also tried the chicken Parmesan pizza (basically a super large chicken breast with pasta and marinara sauce). my fiance got a chicken dish with some tasty sauce on it and asparagus. our server brought our our bread and let me tell you. the bread they give out with your meal is AMAZING! we love it. our food came out pretty quick for how busy it was. everything was fresh and tasty. after our meal we of course ordered cheesecake. i got the Ghirardelli  cheesecake and my fiance got the chocolate hazelnut one. both were so rich and amazing we never finish our cheesecake so we can take some of our food home with us. this visit was a bit loud but what can you expect with it being valentines day and busy. we did have a wait for our table it was about 20 minutes so not to bad at all. just you know if you are visiting on a busier day. hope this review helps.", "rating": 4, "date": "3/1/2018"}, {"text": "Their fish and chips meal was batter and chips.  Of course the cheese cake was wonderful, but that was one of the worst meals we&amp;#39;ve ever experienced there, very disappointed.  Service was great.", "rating": 2, "date": "9/19/2014"}, {"text": "Well what can you say about a place that&amp;#39;s corporate. It&amp;#39;s opulent and nicely decorated. It&amp;#39;s roomy and has a nice bar, place to get to go cheesecake and cake slices. Then there&amp;#39;s the spacious dining room.  I ordered the fried zucchini with marinara as ordinarily it comes with ranch. I also ordered off their &amp;#34;Skinnylicious&amp;#34; menu where items have 600 calories or less. I got the Asian chicken tacos that utilize lettuce as their shell then chicken, bamboo shoots, Asian slaw and chopped peanuts.  It&amp;#39;s served with two different sauces that include a peanut sauce and a ginger sauce. I like them both. Alas you can&amp;#39;t forget the complimentary sourdough and pumpernickel bread served with butter. My friend ordered the crab bites which are little mini crab cakes and they weren&amp;#39;t too bad.  She also got their corn chowder soup. Our waitress was pretty efficient but hard to understand at times as she had a thick accent.  I&amp;#39;d go here again if in the area but I wouldn&amp;#39;t go out of my way as it&amp;#39;s just usual corporate fare.", "rating": 3, "date": "1/12/2016"}, {"text": "I had the best service ever from this location. Zack the manager was so sweet. I hadn&amp;#39;t noticed the time when I got off work and went in. It was 10 minutes to close and so I decided to just say I&amp;#39;m sorry, I&amp;#39;ll go elsewhere, (having been a server I remember dreading having guests walking in so close to closing time) well, he welcomed me back, and said it was no trouble, don&amp;#39;t worry about it! I refused one more time, and he insisted that it wasn&amp;#39;t any trouble and the kitchen won&amp;#39;t be mad. I, having not had anything to eat all day, accepted. I ordered, and again, he made sure that I got anything I wanted. I felt that he went above and beyond!! Thank you for putting your guest first!", "rating": 5, "date": "5/22/2017"}, {"text": "Let me say first and foremost I love the Cheesecake Factory however this particular location is an epic fail.  If you want a good Cheesecake Factory experience to go the Easton location. It seems as if the kitchen at the Polaris location I&amp;#39;d always messing up something and please change your cooking oil more often.", "rating": 2, "date": "6/16/2014"}, {"text": "Stopped into this busy Cheesecake Factory on a saturday afternoon and had a rather pleasant visit. Wait time for a regular table was a half hour, however we were able to grab a high top right by the bar and were served right away.<br&gt;<br&gt;Started off our &amp;#34;lunch&amp;#34; with some fried crispy cheese.  The breading was a big thick which made the frying a little strong.  There was more fried breading than actual cheese, but it was still &amp;#34;ok&amp;#34;. The cheese was a combo of two different types which was fairly tasty, just not much of it. <br&gt;<br&gt;I had the cheeseburger, can&amp;#39;t remember the exact name just remember that it was charbroiled and had cheddar. The burger was not a typical &amp;#34;burger&amp;#34; per say, it was served on a partial loaf...baguette size. The burger was rather tasty and well cooked. Great flavor in the burger without drying it out, still a good amount of juice in the burger.<br&gt;<br&gt;The fries were very tasty and not overly salted. Just the right amount of crisp, salty, and moist. <br&gt;<br&gt;The better half had the salmon. He enjoyed the salmon itself, didn&amp;#39;t really care for the sides. The broccoli, as he reports, was cold so he didn&amp;#39;t really eat any of it. His other side was mashed potatoes, he ate some of those but he&amp;#39;s not a huge mashed potato fan.<br&gt;<br&gt;Service was quick and very pleasant. I would recommend and would return.", "rating": 4, "date": "10/7/2012"}, {"text": "I love the food at this place and whenever I have visited this restaurant in IL the service has been commendable but I was disappointed when I went here. We asked for chilled water and the person got us tap water when we asked we were told I got you what I had this is all we have. Really an upscale restaurant can&amp;#39;t give its guests cold water. Many will just make an attempt to pour cold water from a pitcher full of ice with minimal ice cubes to make the customer happy. The experience was just bad through out from appetizer to entree I believe the person waiting our table was having a bad day but why take it out on a paying customer.", "rating": 1, "date": "5/20/2017"}, {"text": "I had a luau salad (lunch size), and it was gigantic.  The salad tastes great, and the display was pretty neat too. I finished my meal with a huge slice of Snicker&amp;#39;s cheesecake (excellent)! The service was good, so I will definitely be back when I am in the area again.", "rating": 4, "date": "10/20/2014"}, {"text": "It was a great places for me and my friends to have meal, the steak was nice. I would absolutely come here and try some food else.", "rating": 4, "date": "11/16/2014"}, {"text": "I went there with my friends after shopping and we were super hungry. The restaurant seemed nice.<br&gt;<br&gt; I got a fish taco and it was okay. The rice tastes funny but I like the taco. The salads my friends got were so big! Then we shared a cheesecake.  It was so good that we finished it in a second!", "rating": 4, "date": "10/25/2014"}, {"text": "We used to order take-out from Polaris Cheesecake Factory every Friday.  Given the terrible customer service, we quit over a year ago.  We love their food and attempted to order take-out tonight.  We were quickly reminded why we quit.  They quoted us 25 minutes, we sat in the parking lot waiting for a total of 55 minutes.  We spoke with the manager, Jeff, and he was entirely unapologetic and unprofessional.  Very disappointing experience.  Won&amp;#39;t be back.", "rating": 1, "date": "3/3/2017"}, {"text": "My spouse and I had lunch today at The Cheesecake Factory at Polaris and had a wonderful, delicious meal. I had the lunch fish and chips and she the Asian lettuce wraps, both produced empty plates and full stomachs. Almost too full to order a slice of Turtle Pecan Cheesecake, but why come to this place and not get cheesecake!  We devoured it, a food of the Gods. Service was great, the only issue 38.00 for lunch. Lucky for us we had a gift card. An overall great experience", "rating": 4, "date": "9/7/2016"}, {"text": "I was very disappointed by the manager&amp;#39;s way of handling a mix up with my meal. They did not bring out the correct order until our table was done eating. The manager basically told me they gave me more shrimp than I should have gotten and a lame apology. I think I will spend my money somewhere else next time.on the other hand our server was nice.", "rating": 1, "date": "1/17/2016"}, {"text": "OK ...... So .... The Cheesecake Factory IS One of my Favorite Places to Dine ! ...... The Cheesecake of course ..is great ...BUT ..... I come here for the huge menu filled with so much goooood foooood its hard to choose what to get each time ....BUT ... I usually get the CHICKEN MARSALA ...Which is some of the best Ive had anywhere ...... Cool joint ....great vibe ....fun place to dine with Family , Friends , Love kitties .......    5 MEOOOOOWS !     :)", "rating": 5, "date": "9/30/2011"}, {"text": "I have mixed feelings based on a mixed experience at the Cheesecake Factory.  First, lets get the primary concern out of the way... The Cheesecake was outstanding.  I mean, wow, it was really good.  Rich and creamy, the Oreo Cheesecake that I had order was perfection, and worth a trip down to Columbus all by itself.  My wife&amp;#39;s cheesecake was equally as good.  The rest of the meal is where things didn&amp;#39;t go so well.  My burger, which I ordered medium, was over well done and dry.  My wife had a shrimp plate and got food poisoning from it.  The kid&amp;#39;s food looked average in every way.  Considering the price of the food, I would advise anyone just to stay away from their meals.  Cheesecake should be the only reason anyone goes to cheesecake factory.  If you go for that reason alone, you will be more than happy.  Anything else, just stay away.", "rating": 3, "date": "8/16/2013"}, {"text": "First off, I hate chains. Why go to chains when there are so many other amazing local places? Maybe it&amp;#39;s just me but chain food is bleh. <br&gt;<br&gt;First the menu itself if way too large...and they also needed cleaned. I hate sticky menus so we&amp;#39;ll list it as a pet peeve. With pages and pages to pick from it can often be a tedious task. Also, the prices are a bit ridiculous for again, chain food. <br&gt;<br&gt;I don&amp;#39;t have a problem paying $15+ for a dish but from a chain, I do. I&amp;#39;d rather go spend that money elsewhere on something that is probably prepared fresh and with local ingredients. Anyways, off my pedestal about chains.<br&gt;<br&gt;My fiance and I couldn&amp;#39;t decide what to order so we went with the quesadillas, pot-stickers and calamari. Apps for dinner, sounds good to me. All  3 were delicious, my favorite being the quesadillas. Warm, filled with cheese and chicken and filling! The guac was also really good. Potstickers OK and wasn&amp;#39;t digging the fried calamari. But overall, it was all good.<br&gt;<br&gt;And Dessert! The reason why I would come here....in the past. I was SO disappointed in my cheesecake. All 5 of us got something different and I got the tiramasu. Love cheesecake and tiramasu so I thought this would be perfect.<br&gt;<br&gt;My piece, for $8,50 was tiny and everyone even commented on that. To say it was 1/2 the size of the others would be pushing it. TINY! Also, I miss the crust on this cheesecake like the others had. Also, def. more tiramasu than cheesecake. And the whip cream is so nasty, def. couldn&amp;#39;t get that down. <br&gt;<br&gt;Overall, for the price, I&amp;#39;d rather spend my $$$ elsewhere. Way better food and desserts to be had.", "rating": 3, "date": "8/1/2011"}, {"text": "I usually don&amp;#39;t get disappointed when coming to a Cheesecake Factory, but this experience was just awful. It was a Tuesday night and was a little bit busier than we expected so we decided to sit at the bar. Once we did, it took 20 minutes before someone asked us what we wanted to drink. Then it took another 15 minutes to get a mojito and two water. Then it took another 30 minutes for someone to come and take our order. Service was just horrible. And the food was just the same. Clearly it was let out too long, I got the steak medallions and they were all top charred. My vegetables were charred, wilted, and tiny. I am a stickler for good service, and this place just not have it. Won&amp;#39;t be visiting this location ever again.", "rating": 1, "date": "12/30/2015"}, {"text": "Over-rated.<br&gt;<br&gt;If I was only going for cheeseake then Cheesecake Factory could get four stars, but the food is meh at best.  Yes the menu is huge, but bigger isn&amp;#39;t always better.  The pasta is gummy, the mashed potatoes seem microwaved, and the portions are giant in a way that is unappealing to me.<br&gt;<br&gt;They don&amp;#39;t take reservations so if you&amp;#39;re going at a busy time be ready to wait.  Or just get some cheesecake to go and save yourself the bother.", "rating": 2, "date": "9/19/2011"}, {"text": "Came to the cheese cake factory at Polaris for dinner. It was a usual CCF experience. The food was excellent!  We had ordered the Mac &amp;amp; Cheese burger and Romano crusted chicken (add extra sauce on the side ) and split them. They both are very tasty meals. We sat at the bar and the service was good. A usual down fall at the CCF is the service but tonight we were pleased. We decided to get some desert to eat half now an take have home we ordered a red velvet OMG delicious !! Then the banana cream... Tasted good but such a small slice. It was 1/2 the size of the red velvet   Was told it was pre cut by corporate ?? They don&amp;#39;t make them on location?? So I&amp;#39;m Paying 8$ for a pie that is who knows how old and not fresh??  We had to order a third piece to take home because I wasn&amp;#39;t sharing mine   A little disappointed :/", "rating": 2, "date": "10/6/2013"}, {"text": "Their food is absolutely wonderful.  They give HUGE portions, so you can usually get 3 meals out of 1.  Their cheesecake is also remarkable.  The lemon raspberry creme is super light and fluffy.  The red velvet is wonderful as well.  I would give them 100 stars if I could.  This is a favorite of my whole family. My family from out of town come to Columbus to specifically eat here it&amp;#39;s so good.", "rating": 5, "date": "4/7/2014"}, {"text": "As good as any other Cheesecake Factory.  Whenever I come the waiting staff is great and the food is always on point.  I suggest it!", "rating": 5, "date": "3/16/2014"}, {"text": "Want to drop a couple pounds real quick? Then this is the place for you!  For those of you unfamiliar with Norovirus, it is basically an &amp;#34;oral-fecal&amp;#34; illness that derives from poor sanitation combined with food handling. Now I&amp;#39;m no expert, but with some information from the Columbus &amp;amp; Morrow County health departments &amp;amp; some research on my end, I&amp;#39;ve become very familiar.  You see, I was the first of a handful of people to be afflicted with said Norovirus through the Cheesecake Factory of Polaris. Thankfully some of us came forward &amp;amp; reported it to the health department &amp;amp; they are taking it very seriously. I didn&amp;#39;t know this was possible, so next time you suspect you&amp;#39;ve been contaminated by a restaurant, give them a call. Don&amp;#39;t expect it to end there though folks, as they need to be able to prove your food-borne illness came from that particular restaurant, so if you are willing (&amp;amp; I was, as this was my VERY EXPENSIVE birthday dinner), they will ask that you submit stool samples. Specific stool samples. Embarrassing? Yup. But we have a baby, so poop is something I&amp;#39;m a little accustomed to, unfortunately. Anyhow, I digress. My husband was so excited to take me out for a nice birthday dinner.  We just moved here &amp;amp; I&amp;#39;ve never been to any Cheesecake Factory, so I was stoked! The service? It was good! Our food? It too, was good! The first time..... The other 8-10 times when it came back up, not so good. Trying to care for a 1 year old the day after your birthday with volcanic eruptions coming out of both ends? Priceless... Their only saving grace is that our son didn&amp;#39;t get sick as well.<br&gt;<br&gt;Apparently Yelp filters out reviews in an attempts to save businesses from what may be competitors, who are saying bad things about their business. It&amp;#39;s a shame because this place gave me FOOD POISONING... In my opinion, this should be the first thing fellow Yelpers see...", "rating": 1, "date": "3/2/2013"}, {"text": "I tour the country for my job, my favorite chain of restaurants for group dining is cheesecake factory without a doubt!  <br&gt;<br&gt;I ate at this one last year right after it opened and gain this year just a couple days ago, and the service is on point and the atmosphere is just phenomenal, of-course this is the case at most Cheesecake Factories...<br&gt;<br&gt;I tried a few of the small plates from the new special menu, leave it to Cheesecake factory to make an already great menu even better!<br&gt;<br&gt;I had one of the small plate mushroom pizettes it was just wonderful!  Crisp thin crust, copious amounts of mushrooms, and perfect flavors of herbs and cheese wonderfulness!  I also had the Ahi tuna Tar Tar with avocado salad it was great (It could have had more tuna) the flavor was rich yet delicate the consistency was great and it had these really naughty fresh fries flour tortilla chips to scoop it on, another winner!  I also had a salad that was not on the menu it all it was heavily salted and peppered arugula with raisins and nuts and happiness all about the salt quotient was almost overwhelming and i suspect for many it would have been but I still really liked it!  <br&gt;<br&gt;The table also split some bacon wrapped cheese stuffed dates and they were amazing! HMMMMMMM<br&gt;<br&gt;We also split a piece of Lemon Raspberry cheesecake this is one of my favorites and it is always good!<br&gt;<br&gt;Gosh Darn I love The Cheesecake Factory, I just hope this new small plate menu becomes a permanent addition to all Cheesecake Factories!", "rating": 4, "date": "8/7/2009"}, {"text": "Let me say first that the Cheesecake itself is excellent.  Being the restaurant namesake, I had high expectations and they definitely delivered.  But... the rest of the food is not so great and a bit on the expensive side.  ($16 for runny Chicken Fettuccine, anyone???)  The ambiance is a bit strange as well.  There were some nicer dressed folks out for a nice Saturday night dinner, mixed in with mall folks in their shorts and flip-flops.  Might be back for a lunch, but would opt to share an entree, or maybe just follow the crowd at the dessert line instead. :)", "rating": 2, "date": "8/19/2013"}, {"text": "The food was ok. Main course serving was big, we shared between two adults and one child. <br&gt;<br&gt;We went there on Sunday at 1:20pm. The receiptionist told us that the wait time was 30 minutes. We were seated at 2:15pm. If we knew that we had to wait 55 minutes we would have gone to another place. I felt that our time was not well respected. While I was waiting i watched people coming and the receiptionist told everybody that the wait time was 30 munites. Hmmmm.... If people already have waited for 30 minutes, they are likely to keep waiting. But i did not like the strategy. <br&gt;<br&gt;After we were seated at 2:15pm, our order was taken at 2:40pm. We clearly put the menu down and waited for someone to take our order at 2:20pm. <br&gt;<br&gt;Our salad arrived at 3:10pm, main course 3:35pm, dessert 4pm and left at 4:15pm. My daughter missed her gym class since i did not expect the lunch to be almost 3 hour long. <br&gt;<br&gt;So if you have something scheduled, dont take the waiting time that the receiptionist tells seriously, or double it.", "rating": 2, "date": "11/2/2014"}, {"text": "Cheesecake Factory is one of our favorite places to go for birthday celebrations.  I was excited when I called and was able to do call ahead seating.  We arrived on time and were seated.  This is where our experience went downhill.  Our food took nearly 40 minutes and the restaurant was not overly busy.  Our waitress provided the worst service I have experienced in 10+ years.  When our food arrived our kids grilled cheese was so black our kids would not eat it.  Our kids meatball was over cooked and dry.  The kids cheeseburger was lacking cheese.  Upon receiving our food our waitress never checked on us.  We had to stop her for cheese (for the burger), refills (which we never received), and the bill (which was not on 2 checks as requested).  The two adult meals were fine.  <br&gt;We celebrated a child&amp;#39;s birthday and that took another 20+ minutes which we we&amp;#39;re ready to walk out the door when they finally brought the desserts.  We have had good experiences at the Polaris location prior to today.  If this waitress was a trainee then she still needed her trainer for support.  Very disappointing birthday dinner.", "rating": 1, "date": "7/19/2016"}, {"text": "If you are not american you should not come his location. Service is bad and the manager try to excuse. Not they fault. When the crab cake come the bread haven&amp;#39;t be serviced. And the crab cake is cold. So we ask the service change new one. And he toke back with plate too. And wait for another 10 mins still not ready and we so hungry so I ask the service can we have some bread first. And he go get bread and didn&amp;#39;t bring us new plate and don&amp;#39;t explain why the bread take so long. And late the manager bring out new crab cake and apologize to us about first was cold. And I ask can I have plate please and why the bread take so long and he said cause it&amp;#39;s new. And I said In this case you should let your customer know about it. And he forgot our plate so I have to ask the host to get us plate. And one of the plate is dirty.  what the shame. And when the service give our check didn&amp;#39;t said anything just  drop and left. Wtf the service name is Christ", "rating": 1, "date": "7/16/2016"}, {"text": "My husband and I visited the Cheesecake Factory for the first time this past Saturday night.  We found a $25.00 gift card that we had received for a gift a while back and forgotten about, so it was an unexpected treat.<br&gt;<br&gt;My first thought upon walking in was how noisy the place was.  One traverses a rather long hallway when entering from the parking lot, and you are unable to see the interior of the restaurant...but boy could you hear it!!  It didn&amp;#39;t seem so bad when we got in there, but we did opt to eat outside on the patio, somewhat unusual for us.<br&gt;<br&gt;The server was terrific.  He was attentive enough, but not overly so...I hate it when they hand around.  He did warn us about the size of the entrees, and that was very much appreciated.  He was also  ready with answers about entrees and opinions about which he liked better.  I KNOW I might  not like what the server likes, but when I ask them what they like, it&amp;#39;s nice when they&amp;#39;ve actually sampled the items on the menus enough to have preferences!!<br&gt;<br&gt;I ordered the barbecued salmon.  It came with smashed potatoes, onion rings, and corn succotash.  The salmon was fine, cooked okay, but rather ordinary.  So were the potatoes and onions rings...pretty much what you&amp;#39;d expect and a thousand other restaurants.  They weren&amp;#39;t hot...so that&amp;#39;s a ding.  The corn succotash was delicious...I was expecting corn with lima beans or green beans.  No!!  It was full of cubed zucchini and yellow squash and tasted hot and fresh.<br&gt;<br&gt;My husband had a steak, cooked medium rare, which came with two enormous batter fried onion rings and french fries.  Wayyyyy too many french fries, and not very good at that--not too hot and not too crispy.  His steak was cooked perfectly, though, and the onion rings were much better than the stringy kind that came with my salmon (I know cuz I stole one when he wasn&amp;#39;t looking).  <br&gt;<br&gt;I had to pack up half of my meal...and I noticed many other diners had to do the same.  I still felt like I needed to be rolled out, so even cheesecake &amp;#34;to go&amp;#34; was not an option for me.  My husband had a piece of carrot cake cheesecake packed up.  He ate it later that evening and pronounced it delicious.<br&gt;<br&gt;All in all, though, the overall experience was just okay.  About what I would expect from a much closer to my house Max &amp;amp; Erma&amp;#39;s, Fridays, or Applebee&amp;#39;s, but it seemed more expensive.  I was glad we had the gift card.  I&amp;#39;d eat there again if I were in a group and it was a group decision but probably wouldn&amp;#39;t choose it over many other venues.", "rating": 3, "date": "8/9/2010"}, {"text": "Loud restaurant with mediocre food &amp;amp; slow service. Maybe if the waiters didn&amp;#39;t have to spend so much time running back &amp;amp; forth to the kitchen to fetch takeout boxes because of the large (yet over-priced) entrees they could focus on giving faster service. If it weren&amp;#39;t for the cheesecake..the slices have gotten smaller, by the way..there wouldn&amp;#39;t be anything special about the place. Don&amp;#39;t care to go back.", "rating": 1, "date": "5/8/2016"}, {"text": "As long as you don&amp;#39;t mind waiting an hour to get a seat, Cheesecake Factory is always a win! The food is amazing, the portions are ridiculous, and the service has always been stellar. Even though they are always slammed, they always seem to have enough staff to accommodate the mad rush. Oh, and the avocado rolls are a must have!", "rating": 5, "date": "4/19/2016"}, {"text": "The Sheppard pie waz amazing very flavorful. The salad on the hand was severely under dressed. Waitress was very knowledgeable.  The only sad part I can&amp;#39;t eat the cheese cake", "rating": 4, "date": "11/29/2013"}, {"text": "First time to this location, sadly will be the last.  We were a party of 7. 5 adults and 2 kids celebrating a families birthday.  We were seated and greeted promptly but the good ended there.  Our food 50 minutes to arrive. Whrn it did 2 people received their food.  No mention or recognition from the server as the people all around us who were seated after us were served.  About 10 minutes later 2 more plates came.  5 more minutes and the final plate and kids meal arrived.This kids pizza was so hot and the cashew chicken looked like someones reheated burnt leftovers, with no cashews.  All of the requests were forgotten such as no tomatoes, add cheese on a burger.  The manager came out and looked embarrassed by what the cashew chicken looked like and offered to replace but they were out of cashews and as we were already there over an hour we declined. He took care of the dish but the whole experience was lack luster. None of us ordered  dessert bc we were just over the whole experience.  Hope you get it together Cheesecake, reminded me of Applebee&amp;#39;s....", "rating": 2, "date": "6/13/2014"}, {"text": "Always the best food with the best consistent quality.  Cheesecake is always amazing - at times the service quality has declined - but to keep up with such an extensive Menu is always impressive.", "rating": 5, "date": "4/1/2013"}, {"text": "I usually only come here for the Caesar salad and a few hunks of bread.", "rating": 3, "date": "4/4/2013"}, {"text": "Why didn&amp;#39;t you make us feel special tonight??  You usually make us feel special.  It didn&amp;#39;t help much that for hubbs and my 23rd wedding anniversary we were sat beside two young couples and their 4 kids, they thought their high-chairs were jungle-gyms and standing on chairs and wreaking havoc on our intimate dinner.  You were cute and all, but I&amp;#39;m not sure how many times you came close to kicking my arm.... your annoyance over-rode any cuteness you had.  Cashew Chicken was wonderful, again.  Hubbs had BBQ Bacon Cheeseburger....which he adores!  Good job!", "rating": 4, "date": "5/19/2012"}, {"text": "This place has a HUGE selection on their menu.  From burgers, to pasta, to Asian, to salads, to pizza, anything you could really want.  I&amp;#39;ve always had great service when I go to any cheesecake restaurant.  I also LOVE their large selection of cheesecakes.  I&amp;#39;ve had several different types, and all of them are so incredibly delicious!!  I highly recommend this place for anyone.  :)", "rating": 4, "date": "2/15/2012"}, {"text": "I love cheesecake factory. I love how they have little bit of EVERYTHING. I come here regularly after work, trying different things. my favorite so far is their chicken wrap. If you never had it before, definitely try their chicken wrap. it comes with 3 different sauces and they are delicious. you can tell they are a little bit over priced, but as long as it is constant and good I don&amp;#39;t mind coming here every now and then!", "rating": 4, "date": "10/25/2014"}, {"text": "We arrive - we are seated in the patio because the inside of the restaurant is just too cold.  The person who greeted us (ended up being the manager) was pleasant.  She seated us.<br&gt;So I am there with my beau...we are waiting.  It takes like 10 minutes for our waiter to come...his name is Kerrod (very rude and unfriendly &amp;amp; his work uniform was dirty which makes me concerned for him to handle my food).  So we only ask for water &amp;amp; a glass of wine...it takes him almost another 15 minutes to bring that back to our table - there are at least 5 other parties that sit down and he barely comes back.  My boyfriend asked him were we allotted bread.  His response &amp;#34;oh yea, I guess I can bring it....&amp;#34;....so we wait.  Then he takes our order.  My boyfriend has never been here so he is asking questions.  Kerrod seemed annoyed and he ended up placing our order.  I got a salad and my boyfriend ordered a burger.  Others are sat down and we still don&amp;#39;t have our food.  I am getting annoyed so we decide to leave.  The manager (Allison) comes over and asks us what&amp;#39;s the problem.  I tell her about the food and service...oh did I mention our waiter came out with sunglasses on??  Weird....so we are about to leave.  She rushes and gets our food and gives it to us on the house.  We wait almost an hour and my boyfriend&amp;#39;s burger was cold...maybe because it was sitting in back the whole time.  I was so annoyed I  left my food.  Allison tried to accommodate us.  She gave us a gift card which was nice, but dang, did we have to go thru such drastic measures?  Our waiter had a crappy attitude from the word go....so he ruined my boyfriend&amp;#39;s first experience at the factory...", "rating": 2, "date": "8/13/2014"}, {"text": "The Cheesecake Factory is a dressed up casual dining resturaunt that boasts great cheesecake. The food is overpriced, and the beer selection is awful. The wine list is ok, but as with any restaurant the markup is rediculous. I only come here when family gives me no choice.", "rating": 3, "date": "6/13/2012"}, {"text": "I ate once at a Cheesecake Factory long ago and was so unimpressed and disgusted at the never ate at one again apart from running in and grabbing a piece of cheesecake to go every now and then. But just recently dined here with 9 coworkers. I really just went to be polite, but ended up having a great time! I was incredibly impressed with our service. The waiter we had was amazing, he was so attentive even with our large party, and he was super polite and checked on us just enough to make sure everything was going well the entire night. <br&gt;<br&gt;I also like how they now have a &amp;#34;skinnylicious&amp;#34; menu, completely separate from the main menu. It takes all of the regular menu items (and a few new items I think) and combine them all in one little separate menu with items ranging in calorie content, but nothing over 600 calories, if I remember correctly. It was really convenient, especially since I&amp;#39;ve always been wary of their meals after reading all the horror stories about how they notoriously have 1000+ calorie dishes and don&amp;#39;t post their nutrition info. And they don&amp;#39;t skimp on the portions either, they are just healthier options at the same prices!", "rating": 4, "date": "8/29/2011"}, {"text": "outstanding service and great tasting food with phenominal desserts.we had oreo cookie cheese cake and it was so awesome.right texture with little crunch to it.our entire experince i would rate it definately 5/5", "rating": 5, "date": "11/4/2014"}, {"text": "Went here last night with my wife.  The issue was sub par service and poor execution.  They were out of orange bitters for the whiskey smash which i understand you run out of ingredients from time to time, but the gentlemen told me its probably just as good as it is with them...if thats the case why have them in There in the first place.  I changed my drink to another one off the whiskey section which was rather good.  We each had a salad, I had a caesar which the dressing had 0 flavor and my wofes side salad had A similar issue.  I always order the hibachi steak with the wasabi mash.  Unfortunately there was NO wasabi in the mash and there was something off with the taste of the steak so i only ate a couple pieces.  The mash potatoes were good, just not what i wanted (note:  I will almost never send food back to a kitchen as Ive heard too many horror stories, which is why I didnt mention it).  My wife ordered the southwest chicken sandwich which she loved and took home the leftovers.  Most engaged waiters would notice that someone ate half of their meal and question why they don&amp;#39;t want to take it home especially when part of the party takes theirs and the other doesnt, but ours had no questions.  Maybe my expectations are too high, but I think cheesecake factory is going the way of all corporate restaurants when they get too big, they struggle to maintain product quality and service.", "rating": 2, "date": "9/3/2016"}, {"text": "I don&amp;#39;t like the sauce of chicken sandwich，too sweet！But i love the blueberry cheesecake and would purchase it again!", "rating": 4, "date": "11/12/2014"}, {"text": "I soooo love the Cheesecake Factory I always get the chicken tortillas and banana cheesecake it&amp;#39;s so great anytime there&amp;#39;s a problem they resolve it quickly... I love Cheesecake Factory!!!", "rating": 5, "date": "3/14/2011"}, {"text": "The new Polaris location is now open.  We had the opportunity to sample the menu and service before presented to the public and it was great.  The place looks beautiful but no surprises.  They are churning these places out like there is no tomorrow.  I once thought of the CF at Easton as such a treat- a unique place in Columbus to plan your night around but they are becoming so cookie cutter.  Disappointed in that- but not the menu.", "rating": 4, "date": "8/10/2008"}, {"text": "My boyfriend and I decided to come back to the first real date we had for our anniversary. The first time we visited I wasn&amp;#39;t stoked on the food, but he loved his dish. This time around we both were in love with our food, our waiter and our cheesecake. <br&gt;The server was very nice and attentive, even put up with my boyfriend being a bit tipsy and obnoxious.", "rating": 5, "date": "7/23/2012"}, {"text": "Very friendly staff, blue cheese BLT burger was very good. Cheesecake heaven!", "rating": 4, "date": "4/26/2012"}, {"text": "The name says it all. It is truly a factory and they are making money hand over fist from all the fools that live near Polaris.. We felt like we are in Disney world meaning everything is fake. They take a warehouse fill it with a ton of crap and god the high school kids with their parents credit cards pack the place. It&amp;#39;s so loud, the menu is full of cheese ads and the food quality is only a step above you local Applebee&amp;#39;s. save your time and money. You will wait an hour or more jammed in the lobby like live stock before a tag team of servers take your order and bring the factory food.", "rating": 1, "date": "2/28/2013"}, {"text": "I had such horrific service and mediocre food tonight that I will NEVER be back here.  I was charged tax and gratuity on a take-out order, so that one meal, one appetizer and 2 pieces of cheesecake totaled more than $60. Ummm...get over yourself, CF.  Your food isn&amp;#39;t THAT good.  I honestly would have been happier if I had just gone to McDonald&amp;#39;s.  Oh, and they screwed up my order to boot. I won&amp;#39;t go into specifics since I could write a freaking novel about what went wrong tonight...but trust me.  Stay away.", "rating": 1, "date": "1/16/2014"}, {"text": "My future sister in law was in town &amp;amp; wanted pasta.  We decided on the Cheesecake Factory as she could get pasta &amp;amp; we could get whatever else PLUS my fiance had been dying to taste their latest cheesecake creation. My chicken romano was good as always &amp;amp; she very much enjoyed her fettucini alfredo.  The fiance got the meatloaf with mashed potatoes.  He said the meatloaf was good, but the mashed potatoes were not so great.  I love mashed potatoes so I stole a bite.  I found them worse than the usual instant mashed potatoes you find at restaurants - dry &amp;amp; hard once they were stuck in their sand-castle mold.  We finished our dinner &amp;amp; on to the real reason we came: cheesecake.  <br&gt;<br&gt;The fiance had been salivating over the new Hershey&amp;#39;s cheesecake.  Well, too bad because they were out of it.  They were also out of some soup earlier in the evening.  We mentioned that the Hershey&amp;#39;s cheesecake was the reason we came there that evening &amp;amp; our waiter said nothing.  I pointed out that their name is the cheesecake FACTORY - make some more.  Then our waiter had the gall to say the BAKERY (again implying they could produce more cheesecake not run out of it for the evening) was busy &amp;amp; we would have to wait approximately 15 minutes for our cheesecake.  The fiance settled on Godiva &amp;amp; his sister &amp;amp; I shared the tiramasu cheesecake.  I like tiramasu, I like cheesecake, so I thought I would love it.  But it was the first time I have ever not liked a slice from the Cheesecake Factory.  It was dry and boring.  Well we will go back to try the Hershey&amp;#39;s cheescake, but will not waste our time or money with eating dinner.", "rating": 3, "date": "9/26/2011"}, {"text": "i went there for lunch yesterday. the place is beautiful. I think they overprice. their food is nothing special. service very good though. spend about $60 before tips for lunch of two people. i don&amp;#39;t thing i will be back.", "rating": 2, "date": "7/16/2010"}]}