{"address": ["1251 US Highway 31 N", "Greenwood, IN 46142"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.5], [2, 3.5], [3, 3.5], [4, 4.0], [5, 4.0], [6, 3.5], [7, 3.0], [8, 3.0], [9, 2.5], [10, 3.0], [11, 3.0]], "2017": [[0, 4.0], [1, 4.0], [2, 3.5], [3, 4.0], [4, 4.0], [5, 4.0], [6, 3.5], [7, 3.5], [8, 3.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2020": [[0, 2.5], [1, 3.0], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 4.0], [7, 4.0], [8, 4.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2018": [[0, 3.5], [1, 3.5], [2, 3.0], [3, 3.0], [4, 3.5], [5, 3.5], [6, 3.5], [7, 4.0], [8, 3.5], [9, 3.5], [10, 3.5], [11, 3.5]], "2021": [[0, 4.0], [1, 4.0]]}, "reviews": [{"text": "This of course is one of my favorites! Their menu is huge! So many options but I have my go tos. The location is great. They can get busy so prepare to be patient. The bread they bring js addicting though! Definitely one of my top choices in Greenwood!", "rating": 5, "date": "1/31/2020"}, {"text": "Amazing time great food, excellent service attentive to special occasion!<br&gt;Party of 6 and never had to wait for anything, very nice time", "rating": 5, "date": "9/5/2020"}, {"text": "I usually avoid going to restaurants with large groups.  It almost always brings out the flaws in planning and service, and sometimes, the kitchen.  If this were a small business, I wouldn&amp;#39;t even review the place.  But because my grandson wanted to have his birthday party at the Cheesecake Factory, his parents planned for about a dozen of us to meet and dine there.<br&gt;<br&gt;I hold these large national chains which host groups to a different standard.  They ought to know how to do it through experience.  So when they seat a large group with half the people seated on benches, the other half on chairs, that means the servers have to reach over the chair people to place the food and fill the water of the bench people.  I must have been banged into or had the waitress put her hand on my shoulder half a dozen times during the meal.  And I wasn&amp;#39;t the only one.  I don&amp;#39;t really blame her because she had to serve and didn&amp;#39;t want to spill the food.  But she could have asked for help passing the food or excused herself for the contact.  It&amp;#39;s a bad set up and the management is to blame.<br&gt;<br&gt;Of course, with a large group, you always have someone get a foul up on their meal and so my son&amp;#39;s meal had to be replaced meaning he didn&amp;#39;t eat until nearly everyone else had finished.  <br&gt;<br&gt;The portion sizes on some of the meals are ridiculously large.  You can tell by the number of take home bags that this is a strategy of the company to get advertising from the colorful bags that they wrap the take home food in.  At the table next to us, every single person had a colorful bag to carry around the mall property after their meal.<br&gt;<br&gt;The only thing I enjoyed about the experience was that my meal was actually quite good.  (I asked and got mixed reviews from the others dining with me.)  I ordered the Chicken Riesling and thought it had a really good grilled flavor on the chicken and the wine sauce (with onions, garlic, and mushrooms) was delicious.<br&gt;<br&gt;Apparently they have a &amp;#34;skinnilicious&amp;#34; menu for folks wanting to watch their calories.  According to my wife, they were still quite high in calories.  Again, the portion size is priced in the $mid-teens for most items so you just don&amp;#39;t eat the food you pay for if you want to not gain weight.  <br&gt;<br&gt;Sorry, I can&amp;#39;t recommend this place unless you go in a small group and have a huge appetite.<br&gt;<br&gt;Review #1118", "rating": 3, "date": "7/16/2018"}, {"text": "The food are great &amp;amp; lots of selections to choose from.  There&amp;#39;s always a long line &amp;amp; it would be nice if they have more booth than tables quite crowded &amp;amp; loud.  We love their cakes but because it got too expensive we just quit the dessert.  But other than that it&amp;#39;s so far the best!", "rating": 4, "date": "2/29/2020"}, {"text": "We had a party of 9 and they wouldn&amp;#39;t seat us until every person was inside the building. We have a toddler so that made things hard. Then the service was SO slow. I get that we had a big party of people but still. It was hard to even get a refill. I thought we were never going to leave! Good food and cheesecake but wow they need to do something about the speed", "rating": 3, "date": "12/2/2019"}, {"text": "What a wonderful meal I had at the Cheesecake Factory! I had never been there before and I went with a group of red hat ladies out to lunch at the Cheesecake Factory. It was a little expensive but the food was delicious. I then had the pineapple upside down cheesecake and it melted in your mouth. The waiter his name was Bob and he was wonderful and served us fast and friendly. The place was clean and had plenty of parking.", "rating": 5, "date": "10/17/2019"}, {"text": "I&amp;#39;ve never eaten here, but it was so delicious! I had the flatbread pizza and a Caesar salad and it was delicious! The pizza was yummy and the salad was super tasty and I also had a s&amp;#39;mores cheesecake slice and that was tasty! Our waitress was  Elizabeth and she was amazing! She was so kind and very tentative to anything we needed. Plus the restaurant itself was really pretty. I loved it!", "rating": 5, "date": "7/30/2020"}, {"text": "I enjoy The Cheesecake Factory - they have a huge menu, which now includes skinny options. We don&amp;#39;t eat here often because it is pretty expensive and if two people also want to get cheesecake, you can easily spend $50 on a meal. <br&gt;<br&gt;There is also always at least an hour wait, which is a deterrent for us. So while I enjoy it, I do think there are better and more affordable options.", "rating": 3, "date": "5/13/2019"}, {"text": "Great food and cheesecake as always. Unfortunately,&amp;#39;our party was too big and we had to sit separately. We tried to make the best of it. Lemon cheesecake is always the best!", "rating": 5, "date": "7/26/2020"}, {"text": "Chicken Madura is fresh crisp asparagus <br&gt;Creamy sauce <br&gt;Red potato&amp;#39;s are creamy Peyton the server is being great <br&gt;Mushrooms and sauce are mixing on well with the chicken making it moist<br&gt;What shall I get for desert I wonder", "rating": 4, "date": "2/6/2019"}, {"text": "We always go here for our birthday&amp;#39;s and anniversary dinners. We always have an amazing experience each time and the staff are always friendly and helpful.", "rating": 5, "date": "9/13/2020"}, {"text": "Excruciatingly slow service. Mediocre food. Ugly decor.<br&gt;<br&gt;During the one hour wait between being seated and actually getting our food, my friends and I tried to figure out how this place stays in business. We decided it&amp;#39;s because this is the compromise restaurant when you&amp;#39;re eating out with other people. The menu is so large that no one can veto the place because they serve a bit of everything.<br&gt;<br&gt;I only eat here every year or two, which is evidently how long it takes me to forget how much I hate it. I&amp;#39;m not sure why there&amp;#39;s always a line to be seated considering how mediocre everything is. The decor is really ugly too, so there&amp;#39;s not even anything interesting to look at while you wait.<br&gt;<br&gt;They were running out of bread when we arrived, which is why we didn&amp;#39;t get any pumpernickel, just the tough unappetizing baguettes. And when I needed a refill, the waitress disappeared with my glass for five minutes instead of bringing me a new one, so they were probably running out of dishes too.", "rating": 2, "date": "7/21/2019"}, {"text": "Good chain. I do like their choices but dang they can make for a tough decision! <br&gt;<br&gt;If they could do a fat free cheesecake, I&amp;#39;d be all over it!", "rating": 4, "date": "7/11/2019"}, {"text": "I am a frequent at the Cheesecake Factory. I love the ambiance in the restaurant, service is always friendly. The menu has so much variety, though it is massive to the point of overwhelming at times. This time, I got the chicken Romano. It&amp;#39;s pretty simple overall, but the spaghetti has a creamy marinara sauce and the chicken is so light and crispy. The Cinnabon cheesecake is new and really good. Light cinnamon flavor, creamy cheesecake, and a nice crunch that I can&amp;#39;t quite place. service was great too!", "rating": 5, "date": "6/15/2019"}, {"text": "Look...<br&gt;<br&gt;I know cheesecake factory is a chain. And I know that most of their dishes have approximately 10,000 calories. But I don&amp;#39;t care, I&amp;#39;m a sucker for this place.<br&gt;<br&gt;I usually go here for birthdays or other special occasions (since Bloomington doesn&amp;#39;t have a Cheesecake Factory :( ) but everything I&amp;#39;ve had here is incredible. Obviously the cheesecakes are amazing (red velvet and chocolate peanut butter especially) but all of the pasta dishes I&amp;#39;ve tried are so good too.<br&gt;<br&gt;And the fried Mac and cheese balls. I have dreams about this appetizer. So fattening, so bad for you... but I love it. You simply can&amp;#39;t come to the Cheesecake Factory without getting their cheesecake and fried Mac and cheese balls. <br&gt;<br&gt;Definitely my favorite restaurant chain of all time, I would come here all the time if I had the money, wouldn&amp;#39;t gain any weight and there was one closer to me.", "rating": 5, "date": "8/2/2018"}, {"text": "We held a gender reveal scavenger hunt party yesterday, with The Cheesecake Factory being the final destination! They were all accommodating and Kim was the best server we have had there yet! She Did an amazing job tending to all 20 of us and could more than handle all of us and then some!!! Our food all came out at the exact same time and everything was hot and yummy!!! Kuddos to you Kim and thank you again for making my goddaughter&amp;#39;s special day perfect!!!! The only complaint was the temperature of the restraunt. We did however tell Kim it was ridiculously hot and she alerted the manager. After that we felt the air start cooling so they must have adjusted the air. The service was definitely a 10 out of 5 and the food was perfect too! Go and ask for Kim and tell her the gender party sent you!!!", "rating": 4, "date": "9/3/2018"}, {"text": "Funny thing is, I use to think all they had was chessecake. lol<br&gt;The menu is so big you could go there for a couple weeks before you get all the menu.<br&gt;The Chessecake is to die for!<br&gt;The service is average. I just think for the amount of money you spend there that your server should really be &amp;#34;On it&amp;#34;.<br&gt;It is extremely loud in there. And you better choose a booth. If you do not.. the tables are so close together you can lean over and whisper in the guy or girls ear at the next table.<br&gt;Overall if you geta booth and you keep your server&amp;#39;s attention, it is a pleasant night out. And Banana Cream Cheesecake is my fav.<br&gt;OH.. one recommendation.. Try the &amp;#34;Bang Bang Chicken and Shrimp&amp;#34; It is absolutely fantastic!", "rating": 4, "date": "5/2/2019"}, {"text": "Great food but a bit on the higher scale of casual dining for price. Dessert selection, if you like cheesecake look no further. Wonderful selection of entree&amp;#39;s, very broad selection.", "rating": 5, "date": "2/2/2020"}, {"text": "I&amp;#39;m not always a big fan of chain restaurants but when I really want to go to a place I can rely on for great food and service, I know I can rely on the Cheesecake Factory. I really enjoy the Skinnilicious menu that has calories listed and offers lower calorie choices. But when I write, &amp;#34;lower calorie options,&amp;#34; I&amp;#39;m not talking about just a handful of dishes to choose from. I&amp;#39;m talking like over 30. The shrimp skinnilicious tacos are my favorite and always taste so good.  They even offer alcoholic beverages on this menu for you if you want to partake but don&amp;#39;t want to overdo it with the sugar. <br&gt;<br&gt;The Linda&amp;#39;s Fudge Cake is so good, it should be illegal. Haha. In all honesty, it&amp;#39;s incredible. Their cakes are all so amazing and worth every penny.", "rating": 4, "date": "8/25/2018"}, {"text": "Love love love! The Cheesecake Factory! Always gives great service! Note that they have a kiddie plate with bananas and other fruits for littles to partake before food come if you don&amp;#39;t want them to fill up on bread and butter! Best menu item to have are the buffalo blast (basically fried buffalo chicken). Oh! of course the cheesecake is delish!", "rating": 5, "date": "6/17/2019"}, {"text": "I was never even  able to order.  I called and was put on hold for 40 minutes on one phone and 15 minutes on another phone, it took 3 try&amp;#39;s for someone to tell me it would be better to place an online order.  I gave up and went to get Outback Steak House.  I understand being busy but that was ridiculous at least tell me the first time to online order and not keep transferring me to the bakery where supposedly someone should take your order when you know no one is going to answer.", "rating": 1, "date": "8/14/2020"}, {"text": "Love Cheesecake Factory! <br&gt;I usually get their caesar salad, which is the best caesar salad anywhere. <br&gt;I tried out their Pasta Carbonara without the bacon. It&amp;#39;s pretty good, but it definitely does have a lot of garlic in it. <br&gt;I also had their hot chocolate - I recommend, it&amp;#39;s very chocolate-y.", "rating": 5, "date": "11/24/2018"}, {"text": "Honestly this review is very frustrating... I came in today to pick up some cheesecakes for a office. Which I often do in the pharmaceutical industry.. but today I had an hour to kill. So I attempted to get a table while I waited... I tried the bar. Bar was full. So I went back to the front to notify the hostess and informed her...she told me I could sit and wait in the waiting area. Then i watched her seat multiple people. I ended up working on my laptop in the waiting area because the HOSTESS was completely rude and NEVER SAT ME. I watched her seat MULTIPLE people.. families. Person after person. NOT ONCE did she ask me for a a seat at a table!!! Or if I wanted one!!! Instead I sat and waited. I spend lots of money at this location whether it&amp;#39;s for lunch meetings in the area or getting orders for a office and I&amp;#39;ve never been so offended by the POOR SERVICE!!  Pay very close attention to who you make a hostess because the fact I couldn&amp;#39;t get a table today and spent 50 on cheesecakes to go. UNACCEPTABLE!!! I&amp;#39;m honestly offended by the service I received and you can&amp;#39;t help but wonder...why", "rating": 1, "date": "10/9/2019"}, {"text": "The food is seriously amazing. I am never let down with the food. However. I did make reservations and arrived on time to my reservations and was told i had to wait 30 min. Still for my table. I understand they are very busy all the time however if you make reservations you should be able to get in immediately at the time of your reservations.", "rating": 4, "date": "8/2/2020"}, {"text": "Went here for my friends birthday and my food was a disappointment because I got spicy chicken and the chicken wasn&amp;#39;t spicy so why did they call it spicy chicken if it&amp;#39;s not spicy ?? I did how ever get a Carmel cheesecake which was good", "rating": 2, "date": "1/27/2020"}, {"text": "I always, always enjoy a trip to The Cheesecake Factory!  It is such a treat!<br&gt;<br&gt;This particular location is very inviting and the staff really does a great job of providing quality service.  One dish that is always a &amp;#34;go-to&amp;#34; for me is the &amp;#34;Chicken Parmesan Sandwich&amp;#34;.  It is really yummy and a considerably sized sandwich; in fact, I typically bring half of it home with me!  The cheesecake is also outstanding, (of course)!  I have tried a variety of them, but I always come back to the &amp;#34;White Chocolate Raspberry Truffle&amp;#34;!  <br&gt;<br&gt;As I mentioned, I always feel very well taken care of by the staff of The Cheesecake Factory and always, always leave with a full belly!  The only thing I will warn about is their menu prices; the food is slightly on the expensive side.  I can understand the prices of their cheesecake, but the food is a little high to make it a regular place to dine for me!<br&gt;<br&gt;Nonetheless, try out their cheesecake...and if you come to eat, make SURE you save room for it!", "rating": 4, "date": "3/16/2018"}, {"text": "Love the atmosphere and the food. Large selection and so good! Steak Diane is my favorite. Yum!", "rating": 5, "date": "7/17/2020"}, {"text": "The Cheesecake Factory in Greenwood is a frequent date night spot for my boyfriend and I. I love the skinnylicious menu. It&amp;#39;s great how I can get a really filling meal under 500 calories!  My boyfriend loves the variety of food.<br&gt;<br&gt;Our most current trip was good. Our waitress was really nice and attentive. The bread we got before our meal was delicious and warm. I ordered the tomato, basil, and mozzarella flat bread. I had no complaints it was delicious! My boyfriend ordered the spaghetti and meatballs. He was a little disappointed in this time because it tasted slightly bland. <br&gt;<br&gt;We also ordered the Oreo cheesecake and it was fantastic. It was a huge slice! My boyfriend and I couldn&amp;#39;t finish even half of it. The waitress boxed it up and we had later the next day. <br&gt;<br&gt;Overall, the Cheesecake Factory is great. It is a very welcoming and comforting environment. I like nice chain restaurants like this because I know what to expect and I know that I will have a great experience! I would suggest this location especially! It&amp;#39;s a great ending to a day full of shopping at Greenwood Park Mall!", "rating": 4, "date": "3/20/2018"}, {"text": "Cheesecake Factory is nothing if not consistent. I am not a big fan of a lot of chain restaurants, but Cheesecake Factory surprises me with how good everything I&amp;#39;ve ordered is. The preparation is always correct and the seasoning is spot-on. We&amp;#39;ve dined-in countless times and ordered carry-out and DoorDash, and I don&amp;#39;t think we&amp;#39;ve ever had a bad experience. That counts for a lot. Also, I am really pleased with how they handle kids: cut-up fruit brought to the table so the kiddos don&amp;#39;t have to wait to eat is a considerate gesture that keeps me coming back.<br&gt;<br&gt;Finally, I don&amp;#39;t even like cheesecake but I can&amp;#39;t deny their cheesecake (and other desserts) are pretty fab.<br&gt;<br&gt;One last thing: every time I go I think about this article regarding the Cheesecake Factory decor, which is very entertaining in itself. <a href=\"/redir?url=https%3A%2F%2Fwww.avclub.com%2Flets-now-consider-the-postmodern-design-hellscape-of-1820544989&amp;amp;s=183b75ebbe433dd371e8141fb550f0bff5ba27a47c056ac75cb198fa1dc55e39\" target=\"_blank\" rel=\"nofollow\"&gt;avclub.com/lets-now-cons…</a&gt;", "rating": 5, "date": "2/21/2019"}, {"text": "Who doesn&amp;#39;t love cheesecake...a restaurant designed around cheesecake...yes please!  I honestly have to say that I don&amp;#39;t frequent this restaurant, but I can&amp;#39;t tell you why.  It just never crosses my mind when thinking of places to eat, even though I love their desserts.  But, this time when a friend wanted to take me out for my birthday, I wanted to go somewhere I don&amp;#39;t frequent.  I was really happy I chose TCF.  I ordered the turkey and avocado sandwich which came with a salad, from the &amp;#34;skinny&amp;#34; menu.  It was soo delicious and filling.  My friend ordered the herb crusted chicken with the green beans and mashed potatoes.  There were a couple complaints about the warmth of the food, but the waitress made it right immediately with little wait time.  <br&gt;<br&gt;We had a hard time deciding on which cheesecake to order for dessert because they have so many to choose from.  We finally settled on the white chocolate raspberry and lemon meringue.  Both were heavenly.  They load the pieces with whipped cream!  I will definitely start frequenting this restaurant more often.", "rating": 4, "date": "2/17/2017"}, {"text": "The food here is amazing. We are celebrating my daughters Birthday today and the staff did an excellent job in helping us celebrate her day. I am looking forward to the white chocolate macadamia caramel cheesecake. The staff is here is amazing along with the quality of the food and service.", "rating": 4, "date": "6/30/2018"}, {"text": "I like the atmosphere in The Cheesecake Factory.  The tall ceilings help manage the noise and the soft warm yellow hues create a relaxing ambience.  The menus are extensive here.  They have 2 pages dedicated to cheesecakes!  We had the lemon raspberry cheesecake today and it was big enough for us to split.  My Mom had the Chicken Pot pie which she thought was more like chicken soup with a bun on top.  She ate all of it with a spoon, which is quite impressive because she eats so very little usually.  I had a chicken and shrimp dish with rice that was spicy enough after adding a generous amount is tobasco. It would be hard for someone not to find something good to eat here.  With a wide variety of salads, small plates, sandwiches, and flat breads the menu choices seem endless.", "rating": 4, "date": "1/25/2018"}, {"text": "Fraud. This place is sad. Piss poor customer service. Cheese Cake is already high priced. You should at least meet the cost challenge. You do not. Go away!", "rating": 1, "date": "12/17/2019"}, {"text": "The Cheesecake Factory is one of my favorite restaurants. Last time, I went here for dinner and the staff was really nice. I ordered Bistro Shrimp Pasta and it was really good :)", "rating": 4, "date": "5/20/2019"}, {"text": "Pretty underwhelmed by my experience. All our napkins were dirty, silverware was sticky and had pieces of tissue literally stuck to it, and my plate wasn&amp;#39;t clean either. Our server said it was cuz their water softener machine thing was broken or something last night so the silverware wasn&amp;#39;t necessarily &amp;#34;dirty&amp;#34;. Our server also gave us no time to make any changes to our order. I asked for the hibachi steak and then after I told him how I wanted it cooked he immediately asked &amp;#34;okay who&amp;#39;s next&amp;#34; I had to interrupt and ask to substitute my sides. Food was good though so I&amp;#39;m not mad.", "rating": 3, "date": "6/16/2019"}, {"text": "11 dollars for a sangria that was all ice. $7 for a side of asparagus. Service was terrible. Food was good though.", "rating": 3, "date": "6/11/2020"}, {"text": "This place was terrible. They shouldn&amp;#39;t have so many things on the menu if they can&amp;#39;t get simple items right. I got the chicken Parmesan and the pasta had absolutely no sauce. The chicken had no flavor at all. We also had fish and chips. I&amp;#39;m guessing the oil was old. The fries were the worst fries ever and the fish was rubbery. Extremely disappointed.", "rating": 3, "date": "8/30/2019"}, {"text": "The slowest service ever!!!!!! Very nice waitress but she seemed to be a complete air head. She couldn&amp;#39;t handle to two tables that were given to her. She continually forgot to give refills and or check on our food. But of course she put all blame on the kitchen. Management semi apologized for the inconvenience. I&amp;#39;ll stick with the Keystone at the Crossing location.", "rating": 1, "date": "8/29/2019"}, {"text": "It was awful. I only gave it 2 stars because the food was acceptable.  They crammed people into a space too small for that many tables. Server and busboy were cussing and talking about how much they want to quit.", "rating": 2, "date": "11/8/2019"}, {"text": "During my most recent visit, I was looking for lunch during Lent on a Friday. This is tricky unless you want breadsticks or pizza, neither of which I wanted. I was so happy to see options on the menu and even more so to actually eat the avocado eggrolls. They are so flavorful! It&amp;#39;s actually an appetizer and I could only eat about half. As always, the portions are generous here.<br&gt;<br&gt;During previous visits, I have really enjoyed the factory chopped salad. It has a great mix of chicken, bacon, lettuce, dressing, and a whole bunch of other tasty ingredients... including avocado. I continually visit this location because more often than not I am seated right away, have friendly service, and really delicious food. Oh, and I hear the cheesecake isn&amp;#39;t bad either.", "rating": 5, "date": "3/26/2017"}, {"text": "This is definitely a place you go to when you are not starving. There is always a waiting time. I personally think the menu is overwhelming and overpriced. The service is excellent and the cheesecake is delicious.", "rating": 4, "date": "3/21/2018"}, {"text": "Went today for lunch...food was delicious! And the pumpkin cheesecake tasted awesome. Just like a pumpkin pie, but better! Filet minion was cooked perfectly and could&amp;#39;ve cut with a butter knife. There was a five min wait, which was surprising since they were quite busy, so really glad it was quick. Took my one year old and they were super sweet to her and didn&amp;#39;t act all annoyed that I had a small child with me. The waitress even brought her a small bowl of sliced bananas while we waited for our food. Totally appreciated that our waitress thought to do that, bc not many restaurants are accommodating. I would definitely eat there again. It was pricey, but the amount of food was really good for the amount you&amp;#39;re paying. Only downside was there were so many options on the menu that it was a little overwhelming, but it wasn&amp;#39;t really a BAD thing! I was expecting it to be ok food with great dessert, but I was pleasantly surprised and the food was great!", "rating": 5, "date": "11/3/2019"}, {"text": "Think twice before ordering cheesecakes for your next special event.  Last night we received a cheesecake to bring to a birthday party.  Everyone was excited until we tried cutting into it, frozen solid.  Not partly frozen -- frozen.  Granted, this cheese cake had already been out for an hour so I&amp;#39;m pretty sure it was in a blast chiller all day.  It was very disappointing and we obviously didn&amp;#39;t have hours to let it thaw.  <br&gt;<br&gt;Very disappointing, we&amp;#39;ve ordered cheesecakes before in person and through Doordash and they are never like this.  Always chilled but still creamy and delicious.  The manager, Melissa, was uncaring and rude.  When I mentioned that this is the first time this has happened (over many orders), she said the delivery guy probably had the heat in his vehicle on all the other times.  That response was pretty unprofessional and pretty much brushed our concerns to the side.  If we&amp;#39;re spending $40 on a cheesecake, this should not be the experience we get.  If we wanted a frozen cheesecake to thaw out overnight in the fridge, we would&amp;#39;ve grabbed one at Costco.  Customer service goes a long way, the lack thereof really soured my experience - particularly with this location.", "rating": 1, "date": "11/30/2018"}, {"text": "I took the family Christmas shopping at Greenwood mall and we decided to eat at the cheese cake factory. The first thing that jumps out at you there is their decor. Very fancy and interesting.  It was clean, the service was ok.  The food was pretty good but not great.  I thought the prices were high for the amount of food we got and the quality.", "rating": 3, "date": "11/25/2018"}, {"text": "The korean fried cauliflower alone would be enough to ordinarily warrant a 4 star review.  It is by far one of the best appetizers I have ever had.  However, the overall experience was tainted due to their very poor ability to handle the coexistence of COVID-19 and a crowded Saturday night.  They had solid attempts to keep their employees and customers safe by continuing to offer curbside carryout and requiring employees to have masks (keyword there being HAVE - not wear correctly).  We pulled up for curbside carryout after ordering and paying online to find that there were no spots available.  So, we decided to attempt to go in for our order only to find that there was a ridiculous amount of people not wearing masks waiting for tables and for carryout with multiple customer complaints coming from every direction.  The takeout cashier had a mask, but was wearing it so that it only covered his chin (last I checked, our chins are not the part of our face that produce germ particles into the air) and was confronted by another customer for wearing gloves that were not being changed after handling everyone&amp;#39;s money.  Hey Cheesecake Factory - just having your employees use hand sanitizer after each customer with no gloves would probably be more sanitary.  Meanwhile, another customer was complaining to the manager (who, by the way, was standing right next to this chin-mask-wearing employee without saying a word) that their carryout order that they had been waiting for over an hour for had been sitting on a counter for an hour.  It was a complete mess in all facets.  As delicious as the cauliflower is, I&amp;#39;m not sure if it is worth risking our sanity and safety to go back for it right now.", "rating": 3, "date": "6/28/2020"}, {"text": "I visited this Cheesecake Factory on December 14th for my little sisters 19th birthday. Overall the food was pretty good and everyone was happy with that and the cheese cakes we all ordered. The reason why I took off two stars was because of the service being such a disappointment. It wasn&amp;#39;t uncommon for the server to cut us off mid conversation or to take something off the table and run off before being able to make a request for something that was missing. Hopefully they can improve the", "rating": 3, "date": "12/21/2018"}, {"text": "Hayden was the best sever ever. The food was wonderful and the service was even better. We will definitely be back!", "rating": 5, "date": "3/14/2020"}, {"text": "Very sad to say cleanliness was very poor silverware was not cleaned coffee cups also the same manager was notified she came out and said sorry the couple across from us found hair in the food they had .This is the first time that we have gave a one star rating for any restaurant. Don&amp;#39;t think we will be back", "rating": 1, "date": "8/4/2019"}, {"text": "Usually, when we come here, it&amp;#39;s great. For my birthday we went here mostly because it was the only place open as late as we went. We opted not to have an appetizer and only got waters because to be honest none of the drinks seemed appetizing. I ordered the pasta carbonara and my boyfriend ordered the Ahi Tuna. Neither were good. However, our cheesecake was great, they seem to never mess up the one thing they&amp;#39;re supposed to be good at.<br&gt;<br&gt;We aren&amp;#39;t the type of people to send food back so we just fought through about one-fourth of both of our meals. Mine was overly oily and the flavor was very dull. His dish was too soggy and he felt the tuna wasn&amp;#39;t fresh. I took mine home because I felt like I could salvage it by using some homemade marinara sauce or some alfredo sauce to make it taste better and not be as oily. This somewhat worked except for the fact that about 30 minutes after consuming it, it all came back up. Food poisoning maybe? Who knows, but we will not be returning sadly except to have a slice of cake and that is all.", "rating": 2, "date": "9/15/2018"}, {"text": "Burger was dry and not med well.  Waitress said she had a lot of favorites.  How can you have eaten all those things and worked their for 2 days.  Way too much food on menu.  Overpriced too.  Food was hot I will give them that and fries where hot too.  Also bread that came out tasted like it just came off the shelf sitting out.  Was tough as shoe leather!  Asked for fresher bread and I think they just microwaved it!  Still aweful.  Next time we&amp;#39;ll just go to Texas Roadhouse for a better meal!", "rating": 2, "date": "8/9/2019"}, {"text": "I love this place! My favorite is the pasta &amp;amp; cheese. I do feel like they could do better on birthday things. Free slice or drink? No all they do is write happy birthday and a candle and sing if you&amp;#39;d like. It&amp;#39;s a place I&amp;#39;ll go on special occasions only tho as it&amp;#39;s fairly pricy, but very delicious", "rating": 5, "date": "6/11/2019"}, {"text": "Got a slice of Lemon Raspberry Cheesecake near closing time last night. There was still a lot of people trying to grab a slice before they close. The wait wasn&amp;#39;t that long tho. I&amp;#39;ve been helped within 5 minutes. No picture of the slice I got. I was too excited to eat my cheesecake. I&amp;#39;m on a mission to try everything that I could eat.", "rating": 3, "date": "7/20/2018"}, {"text": "Of course the Cheescake is amazing but you better plan on getting that to go because the food is to die for ......This place always gets my vote!!!!", "rating": 5, "date": "7/13/2019"}, {"text": "Dinner time! We had a 30 minute wait.<br&gt;<br&gt;Food was great but service was slow. :)<br&gt;<br&gt;We waited for a good 10 minutes for our waiter to get us a refill.<br&gt;<br&gt;The miso salmon was so good.", "rating": 3, "date": "8/4/2017"}, {"text": "1-2-20 Went with my husband last night about 7. The wait to be seated wasn&amp;#39;t too bad. We were surprised to have a 20 minute wait on a Thursday night, but again, wasn&amp;#39;t too bad. They sat us at a tiny table with couples, also at tiny tables on either side of us. We didn&amp;#39;t love that. Felt like we were all out to dinner together instead of in private parties. Apparently that&amp;#39;s just what they do, so I&amp;#39;m not sure it&amp;#39;s relevant to my review. This was my first time there. The food was &amp;#34;meh&amp;#34; at best. We ordered the buffalo wings for an appetizer and the waitress told us we didn&amp;#39;t have enough, but that we had to tell her there wasn&amp;#39;t enough so she could bring us some more. That was weird, and all that for four more tiny wings. They were practically bite sized. The whole appetizer wasn&amp;#39;t worth the $11 they charge. My husband ordered some sort of shrimp dish and the shrimp was pretty chewy. I ordered the steak tacos and they literally looked like an appetizer when they came to the table. Four teeny tiny &amp;#34;tacos&amp;#34; with barely any steak and a bunch of slimy onions. I mention the onions because in the menu it says &amp;#34;crispy onions&amp;#34; and there were maybe 3 on each &amp;#34;taco&amp;#34;. The service was pretty good. The waitress was pretty attentive and we got refills, but she took our straws and brought the same ones back each time which is a health code violation. The cheesecake was good, but I can&amp;#39;t see driving an hour and a half to eat there again. Not the experience you think you&amp;#39;re going to have for a $95 meal. Yes, that includes the generous tip my husband left, because for the most part the service was good.", "rating": 2, "date": "1/3/2020"}, {"text": "My boyfriend and I had both never tried the Cheesecake Factory before and decided to try it out on a Friday night for our anniversary. We both had friends that told us it wasn&amp;#39;t worth it, but we actually both really enjoyed it. I don&amp;#39;t think we would have picked it as our anniversary dinner if we had been there previously and knew what to expect, but we are still glad we tried it. <br&gt;<br&gt;We were seated immediately around 7:30pm on a Friday night, but the table was less than ideal. We were at one of those really long booth areas with small tables and then chairs on the other side. Convenient when pushed together for large parties, inconvenient on a date when there are two different couples approximately 2 feet away on each side. We could hear both conversations throughout the dinner. We were disappointed we got sat there because there were plenty of open tables, but I&amp;#39;m sure they had their reasons so we didn&amp;#39;t ask for a change. <br&gt;<br&gt;We each got an alcoholic drink. Sangria for me, pineapple mule for my boyfriend. The menu didn&amp;#39;t have prices for alcohol and once we got the bill we were less than thrilled to see they were $10.50 each. Pretty steep price. <br&gt;<br&gt;The meal includes complimentary bread and butter, which was good, but not spectacular. I ordered the chicken parmasean pizza style -- it was DELICIOUS. It was off the &amp;#34;special&amp;#34; menu inserted. It was a large chicken coated in bread crumbs and covered in marinara in cheese. My boyfriend truly thought it was a pizza. Then on top there was angel hair pasta in alfredo sauce. I loved it -- he wished he had ordered it too. He got the four cheese pasta and added chicken. He liked his, but was definitely envious of mine. The servings were big enough to fill us and we both still took leftovers.  <br&gt;<br&gt;We got a slice of the Adam&amp;#39;s peanut butter and caramel cheesecake to go. Very good and just the right size for us to share! The menu also didn&amp;#39;t list prices for cheesecake -- $8 for this particular slice (not sure if that varies??)<br&gt;<br&gt;Overall -- delicious food and we were glad we finally tried the place out. However, the meal was $75 for two people before tip which was pretty pricey. This is definitely not a place that I would go to &amp;#34;just because.&amp;#34; Yet it didn&amp;#39;t really fit the bill as a formal restaurant either. It was one of those in the middle type restaurants -- great and expensive food but still casual (and crawling with kids)", "rating": 3, "date": "6/9/2017"}, {"text": "My daughter who is on crutches slipped when first walked in the door floors were greasy. Not 1 employee came to check on her. Then 6 people seated in a booth it was so hot in there couldnt hardly breathe mind you eat. Server was good at least though.about the only thing nice I can say. Will never eat there again food was unimpressive and high priced for the quality", "rating": 2, "date": "7/20/2019"}, {"text": "Felt like I was the last person on the planet not to have been to the Cheesecake Factory, and now wish I had kept it that way. My son chose this place to celebrate his engagement with family, as it is a favorite of his fiance. When we arrived, we were told it would be a 20 minute wait for our party of 8, not bad. After 25 minutes we asked how much longer, and the hostess said they were clearing a table for us right then. 15 minutes later, my son asked if the table was ready and the hostess told him, Oh, I told the busser, but they didn&amp;#39;t do it, so they are doing it now. There were at least 30 people waiting to be seated and a larger table was left dirty and un-bussed for over 20 minutes? Not a great start. Our waitress seemed very rushed and stressed. She was not friendly, nor did she ask if we were perhaps celebrating something, as is usually the case with a group. it took a considerable mount of time to get our beverages, and then she disappeared without taking the food order. The very extensive menu (200 items, really?) leads me to wonder about quality and how much is actually made to order. the food took a very long time to arrive, so much so that my son&amp;#39;s fiance was embarassed and upset that she recommended the CF - not a good way to feel on such a happy day. When the food arrived, there were mistakes with 5 out of 8 meals. We asked for no sauce with the kids chicken strips, but it came with two different sauces, overflowing onto the chicken so that he only ate part of them. One burger had no cheese, but should have; both of the rare burgers were overdone; the med-well burger was under done. A food runner brought most of the meals, then we waitress came by and asked if everything was ok, and we mentioned that they took one burger back to put cheese on it, and another burger went back. She said, &amp;#34;ok, so they&amp;#39;re handling it.&amp;#34; and walked away. Obviously she couldn&amp;#39;t have cared less. We all decided against having dessert, fearing it would be another 45 minute wait. Sweet potato fires, usually a favorite of mine were bland and unseasoned, the shrimp alfredo was so disappointing that family member didn&amp;#39;t even take her leftovers home. the waitress asked how we wanted the check split, but then didn&amp;#39;t do it the way we asked. Overall, not impressed with the food, very disappointed in the service, and am still a bit angry that they spoiled a special day for my son and his bride-to-be.", "rating": 1, "date": "1/16/2020"}, {"text": "Don&amp;#39;t go around dinner time because the wait will be long. We had an early dinner and got a table right away (5pm on a Saturday). The waiter was very attentive and did a great job refilling our drinks.  My only complaint was that during dessert I ordered a latte and my latte came in a tall glass instead of a coffee cup.  The complementary bread was delicious - hot, crusty on the outside and soft and chewy on the inside.  I could seriously fill up on the bread alone.  We ordered mango chicken from their new menu and it was delicious. There were small chunks of mango in the dish with the perfect ratio of mango and chicken. I will be getting this dish again when I return!!!", "rating": 4, "date": "7/30/2017"}, {"text": "Yes this is a chain and yes it&amp;#39;s at the mall. Which on a Saturday you just know going in it&amp;#39;s gonna be packed. But my experience today made all that so worth it. Fabulous service. Wonderful food, apps tater tots. Chicken lettuce tacos that my sis loved. Really pleased with lunch here today.", "rating": 5, "date": "3/30/2019"}, {"text": "Moby Dick, A Tale of Two City&amp;#39;s, and the menu at the cheesecake factory are the 3 longest books I&amp;#39;ve ever read. Talk about options! There menu is so big, it&amp;#39;s almost overwhelming. The food is decent and the cheesecake is great. We didn&amp;#39;t see Penny from the big bang theory though. I wanted to put some cheesecake in my girlfriend purse to smuggle it in to the movies, but she wasn&amp;#39;t having it.", "rating": 4, "date": "5/5/2018"}, {"text": "The food is average, I have tried several different dishes. He never leaves me wanting to come back. But the cheesecake is a different story. They have the absolute best cheesecake! I love going in and getting a to go cheesecake!", "rating": 4, "date": "6/3/2018"}, {"text": "Made a reservation here on yelp. We got there an hour early went ahead and checked in and was told we would have a table in 20 minutes and we would be txted. After 30 I went and asked the gal who was taking names what was going on she said she wasn&amp;#39;t sure but seen are name called. She said she was contacting management. Waiting outside side for another 20 minutes. Finally she said we could go inside. Went inside and was told that they called are name and didn&amp;#39;t page us like that said they would and someone else took the table and was prepared for us but they were getting a table prepared for us. At this time is is now are reservation time so we have been here an hour at this point waiting for a table. Finally 20 minutes later, now waiting for an hours and 20 minutes we get seated. They had put two tables together in a corner for us. No discount on the food, so free appetizer for the extended wait even with a reservation. Spent over a $100 on my family to eat and I can say I won&amp;#39;t be going back and tho it was nice to finally eat out again after months of not being able to this truly reminds me of how poor customer service is and why I never ate out in the first place. Sever was nice and done her job well but management needs to learn how to treat customers! I was there on 6/12/2020 my reservation was for 5:45 and I check in at 4:40 and wasn&amp;#39;t seated till 6:10pm.", "rating": 1, "date": "6/13/2020"}, {"text": "Overall a great experience as far as food and service, but there were a few draw backs to dining at the Cheesecake Factory. <br&gt;<br&gt;Walking in your greeted by the hostess in their spacious waiting area and right in front of you is a giant display of all of their mouth watering cheesecake options. Seriously, so mouth watering. The average wait time is about 15-30 minutes but lucky for us, we were seated immediately. <br&gt;<br&gt;The menu has a WIDE variety of food ranging from pasta and salad to steaks and shrimp. The portions provided are very large and definitely something you&amp;#39;ll have to pack up and take home. However the cocktails were pricey for what they were. Nothing special or unique. Just expensive. (AND THE MULES ARE NOT IN COPPER CUPS!? What?) <br&gt;<br&gt;The restaurant has many seating options for all different party sizes. (Long tables, high tops, bar top, booths, outdoor patio) whatever you may prefer they&amp;#39;ll have a table for you. My main complaint is that the tables are very close to each other and it makes for a impersonal experience in my opinion. Also, this place is extremely expensive for what it is, we paid $90 for two people. Glad I got to try it but I probably wouldn&amp;#39;t return.", "rating": 3, "date": "6/11/2017"}, {"text": "I love this place.<br&gt;<br&gt;Their pasta is what our kids get and it really is some of the best kids pasta I&amp;#39;ve had.<br&gt;<br&gt;I got the chicken avocado club, one of my favorite sandwiches.  Soooooo good!<br&gt;<br&gt;So is the bang bang chicken and shrimp.<br&gt;<br&gt;Obviously cheesecake is ridiculously good", "rating": 5, "date": "6/11/2018"}, {"text": "I did not like this place. The food wasnt that good, and the food took a long time to get to the table, everyone was loud, the service was HORRIBLE. When I say horrible, I mean it. But the cake was OK", "rating": 2, "date": "6/12/2019"}, {"text": "One if my faves. Beautiful interiors, clean. Fast service. Endless vegetarian options available and a variety of food choices available. <br&gt;<br&gt;Our server was very warm and personable. It was my son&amp;#39;s birthday and Jordan or server went an extra mile to make him feel special by giving him a chance to share his opinion and experience that night with dinner. She was very patient with us as we were deciding and made great recommendations! <br&gt;<br&gt;We had a great time! <br&gt;<br&gt;Quality and quantity: perfect. <br&gt;Great service. <br&gt;Great food choices. <br&gt;<br&gt;I am glad they continue to serve on the South side of Indy.", "rating": 5, "date": "5/7/2017"}, {"text": "So this has been an interesting trip to Cheesecake Factory. Let me start by saying that usually the food  and service is always a welcoming experience. However on this occasion I wasn&amp;#39;t not impressed. <br&gt;<br&gt;Where do I start<br&gt;Between sitting down, getting drinks, and served bread - 20min<br&gt;It looked like they were full and short on staff, the servers were rushing and you can hear things breaking (maybe it&amp;#39;s because we were close to the kitchen) <br&gt;<br&gt;Ordered food - lettuce wraps, two chicken dishes and two pasta dishes<br&gt;<br&gt;Lettuce wraps: delicious esp with the sauce pairings <br&gt;<br&gt;Pasta dishes not bad: Nice twist adding multi colored pasta with the jambalaya. Very unique. Chipotle pasta wasn&amp;#39;t as spicy as it was before and was a lil heavy on the tortilla strips and light on the chicken. I&amp;#39;m not a big meat eater so for me to say light on chicken means not much was given. <br&gt;<br&gt;The chicken dishes - very dry chicken. One was a lemon herb chicken. It looked like they ran out of the chicken and served us something else instead. This person always orders this dish and it always came with a half chicken in sauce with two sides. This is the first time in 3yrs we saw otherwise. Plus you couldn&amp;#39;t taste the citrus that made this dish so popular. What was more disappointing was that two servers came when a complaint was placed, both saying that the recipe was changed and a new chicken is out. Now if that were the case, then the menu should be updated. I didn&amp;#39;t have an opportunity to take a picture (my Bf was all let&amp;#39;s eat no pictures) but I wish I did to demonstrate the difference. The waitress literally argued with us after she said the dish can be changed since we were unhappy with the chicken. We promptly opened the menu, showed her the description and showed her the chicken. No more words were said. <br&gt;<br&gt;I don&amp;#39;t know how to process this experience. Often times I expect better from large chain restaurants but more times I&amp;#39;m proven that the bigger the chain, the less quality of service, and less attention is paid to preparing a well crafted dish. <br&gt;<br&gt;Since this was a rare occurrence, we probably will return but if the food quality is anything like we encountered, this will no longer be on the list of preferred eats.", "rating": 3, "date": "5/28/2018"}, {"text": "We had a wonderful oreMother&amp;#39;s day brunch with my mother.  We all ended up ordering from the Skinnylicious menu and it was fantastic !!  We have the chicken soft tacos with avacado and the pickled side salad--wow!! So healthy and delicious !  We also had the  Angel hair pasta and shrimp for less than 500 calories !  And finally, Mom had the chicken salad sandwhich and loaded baked potato soup.  It was so nice that hey were open for brunch.  They open at 9 on Mother&amp;#39;s Day!! Highly recommend for food quality and excellent service and comfortable atmosphere!", "rating": 5, "date": "5/11/2019"}, {"text": "I love Cheesecake Factory! Never had a bad meal. The service is usually really good. The veggie burger is a favorite and the salad with roasted beets. Also, everything else! You cannot go wrong!", "rating": 5, "date": "4/7/2019"}, {"text": "I hadn&amp;#39;t been to Cheesecake Factory in a year. But I always love to come in the fall for the pumpkin cheesecake. The food was good, a little greedy but tasty. We opted to have only appetizers this evening. We had the crab dip, buffalo bites, Brussels sprouts, and Korean cauliflower. Out of all of the dishes, I highly recommend the Korean inspired cauliflower dish. It was crispy with great flavor with a creamy sauce.", "rating": 4, "date": "11/17/2018"}, {"text": "Trying new things and loooving every bit of it. My new favorite is the ahi cappacio (not sure if I&amp;#39;m spelling it right) but it was absolutely divine. The cream of chicken soup with artichokes and mushrooms....delicious. And my entree, the fish tacos were really good too. <br&gt;<br&gt;My tummy was super happy to be here today.", "rating": 4, "date": "2/1/2015"}, {"text": "Great ambiance. A very nice restaurant. The menu is vast. It is very easy to get lost with so many different choices. We had appetizers, soup and salad, steak, pasta, and dessert. Everything was good and everyone said they were satisfied and that they would order it again. I really appreciate the honesty of the waitstaff to be blunt and speak the truth. I always ask the staff because they eat there all of the time. I highly recommend the dessert. If you have to, eat dessert first.", "rating": 4, "date": "10/7/2017"}, {"text": "This is one of our favorite places to eat. The clam chowder was AH-MAZING!! The Cajun Jambalaya was a bit too &amp;#34;tomatoey&amp;#34; for me, but it was fantastic. Also, the service was great...&amp;amp; our waiter, Brandon Summers, did a great job!!<br&gt;<br&gt;One funny thing that happened during this visit... When the young lady brought us our food, she offered to put fresh parmesan cheese on it. Of course, we said &amp;#39;yes!&amp;#39; When she started to grate the block of cheese, it broke &amp;amp; flew out of her hand &amp;amp; it hit me in the side of the head!! LOL. Too funny. We wound up getting the whole block left at our table. LOL!!<br&gt;<br&gt;At any rate, this is a great place to eat. Happy dining!!", "rating": 5, "date": "9/16/2016"}, {"text": "Unfortunately, I don&amp;#39;t think we will be back to the Greenwood Cheesecake Factory location. Our food was fine and our server Peyton had a terrific personality and great attitude despite being slammed in a bar area she had to herself. I could even forgive that the hostess stand messed up and underquoted our wait time by nearly double (quoted 40 min, but sat in us 75 for a table of 5). What did it for me was witnessing the hosts tell a manager the situation, watching the manager come to the host stand and avoid eye contact and refuse to acknowledge us. Then when we were being seated, I expressed my displeasure about the excessive wait time to the host who said she would have a manager come speak with us. <br&gt;<br&gt;A manager never came. It would have cost the restaurant nothing to simply come and say, &amp;#34;we messed up and we are sorry you had to wait longer than we told you, but we are glad you stayed. Let us make it up to you.&amp;#34; Instead, nothing. <br&gt;<br&gt;The ONLY reason we didn&amp;#39;t leave was we were celebrating my step-daughter&amp;#39;s birthday and she chose this restaurant 2 weeks ago and has been looking forward to it. We have celebrated her birthday there every year for the last 4 years. We waited because it was what she wanted, but she even said afterwards that she won&amp;#39;t choose here next year because no one ever came to apologize. <br&gt;<br&gt;I worked in restaurants all through high school, college, and graduate school. I know how things work. We weren&amp;#39;t looking for anything for free, but a manager who cares about their restaurant and their server knows that evaluating the satisfaction or lack thereof by a patron is fundamental to the success of the business. It is essential to ensure a server isn&amp;#39;t subjected to an irrationally angry customer as much as it is to win over a dissatisfied customer and ensure they come back. <br&gt;<br&gt;As far as chain restaurants go, I had considered (up until recently) Cheesecake Factory a step above the likes of Applebee&amp;#39;s, Chili&amp;#39;s, or TGI Friday&amp;#39;s. This experience tonight showed me it isn&amp;#39;t any better from a service perspective, it just has a larger menu and a higher price point. <br&gt;<br&gt;For the money, there are better places to go like Stone Creek, Fireside, or Revel. Skip the chains and spend your money with locally owned establishments who value their customers. That&amp;#39;s what my family will be doing from now on when dining out on the south side.", "rating": 2, "date": "9/24/2017"}, {"text": "Their cheesecake is great and worth every penny. However, their food is over priced and their steaks have never been cooked the way we have ordered them the 4 times we have visited and the 2 times we have utilized DoorDash. The restaurant is beautiful but the lighting is horrible and that is coming from someone with perfect vision. You literally need a flashlight to read the menu.", "rating": 3, "date": "1/21/2019"}, {"text": "Always love the Cheesecake Factory. <br&gt;<br&gt;This was a Monday night and we wanted to try on a less busy night which it wasn&amp;#39;t busy at all.  We got seated right away.  Once seated we where asked for drinks.  We got water.  <br&gt;<br&gt;On my wife&amp;#39;s water cup it looked like it had not been washed.  It had major floatage.  Something crusty around the inside.  She didn&amp;#39;t notice until after drinking for a a few minutes. <br&gt;<br&gt;We let waiter know.  He immediately got fresh cup. <br&gt;<br&gt;The food after that was very tasty and the service was very good. <br&gt;<br&gt;Bread was good as well.", "rating": 3, "date": "3/27/2016"}, {"text": "Food was great but in my opinion it was WAY OVER PRICED. Probably won&amp;#39;t return. I don&amp;#39;t mind paying for a great meal but some items were way over priced for the portions and quantity of the food.", "rating": 4, "date": "8/31/2019"}, {"text": "Really enjoyed our visit there. The food was delicious as were the Mai Tais. Our waiter Matthew was great. Will definitely go back.", "rating": 5, "date": "2/27/2019"}, {"text": "I love The Cheesecake Factory. Their menu has something for everyone! They have vegetarian options, spicy options, gluten free options, lighter healthier options for people who are being health conscious. Their cheesecake is divine. I highly recommend the white chocolate raspberry cheesecake! They also have non-cheesecake desserts like tiramisu. They even have sugar free low carb options for cheesecake and a bowl of strawberries for something sweet but light. They have cuisine influenced by many cultures and comfort food items. A full bar for those who like to have a drink and many appetizers and small plates for a smaller meal. Sunday brunch is delicious and the bread they bring to the table is so good!", "rating": 5, "date": "9/13/2018"}, {"text": "Just like Webber grill and Bonefish, Cheesecake is one of those chain locations I have no real problem with. Not sure I would have spent my own money here but had a $50 gift card with 2 complimentary slices of cheese cake, so yeah I&amp;#39;m down.<br&gt;<br&gt;Like others have commented the menu is the size of War and Peace, can you imagine prep time for all of that? Decided on the grilled pork chop, wife got the bang bang chicken and shrimp combo, kid got the grilled cheese. Pork chop was good, moist all the way through, sides of mashed potatoes and green beans were competent, wife&amp;#39;s meal was good, too much rice for me even the kids grilled cheese was good. <br&gt;<br&gt;Service was kind of slow, slammed for a Sunday afternoon our waitress was overwhelmed, once it lightened up was much more efficient she was very nice and apologetic. Cheesecake was wicked good, huge not sure what it cost as it was free, if it&amp;#39;s free it&amp;#39;s me, could have ate the whole thing myself, kid and wife got in the way. <br&gt;<br&gt;I know it&amp;#39;s hip to bash chains, but really every time I&amp;#39;ve eaten here I can&amp;#39;t complain, would I have eaten here without a gift card? Meh it&amp;#39;s a push, if somebody else is buying, I wouldn&amp;#39;t complain.", "rating": 4, "date": "3/6/2016"}, {"text": "Beautiful restaurant, great for a date night. <br&gt;<br&gt;They are reasonably priced, with big portions. Staff is always friendly. Great drinks as well!<br&gt;<br&gt;My favorite dish here is the garlic noodles, but unfortunately it is part of their rotating menu, so it is not always available.", "rating": 5, "date": "5/28/2017"}, {"text": "Mr. Jen F lured me here one Saturday.  <br&gt;<br&gt;The food is actually pretty decent, but seriously the menu is a book.  How is that even possible?<br&gt;<br&gt;We started with the house made guacamole, which was super yummy.  Seriously, though, guacamole is kind of like pizza.  Even when it&amp;#39;s bad, it&amp;#39;s still pretty good.  I spent many years not eating guacamole without ever trying it.  I declared that I didn&amp;#39;t like it, despite not really knowing. I&amp;#39;m a weirdo like that sometimes.  <br&gt;<br&gt;I had fish tacos and Philip had some kind of pork bbq sandwich.  <br&gt;<br&gt;Portions are huge.  Fish tacos don&amp;#39;t reheat well.", "rating": 3, "date": "5/16/2015"}, {"text": "I have been here 3 times since I moved to Indy which was 3 years ago. So basically I have gone once a year. Each time the food is not great for the price. This time the shrimp and fries were warm/cold. The service is not attentive. My friend and I went for lunch about 130pm. I had to get her attention on several occasions. It looked like she was processing her tickets for the day so when the lunch shift was over she could go home. I asked about the chicken and shrimp dish and she said this dish goes back to the kitchen the most. People confuse this dish with bone fish grill. I literally put the shrimp into Chris the manager hand so he could feel the shrimp was cold. While waiting for the shrimp my friend who ordered a chicken salad sandwich, salad, and fries. I went to eat a few of her fries and those are cold. I said these are terrible she said don&amp;#39;t worry about it. I don&amp;#39;t want them to spit on our food. I told her that people pay way too much money to eat out and it should be somewhat perfect. The food is not fresh and it hasn&amp;#39;t been each time I have been here. Even the bread was hard. When asked for more bread they needed to bake  more. I moved here from Cali and I really like going to the cheesecake factory, but not in Indy. I sure hope the restaurant can get it together. Not sure if the evening dining is better. Daytime is terrible,", "rating": 2, "date": "5/4/2018"}, {"text": "Amazing food and Brian the manager was beyond hospitable! Highly recommend the lettuce wraps.", "rating": 5, "date": "1/5/2019"}, {"text": "Ever been to a place where the human experience tanks the taste of a good meal? That is this place. We <br&gt;What set this one apart in a bad way was the poor management. Never experienced a more rude and clueless manager. <br&gt;Don&amp;#39;t make the mistake we did and think that you can request a channel change in the bar--even if the bar is empty. And even after bringing the poor behavior of an assistant manager to the attention of the GM, not only was my experience not validated or taken seriously, but to not be wise enough to ask what she could do to win our business back. Will never spend money in a place that treats customers as we were treated.", "rating": 1, "date": "3/17/2015"}, {"text": "We stopped by for some cheesecake for Valentine&amp;#39;s day. I got the Hershey&amp;#39;s piece &amp;amp; my husband got the Oreo Dream. They were delicious! they are a bit pricey for 1 piece of cheesecake but it&amp;#39;s worth it :) It took me 3 or 4 nights to eat my piece b/c it was so rich! Delicious &amp;amp; tons of options! When i&amp;#39;m in the mood for cheesecake, we come here! so see you soon!", "rating": 5, "date": "3/10/2017"}, {"text": "Very poor care for there customers if you can avoid this place I know I will.  After getting passed up for a table I walked out.   The host was just sitting people she knew.  @cheesecake", "rating": 1, "date": "6/26/2019"}, {"text": "This place has went downhill over the years. Used to be a go to spot. Now the food is garbage. The menu has way too much going on, you&amp;#39;d think something would be good... skip the meal and get a slice of cheesecake to go. Servers are rude. The last several times we have been basically everyone was dissatisfied with their entree. Ordered a filet, I don&amp;#39;t know what the heck slab of meat they gave me, but it was awful, full of fat, tough, over cooked. Even the kids who are not picky eaters don&amp;#39;t want to return for food. Cheesecake to go only for us now.", "rating": 1, "date": "4/19/2018"}, {"text": "This was my first visit. Steak was unbelievable! So tender. Cheesecake was the best I&amp;#39;ve ever had! Staff was extremely friendly!.<br&gt;Definitely recommend!!", "rating": 5, "date": "10/26/2017"}, {"text": "Sub par food and cheese cakes taste like Walmart box cheese cake.  I don&amp;#39;t understand how a &amp;#34;cheese cake factory &amp;#34; can&amp;#39;t make a cheese cake.   Ricks boatyard makes there own cheese cake and it&amp;#39;s gourmet in comparison.", "rating": 3, "date": "10/24/2018"}, {"text": "I decided to make a spur of the moment trip down to the Cheesecake Factory. I was going to go to the location at the fashion mall, but decided I&amp;#39;d drive a bit further to explore somewhere I&amp;#39;ve never been. I&amp;#39;m glad I did. To start off this review, as soon as I walked through the door, I was seated promptly. I was expecting a bit of a wait but was pleasantly surprised at how quickly I was able to get seated. Each time I come to the Cheesecake Factory, I always try to pick something new. I don&amp;#39;t get to eat here often, but the food never disappoints. I ended up ordering the pasta carbonara, and it was truly delicious. While the food was fantastic, however, what really made the trip worthwhile was the service. The server, Sierra, was extremely pleasant all throughout the meal, ensuring my glass was never empty and always made sure to check up on us. When it came time for dessert, I asked for her recommendations and she listed off her favorites and why. I appreciated the detail because at most places, the servers will just say something like &amp;#34;I like this one&amp;#34;. All in all, it was a swell experience and now I know to drive the extra 45 minutes to eat at this location. Amazing food and amazing service is hard to come by, and Sierra absolutely knocked it out of the park.", "rating": 5, "date": "6/4/2019"}, {"text": "The Cheesecake Factory has been on my &amp;#34;list-of-restaurants-to-go-to&amp;#34; for a long time. I am proud to say I was finally able to cross it off my list today. I must admit, I had high expectations going in but the Cheesecake Factory exceeded all of my expectations. The restaurant chain has locations spread throughout the U.S. and today I visited the Greenwood location for an Easter afternoon lunch with my lovely parents. Upon walking into the restaurant, my first thoughts were that the place was very nice and that it had an almost &amp;#34;high-end&amp;#34; feel to it. When I was presented the menu, I was a bit confused though. What was said to be the &amp;#34;menu&amp;#34; looked more like a short novel. It especially felt this way when the waitress instructed us to turn to page 8 for a list of lunch specials (page 8 was about half way through this &amp;#34;menu&amp;#34;). It was a bit overwhelming at first.<br&gt;<br&gt;After navigating through the menu for about 15 minutes, we finally decided on our orders. I ordered the Crispy Chicken Costoletta and my parents ordered the Chicken Madeira and the Carlton Salad, respectively. The Chicken Costoletta was lightly breaded, served over a creamy, white sauce and garnished with finely sliced lemon peels. It was accompanied with a side of mashed potatoes and asparagus. Honestly, this may have been the best meal I&amp;#39;ve had in the year 2013. It was that good. All of the flavors complemented each other very well and the chef prepared the food perfectly. My only regret is that I didn&amp;#39;t save room for cheesecake, but luckily I was able to take a piece to go.<br&gt;<br&gt;Given the fact that the place is called &amp;#34;Cheesecake Factory&amp;#34; it shouldn&amp;#39;t come as a surprise that their cheesecake is really, really good. I ordered the Chocolate Tuxedo Cream Cheesecake and it was one of the best pieces of cheesecake I have ever had (the best cheesecake I ever had was at One Market Restaurant in San Francisco). It was a combination of fudge, chocolate cheesecake and vanilla mouse, and yes, it&amp;#39;s as good as it sounds. I am greatly anticipating my next visit to the Cheesecake Factory and I look forward to trying new things from their voluminous menu. I would encourage anyone to go and try one of the many cheesecake flavors they have, in addition to any of the main course options. You can&amp;#39;t go wrong at the Cheesecake Factory.", "rating": 4, "date": "6/4/2013"}, {"text": "We had a special event a few weeks ago at this location for 16 of us; many of us had not seen each other for a couple of years which is why we explained and requested the Rotunda.  Our reservations were misunderstood and the service was LESS than desirable but our dinner reviews were 3 to 4 stars and one 5 star from our group.  I will preference this review with the Manager, once aware of seating and vast service issues did everything in his power to correct our unhappiness with the experience. The Manager was phenomenal and handled the situation with grace and we only wish we had made our situation known sooner to him. Apparently we were told our waitress was the best they had...??? Hard to believe!!!  <br&gt;<br&gt;Our Manager comp&amp;#39;d appetizers and desserts for the entire group which helped many of the groups ruffled feathers in the beginning.  However, several will not return due to the numerous issues experienced.   The Managers&amp;#39; effort was greatly appreciated and most did enjoy dinner so another chance could in order. <br&gt;Even if we had interrupted folks in our booth getting in and out, there wasn&amp;#39;t room to stand around the booths socializing with our friends without disturbing the family seated at the center table of the rotunda which we requested with our reservations.  The Managers game plan was to take over their table once they left to allow us space to move around from the 4 booths we were in. However, they stayed for hours, and rightfully so!!!, visiting with friends showing off their new baby which didn&amp;#39;t resolve our situation as planned since they left as we were receiving desserts.  <br&gt;<br&gt;Regardless, we felt the evening was a bust!!  Basically, due to being separated into 4 separate, private booths, we only conversed and dined with the 6 friends confined within our booth. Because of this, many people couldn&amp;#39;t mingle so hello and goodbye was the extent of their conversations.  Our total evening for dinner, even with the Managers assistant, from beginning to end was 4  1/2 hours!!! All were frustrated from the beginning with our seating arrangements to the length of time it took to correct and pay our bill. 4  1/2 hours is unimaginable for dinner here regardless of the size of the party or the 4 booths to serve.<br&gt;<br&gt;On a positive note, my husband stated his Club sandwich was the best he&amp;#39;d ever had. It was not lunchmeat but instead shaved turkey chunks piled high on his sandwich. The Chicken Carbona, Roma Chicken, Eggplant sandwich and the Steak Diane at our table was enjoyed by our group.", "rating": 3, "date": "4/2/2013"}, {"text": "Why the 3 stars? Just because of the simple fact that the food is pretty bad. My girlfriend and I ate here twice and both times it was just horrible. So we&amp;#39;ve decided to only eat here when we are in the mood for their cheesecake. Thats the only reason we come here is for their cheesecake. <br&gt;     Also the only reason they got 3 stars was because they take more pride in making their cheesecakes than they do with their regular food. Their cheesecakes are the best I&amp;#39;ve ever had.", "rating": 3, "date": "10/23/2016"}, {"text": "Went here with a group of ladies for my birthday dinner. Was not disappointed! For a group of 14 on a Friday night, and a place that has no reservations, I arrived an hour before my party was to arrive and put my name in with the hostesses. It was perfect timing, my group arrived and they had seating ready. Our waitress was very kind and considerate with our large group. The food was amazing and I was thrilled with the gluten free options. I will definitely be back for sure!", "rating": 5, "date": "4/5/2019"}, {"text": "My family has always enjoyed the Cheesecake Factory. It&amp;#39;s a little expensive for a family of 5, but we still go.  <br&gt;Tonight we went because the kids are leaving for college tomorrow. It was a busy Saturday night but we went early , so waited only 45 minutes. <br&gt;Such a disappointment. My son ordered steak tacos. The person who delivered the food told us they substituted fries for black beans. Did not ask if this was Ok, or if he&amp;#39;d prefer a different substitution. Come on, fries with tacos? And they were cold.  <br&gt;I had a club sandwich . It was supposed to have herb mayo. Instead, chunks of goat cheese. It ruined it. <br&gt;My daughter, who eats at Cheesecake Factory more frequently with friends , said her experience has often been the same--the kitchen throws together different ingredients than the menu description suggests or omits some ingredients. <br&gt;So we won&amp;#39;t be going back. There&amp;#39;s no excuse for such a decline in quality and attention.<br&gt;Also, my silverware was clearly dirty. I was glad I did not need it with my sandwich. <br&gt;We didn&amp;#39;t need the server during our meal, but I felt like she should have checked in with us once or twice. She took our order, and brought our bill , that was it.", "rating": 1, "date": "1/5/2019"}, {"text": "Okay I should know better.  If you are okay with chain restaurants you will be fine with this.  I DO NOT like chain restaurants but sometimes, graciously go with someone who picks one so as not to be a bitch.  <br&gt;If you live in a small town with no options and go to the mall you probably think this is fine.  And it is..but JUST fine.  Not great.  The service is robotic, the food is assembly line with absolutely no heart.  <br&gt;Why would ANYONE go to one of these places when you can go to something original and thoughtful?", "rating": 2, "date": "1/16/2017"}, {"text": "Our service today was terrible. Very slow server. No silverware. Had to ask after food was brought. We never received any bread at all. Took forever to get our check. Will be awhile before we return.", "rating": 2, "date": "4/20/2019"}, {"text": "Awesome food and awesome service. The only bad things about this place is the lack of healthier options.", "rating": 3, "date": "8/9/2018"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory twice this week. Monday night we had EXCELLENT service. Tonight was horrible. We didn&amp;#39;t get a single drink refill!!! Not once. For anyone in our group! Our waiter seemed completely annoyed with serving us. He made a couple of snarky comments &amp;amp; was very slow. Our table wasn&amp;#39;t cleaned up with our used bread dishes. Very disappoint experience.", "rating": 3, "date": "3/22/2018"}, {"text": "A bit pricey but received excellent service and the food was terrific! And the cheesecake....worth every single penny.", "rating": 5, "date": "4/8/2018"}, {"text": "Portion sizes are amazing!!<br&gt;Cheesecake is out of this world!!<br&gt;Beverages are a bit over priced but worth it if they are the handcrafted frozen drinks.<br&gt;4 people=$144", "rating": 5, "date": "8/27/2016"}, {"text": "Yummy food and great service! Love this place, just wish they took reservations so you can plan vs wait on site just sitting for an hour or more.", "rating": 5, "date": "5/15/2018"}, {"text": "Cheesecake Factory is always a decent place to go.  I am so confused by there customer unfriendly policies.  Why not allow either call ahead seating or reservations.  If your not there at time your table is available then you go into the line.  It seems like they don&amp;#39;t respect my time.<br&gt;<br&gt;I asked and was told they want to turn the tables.  Seems to me you could have both.  <br&gt;<br&gt;How about it Cheesecake Factory. Give a better customer experience and keep your tables full.<br&gt;<br&gt;I don&amp;#39;t want to have to show up 45 minutes early just to sit in your lobby!", "rating": 2, "date": "3/4/2018"}, {"text": "What is there not to love about fried macaroni and cheese balls amazing!!!!! When dinning the cheesecake factory you can rest a sure that there will be something tasty for everyone. It&amp;#39;s a Classic American  menu with the wide variety of options. The inside is very well decorated with a elegant vibe, my dining experiences was very  pleasurable. The Cheesecake Factory is a perfect place for a great for date night, or a birthday dinner. You have to absolutely try the fried macaroni and cheese balls as an appetizer and they are simply amazing and one of the main reasons why my family and I dine at the cheesecake factory because the macaroni and cheese balls are fried to perfection with crispy crunchy golden outside and a nice creamy layer of cheesy macaroni goodness on the inside ...food for the gods !!!! For dinner I order the filet mignon with asparagus and mashed potatoes. Steak was prepared very well, and side also matched full of flavor.  Now for desert .....how do you come to the cheesecake factory without dining on a piece of cheesecake ???? I ordered the Oreo cheesecake and it was absolutely everything I expected and much more delicious!!!!", "rating": 4, "date": "8/10/2017"}, {"text": "A favorite for my wife and I. The Parmesan crusted chicken is my go to meal. I do wish they would have kept the Dutch Apple Pie cheesecake. <br&gt;<br&gt;Only downside is they don&amp;#39;t take reservations and Friday and Saturday evenings are almost impossible to get a table.", "rating": 4, "date": "4/20/2018"}, {"text": "I like this restaurant very much. I just wish that they weren&amp;#39;t so pricey. My favorite entree is the Miso Salmon. I also like their Orange Chicken. Their cheesecakes are really good, but a little too rich for my liking. <br&gt;The restaurant is clean, the staff are always friendly, and the food is always delicious.", "rating": 5, "date": "7/3/2014"}, {"text": "I took my daughter here for a &amp;#39;fancy&amp;#39; girls lunch a couple of days ago. It had been years since I&amp;#39;d been to the Cheesecake Factory, mostly because this place is pricey. That hasn&amp;#39;t changed. But the food and atmosphere are still great.<br&gt;<br&gt;Our service was kind of slow, which always annoys me when I&amp;#39;m hungry, but the waitress was very nice otherwise. I had the margarita pizza and managed to eat half of it. My kiddo had the kids mac and cheese and the portion was enormous. She also managed to only eat about half of it. We split a piece of the 30th Anniversary chocolate cheesecake and it was divine. And we brought a piece of the Oreo cheesecake home for my husband, who said it was delicious. <br&gt;<br&gt;Our two entrees, two drinks, and two pieces of cheesecake came to $50, including the tip. Which quickly reminded me why it&amp;#39;s been so long since I&amp;#39;ve eaten here. But it was a nice little treat for me and the kid, so it was worth it.", "rating": 4, "date": "1/1/2016"}, {"text": "I&amp;#39;ve been wanting to come here since last year but with the construction in Martinsville, it is hard for me to get from Bloomington to Greenwood. We drove up to Greenwood on a fairly busy day for the Cheesecake Factory, but the wait wasn&amp;#39;t too bad. All the staff members were really friendly. We didn&amp;#39;t have any problems ordering. They had a wide selection of all kinds of food, and of course, cheesecake. The only thing i wish they did have was a cheesecake menu at the table at all times. My boyfriend asked our waiter if we could keep a menu for later. That was a very good idea on his part. I saw other customers having to ask their server for menus later on and that just seemed very inconvenient for these busy servers. Everything we had was simply amazing. My boyfriend did state that he couldn&amp;#39;t really taste the mac and cheese balls on his burger, but I would eat that chicken and biscuit everyday if I could. Neither my boyfriend or I are very big cheesecake fans, but we did share an Oreo cheesecake, and it was great.", "rating": 5, "date": "8/19/2016"}, {"text": "Worst experience from a restaurant and only been here 20 mins.  If you want a hostess to speak to you as if you are a idiot please feel free to come here.  Then to be seated and be pushed past by a waiter.  Nope I&amp;#39;m good thanks though.  We did the &amp;#34;call ahead&amp;#34;. Just to sit and wait 30 mins. Sooooo why didn&amp;#39;t you tell me when I called we would still have a 30 min wait and that my waste of time phone call was pointless.  Other than that the waiter is totally on it and very responsive and helpful", "rating": 1, "date": "3/19/2017"}, {"text": "I decided to dine in at the Cheesecake Factory by myself in Greenwood, Indiana the service was a extremely slow! I came in two hours before closing and it took 1 hour and a half to get one drinks, appetizers, and an entree. Plus, my silverware was dirty and my waiter wasn&amp;#39;t consistent for the place to be empty.", "rating": 3, "date": "3/18/2018"}, {"text": "The food was poor, the service was snail-like, and our waitress, Whitney B,  did NOT ever smile or appear to remotely enjoy what she was doing.  When we needed her, she was rarely visible, and did not heed our attempts to hail her down. When it came  time to pay the bill, she had to be hunted down.<br&gt;<br&gt;We were seated within 5 minutes of arrival for a Monday lunch after what would be the END of a lunch period (12:45). The food took a L-O-N-G time to arrive, and when it DID finally come out, the child&amp;#39;s meal for the 16 month old baby came out LAST,  leaving us to try and keep a baby from melting down from hunger since the limited amount of bread had been consumed during our lengthy wait. One of the meals was luke warm as if it had sat for a while waiting  to be served.<br&gt;<br&gt;Offers to refill drinks were not made...I had to ask for a to go refill, even though my glass was empty during much of the meal, and this request took an extreme amount of time, even though we&amp;#39;d communicated more than once the need for us to go. <br&gt;<br&gt;We asked for our cheesecake to go since we&amp;#39;d indicated a need to leave in a timely manner. When it finally came, there were no forks/spoons, so I asked a bus boy. We received more service and friendliness from him than our waitress, and it was his first day. When the waitress eventually returned with the to go boxes and no bag, she stuffed them in the  bags that had cheesecake in them. <br&gt;<br&gt; I&amp;#39;d say if the service was this poor during a non-rush time, I&amp;#39;d dread to attempt it during a busy time. I would NOT recommend this Cheesecake Factory to anyone...or if you DO decide to attempt it, allow for extra time and definitely  don&amp;#39;t have anything of importance scheduled for later in your day.  When people spend the kind of money we spent for lunch, smiles and friendly service should not be optional!", "rating": 1, "date": "8/3/2015"}, {"text": "Service was kinda slow for a weeknight, but that wasn&amp;#39;t a big deal, especially when you dine in at Cheesecake Factory where menu is so extensive, nevertheless the food was excellent and on spot as usual, my meal was the Chicken Madeira, highly recommended :)<br&gt;<br&gt;Oh, and the best part of the visit, was of course the one and only, Red Velvet Cheesecake !", "rating": 5, "date": "8/12/2015"}, {"text": "Everything took a long time this evening. Our server was not available most of the evening. Everything was backed up per the server, the excuse for the long wait on food, bread, and desserts.  Bread was offered but never brought to our table. However all the other tables were delivered bread. We felt like she was pre judging us, little did she know we tip very well because I am a server. We will not be back to this restaurant.", "rating": 1, "date": "7/26/2017"}, {"text": "Just stopped in for dessert and a drink on a Friday night.   Sat at the bar and it wasn&amp;#39;t too busy (which the bartender said was because Friday night football had started that weekend).   Bartender was fast and friendly (without being too chatty).<br&gt;<br&gt;The cheesecake selection was so extensive it took me a good 5 minutes to decide on one.  It was a very good rendition of tiramisu cheesecake.", "rating": 3, "date": "8/27/2013"}, {"text": "So we were planing to have a nice dinner after a fun day of bowling. So after bowling we go to the cheese cake factory.  The place was very crowded which is understandable due to it being a Saturday during the dinner hour, so we wait and get seated. We put In our order and waited. our waiter came around 40 minutes later and finally brought our bread with our meals instead of us getting it before. I got he pasta with shrimp and the pasta was his and the shrimp was cold, so I asked if they could take it back and warm it up because I was paying around $20 for this meal. The rest of my family was done eating so they ordered our cheese cake. After this point 30 minutes later the waiter comes out with my pasta. At this point I was like &amp;#34; Can you just take this off the order &amp;#34;  so he told us he would just get his manager. The manager never came around so after we ate the cheese cake, the waiter just told us he would take it off our order for us. So I waited 1 hour to get in and waited over a <br&gt;hour to get cold food that cost $20 and sketchy service.<br&gt;If I were you I would not go because I am never going again.", "rating": 1, "date": "1/26/2019"}, {"text": "We don&amp;#39;t go here often, but when we do we&amp;#39;re always satisfied! The food is great and the service is very good. Drinks are a bit pricey and not very strong, but if you don&amp;#39;t drink or stick to beer and wine, you&amp;#39;ll get what you pay for.", "rating": 4, "date": "9/10/2017"}, {"text": "My first time here was out of this world. As soon as I stepped foot into the restaurant, I was in awe. The decor was so powerful and stylish. We were served by Matthew and he treated my girlfriend and I like royalty.<br&gt;<br&gt;I ordered the Parmesan-Herb Crusted Chicken with mashed potatoes and green beans. When I took my first bite, I was in shock. Never before have I tasted chicken so succulent and flavorful. The chicken reminded me of how my grandmother used to cook and it brought out such sweet memories.<br&gt;<br&gt;At the end of my meal, I was thoroughly impressed with the Cheesecake Factory. I am, without a doubt, definitely coming back.<br&gt;<br&gt;Service: 10/10<br&gt;Food: 10/10<br&gt;Overall: 10/10", "rating": 5, "date": "1/4/2018"}, {"text": "Went in with high expectations. Service sucked. Waited for refills and hour for food. The place looked cool. Cheesecake looked cool. Prices are outrageous. You&amp;#39;re better off going to a better fancy/pricey restaurant.", "rating": 3, "date": "4/16/2016"}, {"text": "Our mommy and son date was great.  The food was amazing.  I had the eggplant parmesan and he had the Cajun chicken little dinner.  It was one of the best meals we have had out in a long time.  All the food was fresh and hot.  Our waiter Nathan was great.  The typhoon punch I had is my new favorite drink and my son loved his Georgia Peach.  Oh, and don&amp;#39;t forget about the complimentary warm honey wheat bread and butter.  Just a great dining experience with no wait to eat in the bar area.  I can&amp;#39;t wait to go back.", "rating": 5, "date": "10/23/2017"}, {"text": "We took our adult kids out to a birthday dinner Thursday evening. We had a very personable and professional waiter who took out order in a reasonable amount of time. Everything after that was very unfortunate<br&gt;<br&gt;I got my meal and we waited for the other three. The manager came out and explained something about a problem producing my husband&amp;#39;s order and  asked if he&amp;#39;d like anything else. He didn&amp;#39;t have time to wait and then eat so he declined. Eventually my sons meal arrives and he was happy with it. After another wait of about 10 minutes the birthday girl&amp;#39;s chicken alfredo arrived. By then I had been done for a while, and my son was nearly finished so he ordered dessert. <br&gt;<br&gt;Birthday girl found a tiny worm I her meal after a couple bites. The manager was very apologetic and professional as well. She brought out a full cheesecake in apology. <br&gt;<br&gt;Birthday girl ordered another meal and eventually a birthday choir sang to her and brought her a slice of Oreo cheesecake. Which she loved. <br&gt;<br&gt;My son still didn&amp;#39;t have his dessert. We asked again. <br&gt;<br&gt;In the end, we were charged only for the 2 alcoholic drinks. <br&gt;<br&gt;We appreciate the comp and the nice staff but this place was having serious issues. Won&amp;#39;t go back.o", "rating": 2, "date": "9/23/2017"}, {"text": "As expected on a Saturday night we had a relatively long wait. They told us 50 minutes but our table was ready in less. The food was awesome and great portion sizes. The cheesecake is delicious. Our waitress was super friendly and attentive even with the rush. It was my first time and I know we will definitely go back. We spent about $120 for two adult and two children. My kids loved the kids menu choices.", "rating": 5, "date": "9/11/2016"}, {"text": "One of my favorite places to eat.  Food is excellent and the cheesecake is to DIE FOR!!!  Like others have said, going at peak times can extend your wait times for service but if you keep that in mind, you will have a wonderful meal.", "rating": 5, "date": "11/14/2017"}, {"text": "I came for dinner and got the blackened salmon and it came out burnt. All I could taste was the burnt portion of the salmon and when the waiter came over I told him what was wrong and he said blackened salmon was suppose to be burnt. Real blackened salmon might have grill marks, but your suppose to taste the Cajun seasoning on the salmon. It was taken back and it came back with the middle raw. The cooks here clearly don&amp;#39;t know how to make blackened salmon and it was an unsatisfactory visit.", "rating": 2, "date": "11/7/2017"}, {"text": "I have only been to this restaurant once, and i have to say i was pleasantly surprised. It wasn&amp;#39;t like i had imagined. It is a mid-scale restaurant, clean and nicely laid out. There was a very long wait time (close to 40mins) when we got there, but then again, we went on a Saturday. Everything on the menu sounded so delicious that it was hard picking an item. I ended up getting the Renee&amp;#39;s special which included a choice of sandwich, cup of soup, and salad.I got the chicken salad sandwich, potato soup, and Caesar salad. The brown bread is awesome, and the meal was fantastic! I was extremely hungry by the time we got seated, so that might have contributed to everything tasting extremely good. Anyway, dinner was topped with a slice of mango key lime cheesecake. I had to take my dessert to go since i was extremely full after the main dish. The cheesecake was extremely good, light and sweet.", "rating": 4, "date": "1/8/2017"}, {"text": "The food was Awesome. The service was average. We went for lunch during the week and we were seated immediately. We quickly got our order in and food arrived quickly and was very fresh. All ingredients and portions are great. Even something as simple as a kid&amp;#39;s spaghetti was delicious. We got the smores cheesecake to share and we were blown away by how good it was. Only downside was waiting for our waitress who disappeared a couple times for 10 minutes or more during the desert and time to get our check. This is especially annoying when you have toddlers who are finished eating and ready to get moving. We will definitely go back but hope we get a different waitress!", "rating": 4, "date": "6/20/2016"}, {"text": "This was my first trip to The CheeseCake Factory,  the staff was very professional and courteous.  We were seated quickly, received our drinks quickly,ordered and received our food within 10 minutes.    I ordered the Bang, Bang Chicken, OMG it was excellent.   The portions of food are big,  the portion of dessert was big also.    Well worth the money.  My family and I WILL be back", "rating": 4, "date": "7/29/2018"}, {"text": "You can&amp;#39;t give a low rating because of too many selections and that&amp;#39;s my only issue with Cheesecake Factory. There&amp;#39;s so much to choose from and then they added more menu items. I had the Riesling chicken. It was sooooo good. The servings are enough to feed two people. It was a Friday night and the wait was long, but well worth it. Even though this is the place for cheesecake, I can&amp;#39;t resist the chocolate tower truffle cake. Another menu item that can feed two people.", "rating": 5, "date": "4/9/2017"}, {"text": "Excellent food with a huge menu my personal favorite is the lettuce wraps and all the cheesecakes of course. Love it here", "rating": 4, "date": "5/5/2017"}, {"text": "I want to start off by saying this is one of my fave restaurants and the food was good. We went out for my bday dinner and it started out with being quoted 30-40 min for our wait time... it ended up being closer to an hour. We walked around outside and the mall for a bit and came back and the hostess said we still had 10-15 min... my husband went back again and checked and was told 10 more min and we were at the top of the list.... so we waited another 5 min and were seated. We ordered drinks and food (including cocktails).... our waitress brought waters after about 5 minutes and about 15 minutes later a bread basket (still no cocktails).... then comes our dinner. The lady that brought our food wasn&amp;#39;t our waitress but i asked to see a manager bc we still didn&amp;#39;t have our drinks, 2 minutes later they came. Both manager and waitress had the excuse of the bar being backed up, but I&amp;#39;ve never had drinks come after food being prepared, cooked and brought out. We then decided to get cheesecake to go.... we went up to the to go counter, ordered 3 pieces and i waited close to 20-25 minutes. I still love this restaurant, but will prob not go back for a while... they are for the most part always busy so i don&amp;#39;t understand the problems throughout the whole part of our visit.", "rating": 2, "date": "4/6/2019"}, {"text": "Last night we just wanted cheesecake, so we waited through the to-go line. It was pretty long, but we were in and out in 5 minutes. I was so happy to see that they still had their holiday cheesecake on the menu!", "rating": 5, "date": "2/11/2017"}, {"text": "My love for cheese cake factory continues.<br&gt;<br&gt;Although the wait was madness, they were great as usual! They were able to throw together a vegetable medley for me that wasn&amp;#39;t on the menu which was great!<br&gt;<br&gt;The reason I love cheesecake factory, is that the quality is great and no matter which state you visit them in, you will get the same great food and service.", "rating": 4, "date": "4/27/2015"}, {"text": "Delicious food- absolutely horrible service. We literally asked for bread 4 times. Came after our meal. Martini had something in it and the olives were old. Drinks and meals for the four of us came at all different times .", "rating": 2, "date": "5/12/2017"}, {"text": "I was really excited about going to the cheesecake factory since I have never been but always wanted to go. The menu is extensive and has just about anything you would want. Unfortunately, I believe that this may be their downfall. It seems as though their dishes are just there for a variety. Nothing is done &amp;#34;really well&amp;#34;. They should just stick to cheesecake-which is excellent.", "rating": 3, "date": "2/24/2015"}, {"text": "This place is always great. Came here for my 1 year anniversary and it was more than perfect. Food was excellent and the service is even better. Highly suggest a visit if at the Greenwood Park Mall.", "rating": 5, "date": "7/9/2017"}, {"text": "I highly recommend this place if you&amp;#39;re wanting some delicious bread while you wait for your meal.", "rating": 4, "date": "7/2/2017"}, {"text": "The only thing I&amp;#39;m dinging them for- They don&amp;#39;t take reservations or even call ahead on weekends or evenings. Making a dinner there a guaranteed wait time. <br&gt;My favorite thing about The Cheesecake Factory- Their giant menu. It has every type of cuisine so no matter how large your party everyone can find something delicious (or many things!). Hence my recommendation to put your wait time to good use by asking for menus and mulling over your carvings prior to getting seated. As a creature of habit I usually go with the Spicy Cashew Chicken (ps- you can ask for it not spicy!) Every once in awhile I will mix it up and go for the chicken pot pie smothering biscuits or one of their numerous pasta selections. <br&gt;I am also a fan of large portions. Their prices are a little steep for one meal, but when you make it two the math works out perfectly every time. <br&gt;And of course we must mention their cheesecake. I&amp;#39;ve never had a bad piece and this is definitely an area of the menu that I like to mix it up. My favorite piece that I truly melted over was at my most recent stop- Their Peppermint Bark Cheesecake. It was light and fluffy, not a true dense cheesecake and it has the slightest hint of chocolate to balance the mint. Not to mention the sprinkling of peppermint bark on top. Delicious!", "rating": 4, "date": "12/30/2016"}, {"text": "I&amp;#39;m sure foods are great but you can&amp;#39;t lie customers only 55 mins waiting time then 90 minutes later everyone are still waiting- kept saying check back in 30 mins - we are running close to 120 mins but still no seats and said 6 groups in front of you guys", "rating": 1, "date": "2/24/2018"}, {"text": "I only come here to pick up cheesecake slices. Ive never been to the restaurant as its not my favorite chain. But the cheesecake service is great and fast whenever I go.", "rating": 4, "date": "11/15/2014"}, {"text": "Excellent food and wait staff! Tops across the board. <br&gt;Peak times have long waits but that&amp;#39;s to be expected when it&amp;#39;s a good place.", "rating": 5, "date": "11/15/2015"}, {"text": "Went for dinner with one of my gal pals and had a Wonderful Server named Tre who was very knowledgeable of the menu and a Great waiter, he took very good care of us! One of these best I&amp;#39;ve had in a long while, I must say! I had the small plates which wasn&amp;#39;t overly filling but wonderful and left plenty of room for my desired cheesecake! Sometimes I get a regular platter meal and the servings are so huge that you struggle not to over eat! Loved the small plate concept! I had the Salted Caramel Cheesecake and it was nice and light but could&amp;#39;ve used a little more salt for the Salted! I did request hot fudge drizzle to be added! Small plate Caesar Salad wasn&amp;#39;t too over dressed but was still good size (I didn&amp;#39;t finish it) and the Dynamite Shrimp was super light, crunchy, and tasty! The dynamite sauce was good and not too spicy, best word to describe it would be Zippy! Strawberry Daiquiri and Pina Colada were also very good! My friend said her cheeseburger was good as well! We also started out our meal with the Crispy Fried Cheese and it was the perfect bite, hot, crispy, and very good!", "rating": 4, "date": "9/29/2016"}, {"text": "Best meal I&amp;#39;ve had out in a long time. Probably in about a year. And I eat out a lot.<br&gt;<br&gt;I was just looking for a good meal somewhere that wouldn&amp;#39;t close at 10, and I am really glad this was about the only nice place open in the area. The menu is monstrous, so maybe I just got lucky but the Thai chicken was amazing. Drinks are overpriced ($4.50 for OJ? $8 milkshakes??), but what are you gonna do. Just save your sugar fix for their eponymous cheesecake.<br&gt;<br&gt;My waitress, Peyton, was ever-present without being overbearing, which is actually a very hard balance that most restaurants seldom ever seem to manage.<br&gt;<br&gt;Even the free bread was impressively flavorful. I will be coming back.", "rating": 5, "date": "2/21/2017"}, {"text": "Went for a Sunday Brunch around 10am.  Good hostess, promptly seated and excellent waitress.  Reason for 3 stars:  Music with lyrics!! was so loud that we could not carry on any conversation unless we yelled.  Maybe it was the octagon room we sat in but we told the waitress and there was no change in volume.  Hey, it is early SUNDAY for brunch and there were very few customers and no one in the bar.  No reason for loud singing as there is no other noise to drown out.  Food was timely, we ate it all and had no room for cheesecake.  If we ever choose to come back, we will check the music first and leave if it is as loud.", "rating": 3, "date": "9/4/2016"}, {"text": "Service started out a little slow, but the server went out of his way to make up for it (he was swamped with a larger party). My friend and I started with the portabella, avocado, and zucchini fries ( yum!), then split the macaroni and cheese burger. A) Glad we got it! B) Glad we split it! Such great flavor and texture! We should have split the cheesecake, too. Woof. I always forget how overwhelming their big desserts can be! Tasty, but overwhelming. I branched out with the Reese&amp;#39;s Cup cheesecake and c was not disappointed with its salty-sweet flavor and the texture of the peanut butter cups. A good experience overall!", "rating": 4, "date": "6/6/2016"}, {"text": "I get three things here: the brown oat bread &amp;amp; butter, the Chocolate Tuxedo Cheesecake and the Firecracker Salmon appetizer. Those three alone might be worth the waiting...<br&gt;<br&gt;The brown oat bread is just so soft with that little texture from the oats baked on top... I don&amp;#39;t even understand why that bread is so delicious.  The firecracker salmon is a decent enough size, that it&amp;#39;s really my meal. It&amp;#39;s delicious salmon wrapped in spinach and a crispy wrapper, on top of a bed of red cabbage and a sweet sauce that makes the red cabbage into a crisp, fresh salad on its own. The Chocolate Tuxedo Cheesecake has that right about of chocolate cake and mascarpone cheesecake that just melts in your mouth... JUST GET IT, OKAY?!<br&gt;<br&gt;It is ALWAYS packed. I don&amp;#39;t even understand it. Honestly, this review is towards the Greenwood location ONLY. The Keystone location SUCKS. The service always sucks. But the Greenwood location is extremely friendly and quick on service.<br&gt;<br&gt;If you have a small party (2-4) and you&amp;#39;re over 21, just rush over to the bar and seat yourself. No wait! :)", "rating": 4, "date": "9/25/2013"}, {"text": "We sat at the bar for dessert.  The bartender was attentive and fast, but I just could not enjoy the cheesecake.  The first one was supposed to be raspberry white chocolate, but I tasted neither and it had enough whipped cream to feed a small army.  I sent it back because it was completely tasteless.  The next one I tried was mango key lime.  A bit more flavor, but with none of the zing you expect from key lime.  I felt bad sending back a second one, so I choked it down, but it wasn&amp;#39;t that great.  The kid in me always likes to order milk with my desserts, and I was bummed that they did not carry skim milk.  I was also disappointed that my not so great cheesecake was nearly $7 a slice.  Probably will not bother going back.", "rating": 2, "date": "9/4/2013"}, {"text": "The only reason my review received two stars instead of one is because their cheesecake never fails. However our food was cold tonight, the rice was hard, and the burger left a lot to be desired. Won&amp;#39;t be coming back for anything but cheesecake.", "rating": 2, "date": "1/13/2018"}, {"text": "The cheesecake is always good - the food is hit and miss. The service the past few times hasn&amp;#39;t been stellar by any means!", "rating": 3, "date": "1/31/2017"}, {"text": "A clinical supervisor once told me that you should never try meth. He said that it&amp;#39;s a horrible idea, because if you loved it, I&amp;#39;d use more and more and it would eventually kill you.<br&gt;<br&gt;Three stars for The Cheesecake Factory. I&amp;#39;m so screwed. For some reason. I am glad I live so far away.<br&gt;<br&gt;This place reminds me of a grade A--M.C., television channel series?<br&gt;It is the one where some guy runs a chain of fast food chicken restaurants. Everyone is commenting about how great it is, and they always want to drop in. Also he runs some sort of side business with it?", "rating": 3, "date": "4/16/2013"}, {"text": "Love Cheesecake Factory. Love it! The only bummer about this place is that I think you pay more for the atmosphere than for the quality of food. The food is good, but not 5 stars at all. But the cheesecake is 5 stars!! That alone should get five stars. On of my favorites being the pineapple upside down cheesecake. If you can afford the calories...Get you a slice :)", "rating": 4, "date": "1/29/2016"}, {"text": "best service every time i come here! the manager, bryan, always checks on us to make sure our meals came out right. service is always above and beyond!", "rating": 5, "date": "11/29/2018"}, {"text": "Amazing customer service. Had the fish tacos....hated them , but no worries . They happily replaced them with steak tacos ! No questions asked ! Awesome place", "rating": 5, "date": "2/6/2016"}, {"text": "I LOVED Everything about this place <br&gt;&amp;amp; the food was FAB<br&gt;order the sauces before you head out the door because that To Go Bar is hoppin!!!!!!!!<br&gt;the ENTIRE Staff was so Wonderful<br&gt;handicapped parking right by the Front Door<br&gt;great place to people watch during short wait for Dinner<br&gt;i can&amp;#39;t wait for our next Lunch there", "rating": 5, "date": "3/23/2008"}, {"text": "hubby and I went for a appetizer date night. we shared the avocado egg rolls and the best part of the appetizer is the sauce- not that the egg rolls are bad at all. i had the guacamole &amp;#34;super food&amp;#34; salad but at first is was brought out with chicken mixed in and took some time to get the right salad out. hubby got the falafel (super food) salad and the falafel was probably the best of the times we had bought it because it was warm and crispy and has been pretty gooey the other times we had ordered it.", "rating": 4, "date": "11/26/2015"}, {"text": "I like Cheesecake factory-mostly for cheesecake. Their food is good, just kinda on the more expensive side for what you get. I usually go there for just dessert.<br&gt;On this trip, we had cheesecake and drinks for our birthday (a friend and I have the same birthday). I got my old standby, the Tuxedo cheesecake. It is delicious. My friend had the banana coconut cheesecake. She liked it too!  We also had chocolate martini&amp;#39;s, which were yummy, and strong! A definite plus!", "rating": 4, "date": "1/21/2013"}, {"text": "Skinnylicious Asian Chicken Salad with iced mint green tea &amp;amp; S&amp;#39;more Galore or Vanilla Bean cheesecake for desert!!", "rating": 5, "date": "3/19/2016"}, {"text": "Enormous quantities of mediocre food with long waits and slow service. I don&amp;#39;t understand why people wait an hour for this experience. I&amp;#39;m not a vegan health nut and each serving is two big meals for me. There&amp;#39;s just no reason to serve that much food. Most people are leaving with shopping bags full of leftovers.<br&gt;<br&gt;I love the decor. The exterior and interior of the place are loaded with nice architectural details and great lighting.<br&gt;<br&gt;The cheesecake is good, I suppose, and there are dozens of varieties. However, I&amp;#39;ve had problems not being able to order the kind I want as availability of each flavor varies.", "rating": 2, "date": "8/17/2011"}, {"text": "For the third year running, three friends from the old neighborhood and I have met over the Christmas holiday at the Cheesecake Factory for our annual reunion.  Cheesecake Factory is a known quantity.  There are no surprises with the food.  The food will be tasty and in portions that will be obscenely-large, but reasonably-priced.  The selections on the menu are likely researched and test-marketed with scientific precision for mass appeal and corporate-approved.  The only variables at a Cheesecake Factory are the crowd and the quality of service.<br&gt;<br&gt;This time around, the crowd for lunch on Christmas Eve was sparse.  Service from Nicholas was solid.  However, I did find one surprise with the food.  The Cheesecake Factory has followed the tapas/small-plate trend and added a page to their phonebook-sized menu with small plate selections.  I had the arugula salad, crispy (read fried) artichoke hearts served with a lemon-garlic aioli, and Vietnamese tacos, a banh mi-style taco with a fluffy flour bun/&amp;#34;shell&amp;#34;.  What can I say?  It wasn&amp;#39;t bad at all!  Cheesecake Factory delivers yet again!  <br&gt;<br&gt;I&amp;#39;m sure I&amp;#39;ll be back same time, next year.", "rating": 4, "date": "12/24/2010"}, {"text": "Most restaurants with such an eclectic and extensive menu tend to be a &amp;#39; jack of all trades, master of none &amp;#39; ( Gordan Ramsey taught me that ) but not the Cheesecake Factory. They have perfected nearly every dish - as I&amp;#39;ve never had something here that was bland or anything but delicious. The salads are always fresh and this is one of the few places in Indy you can get pine nuts added to a caesar salad (try it!), the Italian dishes here are divine, as is the pan-Asian cuisine. Personally I like to order a few small plates and share among the table since the portions of some items can be HUGE and overwhelming. The corn cakes are one of my favorites and the cheese bites are great too. And you can&amp;#39;t forget about the cheesecakes - over 20 options to choose from! They are creamy and amazing and oh so rich it makes your heart pitter patter. The prices aren&amp;#39;t outrageous but this is a nice place so expect $15-30 per person excluding any beverages.", "rating": 5, "date": "10/19/2014"}, {"text": "The appetizers are so filling, we don&amp;#39;t have room for an entree! We usually split the delicious Avocado Egg Rolls and then choose a slice of Cheesecake to bring home. So delicious!", "rating": 5, "date": "5/25/2016"}, {"text": "I have to agree with other reviews.. giant portions of &amp;#39;so-so&amp;#39; food. I wasn&amp;#39;t amazed, but I did leave full. <br&gt;<br&gt;I was kind of disappointed with my ahi tuna.. it didn&amp;#39;t have much flavor (the ahi tuna salad is one of the few menu items that is not enormous), but everyone else at the table was pretty happy with their food (giant, overflowing plates of cashew chicken.. at a whopping 1810 calories a plate by the way. It should be good- that&amp;#39;s all you get to eat that day)<br&gt;<br&gt;The redeeming quality.. the dessert. My group split a strawberry shortcake and a tiramisu.  The shortcake was less spongy than I&amp;#39;ve had at other restaurants and tasted more like a cookie.. and it wasn&amp;#39;t ridiculously sweet. I liked. And the tiramisu.. well. It was Amazing. Loved. Knocked this place up from 2 stars to 3.", "rating": 3, "date": "12/10/2012"}, {"text": "Very pleased with service, everything from our appetizer to drinks, entree, and desert were superb. Even our server, who was in training, was great. Will definitely be back", "rating": 5, "date": "1/20/2016"}, {"text": "Came here for lunch with Husband &amp;amp; Relatively spry Mother In Law (age 90, tiny little thing) who has a wheeled walker.<br&gt;They don&amp;#39;t appear to have space for walkers to &amp;#34;park&amp;#34; while the guest is at a table.  The tables are pretty close to each other thus compounding the problem.<br&gt;I didn&amp;#39;t see any &amp;#34;handicap&amp;#34; tables on a quick survey inside.  The restaurant was relatively full.  The walker sat next to the table like another chair was added.  The guests at the next table had to shimmy to get by it, the tables are that close.<br&gt;<br&gt;The entrees were great as usual for me &amp;amp; husband.  <br&gt;My MIL ordered off of the &amp;#34;diet&amp;#34; menu (SkinnyLicious) since she wanted sandwich and salad but NO soup or bread on the side, and that was the only way to order that combo that we found.  She doesn&amp;#39;t eat huge portions to begin with.<br&gt;Her mixed greens salad came without any dressing at all on it (she ordered with extra dressing on the side as she always does).<br&gt;We had a waiter in training.  He was accompanied by his trainer.  <br&gt;It seemed long time before they checked on us to realize no dressing at all had been provided.  The trainer handled it when the trainee didn&amp;#39;t seem to believe there was no dressing.  Once they did bring dressing, apparently it was a pretty flavorless vineagrette.   She ate half her chicken salad sandwich, which she said was good (and took half home).<br&gt;<br&gt;I had Pasta Da Vinci, he had Pasta Carbonara.  My MIL liked our pasta better than her items to my judgement.<br&gt;<br&gt;We all 3 had cheesecake for desssert, I had plain w/ strawberry topping.  Flavor is awesome but the cheesecake itself seems &amp;#34;fluffy&amp;#34;.  I&amp;#39;m used to a denser cheesecake I guess. Hubby got one with lots of &amp;#34;stuff&amp;#34;  like candy pieces &amp;amp; chocolate etc.  A bit sweet for me but he liked.  MIL got key lime and we all liked it as well.", "rating": 3, "date": "7/21/2013"}, {"text": "All Cheesecake Factories are the same across the country, except Hawaii&amp;#39;s which has a slightly different menu I&amp;#39;m told.  That&amp;#39;s a good thing, as you should always get a good, generously sized meal and a good deal.  Wife had pork chops and I had the cajun shrimp and chicken linguine.  Both were very good selections from their extensive menu.  Our party of 4 also split a chocolate coconut and banana cream cheesecake, with the BC being the better choice.  Festive and vibrant scene, and excellent service.  Nice to have a reliable, nationwide franchise like CF around.", "rating": 4, "date": "6/3/2011"}, {"text": "I only went for the cheesecake but it was amazing. The staff was also outstanding and the bartender made a pretty mean mojito. The inside was clean and looked amazing.", "rating": 5, "date": "10/2/2015"}, {"text": "Food is absolutely amazing I&amp;#39;ve never been dissatisfied with the quality of it. Very happy with our server as well.<br&gt;The front of the house was the only problem we had.<br&gt;During this instance we were told there would be a 60 minute wait. Ok, no problem. We go next store to Barnes and Noble for a bit and after 50 minutes check back in to make sure we didn&amp;#39;t miss our summoning. I was told at that time it&amp;#39;d be abother 10-15 minutes. Ok, sounds about right. <br&gt;30 minutes later. I go to make sure we haven&amp;#39;t been skipped or overlooked or forgotten or erased because surely the people who came in after us shouldn&amp;#39;t be getting seated as quickly as they were. <br&gt;I&amp;#39;m told that they paged us &amp;#39;about 20 minutes ago&amp;#39; and was asked, &amp;#39;did your pager not go off?&amp;#39;<br&gt;Um, clearly it did not. That is the reason for our current conversation and I was actually standing here talking to you right around the time that you say we were &amp;#39;paged&amp;#39;. <br&gt;You came through shouting the name for a party of 6 at least 3 times but never once called out for our party of 3.<br&gt;There were no apologies, no recognition of a problem or mistake or miscommunication or anything on their end. They wanted to act like heroes because they &amp;#39;could seat us immediately&amp;#39;. I&amp;#39;m not impressed, we should have been seated 20+ minutes ago. Offer me an apology or a free appetizer or something for our wasted time.<br&gt;They need to work on the consistency and thoroughness of the front end of things then they&amp;#39;d get a solid 5 star rating because everything else is on point.", "rating": 3, "date": "11/21/2015"}, {"text": "Is the Cheesecake Factory really worth all the hype/price? Not really. But do I still come here all the time and make great memories with family and friends? Absolutely. I am not a picky person. The food is good, service is always at least passable, and I will probably never stop coming here.", "rating": 5, "date": "3/17/2016"}, {"text": "I love Cheesecake Factory.  I really love the one at the Greenwood Mall.  And there are only two in the entire Indianapolis metro area, which leads me to my only complaint:  They are ALWAYS packed and wait times can sometimes be lengthy.  In good weather, no problem because you can wait outdoors; however, in rainy or cold weather, you are packed like sardines in a small area.  Ugh!!!!<br&gt;<br&gt;Now the good things:  The 32 page menu with so, so many excellent choices!  The wonderful, knowledgeable servers who hustle and work hard for a living and will do their best to make you a satisfied customer if you give them a chance.  I have been there three times in the past three months and enjoyed everything I tried each time.  My favorite was the miso salmon, which I cannot rave on enough about.  I also liked the Cajun Jambalaya Pasta; however, I really like spicy foods and this could have been spicier for my palate, but is still great as is and this is not a complaint.  I love potstickers, and their chicken potstickers do not disappoint!  YUM!  The Caramel Royal Macchiato is to die for and is huge.  It was great after coming in from a cold winter day of shopping.  It was like having dessert.  Everyone I dine with LOVES the cheesecake......of course!  When I eat dessert, which is not very often because I am too full from the wonderful food offerings, I prefer plain cheesecake and it is wonderful.  My friends prefer the many and varied flavors offered and they are always happy with them.  I also enjoy the pleasant atmosphere of Cheesecake Factory.  I realize some people complain about the prices at Cheesecake Factory, but I personally do not feel you are paying too much, considering all you get: the atmosphere, great servers, huge portions and wonderful flavors.  I also appreciate that there are lunch size portions available until late in the afternoon at reduced prices, but their &amp;#34;lunch portions&amp;#34; are still very large, in my opinion.  And, as unusual as it may seem, their lunch portions are available on weekends, not just week days like some places.  Overall, I give Cheesecake Factory at Greenwood Mall two thumbs up and will definitely return......OFTEN!!!!", "rating": 5, "date": "2/2/2016"}, {"text": "My friend and I came in around 9pm tonight and it wasn&amp;#39;t busy at all. We were immediately seated and given our menus, but sat there for 20 minutes and our server never came. We saw a lot of servers walking around and cleaning; even one server was waiting on a table close to us... Still, no one approached our table. We decided to just leave, which is really unfortunate because I usually love this place.", "rating": 2, "date": "8/13/2015"}, {"text": "The menu was far to lengthy and the the menu items are expensive. The food was just O.K. I had a gift card and I&amp;#39;m glad I used it up because I do not plan on going there again to dine.", "rating": 2, "date": "10/21/2014"}, {"text": "Amazing Food! We had the pasta and the crab dip. And of course the cheesecake! They were delicious!!", "rating": 5, "date": "6/3/2017"}, {"text": "Today is my fiancées great grandmas birthday. His brother wanted to take her out to a nice dinner so we chose the Cheesecake Factory. We arrived before their dinner rush and we had a very short wait; we put our name in and almost immediately got called for our table. The hostess brought us to our table and was very pleasant but when we got to our booth the seats were COVERED in bread crumbs and the hostess watched as my fiancée knocked off all of the crumbs so we could sit instead of taking us to another table that was actually clean. It looked as though a large group of rowdy two year olds crushed up all of the bread and  and threw it on the floor and on our seat. It was not  clean at all. After sitting down I noticed the music was very loud and we were struggling to hear each other. Our server arrived she didn&amp;#39;t tell us of any specials or suggest us any dishes she just asked what we wanted. But she was very nice. We ordered our drinks and shortly after they arrived and she also brought bread. Which she forgot to give us plates for our bread. Which is very small inconveniences but they add up. The reason I&amp;#39;m giving it 3 stars instead of 1 like I wanted to is because of the food. It was delivered about 15 minutes after we placed our order. It was all very fresh! I ordered the Fettuccine Alfredo with shrimp, my fiancée and his grandmother got the Catfish, and his brother got the Ribeye cooked medium-well. We all enjoyed our dinners the only complaint was about the green beans and the steak was mostly fat. At the end of our meal we all ordered cheesecake. Overall this was a nice establishment but I would definitely recommend visiting the Cheesecake Factory up by Carmel, it is much cleaner.", "rating": 3, "date": "3/31/2017"}, {"text": "Well, I had decided for the most part to give up chain restaurants for good.  That is until the company Christmas party.  Guess what?  I won a certificate to Cheesecake Factory, so why not do a review.  Overall, this place is a train wreck, and I have no idea how this place stays in business.  People stop wasting money on garbage like this and find some better places to eat, and save a lot of money in the process.  Just click on my lists of reviews.  I will help you get to better places.  <br&gt;<br&gt;First of all you come in and guys with guns grab your wallet and purse. Take all your cash or charge a huge sum to your credit or debit card.   Ok not literally!   I left there feeling taken advantage of.  Two people could easily spend $60 to $80 and that would be without alcohol.  It was freezing cold so I ordered coffee at $3.00.  Why will people shell out $3.00 for five cent cup of coffee?  I don&amp;#39;t understand this is ridiculous to say the least.  (Remember I am working with a gift card and that is the reason I did.  I didn&amp;#39;t want any balance left on the card which would force me to come back.)  $2 drinks are crazy, but now places are charging $3 for what a local gas station would charge $.79 for the same thing.  <br&gt;<br&gt;Ordered the pizza at $12 as an appetizer.  It was the best thing I had there but that isn&amp;#39;t saying much.  The sausage on the pizza was great.  The mozzarella cheese was fresh and made in house.  However, the crust was limp and doughy and the sauce had no flavor.  I think it was a 10 inch and overpriced in my opinion.<br&gt;<br&gt;Everything was overpriced as I looked through the menu.  I was going to get the fish and chips for $17.00.  I asked the waitress to find out if the fish was fresh or frozen.  The fish is frozen she told me.  $17.00 FROZEN FISH!  I just wanted to get up on my chair and scream to all the customers to get out and start listing all the great local restaurants we have in Indianapolis.  You can charge $17 for fish and chips but you can&amp;#39;t use fresh fish. OMG!  I went with the $12 chili rellenos burger.  I am not sure if the burger was fresh or frozen at this point I just wanted to eat and get out of this nightmare.  The burger was nice size but lacked seasoning.  The problem was the chili rellenos on top was a greasy mess and tasted awful.   I have ate really good chili rellenos and this was worst one I have ever had.   You have $1.50 in food cost and charge $12 but you can&amp;#39;t even make it good.  I didn&amp;#39;t like the fries either and I know those were frozen and came from a bag in the freezer.  No fresh made fries on this $12.00 plate of garbage.     <br&gt;<br&gt;I didn&amp;#39;t have the cheesecake on this visit, but I have had it before.  I know people love this, but I think it is just slightly above average and way overpriced at $7-$8 per slice. I have ate much better cheesecake at other restaurants.  Besides, who wants to eat 1000 plus calories for dessert....NOT ME! <br&gt;<br&gt;Portion size is not an issue as I watched plates come out to the tables, so I can understand a slightly higher price point.  However, mediocre food is still mediocre food regardless of portion size.  This place is for people that have more money than they have common sense. <br&gt;<br&gt;If you are bored of chain restaurants and think for yourself and are not manipulated by millions of dollars in TV commercials to make yourself believe you have to eat average to below average overpriced food at some chain restaurant, I am one of you.  Let&amp;#39;s all keep supporting the true food scene in Indiana.", "rating": 2, "date": "1/25/2014"}, {"text": "It&amp;#39;s cheesecake factory. Nuff said. Oh wait... their gluten free menu is extensive. Which was awesome.", "rating": 5, "date": "2/19/2014"}, {"text": "40 minute wait,  not a big deal,  it is what we were quoted.  So they call us up that our table is ready.  We are then stuck standing at the hostess stand for 15 minutes because the staff is slower than dripping Heinz ketchup.  Finally get seated.  20 minutes just to actually get a waitress and drink order.  We order the nachos with chicken as well as beverages.  I think it&amp;#39;s sad when we get our nachos before our drinks (note no alcohol was purchased).  Our nachos came out without chicken on them.  We then waited another 35 minutes for our food.  This is without question the worst service I&amp;#39;ve had.  I will not be returning to this location again.", "rating": 1, "date": "9/11/2015"}, {"text": "Very efficient cheese graters. In under 5 seconds, my crusted chicken Romano was covered in a hearty amount of Parmesan. I would definitely recommend.", "rating": 5, "date": "4/16/2017"}, {"text": "My favorite item has been removed from the menu, so I had the chopped salad which was a bit disappointing- not bad but not impressive. Our server Darby was very attentive and provided excellent service.", "rating": 4, "date": "10/15/2014"}, {"text": "Only good thing I have to say is our food arrived hot. My mother and I arrived and we were seated right away, of course our area only had 2 or 3 other occupied tables and wasn&amp;#39;t busy at all. Our server, initials M.C, asked if we wanted bread and said he will bring it right out, 25 minutes later, after he had brought 2nd and 3rd servings of bread to the other 2 tables, socialized with them, and basically waited hand and foot on them...probably because they were dressed really nice and looked like good tippers, we finally got our bread. During these 25 minutes a woman was seated next to us and had gotten bread, order taken, order delivered, and had just asked for a to-go box. After receiving our bread we waited another 30 minutes for our lunch, which was grilled salmon, to arrive. It was delivered by a different server and in fact the only time our server interacted with us was to get our drinks, tell us he&amp;#39;ll get our food right away (yeah...ok 55 minutes for salmon), and he was very quick about getting payment.  My mother and I both felt he neglected us because we didnt look as well off as the other 2 tables and therefore probably wouldn&amp;#39;t tip well. We normally tip between 30% and 40% because we know a lot of servers dont make much. It was his loss though.", "rating": 2, "date": "11/16/2015"}, {"text": "Not too bad! Better food than other reviewers led me to believe. What was off putting was the chincy plastic glassware, paper napkin under the fries, etc. Presentation was a problem. This establishment would justify its prices if they executed just a little better. Wait staff was fine. Ate at the bar. Chianti was not good, but not the restaurants fault,I don&amp;#39;t believe.", "rating": 3, "date": "1/2/2015"}, {"text": "Everything I have eaten has always been delicious. The food is pretty expensive. The cheesecake is very good but expensive. The portions are good and the food is hot.", "rating": 5, "date": "1/11/2016"}, {"text": "The Cheesecake Factory always has decent food but the prices are a stretch.  We ordered some appetizers, both around $9.00 a pop.  The deep fried macaroni came with four balls, luckily we only had four people and the egg rolls which were pretty good.  I had the soup and salad and I will say the salad did not taste very fresh but I did like the soup.  Oh I had a beer on tap that was very cold which washed down the bad salad.  I like this place, the atmosphere but their prices need to reflect the market.", "rating": 3, "date": "4/7/2014"}, {"text": "Great food, great service, and especially great dessert. However, it was pretty crowded and loud. Great music choice and the waiter also divided our appetizer and dessert that we shared.", "rating": 4, "date": "7/20/2016"}, {"text": "This review is solely based on cheesecake, not the food, not the service.  (I usually don&amp;#39;t come here for a meal, since the food is mediocre and over-priced.  Though, if you do eat here, I would recommend the Spicy Chicken Chipotle Pasta.)  So back to the cheesecake...Over the years, I&amp;#39;ve tried pretty much all of their cheesecakes.  Usually all delicious, though my favorite is the Vanilla Bean.  However, I might have found a new favorite after trying a bite (ok half) of my roommates Ultimate Red Velvet.  I always thought it would be too rich and indulgent to be good.  But let me tell you it was DIVINE!", "rating": 5, "date": "3/8/2011"}, {"text": "The food is so-so. The cheesecake is the bomb (sorry, I had the time circuits set to 1992).<br&gt;<br&gt;It&amp;#39;s a bit overpriced and not worth the hour wait that often precedes your meal. As far as sit-down dining at Greenwood Park Mall goes, it&amp;#39;s probably the best. Of course, that&amp;#39;s not saying much because the only competition is BJ&amp;#39;s, Bravo!, TGI Friday&amp;#39;s, and Applebee&amp;#39;s. I&amp;#39;m sure I&amp;#39;m forgetting one or two sterile, corporate restaurants that claim to be a &amp;#34;neighborhood favorite.&amp;#34; <br&gt;<br&gt;Have dinner somewhere else and come here for desert and a drink at the bar.", "rating": 3, "date": "7/13/2011"}, {"text": "This place is definitely on the upper-end of the spectrum, though not to terrible as far as fancy restaurants go.  The service is not bad, but the place can get really busy, especially on Friday and Saturday evenings, which slows down the frequency of free refills.  The staff itself is incredibly knowledgeable, having tried a huge variety of their own dishes.  Even in light of how busy it was, our waitress was able to chat with and discovered that she attended the same university that I had.<br&gt;<br&gt;The atmosphere at this particular location feels very much like a slightly-fancy place for suburban families.  Dressing up isn&amp;#39;t necessary, but one might be out of place wearing jeans with holes in them.  <br&gt;<br&gt;The menu itself is riddled with just downright interesting dishes.  Lots of high quality pasta (as you might expect), but also neat twists on more standard dishes.  Check out their omelets. <br&gt;<br&gt;Oh, and, unlike a lot of places, here they sing the real Happy Birthday song.  The copyrighted one.", "rating": 4, "date": "7/21/2008"}, {"text": "Had a horrible experience today for carry out. I was treated poorly even after I paid for my meal and even tipped for carry out. Thanks I will avoid this place if you don&amp;#39;t want crap treatment and it wasn&amp;#39;t even that busy where I could have not gotten help from the 6-7 employees I saw, I had to turn around after finding out I had no plastic forks or knives to go with my CARRYOUT. Most place offer these in the bag, obviously if you dont ask you dont get here from the Cheesecake Factory brand. You pay more here then other places, you would think they would provide these... long story short. Noone helped I waited in car when I was told too and waited well too long in the bright sun, thank you!", "rating": 1, "date": "8/16/2013"}, {"text": "Most people know what to expect when they walk in here- it&amp;#39;s a chain where they serve overpriced decent food and have amazing cheesecake also expensive.  My recent experience last month made me obliged to write this review... it was the service.  I have been to this specific location twice, the first time had service that wasn&amp;#39;t memorable but this last time it was absolutely horrendous.  My boyfriend and I ordered our meals, then only saw our waitress again when she dropped off our food at our table... nevermind that we had empty drink glasses, wanted to order cocktails, and wanted more bread.  Then, while we were eating I had to flag over the manager to request refills on our beverages- the manager didn&amp;#39;t even apologize for the waitress.  We decided to order cheesecake at the counter to go because we did not want to be at the mercy of the waitress or have our tab even higher for a waitress who barely deserved the tip we left for our meals.  I am more than understanding if it is a bustling evening during the peak dinner time- this is in a suburb of Indy (not downtown Chicago) and was a Tuesday night at 9pm... the rush was over if there was one for the night.  <br&gt;<br&gt;Side note-What is it about Cheesecake Factory&amp;#39;s that require the seating to be as close as possible?  It&amp;#39;s like a requirement for a new restaurant opening to cram in as many tables as possible.  I would rather wait an additional 10 minutes for a table to open up that can actually accommodate me and all my food on the table instead of sitting at a little 2 top sandwiched between 2 other tables!", "rating": 2, "date": "3/8/2013"}, {"text": "Unlike the previous poster, i do not consider this an &amp;#34;upper end&amp;#34; of any spectrum.  There are some MUCH nicer and more upscale restaurants in Indy...this just made me giggle b/c everyone&amp;#39;s perception of upper end is different.  <br&gt;<br&gt;Anyway, fear not, it&amp;#39;s a great lunch and dinner location. I agree it can get VERY busy.  If you want a table on a weekend, don&amp;#39;t attempt to make a reservation (they don&amp;#39;t take them -  yet another clue it&amp;#39;s not upper end), but you can seat yourself at one of the five tables in the bar.  Yah...not a lot of choices there.  <br&gt;<br&gt;We went for my sister&amp;#39;s birthday last weekend.  We got in fine right around 6 and there were 7 of us in the party.  Our total bill with tip was around $160.  Yet, ANOTHER reason this CANNOT be considered upper end. :) Sorry, dude.  But upper end is $100 per person, not total for 7 people!<br&gt;<br&gt;It&amp;#39;s affordable, the portions are RIDICULOUSLY offensively big but also delicious!  I always get and recommend the Crusted Romano Chicken...It is my favorite...The menu is FUCKING huge. I hate to use the word fuck (well, no I don&amp;#39;t) but it is.  I mean, it took my poor father (his first time) nearly 15 minutes to read it and then another 15 to make a decision.  I see NO reason to have/offer that many options!<br&gt;<br&gt;However, I agree....everything is good and our entire table was satisfied from the Mahi Mahi to the fish tacos to the chicken entrees and MAN, they were fast!!<br&gt;<br&gt;Our waitress ...was good, though not that personable.  I&amp;#39;m sure she was busy!  But I like someone to be a bit sweeter.  However, she did take the time to embarrass my sister and sing happy birthday.  Love that option (another clue it&amp;#39;s not &amp;#34;upper end&amp;#34; - yes, I&amp;#39;m pounding that guy but seriously??).  <br&gt;<br&gt;The cheesecake is great, but for anyone who thinks they make it in house, you are sourly mistaken.  It&amp;#39;s shipped in from CA to all the Factories around the country - yep, just another chain in Indy. Awwww...Le Sigh.<br&gt;<br&gt;No matter what, it&amp;#39;s a always a great option and if you have picky eaters who never know what to get, this place offers ENDLESS food options and has something for every taste bud. Can&amp;#39;t beat that or the $160 tab for 7 freakin&amp;#39; people who order three courses.  Not bad at all.", "rating": 4, "date": "4/6/2009"}, {"text": "If you know me you know that I love breakfast.  I used to enjoy the brunch at Cheesecake Factory a lot when I lived in Birmingham but since moving to Indy I have tried to go to places that I have not  been to in the past.  <br&gt;<br&gt;Today my sister and I went to Cheesecake factory for breakfast.  It was like seeing an old friend.  MM good!  I tend to have a signature dish at every restaurant.  Today was no different.  I ordered my regular breakfast and accompanied by good coffee and a really good server I found it to be an enjoyable experience.  <br&gt;<br&gt;So, the plan is to wait a few months and rediscover breakfast at The Cheescake Factory all over again.", "rating": 3, "date": "8/30/2009"}, {"text": "We consistently receive good service and food when we dine at this location. Our favorite entrees are the cajun chicken littles and smokehouse bbq burger. Their skinny flatbreads are excellent as well.", "rating": 4, "date": "2/12/2016"}, {"text": "I&amp;#39;m bumping this place up to five stars. Everything here is solid!. I&amp;#39;ve been to this particular restaurant a fair number of times already...enough to be impressed with their consistency. Every meal is hot and fresh, every server is friendly and attentive.<br&gt;<br&gt;If you&amp;#39;ve never been, the restaurant itself is beautiful. Enjoy a drink while you get lost in their expansive menu. It may take a while to choose an entrée.", "rating": 5, "date": "11/19/2011"}, {"text": "Ok, was excited to try Cheescake Factory for the first time. I can&amp;#39;t deny it&amp;#39;s role in &amp;#34;Big Bang Theory&amp;#34; got me interested. In fact, when my wife and I were having trouble deciding where to go, I said, I got it, follow my directions(she&amp;#39;s driving). She gave me a funny, but curious look. So off we go. We get to Greenwood Park Mall and says, &amp;#34;hmmm, have we been here before. I said no and then she guesses Cheescake Factory, because we have been to the Fridays there a dozen times.<br&gt;  We enter, I&amp;#39;m surprised by the size, especially it&amp;#39;s ultra-high ceilings. A hostess is right there, she asks how many and I tell her 2, then ask her &amp;#34;Is there bar seating?&amp;#34; She replies yes, I ask if we seat ourselves, she says yes and we head that way.(9 times out of 10 we sit in bar areas at places like this-primary reason-no kids around). My wife usually prefers booths and we found an open one and sat down. A waitress shows up promptly and says with a distressed look on her face, &amp;#34;Did they seat you here&amp;#34;? I reply, &amp;#34;No, the hostess said it was self-seating in the bar&amp;#34;. The waitress replies, &amp;#34;only for those sitting at the bar&amp;#34;. (I never hinted to the hostess I was looking for 2 bar stools at the bar). So I explain, &amp;#34;Oh, this is my first time hear, I didn&amp;#39;t understand that. So then, can we sit here?&amp;#34; She says, &amp;#34;I guess, but it needs to be wiped down&amp;#34; in a fairly unfriendly manner. I said, &amp;#34;That&amp;#39;s fine, it just needs a quick wipe&amp;#34;, joking that the &amp;#34;last people here were pretty clean&amp;#34;.<br&gt;  So, the confusion thing seemed over with, but we waited at least 5 minutes, when I reached the conclusion that between this ladie&amp;#39;s attitude and the wait to get a busboy to come wipe our table, this experience might not even get better. (cue in back of mind-&amp;#34;Big Bang Theory&amp;#34;, the episode where Penny screws with Sheldon about sabotaging his food).<br&gt;  So I decide we&amp;#39;re leaving. Well, the cheescake display is in front of us and I decide to order a whole cheescake to go(white-chocalate, rasberry truffle- MMMMMM, very, very rich)and this gives me time to ask for a manager.<br&gt;  Manager arrives, I say, &amp;#34;I&amp;#39;m choosing to not eat hear for lunch today, would you like to know why?&amp;#34;. He does, so I explained how the confusion of which seats are in the &amp;#34;bar area&amp;#34; and which seats are not, which seats are &amp;#34;seat yourself&amp;#34; and which seats are not, added to a non-friendly reception from the waitress, made me lose faith in the restaurant. He then explained the design of the place, which area was bar and which areas were not (extremely strange set-up, very undefined, kind-of sectioning the bar area off, but kind-of blending the far side of the bar area into the family side). The protocol of the bar/family-side, who seats who thing, was now finally getting clearer. <br&gt;  So then, this has been a little twilight-zoney already, but the first part was nothing. I asked the mangager, &amp;#34;So, should I return to this restaurant to give it another chance?&amp;#34; He said, &amp;#34;Yes, you should&amp;#34;. I say, &amp;#34;Why? He looked puzzled, apparently nobody had ever asked him for reasons to dine at the restaurant he is managing. He sure didn&amp;#39;t have any reasons at the top of his head and gave he this funny look (the only thing it reminds me of is when my kids were little and I had to take one of their bottles away for a second). So then I express my very real questions about eating at a place where the manager can&amp;#39;t give me any good reasons to eat there. He starts getting uptight, says I didn&amp;#39;t give him a chance. So I say, &amp;#34;Ok, try again&amp;#34; and back up a step and put my arm around my wife in a &amp;#34;I&amp;#39;m ready to listen&amp;#34; stance. So, he starts out by asking me a question, rehashing the seating thing. So I answer him, but he doesn&amp;#39;t let me finish my answer, interrupting me. I said, &amp;#34;You asked, let ME finish&amp;#34;. He then says, &amp;#34;You didn&amp;#39;t let me finish, you won&amp;#39;t give me a chance&amp;#34;. I say, &amp;#34;No, Sir, I gave you plenty of chances and you failed miserably&amp;#34;. <br&gt;   This could have been the end of it, expect he walked away mumbling, then turned around, walked past me mumbling something. So, I said, &amp;#34;You know, I understated it, YOU are a failure...as a manager. My advice to you is that you should find an occupation more suited to your skills&amp;#34;. Before I got that out he muttered something else, which prompted me to wrap it up with the phrase, &amp;#34;You just plain suck at it (managing)&amp;#34;. <br&gt;  Again, the white chocolate rasberry truffle cheesecake was amazing.", "rating": 1, "date": "8/3/2015"}, {"text": "Great food, as always. One can always expect to get a good meal at this place. We had a waiter named Nick. He was a pleasant guy, just like any decent waiter, but what made him special was his personality. He had a special flair that showed a hard working attitude and strong managerial ability.", "rating": 5, "date": "5/29/2016"}, {"text": "This place has an enormous menu!  I have only eaten a few things off of it in the many times I have eaten here.  The cobb salad is to die for, the portions are insanely huge.  The ahi tempura rolls are also great, very light and tasty.  I would stay away from the chicken pot stickers, they are heavy and doughy.<br&gt;<br&gt;The cheesecake is good, but they stopped making them onsite and started trucking them in frozen.  As a result, the quality has suffered.", "rating": 4, "date": "2/2/2008"}, {"text": "Great service and great food! Being vegan it&amp;#39;s sometimes hard to find options besides salads and fries but luckily for me and vegans everywhere they have a delicious veggie burger. Also, let me make the distinction that this is not some frozen microwaveable veggie burger option, it&amp;#39;s handmade perfection! Even if you are not vegan I would highly recommend that you try this burger next time you go to the Cheesecake Factory!", "rating": 5, "date": "2/24/2014"}, {"text": "Brought my daughter here for her 15th birthday and they totally forgot about her! Told them upfront that it was her birthday, and they still blew it. 30 minute wait turned into 53 minutes. Food was ok but they have: terrible wait times, no sweet tea, ridiculous pricing, dark dining room. Caesar salad was covered in dressing and not worth eating after a few bites. Never been here before, and now I know why.", "rating": 1, "date": "10/17/2015"}, {"text": "The food was good, service was slow, but the cheesecake was odd.  Both my girlfriend and I became really sick within hours.", "rating": 1, "date": "6/15/2015"}, {"text": "The husband and I love coming here on our Friday date nights.  We always sit at the bar since the wait is like 45 min.  Weve been pretry lucky with the bar and usually find seats with 5 to 10 min... the calamari appetizer and miso salmon are really good dishes.  Highly recommend getting your drinks made by the blonde bartender.   Always make the drink perfect.  There is another brunette male bartender who makes pretty good ones too.  We came in earlier one day when a lady bartender made our drinks.  Although she was friendly her drinks werent that great.  Anyway, we still like to go there everytime were back in indiana!", "rating": 5, "date": "5/20/2015"}, {"text": "$48 for a whole cheesecake, ouch!<br&gt;I think I will pass and buy from another establishment.<br&gt;<br&gt;Thanks!<br&gt;<br&gt;Devin Huner", "rating": 4, "date": "12/8/2010"}, {"text": "The food was OK, but a bit over priced for my taste, I would have much rather have eaten at Bravo&amp;#39;s next door. Aside from their deserts, nothing on the menu was worth mentioning.<br&gt;<br&gt;Also, their Greeter/receptionist, was extremely rude &amp;amp; full of herself! If our friends had not been sitting down already when we got there, we would have definitely left! All in all, I would say skip this place, and walk 30 feet to Bravo&amp;#39;s! The food is better, the atmosphere is nicer, and the wait staff is much more attentive.<br&gt;<br&gt; Oh, and on to top it off, it took them 45 minutes to bring my wife a Fettuccine Alfredo! All in all, I say pass on this place", "rating": 2, "date": "2/12/2011"}, {"text": "It&amp;#39;s the Cheesecake Factory, so you pretty much know what to expect.  What you may not expect is that this location is much, much smaller than any other  CF I have seen, so the wait is terrible.", "rating": 3, "date": "11/18/2013"}, {"text": "I hear a lot of negative reviews about the Cheesecake Factory in general...mediocre food and high prices.  I&amp;#39;m going to have to add bad service to their repertoire.  <br&gt;<br&gt;I&amp;#39;ve been to this location quite a few time just to get their Red Velvet Cheesecake to go.  It is so divine!  A while back I went to the Keystone location for their happy hour specials.  Their bar food was nothing special to me, good thing it was discounted because I would  never pay full price for it.  Due to that experience I never was in a hurry to try their dinner menu.   <br&gt;<br&gt;I finally got the chance to try out their food during a birthday lunch.  I was excited because my friend had just recently told me about a great dish she tried.  Upon arriving at our table I saw how packed this place was, they had to be doing something right?  Let&amp;#39;s just say it was a bumpy ride from the beginning.  Our waitress was not exactly lively and it seemed like she was rushing us to order.  <br&gt;<br&gt;We all wanted to try something different so we can share with each other. We started out with the Sweet Corn Tamale Cakes, it reminded me of corn bread which I love by the way.  The tamale cake was sweet but the sauce was citrus-y, I thought it went together really well.  We all really enjoyed the tamale cake.  When we got our entrees, I realize the portion was pretty nice but I wouldn&amp;#39;t expect anything less with the prices we are paying.  I ordered the Garlic noodle (suggested by a friend) because I love garlic!  As soon as I took a bite, BANG I was hit by a brick of salt.  All I could taste was SALT.  Everybody had a bite of my dish and we all agreed this was inedible.  I sent the dish back and they assured me that they will have a new dish within 10 minutes.  10 minutes passed...20 minutes passed...30 minutes passed... 40 minutes passed and everybody was pretty much done with their meal.  I hate being put in this situation because I felt like our party didn&amp;#39;t want to order dessert until my entree came out.  I went ahead and told the waitress to pack my meal to go and we were ready to order dessert.<br&gt;<br&gt;At this point I&amp;#39;m having a pretty crappy lunch but I know the red velvet cheesecake will turn my frown upside down.  Almost half the table was planning to try the red velvet cheesecake as well, thanks to me raving about it throughout lunch.  I couldn&amp;#39;t believe what was happening when the waitress let us know that they are out of the red velvet.  AHHHHH!!!  You can say I had a pretty horrible experience at the CF.  At least the manager waived my meal for free since I did not get to eat with my party.  Let&amp;#39;s just say this was my first dining experience with them and will also be the very last.", "rating": 2, "date": "3/2/2011"}, {"text": "This place alone is one of my regular monthly strolls! I heart this place so much. now I&amp;#39;m still shedding pounds from delivering the new man of my life, so I figured that since I only gained 30 lbs why not splurge today. Most of which I already lost at his birth! I&amp;#39;m loving it, now there&amp;#39;s just a strong urge to be pleased with The Cheesecake Factory pleasantries! Let&amp;#39;s just say that I was feeling a little velvety! lol!  Okay I watched a youtube video about this couple that brags on how you can be young &amp;amp; married &amp;amp; happy. I don&amp;#39;t quite know what attracted me to this since I&amp;#39;m almost divorced, but the situation at hand is she mentioned red velvet cheesecake from here. Now I knew that I wanted to eat something that was sweet so I stopped by here to see if it was really all that! Well as stated The Cheesecake Factory not only took the recipe &amp;amp; up&amp;#39;d the ante, but they put an whipping on my grandma&amp;#39;s ole traditional red velvet cake &amp;amp; I have yet to see anyone do this. I paid about $8.00 for the slice of cake, but it was definitely worth every single bite that I took. I had to give the rest <br&gt;to my kids, it was to much for me to consume in one sitting. <br&gt;<br&gt;Since I like to try new things, I will order the pineapple upside down cake when I go back. Cheesecake is one of my favorite desserts &amp;amp; I know where to go get my itch scratched if I&amp;#39;m in need of a good sugar fix!.", "rating": 4, "date": "2/8/2011"}, {"text": "Depending on what day/night you go...your experience can differ. I feel that&amp;#39;s like most places anyway. The 2 times I have been here I&amp;#39;ve had a good experience but others not as much. The food is excellent and their menu is huge. If you can&amp;#39;t find something to eat here then I am not sure where you will. The cheesecake is like a party in my mouth. Seriously, you can&amp;#39;t go here and not get a slice. The drinks are great as well. Then again that depends on the bartender but both times my were excellent and strong. I can see why this place has such a wait and you should avoid those days, Fri-Sat.", "rating": 4, "date": "12/4/2011"}, {"text": "Yeah, they&amp;#39;re a chain. But a tasty tasty chain with ridiculo-humongous-gigantasourous portions that I get like 3 meals out of. So WINNING. The giant menu is a gimmick, yeah. But they deliver. It&amp;#39;s always good. I want to hate them, but I can&amp;#39;t. The waiter talked us into taking home a slice of the Hershey bar cheesecake and it. was. so. good. You spend a lot, but you get a lot.", "rating": 3, "date": "9/25/2011"}, {"text": "This has always been one of my favorite restaurants. The food is always delicious and I love the open bar tops especially on busy evenings. Tonight, we arrived about 7:10pm and were told about a 40 minute wait...which turned into 50. Not a huge deal, after all we were a party of 5. Typically we have excellent service, but tonight that was not the case. It took quite a bit of time for us to get our drinks and for him to come back and take our order. When the order was placed, however, our food did come out pretty quick. The food was delicious and no one had a complaint. We did have to ask several times for drink refills, and I had to ask for parmesan on my pasta di Vinci; which typically is offered when they drop off your food. When we were all done with our meal we of course ordered cheesecake. The cheesecake was delicious, however everyone at the table was given a drink refill but me. Apparently he thought I wanted to drink my 1/4 cup of melted ice and diet coke. All in all i wasnt impressed tonight with the service, but have had such great expereiences in the past that i will definetely be back.", "rating": 4, "date": "9/20/2013"}, {"text": "For the most part I like the Cheesecake Factory especially now that its trying a lite menu.  They certainly have something for anyone with their menu reading more like a book than your average menu.  I really like their pasta carbonara and of course their cheesecakes.  Their Godiva chocolate and lemon raspberry are always good choices and if the fall their pumpkin is a fun selection.  The service is hit or miss here.  I&amp;#39;ve had great experiences and then I&amp;#39;ve also had drinks spilled in my lap with little more than a quick apology.  It is noisy so it may not be the best place for larger groups.", "rating": 3, "date": "6/23/2013"}, {"text": "The food is good (not great).  I find the service great.  You have to work at finding menu items.  My biggest  complaint with this location is it is so loud.  It is hard to hear others in your party.   I rarely go here and it is ok once in a while and of course the cheesecake is wonderful.", "rating": 3, "date": "11/8/2012"}, {"text": "I&amp;#39;ve eaten here for lunch once, dinner once, and just for dessert once. All three have been different. The time I went for lunch I believe the salad gave me food poisoning. That was not a good experience. The dinner I had was just fine. The dessert I had was by far the best. There is a reason they name this place after their desserts. Can I recommend the raspberry chocolate cheesecake? Yum yum! Their coffee cheesecake is also quite great.", "rating": 3, "date": "7/12/2010"}, {"text": "My family and I always enjoy having special meal at Cheesecake Factory. Though it is always packed in the weekend (both locations and it is also true for its Chicago area location), I stil think this is a fun place to go with your family, friends or just as a couple for any special occasion.  Also, the noise level is high, but we can still make a good conversation. Their menu is very extensive - from breakfast menu, pizza, pasta, Asian, and many more - that will definitely please everyone (...or might confuse the first timer ;) ) young or old. <br&gt;<br&gt;This particular location in Greenwood - service is good, but the place is small compared to other CF location at Keystone or other states. Be prepared for the long wait in the weekend evenings - it can be 1 to 1.5 hours long. In this case, you may as well go eat at the mall foodcourt and finish the meal plus ice cream from Maggie Moo&amp;#39;s in less than 1 hour, then browse the books at BN store for half hour, and you can come back for a cheesecake...LOL...<br&gt;<br&gt;Their price tag is moderate, at $11-$17 per entree, or more for specials and steaks. Appetizer costs at around $8-$10. You can easily spend $125 or more plus tip for a family of 5 (= 2 adults + 3 children under 10). However the meal is huge and you can always share, especially the dessert - because you will be full by the time you are ready for it. Remember, you can also order &amp;#34;lunch&amp;#34; until 5pm - the price is about $2-$3 less from regular price, but the portion size is still BIG...<br&gt;<br&gt;Thai Lettuce Wrap is a good one to try for appetizer. Their guacamole is good too. I love their Crispy Spicy Beef. The kids&amp;#39; meal is well prepared and it comes with a drink. My favorite dessert is Strawberry Shortcake that I usually share with my husband - it is delicious and a great dessert to end the big meal. Their coffee is very good too (maybe it is Illy coffee?). But if you have room, you should always try their cheesecake. Ultimate Red Velvet cheesecake is my new favorite one.<br&gt;<br&gt;CONS: Previously, my favorite was Bistro Shrimp Pasta - I love the breaded shrimp and arugula in it. I could only have 3-4 bites and have plenty left over for the next days. However, this dish is in the &amp;#34;not that&amp;#34; list according to David Zinczenko &amp;#34;EAT THIS NOT THAT&amp;#34; with 2,730 calories<br&gt;78 g saturated fat, 919 mg sodium, 141 g carbohydrates<br&gt;Many of their dishes are loaded with fat and sodium, and high calories.<br&gt;<br&gt;In summary: Cheesecake Factory is a fun place to be with your friends and family. Choose and eat your dish wisely...", "rating": 3, "date": "11/10/2010"}, {"text": "I&amp;#39;ve eaten at probably 10 different Cheesecake Factory locations. This one is probably the smallest as well as perhaps the worst experience from a food/service perspective. I really do like the CF menu/food/experience, just not this location...", "rating": 2, "date": "2/28/2013"}]}