{"address": ["101 Jordan Creek Pkwy", "Des Moines, IA 50266"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 3.5], [3, 4.0], [4, 3.5], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.5], [9, 3.5], [10, 3.0], [11, 3.0]], "2017": [[0, 4.0], [1, 4.0], [2, 4.0], [3, 4.0], [4, 4.0], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2020": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 4.5], [6, 4.0], [7, 4.0], [8, 3.5], [9, 3.5], [10, 3.5], [11, 3.5]], "2018": [[0, 4.0], [1, 4.0], [2, 4.0], [3, 4.0], [4, 3.5], [5, 3.5], [6, 3.5], [7, 3.5], [8, 3.0], [9, 3.0], [10, 3.5], [11, 3.5]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "I ate at restaurant Aug, 13, 2020.  Wait time for food was reasonable and serve was also good,  However, didn&amp;#39;t appreciate waiter calling myself and friend Honey all the time.  My disappoint was in my food.  I ordered French Country Salad with beets, asparagus, and pecan because they are foods I really like in season.  However, beets were cut into small pieces and I never saw or tasted asparagus.  Very disappointing.  However, original style cheesecake was very tasty.", "rating": 3, "date": "8/14/2020"}, {"text": "We had been to the Cheesecake Factory a few years ago and we weren&amp;#39;t very enthusiastic about it. We tried it again for Valentine&amp;#39;s Day dinner. It was pretty good. We had a 45 min wait (on Valentine&amp;#39;s no big deal). Our waiter was pretty good had to wait for drinks a time or two, again no big deal. Our food was pretty good. We will definitely be back.", "rating": 4, "date": "2/15/2020"}, {"text": "Have been to The Cheesecake Factory a few times and have never left hungry. It&amp;#39;s a little pricey but the portions are very big. They also have a very large menu so lots of options to choose from. It&amp;#39;s an ok place to grab a meal if you&amp;#39;re already at the mall and wanting something a little extra than the food court. Servers are very nice so that&amp;#39;s always a plus.", "rating": 3, "date": "9/23/2018"}, {"text": "Great food  Ordered delivery however food portion is not as much as dine in. Would be appreciated if brown bread is included for delivery . Overall great experience", "rating": 5, "date": "4/6/2019"}, {"text": "We had some time to kill before our movie so we stopped in The Cheesecake Factory for some drinks. Just stepping in made me hungry and forget all about the movie popcorn I was about to eat. So we decided to share an appetizer to go along with our drinks. <br&gt;We ordered the Tex Mex Eggrolls and I must say, they did not disappoint. Spicy but flavorful and the avocado cream was to. die. for. <br&gt;The service was good as our waitress frequently checked in on us and the food came out very quick. <br&gt;<br&gt;Overall, a great restaurant to go to if you&amp;#39;re in the Jordan Creek area!", "rating": 5, "date": "3/1/2018"}, {"text": "Excellent service and love that they share the calories per dish.  I had the Cajun Shrimp and Sausage Andouille.  Was excellent.  The cocktails are not strong enough but still all in all, this is a fun place to eat at and unwind.", "rating": 4, "date": "9/2/2019"}, {"text": "Our server was Andrew and the service was fine, despite the fact that the chicken madeira was cold and pizza was burnt along with the bread. We also didn&amp;#39;t get a free dessert even though we specified that we had a birthday.", "rating": 2, "date": "7/11/2020"}, {"text": "Food quality and portions were fantastic! However the menu is rather overwhelming and needs to be cut down a bit. It feels overdone, or over-compensating. The wait time was long for our dinner at 7:30pm on a Friday night. However our waitress was the perfect balance of attentive and out-of-the-way. Our appetizer was quite large, our entrees were about double the size we needed but they make for excellent leftovers. The most disappointing part was the Cheesecake. We got key lime cheesecake with raspberry drizzle. The raspberry drizzle was deliciously tart, but the cheesecake itself was very eggy-tasting. The egg flavor was overwhelming and we couldn&amp;#39;t finish it. I give this visit a 3.5/5.", "rating": 4, "date": "1/19/2018"}, {"text": "It&amp;#39;s been a while since I&amp;#39;ve had some bomb food while in Des Moines. One of my good friends suggested this restaurant on a late Saturday night for our cheat meal, and I am so glad we came.<br&gt;<br&gt;Although it was very busy (as expected), we were told that our wait would be probably 20 minutes. That was no problem at all for us, so we ended up walking around/window shopping at the mall. When we came back, we were seated right away. We chose to sit at the high tables near the bar because we didn&amp;#39;t want to be squished next to other tables in the main area. There were plenty of high tables available, too. <br&gt;<br&gt;We started off with the buffalo wings with the bleu cheese dressing. The wings and dressing were amazing. I&amp;#39;ve never been a fan of bleu cheese dressing in the past, but I could eat a giant cup of theirs. The wings were spicy and flavorful, so it worked well with the dressing. The complementary bread n&amp;#39; butter were also a hit. <br&gt;<br&gt;After reading through the novel of a menu, I finally ordered the smokehouse bbq burger (medium well) with sweet potato fries as a side. I also asked the waiter to make sure my burger was seasoned while cooking, and this was no problem. The burger was delicious! The fries were not too salty and tasted even better with that bleu cheese dressing! <br&gt;<br&gt;I was very full and very satisfied with my meal. We were in the mood for some Oreo or cookie dough ice cream, but I believe this place only offers vanilla ice cream. Bummer! <br&gt;<br&gt;All in all, everything was a 10/10. Can&amp;#39;t wait to come back, and also looking forward to trying their breakfast!", "rating": 5, "date": "9/11/2019"}, {"text": "Went for a late night slice of cheesecake and besides the long wait &amp;amp; price, couldn&amp;#39;t have been more pleased with my visit. Got two slices of cheesecake for $17- turtle cheesecake and their Godiva. Definitely recommend the Godiva- super decadent and delicious. Love that their open late for this option.", "rating": 4, "date": "7/8/2019"}, {"text": "Take forever to take the order! <br&gt;<br&gt;They took forever to take my order and seated me right next to the cash register. <br&gt;<br&gt;No consistency in service but their prices are consistently high!", "rating": 1, "date": "10/21/2019"}, {"text": "This is by far one of my favorite restaurants! I always go for the pasta dishes. The chicken bellagio is one of my favorite menu items they have for around $15. The whole menu has a wide array of everything though. <br&gt;<br&gt;The waitstaff is really good about giving recommendations if you can&amp;#39;t decide. And they are quick at knowing when you need a refill or anything else. This place has great food dishes with healthy servings and recommended if you&amp;#39;re in the Jordan Creek area. The amount of food you get with each dish makes this place even better.<br&gt;<br&gt;Expect it to be fairly loud during peak business hours. And they pack you in pretty tightly. If you decide to re-arrange to a different table, because you don&amp;#39;t want to be touching elbows, they are usually pretty good about it. <br&gt;<br&gt;Tucked into the Jordan Creek Mall, this place has many people come through the doors. No reservations of course because what&amp;#39;s the point in that? The wait during the week nights is about 15-20 minutes but you&amp;#39;ll have plenty of chances to look at the menu while you wait. If you arrive on the weekends plan for a longer wait. You&amp;#39;ll leave with a full stomach.", "rating": 4, "date": "10/19/2016"}, {"text": "Astounding low on the customer satisfaction scale. <br&gt;Waiter takes my credit card and charges it and then returns the receipt for signature but no card. <br&gt;The card cannot be found anywhere.....<br&gt;<br&gt;My consolation prize for all the inconvenience to reestablish all the automated payments and hassle etc...........is we are not sure if we are the ones responsible for losing your card and I&amp;#39;m sorry......<br&gt;Not only did they lose my card but thought it was appropriate to insinuate that I may not be being honest/accurate with my account of events.....<br&gt;<br&gt;They may be in the customer service business but definitely not remotely close to being in the customer satisfaction business....amazing.", "rating": 1, "date": "11/11/2019"}, {"text": "We visted on Sunday May 12, 2019 ( Mother&amp;#39;s Day which i expected it to be busy) and surprisingly we got seated within 15-20 mins of being there. This is one of my favorite resturants and coming from Atlanta Georgia, your wait time can be 1hr-2hrs depending on the day and whats going on in the city. <br&gt;<br&gt;Our server this day was Grace, she was extremly pleasant and sweet. However, the food wasn&amp;#39;t ! I had the Shrimp Scampi and Steak Diane, the shrimps &amp;amp; the angel hair tasted like straight WATER! It didn&amp;#39;t have a drop of flavor. My husband had the Louisiana Pasta and that had to be worst than mine. His chicken was BURNT &amp;amp; DRY, the pasta just tasted like boiled noodles. It seemed as if they didnt put any seasoning in it. My Brother-n-law had the Carne Asada it looked pretty decent. However, his white rice was hard and corn was watered down. I was extremly disappointed being that this is one of my favorite resturants, paying $106+ for digusting food, and i spent my first Mother&amp;#39;s Day here.", "rating": 2, "date": "5/12/2019"}, {"text": "This was once one of my favorite restaurants to not only dine at, but get take out, at least once a week.  <br&gt;Unfortunately, the service has fallen so much that I only make this a choice when I get an extreme craving for their Santa Fe salad.  Even then, they can&amp;#39;t seem to get this right.  3 of the last 5 times I ordered it, they forgot to put the chicken on it.  Twice they forgot dressing and I had to drive back.  All 4 incidents got a half heated apology? and a offer of a gift card.  Go forward, I&amp;#39;m on the hunt for this salad somewhere else.  Or, I&amp;#39;m going to have to dig thru the salad at the restaurant to make sure it&amp;#39;s made right.", "rating": 2, "date": "4/28/2019"}, {"text": "I&amp;#39;ve been to this location a few times, and taking into consideration this is a major chain, its pretty good. My biggest complaint is the menu. Its overwhelmingly huge. Sometimes to the point where I just stop looking and ordering whatever the server suggests. However, if you are on a diet always check the calorie count, as many of their dishes are high in calorie. If you want to watch what your eating I recommend looking at their &amp;#34;skinnylicious&amp;#34; menu. Everything on it is under 600 calories.<br&gt;<br&gt;By far my favorite menu item is the Chicken Madiera. Its a one the cheesecake factory staples and is enough for two people to split. I would compare it to a sweetish Chicken Marsala. It comes with cheese over top and asparagus which adds a nice bit of bitterness to the otherwise sweet dish. The Pasta Napoletana is also good, though perhaps a bit overwhelmed by all the ingredients. Normally I eat the Pasta Da Vinci if I have pasta there, though its pretty much just the Chicken Madiera with pasta. I&amp;#39;d stay away from their steaks if you are picky. They aren&amp;#39;t bad but I wouldn&amp;#39;t consider them the best. As far as cheesecakes go, they are good but extremely rich. My favorites are the White Chocolate Truffle and the Lemon Raspberry Cream cheesecake&amp;#39;s. They are big enough to split. Last time my group of 3 split one piece and we were more then satisfied.<br&gt;<br&gt;In closing, I&amp;#39;d say if your looking for something to eat that isn&amp;#39;t food court food, and don&amp;#39;t want to leave the mall this would be a good option. However, I wouldn&amp;#39;t go out of my way to eat it if you have other options.", "rating": 4, "date": "3/18/2018"}, {"text": "Visited for lunch and was seated right away. I&amp;#39;ve been to a few locations and they are all beautiful, same with this location and it is huge too. <br&gt;Our waitress (kicking myself for not remembering her name) she had brownish/red hair with a stretchy headband on was SO sweet and helpful. She did everything with a smile and made our meal that much more enjoyable. <br&gt;<br&gt;We ordered the avocado egg rolls appetizer and they were delicious. <br&gt;Ordered the Cuban sandwich for lunch. Overall the sandwhich was great, meat with a little too thick (not usually a problem lol) but with the bread it made it somewhat hard to eat. It also could use a little bit more sauce but I enjoyed it! The portions sizes are large so definitely had left overs to bring home. <br&gt;<br&gt;Overall good experience and 100% recommend eating here. We were too full for Cheesecake I&amp;#39;m guessing it is just as good as the other locations we&amp;#39;ve been too!", "rating": 4, "date": "3/22/2019"}, {"text": "Maybe you guys are sick of me talking about gluten-free food. You shouldn&amp;#39;t be, it shows how much a business cares about all of their customers. <br&gt;<br&gt;Their GF menu is off the charts, and they&amp;#39;ll generally make everything to fit your needs - whether you have allergies or not. Extra sauce? Sure. Cook with oil instead of butter? Definitely. Generally the staff is really friendly and knowledgeable, but if they don&amp;#39;t know, they&amp;#39;ll ask. <br&gt;<br&gt;My normal choices are the 4 cheese pasta (without cheese), or the old fashioned burger with a gluten free bun. They toast the bun and it is fantastic. Their burgers are large and really filling, with a few interesting choices. Fries are a good choice, because any substitution is charged ala carte (not the best business, IMO...), but you have to ask them to dedicate a fryer. Celiacs- remember that.<br&gt;<br&gt;As for the rest of the menu, they&amp;#39;ve got what seems like hundreds of choices that are all made well and my husband likes most of them. Would not go here for a steak or seafood, save that for some of Des Moines&amp;#39; local joints. If you&amp;#39;re craving lots of carbs, fat and sugar - Cheesecake Factory is your go!<br&gt;<br&gt;What could make this 5 stars for me? More professional staff, maybe another GF appetizer and definitely a little more light in the dining room.", "rating": 4, "date": "1/24/2016"}, {"text": "3.5 stars. I&amp;#39;ve had some hit or miss experiences at this Cheesecake Factory location and it&amp;#39;s been awhile since I&amp;#39;ve dined here. There have been some recent changes to the menu including a Super Foods section. There were a couple of salads that sounded appealing and I finally decided on the Vegan Cobb Salad. This comes with a lot of ingredients: avocado, beets, garbanzo beans, quinoa, faro, asparagus, cucumber, tomatoes, and sunflower seeds on a bed of lettuce with house vinaigrette. This was a very tasty salad but although it looks substantial, it would have been MUCH better with less lettuce and more quinoa and faro - I ended up leaving most of the lettuce behind. But kudos for adding some more healthy options to the menu. Husband had the Cuban sandwich and it was very tasty. Was sad to see they no longer offer the unsweetened green iced tea but I guess I&amp;#39;m in the minority liking unsweetened beverages. We decided to be good and not indulge in cheesecake. Javier was a very attentive server.", "rating": 4, "date": "8/14/2018"}, {"text": "Their almond encrusted salmon and kale salad is one of my favorite dishes!  I love it!  It&amp;#39;s a generous portion of kale, quinoa, lemon zest, radishes, shaved brussels sprouts and a serving of perfectly cooked salmon nestled on top. <br&gt;<br&gt;I always get a latte.<br&gt;<br&gt;And sometimes get a few bites of cheesecake :-)", "rating": 4, "date": "1/17/2018"}, {"text": "My boyfriend and I came here for our one year anniversary with plans to do happy hour and then dinner. We hadn&amp;#39;t been here for happy hour before and wasn&amp;#39;t aware you couldn&amp;#39;t do the happy hour deals in the dining area? Seems stupid to me. We asked our first server about happy hour deals and she said those aren&amp;#39;t allowed in dining areas. We asked to go to the bar and she said yes and walked away. No direction, didn&amp;#39;t help us, nothing. She was obviously not pleased. <br&gt;<br&gt;Our server in the bar area was very sweet, helpful, and attentive. Although we would have liked to sit in the dining area, the food and drinks were all great. Their happy hour deals were good as well! We got a huge plate of nachos for $5 as an app. I got the eggplant parm for my meal and it was so big I got three meals out of it! Will be back, but wish you could enjoy happy hour anywhere in the restaurant not just the bar.", "rating": 3, "date": "7/18/2018"}, {"text": "Everything here was great. The wait time we were given was accurate, the servers were very professional, and the food was fabulous. I could only give four stars tho, because it&amp;#39;s so dark in there!! I needed the flashlight on my phone to read the darned menu! Also, it was hot. Stifling. I&amp;#39;d go back- during the day- so I could see what I was doing.", "rating": 4, "date": "12/8/2019"}, {"text": "Sat fairly quickly considering it was a weekend and just after the lunch rush. Is this a good sign or a bad sign?<br&gt;Its not always my first choice for restaurants out in the Jordan Creek area but this wasn&amp;#39;t my turn to pick. <br&gt;The waitress took little to get to us but once she did.... well... lets say I wish I remembered her name. She was overly sweet, helpful and cheerful. She made us all smile and kept a close eye on us. Any request was quickly taken care of. Kudos to her! She was one in a million with really good service on her part.<br&gt;<br&gt;I think they needed to rethink the design of the restaurant. The arched ceiling make for a louder than needed ambiance. I felt like all the sound echoed and carried more than it should have. The radio could be turned down so I didn&amp;#39;t have to raise my voice or the waitress struggle to hear my order.<br&gt;<br&gt;I decided to try and eat decent. (ha) Skinnylicious Caesar Salad:<br&gt;Romaine Lettuce, Croutons, Parmesan Cheese and Our Special Caesar Dressing.<br&gt;If you are a light eater - ASK FOR THE HALF SIZE. <br&gt;I didn&amp;#39;t realize that this thing would come out on a plate bigger than my head. I hate to waste food. I had to box over half of this salad up. Waitress said even on this menu I would have had to requested a lunch size.. HOW is this Skinnylicious at this monstrous portion? Just saying. <br&gt;<br&gt;Somehow my lunch buddy got a half size on hers, ... which was the same thing.. without the chicken. We could have shared the salad.  However she ONLY got the salad cause they were out of the Turkey Burger (fail) .<br&gt;<br&gt;My other lunch buddy got a pasta with shrimp. I cant remember the name but she really enjoyed it cause it was inhaled and gone! <br&gt;<br&gt;Last of course, we left room for cheese cake. The only down side is they have just ONE choice for gluten free cheesecakes on the giant list. Good news it was the Godiva Chocolate Cheese cake. Holy mother of chocolaty goodness. It&amp;#39;s so rich that the three of us could not finish it and, oh darn, had to take it home too. <br&gt;<br&gt;So my feed back overall:<br&gt;1. Service from this waitress: excellent- again wish I remembered her name. <br&gt;2. Louder than expected atmosphere<br&gt;3. overly HUGE menu full of advertisements (which I don&amp;#39;t get)<br&gt;4. Does have gluten free options on normal menu. <br&gt;5. Do still enjoy the warm bread they bring out.", "rating": 3, "date": "11/25/2015"}, {"text": "It&amp;#39;s very frustrating that this place cannot get their orders out the door for delivery in a timely manner. We live 3 miles from the Cheesecake Factory. Once I receive the alert that my dasher has my order and my food is in route it&amp;#39;s typically 25-30 min before the order actually arrives. The dasher is very apologetic and states that the order was not ready upon their arrival so they wait...and this really ticks me off! Please don&amp;#39;t send a text to the customer until the order is actually OUT THE DOOR!!!", "rating": 2, "date": "9/7/2019"}, {"text": "The service is generally pretty good and the food tastes good. <br&gt;<br&gt;But if you eat here, the food will probably kill you due to its nutrition, and this place is horrible about giving that information out, answering questions about the content of the food, and adds things to your food that you simply don&amp;#39;t want and don&amp;#39;t know to tell them not to add (why was there powdered sugar on a mint leaf on top of my maker&amp;#39;s mark)? I can&amp;#39;t feel good about recommending this place to anyone.", "rating": 2, "date": "10/4/2015"}, {"text": "I love this place.  Every single time I come here I have a good time.  The food is good, the drinks are awesome (but kind of expensive), and the cheesecake is to die for.<br&gt;<br&gt;My favorite is the Godiva cheesecake.  It is heaven in the form of a slice.  And not a small one!  <br&gt;<br&gt;The environment is very nice.  Dim lighting, nice décor, and just that good warm feeling of satisfaction.<br&gt;<br&gt;Only complaint is there is always a wait.  But that&amp;#39;s to be expected here because it just that good.  Yes, its a chain, but it&amp;#39;s a very very good chain!", "rating": 5, "date": "3/10/2016"}, {"text": "We stopped for dinner tonight, after a 15 minute wait we got seated. We waited another 10 minutes for a waitress to take our drink order, we asked to order our food at same time. We ordered an appetizer and dinner entrees. The app was another 20 minutes. The place was not overly crowded.   At 55 minutes after we ordered, I asked to see a manager. We asked to cash us out for the drinks and app. Kudos to him, he wouldn&amp;#39;t accept any money, he covered he bill. He asked if he could go get our meals right away, by then we were over it and ready to leave.", "rating": 2, "date": "7/5/2019"}, {"text": "Came here while on a work trip.  The food is the same as every other location and the ambiance was nice.  My only complaint was that for a restaurant that gives such large food portions, the drinks are rather small.", "rating": 3, "date": "9/4/2018"}, {"text": "This place is pretty good for a once in a while treat. Once my boyfriend and I came in we were informed that there&amp;#39;s a 40min wait which thankfully only took 20mins. We were seating right by the kitchen and the waiter station which was a huge bummer. The food was okay but honestly not worth the price. Our waitress (sadly don&amp;#39;t remember her name) was amazing! She helped us so much, even going back and asking other waiters for their opinions. She&amp;#39;s what made the whole visit amazing. I feel like it would be great any day other than Saturday night.", "rating": 4, "date": "10/28/2018"}, {"text": "I&amp;#39;m not a newbie to The Cheesecake Factory since there are locations where I&amp;#39;m originally from, but I did want to post a review since I&amp;#39;ve recently tried a couple of dishes different from what I usually order (turkey burger, shrimp pasta, or chicken enchiladas with corn cakes). Last night I finished a torturous workout and wanted something relatively healthy. So I decided to order the kale and quinoa salad and Thai chicken lettuce wraps. Both were really good, but had huge portion sizes. The salad could easily feed four people. I passed on the cheesecake, which was no minor feat since I love most of the ones I tried. My fave is the banana cream pie cheesecake. It&amp;#39;s really light and not too sweet. When I want to indulge I usually go for the cookie dough chocolate chip cheesecake. Love this place!", "rating": 5, "date": "7/14/2018"}, {"text": "It&amp;#39;s suck a nice day out... the ppl are nice and the service was not that bad on game day...", "rating": 4, "date": "9/8/2018"}, {"text": "I was super excited to dine at CheesecakeFactory as I have not been in almost a year but this location left me never wanting to go again. <br&gt;<br&gt;1.They tried to see us in the bar area and we said no- we asked to be seated in a booth- with hesitation they seated to the other side of the restaurant.<br&gt;  <br&gt;2.The silverware was dirty- I ignored that.<br&gt;<br&gt;3.We waited for a good 10 minutes to order- after we were ready. <br&gt;<br&gt;My dates salad was brown- I started to eat and we waited and waited to complain- but by the time they came around I was almost done with my mediocre  chicken enchiladas. <br&gt;<br&gt;Are the glasses now always plastic here? <br&gt;<br&gt;More soon-", "rating": 1, "date": "10/12/2014"}, {"text": "I travel extensively and have been to many Cheesecake Factories across the US and I must say hands down Des Moines IA is my favorite.  I am a lone traveler and will typically eat at the bar well there is no greater feeling than sitting at a bar alone but feeling welcomed and cared for. Thank you Christiana T for being attentive, approachable and just all around fun!  Des Moines Cheesecake Factory your have a a excellent bartenders I didn&amp;#39;t get the names of the other two but they too were so great with customers.", "rating": 5, "date": "7/27/2018"}, {"text": "I was so disappointed in my lunch today. Ordered the Thai curry chicken and it was not appetizing. The sauce was broken, not smooth and creamy like a coconut milk curry sauce should be. Very few vegetables were present and half the plate was piled with rice. With an ice tea and tip my bill was right at $25. Not even close to worth that price. Hopefully there are other menu items that are better.", "rating": 2, "date": "8/27/2019"}, {"text": "I&amp;#39;ve eaten at the Cheesecake Factory many times and every time I&amp;#39;ve found that it&amp;#39;s only okay. The service is always wonderful, I&amp;#39;ve never had any issues with that. I got the chicken dumplings and they were plated just absolutely beautifully, but it tasted like something I could&amp;#39;ve gotten at Panda Express for MUCH cheaper. The bread they give you at the beginning of the meal is honestly the best part. The cheesecake is good, but nothing to absolutely die for. Overall, it&amp;#39;s just an incredibly average restaurant. I always want so much more from this place.", "rating": 3, "date": "3/14/2018"}, {"text": "Great cheesecake!!!!<br&gt;<br&gt;TERRIBLE FOOD. <br&gt;the manager was a total jerk. <br&gt;My nachos came out burnt and was told that&amp;#39;s  normal because of the grease???<br&gt;I won&amp;#39;t be back. <br&gt;<br&gt;This was only my second time there. I had the same experience besides the burnt nachos. Terrible food and good cheesecake.", "rating": 1, "date": "8/31/2016"}, {"text": "Damnnn that cheesecake and all its delicious calories! We just popped in and grabbed three slices for five of us. Macadamia nut, lemon meringue and the Ultimate red velvet! The crew voted and The red velvet was the best! Absolutely amazing! The only thing is I thought it was a bit pricy. Three slices of cheesecake racked up to almost $30...  we will probably be back but not until I work off the calories.  great job guys", "rating": 4, "date": "3/9/2019"}, {"text": "Today&amp;#39;s encounter will be my last at Cheesecake Factory. <br&gt;<br&gt;My meal started out with a blue cheese salad, which had no blue cheese flavor.  It had an extreme about of garlic in it that dominated it.<br&gt;<br&gt;The menu described the pasta  I ordered as being in a rich tomato sauce; instead came out charred.  The sauce was dried out and tasted burnt.  When I said something to the server he was annoyed and expected me to know exactly what else I wanted to order right then. <br&gt;<br&gt;When I did figure it out, I ordered their lemon shrimp pasta but asked to have linguini or spaghetti instead of the angel hair. He said ok but still brought it out with angel hair. I asked to speak to a manager,.<br&gt;<br&gt;The manager immediately knew what was wrong so the waiter had to know he was giving me the wrong thing. The manager apologized but was not genuinely apologetic. <br&gt;<br&gt;He offered to remake the dinner with linguini.  After about 20 minutes my dinner arrived but the shrimp was over cooked. I ate it anyway. They  probably  used the same shrimp from the pasta that was wrong,  and therefore they were dried out/over cooked.<br&gt;<br&gt;Overall a waste of $20+ and therefore I will not be back!", "rating": 1, "date": "6/13/2017"}, {"text": "We recently returned to this restaurant after a 20 year hiatus.  our first experience was with virtually raw hamburgers. now we met my friends there and the food was miserable. The toast on my friends sandwich was burnt.  the two salads my girlfriend and I had were very limp as if frozen and room temperature.    my skinny burger was dried to the bone. the good things were my husband&amp;#39;s fries and my girlfriends chicken salad sandwich.  Her husband ordered a grilled chicken sandwich and out came a batter fried chicken in bread. The cheesecake was super good", "rating": 1, "date": "8/11/2019"}, {"text": "Fiancé and I got back in town from<br&gt;Vegas yesterday and decided that - you know what? We needed carbs. Could have had something to do with coming home to snow. After brief discussion, we settled on the caloric tastiness that is Cheesecake Factory.<br&gt;Our server, Javier, was both friendly and good at his job. Always appreciated.<br&gt;Waiting on our appetizer, the brown bread was delightful and lightly sweet, like always.<br&gt;We started with an appetizer that we were both craving, the Cuban Rolls. As usual, they were delicious and the sauce to dip them in hit the spot.<br&gt;We both ordered our usual - for me, the pasta carbonara with mushrooms instead of peas and extra bacon. For the fiancé, the chicken Bellagio with extra sauce. Both did not disappoint - smoky bacon, tasty mushrooms. There&amp;#39;s been mistakes in the past, but this visit was nice! I recommend.", "rating": 4, "date": "1/27/2017"}, {"text": "Amazing food and service, stuffed mushrooms are the best. One of my favorites in Des Moines.", "rating": 5, "date": "8/7/2019"}, {"text": "O M G Just finished piece of &amp;#34;Salted Carmel&amp;#34; Cheesecake.   Creamy Delicious GOOOODNESS.  UNBELIEVABLE    FYI. Shared w/Dog.  He was equally pleased.", "rating": 5, "date": "3/2/2019"}, {"text": "Okay, so maybe there isn&amp;#39;t a new chef as I&amp;#39;m unsure of their turnover.  However, there was definitely a positively delightful new experience at the West Des Moines, Iowa location of the ever popular Cheesecake Factory!<br&gt;<br&gt;For the first time, in a very long time, the Cajun chicken littles were not over cooked.  They were just simply scrumptious!  A delight to eat.  This is my all around favorite at CCF to enjoy when visiting WDM to get away from the frantic football &amp;#34;hot mess&amp;#34; in Iowa City.<br&gt;<br&gt;The waitress was super polite and attentive.  The bread/butter service was super-duper.  The new way to do the butter (slice instead of individual packets) was a homerun.  <br&gt;<br&gt;Yeah!  Go Team CCF!", "rating": 5, "date": "10/9/2017"}, {"text": "Went here late night for an appetizer, slice of cheesecake and some wine. The food was all great and the macadamia nut cheesecake was suuuuper tasty. <br&gt;<br&gt;Our service is what made the visit so enjoyable, our server was super friendly, helpful and attentive. We don&amp;#39;t make it to the Cheesecake Factory very often but our most recent trip put it on the list of spots to consider frequenting more often!", "rating": 5, "date": "11/26/2018"}, {"text": "Mmm! I came in around 5 and there was plenty of seating in the bar area so I bellied up and ordered a Whiskey Smash. I would order it again... And again. I was tempted by the bourbon and honey as well as the old fashioned but what sold me in the whiskey smash was the passion fruit. No disappointment here. I ordered a side greek salad and the blue cheese and pear flatbread. This was a delicious, light choice. I did indulge in the red sangria for dessert. I saw the bartender make it... It was 95% soda... Umm no. If I&amp;#39;m paying $10 for a drink, I want most of it to be booze. Not a big deal, I just won&amp;#39;t get it next time. My bill total was $36. More than I was trying to spend but.. It was yummy and I always appreciate the pretty decor and fancy feast ambiance when I come in here. This is a great pit stop before catching a flick at the movie theater.", "rating": 4, "date": "1/24/2016"}, {"text": "I waited 1:15 minutes for my food on my anniversary they brought it out twice wrong. I don&amp;#39;t understand what&amp;#39;s so complicated no mushrooms gluten free noodles. Bartender was amazing had good drinks. The kitchen sucks this is not the first time this is happened to us but I&amp;#39;ve never been so frustrated to write about it my wife ate her dinner on her own while I was waiting for them to make it for the second time and it still comes out wrong. Should&amp;#39;ve trusted my gut and went to Flemings restaurant.", "rating": 1, "date": "9/3/2018"}, {"text": "Pricey but worth it! Great high quality food in my opinion. And very large portions so fits the price. And tastes so delicious and kind service, my favorite appetizer is the spinach artichoke dip! Soo good!", "rating": 4, "date": "2/17/2019"}, {"text": "On a whim, herself, the sister, niece and I decided on brunch at the Cheesecake Factory before shopping. Service was grand. Our server apologize profusely that I would have to order the lemon ricotta pancakes instead of a small salad dressing on the side. They were not taking a chance on lettuce. I didn&amp;#39;t finish the spinach omlette as the eggs were scorched.", "rating": 4, "date": "11/24/2018"}, {"text": "Food serve here do have very decent taste; place is very clean; but their music is just too loud! I wish mgmt will turn down a bit!", "rating": 5, "date": "2/10/2018"}, {"text": "This is one of the few chain restaurants that my husband and I enjoy.  He always gets the same dish, chicken bellagio, which is delish, and I like to sample the menu.  They have a few fab items (most small plates, french country salad), some good ones (jamaican shrimp dish) and eh, I&amp;#39;ve had better (glamburger and lettuce wraps). Just a couple examples of what I have tried over the years.  The larger menu items are enough to feed two or have leftovers to bring to lunch the next day and make your coworkers jelaous.<br&gt;<br&gt;Along with the menu items, we have both tried a variety of their cheesecakes.   This is the hardest part, which one to get each time.  My husband&amp;#39;s fave is no longer offered, coconut cream pie cheesecake, but we are both chocolate fans and there are a few to choose from under that category. Godiva and s&amp;#39; mores may be my two faves.<br&gt;<br&gt;You would think with such a large offering of items that the quality would suffer, but generally speaking we have enjoyed our experience.  The one down side is probably it&amp;#39;s popularity and long wait times, but well worth it as long as you don&amp;#39;t get hangry.", "rating": 4, "date": "5/3/2015"}, {"text": "I usually love eating here but it was an awful experience. The tables and silverware were soaking wet, food took about 30 mins to come out (we only ordered an omelet and burger), and when we got our food it was the wrong thing. Food was not up to standards as well. I understand it was Mother&amp;#39;s Day but the rush had well passed and when the family of 4 orders steaks and gets their food before.... there is a problem.", "rating": 2, "date": "5/13/2018"}, {"text": "Came here on a Friday night at 8, waited half an hour for a table, and then another half an hour for drinks. It seems like anytime I come here I always have to wait. Which is okay.<br&gt;<br&gt;Their cheesecakes are to die for, and that&amp;#39;s coming from a person that does not like sweet. The food is pretty much up there too. I had their kobe hamburger, it was juicy and everything you can ask for in a hamburger. <br&gt;<br&gt;It&amp;#39;s a good place for a date night, but expect to spend over $100. :-)", "rating": 4, "date": "3/5/2016"}, {"text": "I love Cheesecake Factory but today I do not! <br&gt;It&amp;#39;s a Monday and it&amp;#39;s usually not busy and the service was worse than on a busy day. <br&gt;They got my friends order wrong and it took another 15 mins for it to come back out. <br&gt;When I got delivered my food I asked if I can have grated parmesan and he said sure and never came back! So disappointed and our waitress never came back to check on us after my friend got her food. Our waters were gone and no refill. We finished our food by the time she came to check on us... worst service I&amp;#39;ve had here in a very very long time.", "rating": 1, "date": "11/5/2018"}, {"text": "We went to Cheesecake Factory tonight for our anniversary. We waited maybe 5 minutes for a booth. Our waitress, Jerica, was ok. She didn&amp;#39;t seem very enthused. Maybe she is new or had a long day...I don&amp;#39;t know but not how I would picture a waitress at The Cheesecake Factory. We ordered our drinks and an appetizer. We love the loaded tator tots! Matt ordered the Spicy Cashew Chicken and I ordered the Parmesan Herb crusted chicken, with mashed potatoes and asparagus. All I can say is OMG!!! The food was SOOOOOO good! I tasted Matt&amp;#39;s spicy chicken, which was excellent but a little too spicy for me. I had three chicken breast portions, mashed potatoes that are to die for and the asparagus was cooked perfectly. Done but still crisp. We wished we were hungry enough to eat all our food but we got so much! We both brought home leftovers for tomorrow or Sunday. I have had a couple not so great experiences at Cheesecake Factory but tonight was perfection! I highly recommend these two dishes and the loaded tator tots!", "rating": 5, "date": "7/13/2018"}, {"text": "For a late-night, after-show place to get consistent food, The Cheesecake Factory is all right. I seem to end up here after concerts, plays, and some early evening event. I only order Tex Mex eggrolls and a piece of cheesecake to take home. The service is consistently good, and food arrives hot, and the cheesecake is always good. Currently they have the peppermint cheesecake and it&amp;#39;s seasonal so I definitely had to make a stop.<br&gt;<br&gt;It&amp;#39;s a chain, the portions are huge, it can be a bit pricey, but when it&amp;#39;s easy to get two meals from your order, really it&amp;#39;s a decent deal.", "rating": 4, "date": "12/11/2016"}, {"text": "Always a great break in the Jordan Creek Mall complex. The Restaurant is very large but the kitchen must be scaled to handle the usual large crowds eating here on the weekend. Food is always on the spot with great flair and great taste. Menu is huge which makes for hard decisions but I&amp;#39;ve been before so know the good sections; appetizers, Salads, Burgers, and Tacos. The fun of this place is to scope out the cheesecake counter before hand to get a slice pinpointed to follow a great meal. A favorite of ours is the Aloha Chopped Salad that towers high and makes for a good shared dish followed by the Mango Key Lime Cheese Cake and can&amp;#39;t forget the many flavored egg roll appetizers ahead. Since the first time I at at Cheese Cake Factory in Chicago I have been a loyal fan of their efforts to treat every customer with  the best they have and it always stands I will be back for Lots of memorable meals.", "rating": 4, "date": "5/1/2017"}, {"text": "It you have half a day to kill then this place is for you. Service is kinda non existent at this place. Got seated in time to watch the first pitch of the MLB all star game. Was able to finally pay the check at the end of the 6th inning. If you know baseball then I was easily there for over 2 plus hours. Waiter would come then go mia for you innings at a time. Food was standard at this location. But service was lacking.", "rating": 3, "date": "7/17/2018"}, {"text": "Cheesecake Factory has an amazing menu and the food is just as good. The only reason I didn&amp;#39;t give it five stars is because they pile you in there. The tables are way to close together. Other then that the menu has just about everything you can think of and of course there&amp;#39;s cheesecake! Yumm", "rating": 4, "date": "10/19/2016"}, {"text": "I love this place, LOVE IT. The atmosphere is so... I can&amp;#39;t think of another word... Fancy! It&amp;#39;s easy to forget that it&amp;#39;s connected to a shopping mall. My main advice is to there HUNGRY because the portions are absolutely insane. <br&gt;When my mom and I go to Jordan Creek for a shopping day (usually an annual occasion) the Cheesecake Factory is the only restaurant we even consider anymore. (In the past, we have given PF Changs a chance, and the Italian place that I can&amp;#39;t even remember the name of, but these always leave us with an emptiness that only CF can fill.)<br&gt;<br&gt;As for the food itself, there are great options, but keep in mind this is not a &amp;#34;light&amp;#34; choice. Even the salads are ginormous! But overall you really can&amp;#39;t go wrong. I LOVE the ahi tuna salad! It was delicious but didn&amp;#39;t leave me &amp;#34;sick to my stomach&amp;#34; full. Honestly, that&amp;#39;s the cheesecakes job.<br&gt;<br&gt;Ah the cheesecake. Seriously, even if you eat lunch somewhere else (shame on you) I highly reccomend that you stop here for dessert. I DONT EVEN REALLY LIKE CHEESECAKE. But this, this is a whole new level. There are so many flavors to choose from, you really can never go wrong! It is also great to share since they are so rich. My mom and I always struggle to finish a slice together, it takes teamwork for sure! I love the raspberry chocolate mousse, but there is always another on the menu that is on my list to try next!<br&gt;<br&gt;Overall, if you are looking for an upscale dining experience with great food all around and something for everyone, Cheesecake Factory won&amp;#39;t disappoint!", "rating": 5, "date": "7/4/2014"}, {"text": "Amy was awesome at the bar. Pleasant demeanor with a cheerful and welcoming disposition. I was able to get in right before the end of happy hour and she took great care to present the good eats and best deals. Great employee and there should be more like her. Bravo!", "rating": 4, "date": "9/20/2017"}, {"text": "My wife and I live in Ames and don&amp;#39;t get down to Des Moines all that often, but we had some errands to run there today and decided to visit this restaurant while there, since I had never been there. Based on our experience, I think it likely that in the future we will make a special trip to Des Moines just to eat here.<br&gt;<br&gt;Soon after being seated, our cokes came along with a basket of very good bread and butter. I had the crusty French bread, which appeared to be part of a bagette, and my wife had what looked like some kind of oat bread that she thought was very good. A second basket was cheerfully provided upon request at no extra charge. <br&gt;<br&gt;I had the chicken parmesan &amp;#34;pizza style&amp;#34; (it should really be spelled &amp;#34;chicken parmigiana&amp;#34;) , which is an unusual dish: chicken is pounded until it is very thin, shaped into a disc, then breaded and served with melted cheese and tomato sauce. It comes out looking like a pizza, with the &amp;#34;crust&amp;#34; being the chicken, with a large ball of pasta sitting on top of it. It was delicious, and didn&amp;#39;t suffer from a problem that I have had with chicken parmigiana in the past, which is too-thick chicken. The portion was huge; the disc covered an entire plate. My wife had the chicken Riesling, which she also loved: this was chicken with Riesling white wine cream sauce, along with bacon, onions and mushrooms. I had a few bites of her meal and agree that it was excellent. I&amp;#39;m not a mushroom fan and was glad to see that it had more bacon than mushrooms; my wife would have preferred it the other way. Her portion was also generous, though not as huge as mine; we both took about half home for leftovers. <br&gt;<br&gt;We also splurged and split a dessert, Linda&amp;#39;s fudge cake. Chocolate cake lovers will enjoy this: multiple layers of excellent chocolate cake with fudge frosting on top and between the layers, served with an extra-large dollop of whipped cream. Although we both loved it, we also couldn&amp;#39;t finish it and wound up taking about half of it home, too. We both agree that in the future, given the quantity of food that is served here, we&amp;#39;ll probably skip dessert, but we were curious about it and wanted to try it this time. Photos of our entrees and dessert, courtesy of my wife, are attached.<br&gt;<br&gt;On the basis of the food and waitress quality alone, I would likely give this restaurant five stars, but three circumstances conspired to knock the rating down one star. First was a timeliness issue. We arrived a few minutes after the restaurant opened and although there were still many open tables, we had to wait about four or five minutes to be seated. (A word to the wise: when we left at about 12:30, the place was already mobbed; this was on a Saturday afternoon and perhaps the restaurant is not that crowded on a weekday.) The brief wait to be seated was not that big a deal, but, after ordering, we also had to wait quite a while for our meals, to the point where our waitress told us that she would check to see where the food was.<br&gt;<br&gt;My second quibble concerns the size of the restrooms. They seem too small for a restaurant of this size and mealtime population, and indeed the ladies&amp;#39; room had substantial lines when my wife used it. I suspect that people from Jordan Creek Mall who were not dining here were coming in to use the restrooms. <br&gt;<br&gt;Finally, there is the price. Our entrees ($14.50 for mine, $13.95 for my wife&amp;#39;s) were not cheap but did not seem unreasonably expensive, but our dessert seemed a bit high at $8.50 and our cokes, at $3.25 each, were probably the most expensive beverages I&amp;#39;ve had in any restaurant in recent memory. All told our lunch, with tax and tip, cost almost $55, which seems rather high for central Iowa. But, given the quantity and quality of food that we had, the price will not deter us from eating here again.", "rating": 4, "date": "10/7/2017"}, {"text": "I&amp;#39;ve been to Cheesecake Factory many times and it&amp;#39;s usually pretty good.  There will most likely be a wait if you go between 6-8pm, so plan accordingly.  The menu is huge so it should satisfy all your cravings.  From American food to Chinese to Italian to Mexican.  It&amp;#39;s a smorgasbord of culinary delight!  The food won&amp;#39;t blow your mind, but it will fill you up and you&amp;#39;ll probably finish it the next day cause the portions are ginormous!  The staff is friendly and the food comes out pretty quick. The best part is that they have a ton of cheesecake flavors, so save some room for dessert :)", "rating": 4, "date": "2/19/2016"}, {"text": "Overall, the food was good. We ordered the mac and cheese cheeseburger, and I was a BIG fan of the cheese sauce they put in the burger. Much better than a slice of American cheese in my mind. Before that, we ordered the tator tot bite things as our appetizer. I know the texture is supposed to be mushy, but the mushy combined with the crispy fried idea clashed a little. The bread was very good, but inconsistent with its temperature. We got one piece of warm, soft bread and three or four pieces of cold, hard bread. I would have loved some more warm and soft bread, with spreadable butter, not frozen butter!<br&gt;<br&gt;Similar to the food, the drinks were tasty. I got a whiskey sour, and OH BOY! It was overly sour, but I think it was mixed by a newbie, so that&amp;#39;s ok. The drinks were INCREDIBLY OVERPRICED! I should never have to pay $22.00 for two drinks at a restaurant. That was ridiculous. We also passed on the actual cheesecake as well, because of their outrageous price per slice. $7 for a slice of cheesecake??!! Very disappointed with their menu prices. If you are going to pride yourself on serving delicious cheesecake, then make it reasonable for people to purchase it.", "rating": 2, "date": "10/7/2016"}, {"text": "Choose your cheesecake slice of adventure!<br&gt;Food (4 Stars) - Typical CC food<br&gt;Ambiance (4 Stars) - located at the end of the mall near food court so minimal things to do while you wait.<br&gt;Service (4 Stars) - courteous <br&gt;Jimmy&amp;#39;s Hacks - park near Barnes &amp;amp; Noble that stays open later than mall<br&gt;<br&gt;Note... reviews maybe updated after future visits. If you find any of my hacks or reviews helpful pls follow &amp;amp; like my review for more. Thx<br&gt;-----", "rating": 4, "date": "3/5/2016"}, {"text": "So many options, entrees or cheesecake! I love the variety of the menu, but I usually just order flatbread and their sweet potato fries with amazing ranch on the side.  While I keep it simple, the menu does offer anything from Italian, Mexican or asian. Just depends on what you are in the mood to eat! The cheesecake of choose is a must, I usually order the smores one because its amazing!!", "rating": 5, "date": "12/24/2015"}, {"text": "Came here for my birthday dinner, and have to say I was pleased. The wait was only about 15 minutes on a Saturday night, which for Cheesecake Factory standards is phenomenal. <br&gt;<br&gt;Ordered a Modern Old Fashioned, which contained Knob Creek, Orange, and Blue Moon. Went together quite nicely.<br&gt;<br&gt;For my dinner choice, I opted for the Steak Diane which was topped with a peppery mushroom gravy and mashed potatoes. It was well prepared and tasted delicious.<br&gt;<br&gt;My dessert choice was the White Chocolate Caramel Macadamia Nut cheesecake, which had a great combination of flavor and was very nice sized piece! (Almost) enough to split.<br&gt;<br&gt;I would return here in order to try one of the million other things I can try on their epic menu.", "rating": 4, "date": "11/5/2016"}, {"text": "*Duplicate Review* There is another page already for this restaurant. <br&gt;<br&gt;I&amp;#39;ve been to Cheesecake Factories in different states and my experience here is similar to the other ones. They have a nice atmosphere with beautiful decor. It is a great place for a casual date. Their food is good, but nothing I would say that stands out from the crowd. Their cheesecakes are obviously amazing, sometimes I would just come to order cheesecakes to go. <br&gt;<br&gt;This location is always busy when I go, but we managed to wait it out. The staff is very friendly here. It is slightly pricey here, but is worth the eating experience here.", "rating": 5, "date": "2/28/2014"}, {"text": "Okay let me just say, if you have never tried The Cheesecake Factory, you are missing out! Even though it is a chain, I still really enjoy it for the variety on the menu, the upscale dining experience and of course the cheesecake!<br&gt;<br&gt;It is a HUGE restaurant so if they look busy, their wait probably still isn&amp;#39;t very long. I really recommend anything on the menu as it all tastes really fresh, my favorite is the Chicken Bellagio, it is two huge chicken planks on a bed of pesto spaghetti yum!! On top of that you get a basket of bread and of course you can&amp;#39;t leave without trying some cheesecake!<br&gt;<br&gt;Portions are huge, food is great, service is good sometimes but the food and atmosphere does make up for the service!", "rating": 4, "date": "11/12/2016"}, {"text": "I went there today &amp;amp; Ryan told me they were out of cheesecake like wtf... it&amp;#39;s cool Nate said he was lying and found me the best darn piece of cheesecake I&amp;#39;ve ever had!!! Chris seen the whole thing he will vouch for me! Nate &amp;amp; Chris are the best Nate I&amp;#39;m sorry man for how life&amp;#39;s turned out!", "rating": 3, "date": "9/18/2018"}, {"text": "I really enjoyed my dinner tonight. The Cheesecake factory has an amazing variety of food, even for vegetarians/vegans!<br&gt;The chardonnay was wonderful and we were seated out on the patio with the heated lamps. The ambiance was lovely. The menu items are a bit pricey (98.00 for 3 people) and the inside of the restaurant had an odd odor when we first walked in, but other than that, dinner here was a great experience. I do recommend it!", "rating": 4, "date": "11/4/2016"}, {"text": "Always something new to try!<br&gt;<br&gt;Three of us stopped in for appetizers, drinks, and cheesecake.<br&gt;<br&gt;I had the best pineapple mojito that had so much flavor in one drink that made my taste buds dance with joy.<br&gt;<br&gt;For my appetizer, I went with the southern fried chicken sliders that were an interactive dish.  I found it very fun to try different combos of sauce, pickles, tomatoes, and lettuce on top of the 4 sliders that came with the order.  It left just enough room to enjoy a slice of cheesecake.<br&gt;<br&gt;I ordered the raspberry lemon cheesecake that tasted like a slice of summer.  The best part of the cheesecake was the raspberry soaked ladyfinger crust with delicate layers of lemon cheesecake with a fresh raspberry drizzle that just added the right amount of tartness to the whole dessert", "rating": 5, "date": "7/4/2015"}, {"text": "Normally love the Cheesecake Factory--the salads are amazing and huge, and I&amp;#39;ve never had a bad slice of cheesecake. But wrote this review to warn people of the fettuccine alfredo. Tastes as though it&amp;#39;s one of the $1 stove top pasta dinners that you add just milk and water too. Chicken tastes as though it was canned and microwaved before being mixed in with the pasta. Not trying to be dramatic! Just a alfredo lover, who was disappointed. Loved the service, drinks, bread and cheesecake though!", "rating": 3, "date": "8/14/2017"}, {"text": "My family and I have eaten here on a number of occasions. I never have been super impressed with the food. The breakfast is better then the dinner menu and you can get some of the breakfast menu all day. I have never had bad service on any of my visits, but the last trip was well below average. My soup was cold and the sauce my wife requested be left off her sandwich was piled on. Also we ran out of butter and after two &amp;#34;I&amp;#39;ll bring you some more butter&amp;#34; we never saw any.  Over priced for what you get.", "rating": 3, "date": "6/4/2016"}, {"text": "Disappointed!! I live in LA but from Iowa originally and have been to plenty of Cheesecake Restaurants. Our waitress seemed tired. I ordered a glass of wine, only for it to show up with finger prints and lip marks on the glass. I mentioned it and she just walked away. I had to take the glass up to the bar myself and have it replaced. Then told her later and she didn&amp;#39;t seem concerned. Just I&amp;#39;m sorry. Then she took our food away to box it up while my daughter was still eating. Not the usual for this restaurant.", "rating": 3, "date": "7/3/2017"}, {"text": "The food is wonderful and the brown bread is to die for. My only concern is the service. I have gone there several times in the past couple months and every time the service has been horrible. One time my waiter was hitting on the hostess and told me he would be right back with my check but it took 20 minutes. Again, great food but the service almost makes it not worth the food.", "rating": 3, "date": "8/6/2017"}, {"text": "Our family went for dinner there last night.  Overall we were there for 1/2 hours.  They were out of the soup that I ordered.  They were out of cups for the shakes.  Our food took 40 minutes to get.  My sons hamburger order was wrong.  None of us liked what we ordered.  My husband got the cuban sandwich which was soggy, my son got pasta which was dry and bland, I got the skinner chicken enchiladas which had just a big chunk of chicken and not much else to it.  My sons&amp;#39; hamburger was dry by the time he got it.  None of us ate very much - the server never questioned if everything was ok especially considering none of us ate very much.  Way overprices for what you get.  Too many other great restaurants with better food and service.", "rating": 1, "date": "1/3/2019"}, {"text": "Wait was forever to get a meal that was over priced and less than great tasting. If you are looking for cheesecake to go this would be fine. For an actual meal you would be better off to go into the mall and get something.", "rating": 2, "date": "1/2/2018"}, {"text": "Hard not find something for about anyone with such a big menu but very limited with kids options. Tried the fish tacos this time and they were very good and just the right amount. Potions here are usually way too large for one person. Which is great if you like leftovers. This makes it difficult if you try and save room for cheesecake. Service is always very friendly.  One draw back is the wait can be long. Thus, not a place for a &amp;#34;quick bite&amp;#34;.", "rating": 4, "date": "1/16/2016"}, {"text": "Impressive!<br&gt;<br&gt;As a rule, I shy away from chain restaurants when possible.  There wasn&amp;#39;t much else in the immediate area, so this was Hopson&amp;#39;s choice.  <br&gt;<br&gt;I confess that everything from the time we entered until we left that there was nothing that I could fault.  Hostess was politely perky, took us straight away to a table (5 of us).  Waitperson was there in an instant, took drink orders, talked about a special or two, was back with drinks.  Food came quickly, cross service was definitely in play, as 3 waitpeople brought our entrees one after the next, our waitperson checked back after the first few bites.  Drink reorders were taken and delivered.  <br&gt;<br&gt;My entree was as close to perfect as I could have asked--salmon was done exactly right, crispy hot on the outside, hot and juicy inside.  The steamed broccoli might have been a little over salted, but was hot and tasty.  And the mashed potatoes were too good to resist.  Other entrees at the table also got rave reviews--chicken marsala looked awesome, fettucini alfredo was a generous creamy portion.<br&gt;<br&gt;Highly recommended.", "rating": 5, "date": "7/23/2016"}, {"text": "I&amp;#39;ve eaten here several times. I love their brown baguettes served when you&amp;#39;re seated. The menu is huge, so look at one ahead of time to narrow your choices. The portobello, avocado, and zucchini fries are very yummy, especially when paired with the dipping sauces. The fish tacos are one of the best things I&amp;#39;ve ordered here. The pasta dishes are always huge servings and well prepared, one of my favorites being the Louisiana chicken pasta. The atmosphere reminds me of an Italian palace, and the service tonight (and every time I&amp;#39;ve gone) was very prompt. Our waitress was definitely attentive. I&amp;#39;m not a huge fan of lemon flavored things, but the lemoncello cream torte is VERY good. They also have a great classic cherry cheesecake.", "rating": 5, "date": "10/16/2016"}, {"text": "I don&amp;#39;t know what happened to the Cheesecake Factory but if I go back it will be for the desserts only and get them to go. Saw our server roll her eyes at the hostess when we were sat and I can only assume that it was because we had a 7 month old with us (he stayed in his carrier the whole time asleep)For all you young servers out there, when you see a couple with a kid treat them as any other table. Especially when the parents both served/bartended in their younger years. Our appetizer came out with our food, the fish I had tasted like grease, and my wife&amp;#39;s pasta had been sitting under a heat lap for at least 7-10 minutes. No offer for a refill on my tea until the check was dropped off and when I handed her my plate that was 4/5 full she did not inquire if there was anything wrong. My wife had to inquire about getting a dessert to because our server didn&amp;#39;t offer any. For 2 people with a check of $72 without alcohol, I was extremely disappointed. My wife loved her tarimasu but that was the highlight of our experience. I guess just because a restaurant looks awesome from the inside doesn&amp;#39;t make it an awesome restaurant.", "rating": 1, "date": "5/15/2018"}, {"text": "Looking for a place to eat lunch we ended up at the Cheesecake Factory. We were warmly greeted by everyone and promptly seated after ten minutes of waiting. Looking through the menu, I just had no idea how [...] Check out my blog for more! Link in my bio.", "rating": 4, "date": "11/7/2017"}, {"text": "First time ever trying Cheescake Factory, and likely my last.  Had the meatloaf lunch.  It tasted similar to what I remember the TV dinners were when I was a kid.  Definitely overpriced, and very disappointing.  The service was good and attentive, but food quality was poor.", "rating": 2, "date": "8/15/2017"}, {"text": "The Cheesecake Factory is always a hit!  From their sandwiches and lighter fare, to the steaks and pasta, everything comes out wonderfully!  And of course, who can leave without a luscious piece of cheesecake?  I&amp;#39;m particularly enamored with the White Chocolate Raspberry Truffle, but the seasonal Pumpkin Pecan is another amazing choice.  The chocolates tend to be so rich you can only eat part of one piece at a setting.<br&gt;The staff tend to be nice and all smiles, though on our most recent visit they didn&amp;#39;t hear or understand us well and the order didn&amp;#39;t come right.", "rating": 4, "date": "10/8/2008"}, {"text": "I mean, its a chain restaurant. But not bad for a chain! Came here at 11:01 on a Saturday and there was already a line to get seated. They have smaller portions of their pastas for a cheaper price for lunch, and about 15 pages of food you can choose from. Food is average, but the cheesecake is to die for! I&amp;#39;d go again, but not a place I would frequent more than once every 8 months or so. I think there are better, more authentic places in Des Moines to go to for the price.", "rating": 3, "date": "2/14/2015"}, {"text": "We admittedly had a large group however our service was unacceptably horrible. It took about an hour and a half for us to get our food and when it did come out it was plate by plate, so the first person was almost done eating by the time the last person got their food. One plate had to be sent back because it was cold and another didn&amp;#39;t get the right food and it took the manager to come over and get it right. There were no &amp;#34;sorry&amp;#39;s&amp;#34; or offers for discount and our server had a bad attitude the whole time. I&amp;#39;ve never written a review before because I understand some things can&amp;#39;t be helped but this was a joke. I recommend eating elsewhere.", "rating": 1, "date": "9/30/2018"}, {"text": "We arrived for Sunday brunch and opted to sit outside in the patio area. Unfortunately service was slow. When our food arrived, the dishes were delivered separately and not together.  Out of the three of us, only two of us received our orders. We had to wait 15 minutes for the last dish to arrive.  Our server was not very attentive and barely checked on us after we all got our food. He didnt seem at all apologetic that we had to wait so long for the last dish of our table to arrive. This place is getting 3 stars because the seating was comfortable and the food was good.", "rating": 3, "date": "10/1/2014"}, {"text": "Ordered Shrimp and chicken gumbo.  No shrimp came with it. Had to wait 15mins for shrimp to be added. Family had to wait with me. Food got cold. Manager was inconsiderate, even asked &amp;#34;oh,did you want shrimp with it?&amp;#34;had to tell her it was unacceptable. And wanted to be compensated. Bad service! Sux! Ruined and wasted a good evening.", "rating": 1, "date": "3/18/2017"}, {"text": "The food was great. I went there for my birthday and they sent out banana cheesecake that said happy birthday to you. <br&gt;<br&gt;For appetizers we got amazing buffalo wings. I had a burger with fries. My friends had a steak and chicken. The portions are very large so the price is worth it. <br&gt;<br&gt;My mom and brother sat at another table and apparently my brothers burger didn&amp;#39;t get there till 40 minutes later and they say them at a table that didn&amp;#39;t have a waitress assigned to it. That was the only bad part. <br&gt;<br&gt;The service was amazing and so was the place.", "rating": 4, "date": "7/26/2015"}, {"text": "Although it can be a bit noisy and not have the best lighting it&amp;#39;s a great place with great food. Can&amp;#39;t go wrong at the Cheesecake Factory.", "rating": 5, "date": "3/23/2015"}, {"text": "Stopped for dinner while on vacation. Hubby had a yummy cheeseburger and salad. I had a barely warm small flatbread pizza with added chicken - $4 for about a quarter ounce. I bet they add more to the caesar salad for the same $4 upcharge. The crust was fairly thick for flatbread and not very crispy. First and last visit.", "rating": 3, "date": "7/1/2018"}, {"text": "I love this place.  I don&amp;#39;t even like cheesecake but I&amp;#39;ve never had a bad meal here.  The bbq chicken salad is to die for (I get regular ranch, not the bbq ranch) and their alfredo pasta dishes are great.  The caprese salad is very refreshing and the teriyaki steak is good (albeit a little sweet for my taste).", "rating": 4, "date": "6/30/2016"}, {"text": "100 page menu and delicious food. Ill give it 4 stars. They have everything under the sun here, I would love to see the kitchen in action. The menu is like a college text book, I love it though. Dive in a few chapters here over time to try their menu. They do a great job all around, the cheesecake is good as well.", "rating": 4, "date": "1/27/2014"}, {"text": "Their stakes are good. Their cheesecake is amazing. It&amp;#39;s a good place for a date, but don&amp;#39;t bring a whole lot if yourself is paying. Lol. Their drinks is expensiveeeeee. If getting drunk is a goal, go to a bar or spend a lot of money here. Service is good and very attentive. It meets my expectation. <br&gt;<br&gt;Their location is at jordan creek mall, and its easy to find!", "rating": 4, "date": "11/26/2015"}, {"text": "I had my first ever lunch at The Cheesecake Factory and I was actually quite impressed with the Veggie Burger! It was mostly made with beets which was different and pretty good!  The bun the burger left a little to be desired but not horrible!  I also dug the side salad and presentation of the food.  Service was good too, I would go back again.", "rating": 3, "date": "12/3/2013"}, {"text": "Got my salad wrong and had to be replaced<br&gt;My wife&amp;#39;s burger was undercooked and had to be redone<br&gt;Waited forever for them to fix it<br&gt;Received the check with no apology. <br&gt;Won&amp;#39;t be back.", "rating": 1, "date": "6/26/2016"}, {"text": "The lettuce was not fresh there were many pieces with brown spots on them. The ends of the lettuce were black. I would have expected some tomato and  cucumber in the salad, but none were to be seen. <br&gt;<br&gt;The hamburger which I ordered medium, was very pink (red?) inside I would have classified the meat as medium rare. I was surprised to see shredded lettuce as well as shredded cabbage on the hamburger. The hamburger was very runny and messy to eat. <br&gt;<br&gt;The fries were excellent and hot!<br&gt;<br&gt;We didn&amp;#39;t order a desert and I was dismayed to learn that the only diet beverage served was a diet coke.", "rating": 2, "date": "8/13/2015"}, {"text": "This is one of our favorite places to go in the area. The food and service are generally very good. They have good selections for lower calorie meals as well. This is a great place to go for a nice evening out, or a relaxing lunch or dinner on the patio. And of course there are the desserts, which don&amp;#39;t consist of only cheesecake. Their strawberry shortcake is amazing, and one of my personal favorites is a simple bowl of strawberries and whipped cream.<br&gt;<br&gt;The negatives:<br&gt;Avoid the table/booth combo seating if you are on a date or want any kind of privacy. The drinks aren&amp;#39;t very good so don&amp;#39;t waste your money. <br&gt;I don&amp;#39;t care for their coffee.<br&gt;They are a little more expensive than some of the other places in the area.<br&gt;The menu is huge and overwhelming, so if you haven&amp;#39;t been there before be prepared to spend a little time looking.", "rating": 4, "date": "4/13/2015"}, {"text": "We love the Cheesecake Factory! Have never left disappointed no matter what we order.  My wife and I often get the combination plate to share because the portion size is more than enough for both of us!  We especially love the Adamst peanut butter cheesecake. You can&amp;#39;t go wrong with anything on the menu!", "rating": 5, "date": "3/26/2016"}, {"text": "Always a &amp;#34;25 minute&amp;#34; wait.  The hostesses act like they are doing you a favor by acknowledging your existence.  I think not.  Go elsewhere.", "rating": 1, "date": "12/1/2015"}, {"text": "My husband and I have been dining at CF every Sunday after church, unless we are out of town, for the past two years.  However; I have never thought of writing a review until now.   Before we became a regular customers we have eaten there several times.  Each time we had a different server but they were all excellent.  Then one day we decided to sit at the same place every week and our server Rachel took very good care of us until recently she left to take a job closer to her house.   Out new server is Chad and he gives us excellent service every Sunday morning... always with a big smile. <br&gt;<br&gt;My favorite food at CF is Asian lettuce wrap and I love the warm dark bread.   My husband orders different dish each week.  Every dish we ordered has been pretty good so far, including hamburger, turkey burger, Moroccan chicken, taco salad, fried zucchini sticks, hummus dip, omelette, sweet potato fries, etc. <br&gt;<br&gt;This is one of the few restaurants in town we really enjoy.", "rating": 5, "date": "7/19/2014"}, {"text": "I love there extensive menu. You can anything at any time. It is an anchor to a mall so parking can be a pain if the mall is busy. The food is always good and consistent. The cheesecake... oh the cheesecake.... and did I mention the cheesecake? Red velvet is my favorite. Pumpkin a close second. The slices are huge, the decadent factor 11 out of 10.", "rating": 4, "date": "12/24/2016"}, {"text": "Harrlie, you need to lose the bad attitude and learn what good customer service is.<br&gt;<br&gt;Normally, I am a fan of The Cheesecake Factory restaurants around the U.S. and take visitors there because everyone can find something they like on the restaurant&amp;#39;s extensive menu, but Harrlie ruined my last visit and hurt the restaurant&amp;#39;s image.<br&gt;<br&gt;During a trip back to DSM, I stopped in to pick up a couple pieces of cheesecake and chocolate sauce to go after shopping at Jordan Creek Mall.  Before I could even get the second flavor of cheesecake out of my mouth, Harrlie said, &amp;#34;Is that all?&amp;#34;  <br&gt;<br&gt;Me:  Yes, did you get the second one.<br&gt;<br&gt;Harrlie:  Yea, is that all? (Again, on the heels of what I was saying.)<br&gt;<br&gt;Me:  And, I&amp;#39;d like a small container of chocolate sauce.<br&gt;<br&gt;Harrlie: Is that all? (Once more, cutting me off.)<br&gt;<br&gt;Me:  Yes.<br&gt;<br&gt;Ok, so this might sound standard, but the way she spoke to me was condescending and hurried, as if she had better things to do and I was getting in her way.<br&gt;<br&gt;After I had received the cheesecake and was walking to my car in the 90-something degree heat, I noticed that Harrlie had forgotten the chocolate sauce.  I went back inside to get it and she made me wait until she helped the 5 people in front of me to ask me what else I wanted - again, as if she had better things to do than to take my order.<br&gt;<br&gt;People in Iowa are thought to be exceptionally nice and friendly, but not that gal.  I have never had such a sour experience at any of The Cheesecake Factory&amp;#39;s around the U.S., the last being in Miami just a week ago.  They were slammed with guests, but no one showed their stress and, certainly, not a single person snapped at me or anyone in our group.<br&gt;<br&gt;Harrlie, be thankful that I did not complain about you directly to the manager.  No, I wanted a much larger audience.", "rating": 1, "date": "7/25/2015"}, {"text": "My husband and I find ourselves here almost every Saturday because it&amp;#39;s right by the J-Creek Theater and their food and service never disappoint. I love that they have the light menu that has food beyond just salads. I love the shrimp tacos and my husband (who normally prides himself on trying something new) always goes with the Cuban. Chain or not it&amp;#39;s just so good!", "rating": 5, "date": "8/14/2016"}, {"text": "It never disappointed! The menu is huge! We can always try something different. I love their pasta dishes. And there&amp;#39;s always enough for me to bring back some for my next meal. <br&gt;Cheesecake: vanilla bean is my favorite.", "rating": 4, "date": "1/27/2017"}, {"text": "Been here before but only came for grab n go cheesecake during this visit. It took roughly 15 minutes to place our order because of the overly needy gal ahead of us (if you don&amp;#39;t want cool whip on yours then don&amp;#39;t eat it). The order taker was clearly annoyed that it was just two of them handling the station. I saw at least 3 other staff members come over who stood there for a second and then walked away - really?? You&amp;#39;d think someone could step in and take care of the line of people waiting to order. After ordering and tipping the guy $5 for his stress level, our order showed up about 3 minutes later. I got the impression other people had waited 15-20 for their orders prior to our order. This isn&amp;#39;t an employee problem; this is a management problem. All that said, we got the coffee and cream chocolate cheesecake. The coffee part was very good, the chocolate part was too rich. Probably won&amp;#39;t order that one again unless they change it to have less chocolate in it.", "rating": 4, "date": "9/9/2018"}, {"text": "The portions are huge!   I ordered the lunch size soup and salad and couldn&amp;#39;t believe how  large and filling the portion was.   The servers were very attentive to our large group.   We ordered several varieties of the cheesecake and all were fantastic.", "rating": 4, "date": "2/23/2014"}, {"text": "Prior to Monday, I had lukewarm experiences at The Cheesecake Factory the very few times I visited. On Monday, I picked up a piece of cheesecake to celebrate a job promotion. <br&gt;<br&gt;The first forkful had one short white hair in it, like the kind you would find on a cat or a rat. I pulled it out, and didn&amp;#39;t think much more about it. Two forkfuls later I found three more of these hairs! Ick! So at that point, I torn the piece apart and found many more of these cat/rat hairs!!!<br&gt;<br&gt;I emailed The Cheesecake Factory to voice my concern. I then got very, very sick... at work. I have yet to hear from The Cheesecake factory. It is obvious, by their lack of response, that they do not care about quality or their customer.<br&gt;<br&gt;Thanks, but no thanks. I won&amp;#39;t be back.", "rating": 1, "date": "3/20/2015"}, {"text": "The restaurant is fancy. The food is delicious and very big portions. The prices are very reasonable. The service is good. I enjoyed it multiple times and certainly would go again with my family or friends", "rating": 5, "date": "7/31/2015"}, {"text": "Great place to eat be here before always have good food. On the menu&amp;amp; Drinks to.the waiter staff is great", "rating": 5, "date": "12/18/2016"}, {"text": "The husband and I met up with an old friend and his SO here and had just a lovely time.  We all enjoyed our meal and the portions were huge.  They have a very large and expansive menu so it is a great place and I am sure you can find something to please just about anyone.  The quality of the food is great and service was awesome.  Of course I indulged in Cheesecake--I purchased a couple pieces to take with --peanut butter chocolate and raspberry white chocolate....yeah baby...", "rating": 4, "date": "2/8/2013"}, {"text": "There are numerous choices on be menu. Too many, in fact. The ambience is nice and the derive professional. The servings are massive. They exceeded our expectations for sure. Food was great, service was very nice and friendly. They never disappoint!", "rating": 5, "date": "9/11/2017"}, {"text": "Had an okay experience, food was good, but I&amp;#39;m 99.9% sure my waiter was wasted or hungover, also, asked a question about something and he just assumed I wanted it.", "rating": 3, "date": "8/6/2016"}, {"text": "Love the Cheesecake Factory.  The food is excellent but I have a few issues with this location.  First, its small for Cheesecake Factory standards.  The one in Omaha is bigger, and the one in Kansas City is more then double this location size.  This would not be a problem if it wasn&amp;#39;t so busy all the time.   That said, the food is good and everything is consistent with every other Cheesecake Factory around the country I have eaten out.  Typical Lunch + Drink will cost you at least $15 a person on average.  Add another $8 if you add a cheesecake so its not exactly a cheap place for Lunch, and even more for dinner.  They do have a huge menu with a lot of good options.  Most of the items are carb heavy though, so if your on a low carb diet you have to hunt a little for something.  The portions are huge.  Its not uncommon for my wife and I to split 1 appetizer and 1 entrée and be full by the end of Dinner.<br&gt;<br&gt;And now for the cheesecakes.  Yes I have tried nearly every flavor at one point or another over the last 20+ years visiting a cheesecake factory someplace in the country.  In fact I visited my first one in Newport Beach, CA back in 1990.  I&amp;#39;m not even sure if its still there!  But, over the years I have developed a taste for a few of them, and can rank them in what I believe is their worst, to their best. <br&gt;<br&gt;Here we go:<br&gt;<br&gt;32. Low Carb Cheesecake with Strawberries<br&gt; - Yuck<br&gt;31. White Chocolate Caramel Macadamia Nut<br&gt; - Not a fan of white chocolate with caramel.<br&gt;30. Kahlua Cocoa Coffee Cheesecake<br&gt; Coffee in dessert is not my thing.  Yuck.<br&gt;29. Tiramisu<br&gt; I&amp;#39;ll stick with the original, and I don&amp;#39;t really like coffee in my desserts.<br&gt;28. Pineapple Upside-Down Cheesecake<br&gt; Not very good<br&gt;27. The Original<br&gt; Boring<br&gt;26. Chocolate Mousse<br&gt; Not a fan of mousse. I want a better chocolate.<br&gt;25. White Chocolate Raspberry Truffle<br&gt; This one is ok, but again, not a fan of white chocolate<br&gt;24. Adam&amp;#39;s Peanut Butter Cup Fudge Ripple<br&gt; Not bad, but they have better<br&gt;23. The Original with Cherry Preserves<br&gt; The original is good, and cherry makes it a little better<br&gt;22. Craig&amp;#39;s Crazy Carrot Cake Cheesecake<br&gt; I like carrot cake, but this one is a miss<br&gt;21. Key Lime<br&gt; I like it, but it&amp;#39;s a weee bit tart<br&gt;20. Ultimate Red Velvet Cake<br&gt; Getting better on the chocolate front but they have better<br&gt;19. Mango Key Lime<br&gt; This is a good option for tart and sweet.<br&gt;18. Dulce de Leche Caramel Cheesecake<br&gt; This is a good one, worth trying.<br&gt;17. Fresh Banana Cream Cheesecake<br&gt; Reminds me of banana cream pie, but better<br&gt;16. Pina Colada Cake<br&gt; Different take. I feel like I&amp;#39;m in the islands<br&gt;15. Caramel Pecan Turtle Cheesecake<br&gt; Love me a turtle in any way. This is a good option<br&gt;14. Vanilla Bean Cheesecake<br&gt; For something so simple, it works.  Tastes like rich vanilla ice cream.<br&gt;13. Dutch Apple Caramel Streusel<br&gt; Apple Pie Cheesecake.  It is good<br&gt;12. Wild Blueberry White Chocolate Cheesecake<br&gt; This is the only white chocolate cheesecake I actually like<br&gt;11. Chocolate Tuxedo Cream<br&gt; Vanilla and Chocolate twist.  Very good<br&gt;10. Toasted Marshmallow S&amp;#39;mores Galore<br&gt; This is one of my favorites.  Worth getting for sure.<br&gt;9. Godiva Chocolate Cheesecake<br&gt; If you want chocolate, this one is great, but almost TOO much chocolate. it&amp;#39;s fairly dark chocolate.<br&gt;8. The Original with Fresh Strawberries<br&gt; A classic, and very very good.<br&gt;7. Reese&amp;#39;s Peanut Butter Chocolate Cake.<br&gt; The best peanut butter cake I have had in some time.  Great if you don&amp;#39;t want a cheesecake<br&gt;6. 30th Anniversary Chocolate Cake<br&gt; Probably the best chocolate item they have.  perfect flavors<br&gt;5. Chocolate Chip Cookie Dough<br&gt; I am so partial to chocolate chip cookie dough anything, and this cheesecake is excellent.<br&gt;4. OREO Dream Extreme<br&gt; If you like Oreo&amp;#39;s, you will love this cheesecake.  I do.<br&gt;3. Lemon Raspberry Cream<br&gt; When you are sick of chocolate, this sweet and tart cheesecake is perfect.  My favorite fruit cheesecake they have. <br&gt;2. Hershey&amp;#39;s Chocolate Bar Cheesecake<br&gt; This is also probably the best chocolate item they have. Honestly, this and the 30th aniv chocolate cake are both fantastic, but this one is readily available everywhere.<br&gt;1. Chris&amp;#39; Outrageous Cheesecake<br&gt; This is the best of the best.  German Chocolate, coconut, pecan frosting, omg, this thing is the bomb.", "rating": 3, "date": "1/9/2015"}, {"text": "Absolutely awful experience for a Cheesecake Factory!  First of all, the waitstaff was rushing around so fast, we had to dodge them to take our seat.  Later, our waiter bad-mouthed a busser to us and then we saw a manager scream at a worker right by our table.<br&gt;<br&gt;BUT, the worst was our food.  :-(  My Mom and I ordered Cobb salads on a recommendation of a friend and they were just a huge pile of lettuce.  There was less than an ounce of greasy chicken, a tiny amount of bacon and tasteless cheese and tons of tasteless shredded eggs.  Overall, the salad had no taste and cost $15!", "rating": 1, "date": "4/23/2013"}, {"text": "I just wanted to say I used to love this place when I first came to Iowa and that change after going to some of hidden gem of Des Moines. Few times that we came here, there was always a long wait which we thought that it might be a good thing. Few more visit, it was just plain horrible and one time we just decided to just leave and go somewhere else. One time we came here for one of my friend&amp;#39;s birthday since there were more than 6 in our group, we tried to see if we can make the reservation but no luck. The most recent visit was a few weeks ago since we were all craving for cake, we came here to get some Craigs carrot cake, Red Velvet cake, or whatever they have really. There was no line at the take-out area. We have told the guy what we wanted to get and to our surprise it took them 20 minutes to put a cake in a box. Yes, it was 20mins and we not even exaggerating. When we ask how long will it take we always get &amp;#34;in a bit&amp;#34;.  That was 20 minute for something that I was looking at through refrigerated pastry case. My daughter asked to go to the bathroom and came back, still no cake. When I was about to leave the lady called out my name, paid for it and left. It was just horrible. To be fair, we did like their Louisianna Chicken, though they put way too much sauce.<br&gt;<br&gt;We came home and ate the cake. It was not the same carrot cake that I like. I don&amp;#39;t remember it being too moist or tasting so differently. The cake was not fluffy as well. Same as with the red velvet. We just  threw it away coz it tasted nasty. I mean Village Inn would probably be better just get something from the grocery. Yeah, I don&amp;#39;t see us coming back here anytime soon. Bring some flashlight to see your food as well. I know cozy or romantic ambience, but this place is saving way too much", "rating": 1, "date": "12/3/2015"}, {"text": "Always good food here and the portions are huge. We always finish off with a piece of the eponymous dessert", "rating": 3, "date": "10/19/2013"}, {"text": "The past few times I have eaten at this location the service was lacking. On my most recent trip our server forgot to bring bread out, which was fine, but then almost all of our meals were messed up in some way and this has not been the first time. When we asked to see a cheesecake menu our server brought us one menu for four people to share. The cheesecake was amazing but that&amp;#39;s hard to mess up when all you have to do is thaw it. Will not be returning for a long time.", "rating": 2, "date": "9/18/2017"}, {"text": "Great food! I got the baja chicken tacos and the chocolate truffle cake for dessert. Huge servings, but it is a pretty pricey. For three people (including dessert) our bill was $75. For a nice treat, it was worth it. Our waitress was very nice, helpful, and attentive. I took off one star because of the 40 minute wait. It is a very large restaurant and it was 1:30 p.m. in the afternoon, but it was still a 40 minute wait. Once we got to a table (finally) the food came very quickly. Overall, a pretty good experience.", "rating": 4, "date": "2/28/2016"}, {"text": "Was visiting from out of town and was very disappointed with competence of staff and service. Waited for over 45 minutes while several people who arrived after us were sat before us. Honestly, this Cheesecake Factory was despicable in comparison to the one in Overland Park.", "rating": 2, "date": "4/23/2016"}, {"text": "I recommend the Chicken Bellagio.  The chicken is flattened, baked breast meat with a crunchy crust, on a bed of pasta covered with a pesto sauce, and topped by a liberal covering of arugula.  A good mix of flavors and the preparation was excellent.  Had the buffalo wings as an appetizer - good but nothing out of the ordinary.<br&gt;<br&gt;The patio seating seems nice on a pleasant day, but be forewarned that there seems to be a horde of flies out there at this time of year.<br&gt;<br&gt;Wait service is par for Cheesecake - first rate.", "rating": 4, "date": "9/22/2012"}, {"text": "Oh my is this place good.  Beautiful restaurant and Derek was a professional quality server.", "rating": 5, "date": "6/9/2017"}, {"text": "Nice restaurant and the cheesecake is very good. However, for a place that is very reputable, the service is slow. Our most recent lunch took an hour and a half which and was not during prime lunch hours. A lot of food on the menu can be delicious, but do not waste your meal on the &amp;#34;Sunday brunch&amp;#34; items. Those items are definitely not a specialty of the Cheesecake Factory. The pastas and pizzas will be a better choice but I have never felt that I&amp;#39;ve received my money&amp;#39;s worth for the quality of food and services during my recent visits.", "rating": 2, "date": "7/2/2017"}, {"text": "First time here, went with my usual two dining companions.  The interior decor is very classy and it makes you forget that you&amp;#39;re at a chain restaurant.   We stopped in at 6 PM on a Sunday evening and were seated immediately;  curious for a busy area at a mall during the Christmas shopping season.   Our server promptly brought us water and a couple miniature loaves of bread.   Bread was good but the butter provided was frozen.   I ordered the chicken di pana.  This particular dish came sided with mashed potatoes and broccoli.   I didn&amp;#39;t ask if sides could be substituted but the menu didn&amp;#39;t give the impression that doing so was an option.  The chicken came exactly as described but there was only a minimal amount of the sauce.  Food was plated nicely but seemed to be overpriced.   I ordered key lime cheesecake which was covered in whipped cream.  Total was $23.  Not outrageous but also have had better meals at this price point.  The server we had was very patient when we were contemplating our decisions.   She was also efficient refilling waters and clearing the table.  Wouldn&amp;#39;t object if friends wanted to go here again but it wouldn&amp;#39;t be something I&amp;#39;d nominate.", "rating": 3, "date": "11/30/2014"}, {"text": "Wow!! Talk about outstanding service. I have never been to a restaurant in Iowa that was more accommodating than this one. Angela the manager got my large party seated immediately and went above and beyond to serve us any way possible. As for my server KEELI. She deserves some sort of award. This server was so calm the whole time, split ten separate checks all for us without batting an eye. She was so sweet. Angela and Keeli represented Cheesecake Factory well. I will come here every time I&amp;#39;m in Iowa simply because of the experience I had there tonight for dinner. It was truly a signature moment that makes Cheesecake Factory stand out as a great establishment", "rating": 5, "date": "6/17/2015"}, {"text": "I was very pleased with the Skinnylicious Chicken Enchiladas and the accompanying salad.  All of the food was flavorful and looked just like it was pictured in the menu.   It is great that the Cheesecake Factory has lower calorie options available for people who are watching their weight and want to enjoy an evening out with friends.  Our waiter was very nice and the service was good.", "rating": 3, "date": "4/17/2015"}, {"text": "You really can&amp;#39;t go wrong with the Cheesecake Factory. The menu is huge, but everything that I&amp;#39;ve had so far has been  cooked to perfection. My boyfriend and I like to go almost every Friday night after the gym. We have to get our items specially ordered without butter, lower carbs, etc. and the staff is always willing and happy to accommodate our needs. Over the course of my visits I&amp;#39;ve had the skinnylicious tacos (both chicken and shrimp; I prefer the chicken), baja chicken tacos (which are amazing especially with their black beans), hibachi steak, kids Mac &amp;amp; cheese (pretty incredible) and my favorite dessert: Linda&amp;#39;s fudge cake. You cannot go wrong with Linda&amp;#39;s fudge cake. It is rich, succulent, the best tastebud party your mouth will ever experience....I&amp;#39;m sure of it!", "rating": 5, "date": "10/8/2014"}, {"text": "Wonderful for a date or family event. Love their food and they have so many options to choose from. Great service at this location.", "rating": 5, "date": "2/18/2015"}, {"text": "I know it&amp;#39;s a big chain and people like to hate big chains. It is a little on the expensive side, particularly the drinks. But I really like it. I do! And I&amp;#39;m not ashamed to admit it. Time and time again they have been super consistent for me in both food quality and service. I love the decor and I could stare up at the ceiling for hours. I prefer booth seating and they have plenty available. There is an outdoor section where you lose the classy architecture but gain a view of the parking lot. Not the biggest fan of that. The menu is HUGE and very tasty. My favorite item here is the Romano encrusted chicken with pasta. All of the cheesecakes here are fresh and fabulous and you must try them all. The cocktails are incredibly good. I love the semi classy vibe and the atmosphere. This is a repeat on my playlist a few times a year. Read about the history of the chain in the menu. I thought it was somewhat entertaining. By coincidence I happened to have been to the store in Beverly Hills, their first chain location.", "rating": 5, "date": "10/14/2016"}, {"text": "I stop here every time I&amp;#39;m in West Des Moines for work. Love it! A little pricey-but the amount of food makes it worth it.", "rating": 4, "date": "5/29/2014"}, {"text": "its good, just over priced for what it is.  Brought my daughter here on date night, the burgers are great and so is the steak.  It&amp;#39;s a chain restaurant with decent food, maybe two steps above applebees at 4 or 5 times the price.  Meh....", "rating": 2, "date": "10/15/2013"}, {"text": "Good service, mediocre food and high prices. They are slipping fast. I do not recommend until food service improves.", "rating": 2, "date": "9/7/2013"}, {"text": "This was predictably mediocre. The service was fair. We had to get our waiters attention more than once. The staff were all aloof except for the kind busboy who showed me to the restroom!  Food was good but nothing really special. The menu is just way too big, like they are trying to be something for everyone.  This is a chain that does not really stand out.", "rating": 2, "date": "2/18/2016"}, {"text": "How can one say no to eating at The Cheesecake Factory?  That&amp;#39;s right...nobody can!  <br&gt;<br&gt;This Cheesecake Factory is located in the beautifuly sculpted corner of Jordan Creek Town Center on the western edge of West Des Moines.  From the minute you walk in to the minute your satisfied stomach is full you will enjoy this restaurant!<br&gt;<br&gt;Let me say up front that this restaurant is not for the carb-consious or the weight watchers...this is splurge city, folks!  The Cheesecake Factory doesn&amp;#39;t display their nutritional information for good reason...I bet my jaw would drop if I knew what my total calorie intake was for the evening...but who cares...it&amp;#39;s worth it!<br&gt;<br&gt;Ever since the first time I visited this place, I wonder, &amp;#34;WHY didn&amp;#39;t I start eating here when they opened in 2004???&amp;#34;  The bread they serve is great, the Cheesecake is VERY rich, and the portions of food are monstrous!  It&amp;#39;s great!<br&gt;<br&gt;The Cheesecake Factory is a great way to wind down from a day of shopping at the great Jordan Creek Town Center.  A nice piece of cheesecake with a cup of espresso is great!  <br&gt;<br&gt;When people are staying in town on business or for leisure, this restaurant is the one i recommend (even if it&amp;#39;s a chain, it&amp;#39;s THAT good) The Cheesecake Factory.  <br&gt;<br&gt;Keep doing what you do best, Cheesecake Factory!  I love you!", "rating": 5, "date": "2/26/2010"}, {"text": "I have had bunch of meals here, but it&amp;#39;s hard to forget the time that I found a &amp;#34;eyelash&amp;#34; in my seared tuna takaki salad. My wife and I weren&amp;#39;t so sure that it was an eyelash - but the manager insisted that he knows his bodily hair and it was indeed a eyelash. It left a bad taste in my mouth (no pun intended) <br&gt;<br&gt;Other than that I have always had a blast and eaten some tasty food. I like the fish tacos and the kobe beef burger. not too shabby. Plan on spending a couple bucks. Also, it&amp;#39;s hard to make a decision because the menu is huge.", "rating": 3, "date": "1/17/2010"}, {"text": "You definitely don&amp;#39;t want to come to the mall around Christmas - luckily we snagged a high top table in the bar within minutes of arrival, otherwise it was an hour wait for the dining area. The food is pretty average here - my pasta was slightly heavy on the garlic and I needed to add salt. But the cheesecake is always spot-on and I keep coming back so it must be good enough.", "rating": 3, "date": "12/14/2013"}, {"text": "Delicious food, great service, and friendly professional staff. I have never had a bad experience here and we are now going more often since there is now a kids menu and a menu with healthier options.", "rating": 5, "date": "2/12/2016"}, {"text": "A friend and I went on a Saturday and the wait was almost 90 minutes! We hung in there and finally got seated. Our waitress, Maci was awesome! She was personable and funny which added to our fantastic experience. I had a sandwich and she had pasta...both were extremely good. Though I recommend coming hungry because the portions are HUGE!!", "rating": 5, "date": "3/6/2012"}, {"text": "Typical for a chain place, but it&amp;#39;s open till 11pm.  The bar tender was helpful on what to do in Des Moines.", "rating": 3, "date": "8/25/2012"}, {"text": "Cheesecake factory is a hit or miss game.  I frequent the establishment when I&amp;#39;m at the mall for lack of better choices and I consider it mid-range as far as quality of food and customer service.  On a good night the ambience, customer service and food are at least 4 stars I gave it 3 for the lack luster Vietnamese tacos I had on a recent visit.  The pickled cucumber slaw makes the entire dish.. The pulled pork was as rubbery as a deflated bicycle tire and even the most carnivorous homosapien would have rolled that flat tire back from whence it came!!! How dare u cheesecake factory?  I think the problem these days is that they just aren&amp;#39;t as passionate about the food they put out.  Either way u slice it. It all boils down to one thing.  Cheesecake Factory is a crap shoot if u go there I hope you don&amp;#39;t come up snake eyes.", "rating": 3, "date": "4/5/2011"}, {"text": "The cheesecake is delicious which is what really matters, the food on the other hand is overpriced for what it tastes like.", "rating": 3, "date": "7/18/2015"}, {"text": "Everyone says their portions are huge but I haven&amp;#39;t found that to be true. Their menu itself is pages and pages long though. Still pretty expensive. The food is above average but not out of this world. The wait is usually ridiculous (to be expected w/ a popular restaurant). A decent place to go if you need to feel fancy or eat overpriced small pieces of cheesecake.", "rating": 3, "date": "11/9/2012"}, {"text": "Pretty good food. The menu is so huge that it&amp;#39;s tough to make a decision though!  Always a great atmosphere though", "rating": 4, "date": "3/18/2015"}, {"text": "Great place for the hungry, this place has a huge menu. Highly recommend the miso salmon. The calamari appetizer is also great. Fairly good selection of wine and beer, mixed drinks good as well. The peach bellini is great too.<br&gt;As for cheesecake, it definitely lives up to its factory name, there are at least 25 varieties!<br&gt;Definitely four stars for this.", "rating": 4, "date": "11/11/2010"}, {"text": "I have been to this location for several times in the past year, usually for brunch with out of town visitors since I get cooked out all weekend, and the food has been outstanding. The wait-staff is very friendly, accommodating, and very professional. And obviously, the menu choices can satisfy just about anyone - I will definitely come back here again.", "rating": 5, "date": "9/2/2012"}, {"text": "If you&amp;#39;re looking for huge portions then Cheesecake Factory is where to go.  Their menu is massive, they have over 40 different entree options to choose from.  I personally like the Thai Chicken Pasta which is a fettuccine based pasta tossed in a Thai peanut sauce and mixed with grilled chicken, green onion, carrots, peanuts, and bean sprouts.  And with a name like Cheesecake Factory, you have get a piece of cheesecake to follow the meal.  They have over 20 different varieties to choose from.  Personal favorites of mine are the Godiva cheesecake and the Reese&amp;#39;s Peanut Butter Cup cheesecake.", "rating": 4, "date": "1/18/2011"}, {"text": "We visited this location Tuesday June 7th 2011.  We were down on a business trip to World Pork Expo and were looking forward to this location.  Our closest Cheesecake Factory location is Buffalo New York, that location is tiny compare to this one.  We were happy to get in with no wait! I enjoyed the Southern Chicken Sliders, with the great tangy ice team and Cheesecake for Dessert.  Service was quick, and the food was perfect.", "rating": 5, "date": "7/1/2011"}, {"text": "Cheesecake Factory is a great chain, and this is the only location in Iowa, I believe.  It&amp;#39;s nice that this is part of the mall - it makes for a good place to take a shopping break.  Service was pretty sloooow during our recent trip, however.  We were there during the post-Christmas shopping rush, so I&amp;#39;ll give them a break for taking awhile to get us seated.  But even once we got seated, it still took quite a long time to get bread, drinks, our order placed, etesc.    Prices at this location seem to be very similar to or exactly the same as prices in California and the East Coast, which makes this quite an expensive dining option for Iowa, where meal prices are typically quite a bit lower.   Keep in mind however, that most meals are 2000+ calories, not even counting their delicious bread + french fries, so you should be sharing them or bringing half home, which makes it a much better deal.", "rating": 3, "date": "12/29/2010"}, {"text": "the place is really clean, the waitress was tooo over bearing on the appetizer menu, and her way about presenting the menu and specials was far from genuine. the cheesecake is very expensive, and the portions were pretty small. we did enjoy the patio, thats why i gave them 3 stars instead of 2. not horrible, but really far from great.", "rating": 3, "date": "7/25/2011"}]}