{"address": ["12735 Wayzata Blvd", "Minnetonka, MN 55305"], "monthly_reviews": {"2019": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 4.0], [5, 4.0], [6, 3.5], [7, 3.5], [8, 3.5], [9, 3.0], [10, 3.0], [11, 3.0]], "2017": [[10, 3.0], [11, 3.0]], "2020": [[0, 2.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 4.0], [7, 4.5], [8, 4.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2018": [[0, 3.0], [1, 3.0], [2, 2.5], [3, 2.0], [4, 2.5], [5, 3.0], [6, 4.0], [7, 4.0], [8, 4.0], [9, 4.0], [10, 3.5], [11, 3.5]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "We love the Cheesecake Factory but we pretty much only order one thing, which is the bang bang shrimp (we leave out the chicken). It&amp;#39;s our favorite and we have never been disappointed. We usually do &amp;#34;to go&amp;#34; because we have been disappointed in the past with poor service. Curbside pick up is amazing --super fast and easy, super friendly and we hope you continue that even after Covid.", "rating": 5, "date": "7/18/2020"}, {"text": "Went here for our anniversary.. I ordered the ribeye.. it was chewy which took me minutes to chew one bite ..I took only about 2 bites before I decided it wasn&amp;#39;t worth the effort.. for 125$ plus tip for 2 meals an ap and cheesecake ..it left alot to be desired .", "rating": 3, "date": "10/9/2020"}, {"text": "Stopped in for lunch after our outing at iFly. My son loves this place almost as much as we do. The thought of a piece of cheesecake as big as his head was enough to make us stop.<br&gt;<br&gt;Food ordered:<br&gt;Chinese Chicken Salad- lunch portion was excellent. Fresh and tasty as always. I can only imagine how big the dinner portion is. Everything in it was so fresh.<br&gt;Kids&amp;#39; macaroni and cheese. Very tasty for mac-n-cheese.<br&gt;Coconut lime chili chicken with rice- to go. Was said to be good.<br&gt;Oreo cheesecake to go.<br&gt;<br&gt;Food and service at any location has always been good. It was the same for this visit. Our server was lovely and she brought us warm, fresh bread. <br&gt;<br&gt;I only wish that there was one closer to us. Roseville, Perhaps? I didn&amp;#39;t know this location had even opened. The hostess said they had been there for about two years. Tells you how often we make it out this way.", "rating": 4, "date": "3/23/2019"}, {"text": "This wasn&amp;#39;t my first choice for dinner but I&amp;#39;m glad we went. I&amp;#39;ve been to Cheesecake Factory only a handful of times. I think it&amp;#39;s too expensive but the food is good. Service was great too. We were able to snag a seat in the &amp;#34;patio&amp;#34; area (in the mall). My pasta dish was $18. I ordered it through their &amp;#34;skinny&amp;#34; menu. I wish I had just paid 2 extra dollars for the regular lemon garlic pasta. I imagine it would be a bigger portion. It was really good though. Lots of flavor and good size shrimps. <br&gt;It felt wrong to not get dessert. So we ordered the strawberry cheesecake. The gram cracker crust tasted amazing and paired perfectly with the creamy cheese layer. The strawberry&amp;#39;s were fresh and completed the whole dessert. I&amp;#39;ll come back to try more cheesecakes. If I want food, I&amp;#39;d come back during happy hour.", "rating": 3, "date": "2/9/2019"}, {"text": "We went to The Cheesecake Factory in Minnetonka on Sunday, July 21 at around 2 pm to celebrate my daughter&amp;#39;s birthday. We usually go to the Edina location but went to this one because the location was more convenient.  <br&gt;<br&gt;We were surprised there was no wait (like there always is in in Edina and were seated outside on the covered patio. It was a beautiful day and, despite the flies, we enjoyed the weather.<br&gt;<br&gt;Service was verrry slow. I asked the waitress if she was new after seeing the table next to us return food and drinks twice AND the fact that she admitted to our table she had forgotten to put our meal order in. Nope. She wasn&amp;#39;t new. Hmmm. We waited well over an hour for our food. <br&gt;<br&gt;Food arrived. My husband ordered the Spicy Cashew Chicken. Chicken was more breading than chicken so he was pretty disappointed about that. My daughter ordered the Steak Medallions, son got rotini, and I got the Boneless Lemon Herb Chicken. <br&gt;<br&gt;The waiter spilled most of the lemon herb sauce on the floor when he brought our food over. I had 2 pieces of chicken...both under a layer of rubbery skin. I removed the skin and ate a tiny portion of the chicken on one half because the other half of my &amp;#34;boneless&amp;#34; chicken contained a large bone. Looked like a leg bone. <br&gt;<br&gt;I picked away at the chicken, which was rubbery, and filled up on the mashed potatoes and carrots. When the waitress returned (finally) to put leftovers in containers, I mentioned the bone. No big deal to her, I guess. She just looked at me, then took my plate to pack it. <br&gt;<br&gt;I brought my chicken and leftovers home to eat and was absolutely disgusted the next day when I pulled off the top layer of rubbery skin to find who the heck knows what underneath. It looked like the stuff I cut off my chicken and give it to the dog because it&amp;#39;s unidentifiable and too disgusting to eat. I showed my family and picked up one end by the fork and a long 7-8&amp;#34; connected glob of garbage &amp;#34;chicken&amp;#34; dangled from the fork to my plate. Yes, of course I took pictures. <br&gt;<br&gt;I also immediately contacted The Cheesecake Factory with NO response. GREAT customer service, right?<br&gt;<br&gt;Oh yes...and my daughter got sick about 6 hours after we ate at The Cheesecake Factory and missed a day of work the next day. She did indeed let everyone in her office at a very large Twin Cities company know where she ate so they can all avoid the place.<br&gt;<br&gt;I normally don&amp;#39;t complain like this and wouldn&amp;#39;t have if my email had been at least acknowledged, but with zero response from The Cheesecake factory, the horrible review is deserved.<br&gt;<br&gt;They get one star, simply because the cheesecake we got was delicious. The probably shipped it over from the &amp;#34;good&amp;#34; location in Edina.", "rating": 1, "date": "7/30/2019"}, {"text": "Okay, it is always hard to review chain restaurants, so this review more than anything is focused on the execution of the food, the cleanliness of the restaurant, and the service.  And yum yum yum, the food!<br&gt;<br&gt;My main complaint is that the service was rather slow, even though it was not busy.  We waited for awhile first for the drinks, then after our food was boxed up, it took a long time to flag down a server to order cheesecake.  Aside from this, the server was friendly and attentive with drink refills.<br&gt;<br&gt;I came here with my sister for happy hour and were able to find a place to sit right away, since we arrived about 30 minutes after it opened. She got the nachos from the happy hour menu and a cosmo. The nachos were superb. The chips are thick and made from corn flour, and the toppings were fresh salsa, medium-mild spice, sour cream, fresh guacamole, grilled chicken, cheese...oh my goodness it was good. Both of us were pleasantly surprised as to how good they were.  Each ingredient was made and executed with care, and it showed in the taste!  The portion size is GINORMOUS. We could only eat about half.<br&gt;<br&gt;I ordered the chicken piccata, because this is one of the few pasta dishes that I CRAVE.  Not just chicken piccata, but specifically chicken piccata from Cheesecake Factory. Five chicken breasts tenderized thin sitting in a made-to order creamy, lemony, herb piccata sauce and sprinkled with capers.  Slices of warmed baked lemon lie on top of the chicken and then a big twirl of angel hair pasta.  I ate about 1/4 and took the rest home for 3 more meals.  And, it was DELICIOUS.  Sauce well emulsified and the server came by to snow parmesan cheese grated on top.  Now.  How do I know that the sauce is made to order?  For the to go, I asked the server if it were possible to get some sauce to go on the side, and he said he would see if the chef/cooks were able to make some extra.  Voila! They were and it tasted just as good as ever.  <br&gt;<br&gt;Of course, we got the cheesecake. I got the chocolate mousse and my sister got the Ghirardelli cheesecake. I mean, what can I say, it was all of the silky chocolatey goodness, with fresh whipped cream, chocolate pieces for a crunch and chocolate crust and chocolate cheesecake portion that I would ever want.  As for my sister&amp;#39;s cheesecake, I cannot say, since she refused to share!", "rating": 4, "date": "3/18/2019"}, {"text": "Been here a few times at this location to get cheesecake to go.   Its a quick and easy treat to get on short notice.  We will be back!  :)", "rating": 4, "date": "2/29/2020"}, {"text": "Great place for a birthday get together however the slow service and the price of the food is Something to think about.", "rating": 3, "date": "11/12/2019"}, {"text": "This has got to be one of my favorite restaurants that exist to take my wonderful fiancée to. I&amp;#39;m going to list a few pros and cons from the last visit that we had.<br&gt;<br&gt;Pros: Great service, wonderful atmosphere, fast to receive food, food arrived how I ordered, and overall just content with the experience I had.<br&gt;<br&gt;Cons: while it is minor it was worth mentioning that in the time we had went the Caesar salad seemed to have too much black pepper placed on both the chicken and salad. While I still enjoyed the dish my fiancée was hesitant to continue eating, but enjoyed the cheesecake to much so it sort of makes up for it.<br&gt;<br&gt;Overall I would easily recommend anyone go here, and I can&amp;#39;t seem to really find much of a complaint about this place. I&amp;#39;ve went nearly several times for cheesecake runs, but after our first dining experience I&amp;#39;m content to say this one is up there with the Edina experience, but way less of a wait time if any since we didn&amp;#39;t have any.", "rating": 4, "date": "6/1/2019"}, {"text": "I had dinner from the &amp;#34;light&amp;#34; menu.<br&gt;A Garlic Shrimp pasta. Wasnt bad at all! Shrimp was fresh and portion was good.<br&gt;Friend and I shared the Nutella cheesecake. The crunch part in the bottom was phenomenal and the Nutella drizzle up on top YUM. The cheesecake itself though was not as good as I thought it would be as far as taste. Texture was great though.<br&gt;Always enjoy coming here but with 1,000+ calorie cheesecAke slices, these visits are rare events!", "rating": 4, "date": "10/13/2018"}, {"text": "Fantastic food and service. Sizable portions. Warm and inviting atmosphere. Would definitely return. Lots of choices on the menu.", "rating": 5, "date": "4/22/2019"}, {"text": "We went there to order 3 slices of cheesecake to go. This was our first time waiting for over 20 minutes for them to just put some cream in the box and box them up. I understand they had a lot of online orders and it&amp;#39;s ok, but I literally watched another customer walk in 10 minutes after I ordered, place their order and get it within few minutes while I was still waiting for mine. I love their cheesecakes, but I&amp;#39;m gonna have to find another location next time", "rating": 3, "date": "8/12/2020"}, {"text": "Service was amazing and they did a great job at taking orders and bringing food out. Food was amazing. My favorite was the fried mac and cheese. The pork belly sliders were surprisingly good, and the coleslaw really compliments the sweetness of the pork. The hibachi steak was good, but it started getting way too sweet the more I continued to eat it. The grilled ribeye steak was amazing, but the green beans were very chewy and tasted a little undercooked. Otherwise, everything was amazing!", "rating": 4, "date": "2/1/2020"}, {"text": "Six of us tried this newish spot for an after-concert dinner. It seems that management may still be working out the kinks because in our experience, service was not the usual well-oiled machine found at other CF locations.<br&gt;<br&gt;I&amp;#39;ll start by saying we were seated in a generously sized booth that easily accommodated us and provided a semi-private feel. Our server was very cordial and professional, promptly taking beverage orders and delivering bread baskets.<br&gt;<br&gt;It was after entrees had been ordered that things began to veer off track. Menu items chosen included a Renee Special (half-sandwich with soup-of-the-day), Classic Burger, Chinese Chicken Salad, Louisiana Chicken Pasta, Chicken Piccata and Truffle-Honey Fried Chicken. <br&gt;<br&gt;It took what felt like an inordinate amount of time before our orders began to appear. The burger did not include the side of French Fries and they weren&amp;#39;t delivered for another fifteen to twenty minutes. I&amp;#39;ll add that iced tea and lemonade were promptly refilled and our primary server was again, very attentive and did apologize for the delays.<br&gt;<br&gt;As far as the food itself, no complaints. Everyone was happy and satisfied with their choice, some ending up with take-home boxes due to the over-sized portions. Not that they were displeased to have tasty fare for late night snacking or next day enjoyment.<br&gt;<br&gt;This location is smaller than the Edina CF yet the layout seems more open, less intimate. Noise levels fine for dinner conversation (at least where we were seated). I expect that things will improve over time as staff and management fall into an efficient routine.", "rating": 3, "date": "3/16/2018"}, {"text": "Yes it was the Grand Opening on Tuesday October 17. Busy but the smiles and service was very welcomed. Was greeted by so many individuals ready to get us seated and help us through their huge menu. Ranging from salads, Italian, Asian, some Tex mex, breakfast all day selections and America food. I can&amp;#39;t forgot all the Cheesecake selections. They also have ice cream and cake. <br&gt;<br&gt;           We had the pleasure of enjoying the white chocolate Raspberry truffle cheesecake!! One of my favorites and my brothers new favorite. Nothing was forgotten while we dined for the very busy lunch hour. We ordered the avocado toast, pizza and salad lunch special and the super antioxidants salad. Not to forget the avocado egg rolls and the firecracker salmon rolls! Yummy. The food presentation was up to Cheesecake Factory standards!! <br&gt;<br&gt;        We couldn&amp;#39;t finish the big portions they offer so of course we had to take lots of food home. Late night snacks  Which our server so kindly packed up to go for us so we can figured out which cheesecake to end our lunch with. Made our dining experience very enjoyable. Everything looked great  and tasted even better.", "rating": 2, "date": "2/28/2018"}, {"text": "I went to dinner in the mall with my daughter. It was a mixed bag, but mostly disappointing. Her water glass was cracked and leaking.  The app of fried calamari was really bland. Good portion and cooked about right, but it needed lemon, salt, pepper, aioli... anything to give it flavor. Didn&amp;#39;t finish that. The most positive thing about dinner was my beet and avocado salad. Yum! My daughter&amp;#39;s alfredo was serviceable right up until a hair was hanging off of her fork...<br&gt;After reviewing the general dissatisfaction with our server, &amp;#34;Veronica&amp;#34; responded with a shrug and handed me the bill.  With the cost comes expectations, if not for initial quality at least for amends. Disappointing.", "rating": 2, "date": "1/2/2020"}, {"text": "Ordered through door dash for delivery at work. Sliders with fries, and buffalo blasts. <br&gt;<br&gt;Arrived with no fries (cost extra for sliders with fries compared to without) and the buffalo blasts had half of them with giant holes and no buffalo chicken inside. Guessing they over cooked in the fryer and the chicken came out sort of what happens with mozzarella sticks if cooked to long. The few that did have chicken inside had very little in contrast to the ratio of fried wrap around it. All around not a good experience and will probably not be ordering again as this is the 3rd time I&amp;#39;ve had issues with the orders<br&gt;<br&gt;Edit for response: the issues I&amp;#39;ve had are not in contrast to the delivery. There drivers have all been professional. The issue has been with the food being delivered. I am an avid fan of Cheesecake Factory and have enjoyed eating here for many years. The issues are all with the quality of food being delivered. Not the delivery itself.", "rating": 2, "date": "2/1/2018"}, {"text": "First time was 1999 July : it was in MA. I was not a foodie yet.<br&gt;Second time nov 2011/ it is as good an generous.then I got to go back few tones: always good and generous as well as good service, hotel level service and quality .<br&gt;Last time was Jan 2018 at the new one and n ridgedale  mall in MN: sane good stuff. I always try different dishes.... they have so many :-)<br&gt;I like and hate the lighting: too Dim for privacy but also makes it somehow romantic and &amp;#34;focus on your table&amp;#34;", "rating": 5, "date": "5/30/2018"}, {"text": "Very disappointed, we walked in to celebrate my younger sisters birthday and asked the waitress Melanie R. if they could please sing (at the time my sister wasn&amp;#39;t in the table) she very strictly said &amp;#34;don&amp;#39;t do that here&amp;#34; Since we don&amp;#39;t come to this location we though perhaps not in this Cheese Cake Factory And as we were having our meal we saw 3 waiters approach and sing happy birthday to a different table. We all looked at each other confused but didn&amp;#39;t mention anything until we were heading out. We asked one of the waiters who confirmed that all we&amp;#39;d have to do is &amp;#34;request it&amp;#34; she directed me to her manager who said &amp;#34;she probably meant we don&amp;#39;t sing very well&amp;#34; in a very sarcastic tone. Didn&amp;#39;t seem to care much for it. We decided to skip the cheesecake celebration and head home. Will definitely not be celebrating any birthday dinners here.", "rating": 1, "date": "9/28/2019"}, {"text": "This was my first visit to a Cheesecake Factory.  Let&amp;#39;s set aside the fact that it is a soulless chain.  <br&gt;<br&gt;I got a side salad.  It&amp;#39;s a side salad.  Nothing to comment on.  <br&gt;<br&gt;But the truffle bacon grilled cheese!  Look at those perfectly browned craggy edges of crispy goodness!  Sturdy ciabatta bread wrapped around salty strips of bacon that, strangely, cut through the fattiness of the cheese.  And it comes with a little saucer of tomato soup dip.  Because you have to have grilled cheese with tomato soup.  There is no truffle flavor whatsoever, which is a good thing, because who wants fake truffle oil all over their homey  grilled cheese?<br&gt;<br&gt;So based on my single visit and this one item, 3.5 stars.  I did not get the cheesecake.  Because it&amp;#39;s a Cheesecake Factory.", "rating": 3, "date": "12/6/2017"}, {"text": "My brother and I just had an extremely disappointing experience here. <br&gt;<br&gt;The woman serving us only checked on us at the very beginning for waters and taking our orders. A different server brought out our food and another one cleared our dishes. My brother and I then made small talk and awkwardly kept looking around for over 10 minutes while waiting for our paycheck. <br&gt;<br&gt;My brother guessed there was probably a shift change...until we saw our server helping another group a few tables down. Eventually another girl approached us apologizing and saying that there had been a shift change and we hadn&amp;#39;t been assigned a server...which really didn&amp;#39;t make sense at that point. We asked for the bill and she said she would give us complimentary sundaes to make up for their mistake. The &amp;#39;sundae&amp;#39; was a single bowl with 3 scoops of plain vanilla, a tiny drizzle of chocolate, and whipped cream. My brother and I took a few courtesy bites and left.<br&gt;<br&gt;Overall I just felt that the service we received was quite poor. It was my first time here and I don&amp;#39;t plan on coming back.", "rating": 1, "date": "10/5/2019"}, {"text": "Ordered. 30 mins later, no bread and no apps. Finally got apps and had everything else to go because they already took way too long. They forgot the cheesecake in the to-go bag, which was the main point of going there  #slow #smh<br&gt;<br&gt;I also got a piece of metal in my pasta to go. ‍", "rating": 1, "date": "1/3/2018"}, {"text": "Enjoying Black Friday dinner with love ones! <br&gt;Glad to know thy open a new location in Minnetonka which is more convenient now!", "rating": 4, "date": "11/24/2017"}, {"text": "Hooray!  There&amp;#39;s a new Cheesecake Factory in town!  I&amp;#39;m not much a chain restaurant fan, but Cheesecake Factory is a unique experience.  If you order right, you can get well-prepared, high quality food for considerably less than you would at a fancy schmancy downtown restaurant. This time I had the seared tuna entrée, which was to die for.  It came with outstanding tuna, fresh veggies, and some delicious sauce with a serious wasabi kick, and I think it was only $22 and enough for two people to share.  <br&gt;<br&gt;I&amp;#39;ve only been to this new location once, but they seemed to be bending over backwards to be friendly and give good customer service.  That said, service was kind of a jumbled mess, but I recognize that I was there on Day Two.<br&gt;<br&gt;Protip:  Share. The huge portions of rich, rich food here are almost a satire of American gluttony. So unless you are a growing teenage boy or you just ran a marathon, share. And get the cheesecake to go (but by all means, get the cheesecake).", "rating": 4, "date": "10/20/2017"}, {"text": "Service was alright. I feel like our waitress was new to the food industry, she seemed nervous but kind. <br&gt;<br&gt;Our food took awhile to get to us, but when we got it, my mothers steak was really raw and cold. Our server didn&amp;#39;t even give my family members a steak knife, she hurried off after the food was dropped off. On the other hand, I ordered salmon with some lemon sauce. It was really good, I&amp;#39;d recommend it. <br&gt;<br&gt;Overall, it wasn&amp;#39;t the best experience. I&amp;#39;d recommend it to someone who is nearby, but not to someone that&amp;#39;s got out of their way to eat here.", "rating": 3, "date": "10/25/2017"}, {"text": "Came for lunch to celebrate my birthday. We&amp;#39;ve always loved the apps when we went to Southdale. Food was good as always--potato bites, fried mac and cheese, calamari, and the wonton wrapped chicken (can&amp;#39;t remember the name!) The free bread was warm and good, too. <br&gt;Our server, Marty, made the experience great. We&amp;#39;ve never gone to the restaurant because of their servers&amp;#39; reputation before, but maybe now we will!", "rating": 5, "date": "12/2/2017"}, {"text": "Horrible service. They seated another party before us and then told us it would be over a 30 minute wait. I called in advance and they advised me that they do not take reservations on the weekends and typically only a 5-10 min wait and it was a first come first serve basis.  I know the other party did not have a reservation. Their party looked about the same size as ours of 7-8 people. Never going here again! Completely horrible service. Hostess had no idea what she was doing and had to ask a manager before even seating us. We left and brought our business elsewhere. Be careful when going here!", "rating": 1, "date": "4/26/2019"}, {"text": "If you don&amp;#39;t like The Cheesecake Factory, you must have a screw loose. I don&amp;#39;t usually dine at chain restaurants (cuz they&amp;#39;re mediocre at best), but I just had Cheesecake Factory for the first time ever &amp;amp; its AMAZING!!! I ordered 9 items to go &amp;amp; everything was spectacular! The 3 employees I interacted were all very friendly &amp;amp; they got my entire order right! Hallelujah! Praise Cheesecake Factory!!!", "rating": 5, "date": "11/20/2019"}, {"text": "Nice decor and environment- a large room with dividers and mirrors.  Server Rainy was nice as was the pasta dish wife ordered- Evelyn&amp;#39;s favorite- was meatless, flavorful and plentiful.  I guess $7.50 is going rate for a glass of beer (beer!) but the October Fest on tap was fresh.  Wife really liked the 30th anniversary cheese cake.  Here&amp;#39;s the problem. I ordered a Factory Combination entree for $24. Chicken Madeira and Steak Diane (marinated steak slices) along with mashed potatoes. For $24 you do not get that much food. The chicken breast was a flattened 3-4 oz portion and the steak, while flavorful, was no more than 3-4 oz. Even with potatoes added, the serving plate looked half empty. No salad or vegetable. Incidentally, the entree arrived room temp so I sent it back- it came back warm, but the madeira sauce was gone.  I didn&amp;#39;t feel like sending it back again. Including beer and 1 slice of cheesecake this was a $70+ lunch and I felt shortchanged.  Bean counters must taken control of the kitchen. Not the CF I remember.", "rating": 3, "date": "10/28/2019"}, {"text": "My wife and I had lunch at the Minnetonka Cheesecake Factory today and totally enjoyed the experience.  The luncheon fish &amp;amp; chips had more than ample portions of fish and chips coupled with flavorful Cole<br&gt; Slaw.  My wife reported her chicken salad sandwich was equally delicious.  Topping off this excellent dining experience was our Server Jordan&amp;#39;s constant smile and eagerness to please.  All in all a 5-Star luncheon in very pleasant environment.", "rating": 4, "date": "1/10/2018"}, {"text": "This location just opened this week.  My wife and I wanted to check it out.  We were happy because this locale is only 10 mins away.  <br&gt;<br&gt;We arrived and had no wait for a table.  This was a first at CF.  The decor is very nice and clean.  <br&gt;<br&gt;We were promptly greeted by our waitress who took our drink order and arrived soon after with our drinks.  We were also given a basket of warm bread and a refill as well. <br&gt;<br&gt;We decided to try the Fortella with Roasted Chicken and Garlic.  It was excellent.  We were checked on several times and given refills or asked multiple times.  <br&gt;<br&gt;We also got the raspberry lemon cheesecake to go.  Which was soooo good.  <br&gt;<br&gt;Overall, a very pleasant experience.  Service was phenomenal and the food was top notch.  We will be back!", "rating": 5, "date": "10/22/2017"}, {"text": "The Cheesecake Factory!<br&gt;<br&gt;I&amp;#39;ve heard a lot of mixed reviews about this place so I was never persuaded to give it a try until I got a $50 gift card. Base on how many stars I gave The Cheesecake Factory you can guess I had a good time. However, I could see why there are so many mixed reviews. <br&gt;<br&gt;Atmosphere: <br&gt;It&amp;#39;s a really nice restaurant. The lights were dimmed and the table are nicely set. I find it funny/odd that they serve ice water in a plastic beer mug seeing how fanny the restaurant looked. <br&gt;<br&gt;Food:<br&gt; <br&gt;Fried Calamari ($12.95)- Perfectly battered and seasoned. The tartar sauce and the shrimp cocktail was delicious. I took turn dipping both sauce cause I couldn&amp;#39;t decide which one I liked more. <br&gt;<br&gt;Shrimp &amp;amp; Chicken Gumbo ($17.95)- The sauce wasn&amp;#39;t as thick as I would have liked it to be and the Cajun broth needs to be spicier. But, it was still very good. The shrimp and chicken was cooked perfectly and the parsley sprinkled over the bowl was a nice touch.  <br&gt;<br&gt;Chargrilled Bone-in New York Steak ($19.95)- I ordered the steak medium rare and it came out perfectly. The steak was juicy and tender however it was a bit over seasoned. The mash potato was delicious with a great butter taste.<br&gt;<br&gt;Additional thoughts - I personally had a great time and the food was delicious. I did however felt that the service needed to be more professional. Either way the food won me over. <br&gt;<br&gt;Summary: <br&gt;<br&gt;Good :)<br&gt;* Cool restaurant<br&gt;* Clean <br&gt;* Great Food <br&gt;<br&gt;Bad :(<br&gt;* Service isn&amp;#39;t bad, but it can improve", "rating": 4, "date": "2/20/2018"}, {"text": "LOVED THIS RESTAURANT. This was my first time at a Cheesecake Factory and first off the drink I got which was a Blended Georgia Peach- it was amazing. Both me and my boyfriends meals were so flavorful and we loved them, we ordered the Jamaican shrimp and Baja tacos, soooo good!!!!!! Our server Jackie was super nice and speedy we got our meals really fast and our drinks and it was a Saturday night so I&amp;#39;m super pleased with this restaurant overall.", "rating": 5, "date": "6/30/2018"}, {"text": "All sorts of  yummy! Pecan waffle Delicious, Orange chicken, Delicious, Egg white omelet Delicious! The service was excellent. Another great experience at this restaurant I had been to the Edina one both locations are Great!", "rating": 5, "date": "2/25/2019"}, {"text": "Love coming here! Have never had bad food or poor service. It&amp;#39;s never over busy if you go during the week (even after working). Looking forward to my next time coming here!", "rating": 5, "date": "4/30/2019"}, {"text": "Ordered lunch and had a long strand of curly hair in my food. Lost my appetite, never going here again. Please wear hair nets or caps, it&amp;#39;s unsanitary", "rating": 1, "date": "4/4/2018"}, {"text": "Went for an early dinner at about 4:30 PM on a weekday night.  Able to order off lunch menu.  The food was great, tasty and plentiful, even lunch portions.  Their Pasta da Vinci is one of the best pasta dishes anywhere.  Even better was the terrific service from Justin.  He was attentive, friendly and as good a server as you find at much fancier restaurants.", "rating": 5, "date": "7/7/2019"}, {"text": "Service was fast and friendly today. We ordered fried baked potato bites which where amazing! By the time we got to our meal we where too full to finish. I ordered the soup of the day which was baked potato soup. It was pretty good just a tad bit salty. The chicken bites where good and the buns where toasted to perfection. I enjoy coming to this location because the staff is always friendly and although they are busy they still remain on top of things.", "rating": 5, "date": "2/17/2018"}, {"text": "I live and work near the Ridgedale Cheese Cake Factory. I am an admitted  snob when it comes to my food and was slow to give the restaurant a  chance. To my surprise I found some choices on the menu I really enjoy. The Chicken Chile is great and surprisingly filing. My frequency has allowed me to become familiar with some of the staff.  Rose is very personable and professional. I look forward to her service because she always makes sure my food is fresh and hot. Sit at the bar on busy evenings to get in and out quickly.", "rating": 5, "date": "2/5/2019"}, {"text": "Great place &amp;amp; great food. I stopped in for a quick bite after the Twins game and wasn&amp;#39;t sure what to get. Ashley steered me in the right direction to get a egg roll sampler and it was off the charts. Definitely going to check it out again next time I&amp;#39;m in town for work. Thanks!", "rating": 5, "date": "7/15/2018"}, {"text": "Place looks great. Not uncommon for Cheesecake Factory. We ordered factory nachos and soft corn tacos. Factory nachos is gigantic in portion but overwhelmingly delicious. Soft corn tacos I would say was just good. Only issue we faced was getting the table when it was our turn to get a table the concerned person gave our table to someone else which was bit weird. Looks like they need some training. Our waitress was wonderful and comforting. Would definitely recommend this place.", "rating": 4, "date": "11/26/2017"}, {"text": "I come to this restaurant often as it&amp;#39;s a choice of my friends. However, in the past few months I have been here 6 times and each time they are completely out of their lemon pepper chicken. EVERY TIME. Their other items are good, but it&amp;#39;s disappointing to see the lack of preparation as this appears to be a reoccurring issue. Needless to say, that has left me pretty unimpressed with the restaurant.", "rating": 1, "date": "11/8/2018"}, {"text": "The food here is always top notch and worth the money! Our server Taylor was fantastic and paid attention to the small details, requester her if you can!", "rating": 5, "date": "8/20/2018"}, {"text": "The fried cheese stunk like an old boot and had the texture of freshly mixed DIY slime. Very grotesque! Service was unsatisfactory to poor! Yikes! To make everything worse the server gave the check to my wife. Very offended! I feel absolutely emasculated and ashamed. Will never come back to this establishment as long as I shall live.", "rating": 1, "date": "3/15/2018"}, {"text": "Brought mother and sister here from out of state and regret it. Had to wait to be seated about 10 minutes which is fine, except the 3 people walked in and were seated right away while we were waiting. <br&gt;<br&gt;Ordered an appetizer and then told 10 minutes later they didn&amp;#39;t have any left. Said he&amp;#39;d try to rush our lunch order as a result. Sitting here an hour later and still no food. <br&gt;<br&gt;UPDATE:  Thanks for apology on Yelp to &amp;#34;Guest Services&amp;#34;, but it&amp;#39;s really not enough. You should know that things got even worse. Right after my initial post, a server came by to tell us our server had gone on break but she&amp;#39;d help us. Told her we&amp;#39;ve been waiting over an hour for our order and she got it out to us immediately. Clearly was just sitting in the kitchen for a while. Only 1 of 4 things ordered was correct. My mother hates mushrooms and asked for no gravy for her meatloaf yet gravy all over everything. My sisters past was covered in oil. My spaghetti came out with no sauce and after sitting under heat lamp was a dried sticky ball. Server never came back to offer refills or ask how food was. Finally flagged someone down and told them and no apology or offer to correct the food. At the end of meal management came by and was very nice and apologetic to my mother and offered her a free piece of cheesecake. No apologies to the others whose meals were late and awful. Took forever to get our bill then he forgot to bring us the 3 pieces of cheesecake ordered and paid for. Took 10 minutes to get the dessert to go. In total our lunch with no appetizers, hardly eating our lunches, or eating of dessert took a grand total of two and a half hours!!<br&gt;<br&gt;Our meals should&amp;#39;ve, at the very least, been partially comped. All 4 of us have decided we will never go to a Cheesecake Factory again!!", "rating": 2, "date": "2/12/2018"}, {"text": "I have eaten at the restaurant in Ridgedale once (good experience), but often my boyfriend and I will go there and just buy cheesecake slices. The variety of cheesecake is awesome and tastes so good!! Only downfall is 2 slices are using $16-$18 :/", "rating": 4, "date": "4/26/2018"}, {"text": "I have never been to a CCF before, and may not return.  The food was fine (lunch, salads/lettuce wraps all around). But the service was horrible!  We came for lunch at 12:30, the restaurant was NOT busy - maybe 20 people.  Got our orders in fairly quickly then waited like 45 minutes - for salad.  We told server we were trying to make a 2:30 movie and needed our bills - took him 15 minutes to get them, then did not return for another 10!  <br&gt;I mentioned to him as we left how I felt about the service and zero from him.  Maybe they don&amp;#39;t need to provide good service if they think people are not going to tip well, or that they have so many people coming through that it does not matter.", "rating": 1, "date": "1/19/2018"}, {"text": "What a terrible disappointment. This location doesn&amp;#39;t meet the usual Cheesecake Factory standards at all. We were told it would be a half hour wait to be seated and an hour and fifteen minutes later we finally got a table. Then 2 of the 8 orders were wrong, one of the corrections took 30 minutes and the rest of us were nearly finished with our meals by the time it got there. We were celebrating a birthday so we ordered cheesecake which was almost correct but the guy who got his meal late never got his cheesecake. The entire time we were seated we had to ask for refills on our drinks. This was not a good experience and I&amp;#39;m not sure I will ever be going back.", "rating": 1, "date": "11/11/2017"}, {"text": "I&amp;#39;ve never experience such slow and horrible service.  We arrive at 5:30 and told we&amp;#39;d be seated in 30 minutes.  Our table was given away to people requesting low tops and we were seated 90 minutes later. The manager at first seemed apologetic but in the end they didn&amp;#39;t care.  They made promises that they didn&amp;#39;t deliver on.  Super disappointing, save yourself the drama and don&amp;#39;t bother!", "rating": 1, "date": "12/1/2017"}, {"text": "My beef taco hanger steak was very tough .<br&gt;I go to Edina restaurant  a lot and never has such a bad food .<br&gt;I don&amp;#39;t know who is your meat supplier ,for sure is not giving you a eatable meat .", "rating": 1, "date": "11/19/2017"}, {"text": "My family and I are avid Cheesecake Factory people and we visit one anytime we are in a place that has one. This one in Minnetonka beats any we have been too ( which are many. Service 5 star all the way from servers when you walk thru the door, wait staff, kitchen, management you name it. I am truly amazed at the difference between this one and the one in Edina. If your in town come to this one and hope Edina send someone over here to see how a CheeseCake Factory should be run!! Minnetonka you have made customers for life and I would recommend you against any 5 star restaurant in America!", "rating": 5, "date": "6/18/2018"}, {"text": "40 minutes after I order I&amp;#39;m told they are out of ham for the club sandwich.  Now I wait for a substitute while the other diners at my table are eating. There are plenty of options at the mall to eat...just don&amp;#39;t choose this one.", "rating": 1, "date": "6/11/2018"}, {"text": "The waitress spilled part of my husband&amp;#39;s pasta sauce on his jacket and all the manager offered was to pay for dry cleaning. Nevermind the fact we don&amp;#39;t live there and it was freezing cold out and he left without a jacket to wear.  The food wasn&amp;#39;t great either.....$5 for chicken with the pasta and only came with 4 small pieces! It was an awful experience! Better off at the Edina location.", "rating": 1, "date": "3/23/2018"}, {"text": "We have visited a couple times in the last few months. We were really looking forward to having this closer to us.<br&gt;<br&gt;We went for lunch today. Nice waitress, food was just fine. It took quite a while to get our food. Seemed a little dark and dirty.<br&gt;<br&gt;The bar had cnn on both tv&amp;#39;s. This was such a turn off. In this political environment we have today, change to a  non political channel or put on some sports, even hgtv.<br&gt;<br&gt;Maybe we will try one more time in the next couple weeks.", "rating": 3, "date": "5/31/2018"}, {"text": "Stopped to meet a friend for early dinner.  Sat on the patio on a gorgeous evening in full shade... my definite preference.  Service was slow but I think a lot of people came about same time.  We ordered wine and a sandwich and it took 2 hours, more than necessary.  Our server was very nice but didn&amp;#39;t introduce herself, had no name tag and wire very strong perfume which was very hard for my breathing. I might suggest that the training include giving their name, stop occasionally to check for needs and not wear perfume.  Food was ok. I had a Chicken Avocado sandwich. There was a very thin grilled piece of chicken, three slices of tomato (?) and plenty of tough bacon of good flavor and lots of avocado on toasted white bread.  Friend&amp;#39;s Chicken Salad sandwich looked very light on Chicken salad, long on tomato but said her flavor was good.  The best thing was the sweet potato fries...nummy.  Won&amp;#39;t be taking over my &amp;#39;go to&amp;#39; spot but then I wasn&amp;#39;t looking for a piece of cheese cake.", "rating": 3, "date": "7/24/2019"}, {"text": "Tonight I had the BBQ Burger with fries and it was really good. The burger was juicy and a good size, better than most places. It filled me up and I sadly had no room for cheesecake but there is always next time. I will definitely go back soon within the next few weeks. The environment was good and the staff was very nice. I had a great dining experience here.", "rating": 5, "date": "12/13/2017"}, {"text": "I was super excited that this location was opening so close to home.  My first experience was not great.  My cheesesteak had raw meat in it.  But just tonight decided to try it again.  Big Mistake!  My companions buffalo Blasts were so burnt and several were empty.  They did nothing but say sorry.  I should have taken a photo but the plate was taken before I could.  I think I may jus have to go to Edina for my lemonade fix in the future.", "rating": 2, "date": "1/29/2018"}, {"text": "This location is 10 times better than the Southdale location. Everyone is friendly, they actually smile and say hello/thank you. The ambience is very warm and inviting, and the food quality is so much better here. Everything was delicious and timed out well. Our server, Matt, was fabulous, knowledgeable, very kind and hard working. We&amp;#39;ll be going to this location from now on as it was a much more enjoyable experience all around.", "rating": 5, "date": "12/3/2017"}, {"text": "Too many choices!  Easy pick for when the family can&amp;#39;t decide on a cuisine.  Wonderful staff.", "rating": 5, "date": "10/25/2017"}, {"text": "We were excited to add this to the restaurant options at Ridgedale, but the excitement didn&amp;#39;t last long. The food took forever - and the entrees came out 25 minutes apart (there were only three of us). My order was messed up and had to ask the waiter to take things off the bill that were never delivered. It&amp;#39;s a shame because the food was decent, but service was terrible. Won&amp;#39;t be going back.", "rating": 2, "date": "11/18/2017"}, {"text": "I&amp;#39;ve been to this location twice now and the service was horrible both times. Extremely slow through every step of the process, even when the restaurant wasn&amp;#39;t busy. Had to remind servers multiple times for items they were forgetting. Never refilled water or asked how food was. Also very slow to get check and pay bill. And the servers seemed clueless that there may be an issue. After my second visit I complained to the manager and he did nothing to compensate me. You&amp;#39;d think at least a small coupon to try to get me to come back. They don&amp;#39;t know good customer service or how to run a business. Only thing saving CF is that I like their food.", "rating": 2, "date": "1/29/2018"}, {"text": "My group of three was the first table seating at 11:30am. I should have known that my experience was going to terrible when I watched the server hand out the appetizer plates and stopped at mine plate to wipe it off with her bare hand. Apparently when you see a dirty plate, you shouldn&amp;#39;t get clean for your guest but make it more dirty. That was only the beginning of terrible service.  We had to ask for our drinks to be refilled multiple times. The tables around us got their food before us (again, we were the first table). After one hour, I had to ask the host to find out server to check on our food. It took over an hour and a half to get our lunch. I ordered a half sandwich and salad. My salad was wrong and when I let the server know, she didn&amp;#39;t say sorry and just took it away. The rest of my tables food (both pasta dishes) came out cold. Unfortunately due to when we received our meals, we had to go back to work so we couldn&amp;#39;t eat our food at the restaurant. Overall, it appears that the management has a lot of learning opportunities for the staff and customer service.", "rating": 2, "date": "3/26/2018"}, {"text": "This is one of the best restaurants I have eaten at. The food was exceptional and the wait staff was awesome!!Way to go Cheesecake Factory!!", "rating": 5, "date": "11/3/2018"}, {"text": "This is by far one of the best dining experiences I&amp;#39;ve ever had ! The food was phenomenal, the drinks were affordable , and all the staff was excellent. They really made me and my friend feel welcomed for her first time !", "rating": 5, "date": "7/10/2018"}, {"text": "Terrible service from the bar to the host to the manager.  We waited one hour 55 minutes. The manager promised to come a round of drinks but withdrew the offer after we all ordered them.  Poor management.  They literally gave away our table to another Group.  Avoid at all costs.", "rating": 1, "date": "12/1/2017"}, {"text": "After being seated and our drink orders were taken by a vary awkward waitress I began to look at food choices. After flipping through a extensive menu I chose the Americano burger and my mother chose the club. We had a basket of bread with our drinks while waiting for our food to come, our food came our quite quickly and our server than popped up asked us how everything looked before we managed to take a bite and than disappeared. That&amp;#39;s when things went wrong, I cut my burger in half to see that it wasn&amp;#39;t medium as I had ordered but rare. So rare that it was still cold, my waitress than was no where around and I had to flag down another waitress who saw it and was shocked that it was even sent out. She got me a salad on the house, and they fixed my burger, the manager also came and apologized. When it was time to get the bill they took the burger off it completely. I was impressed at the lengths they went to make everything right. I believe that they are still trying to work out everything since it is still semi new.", "rating": 3, "date": "11/21/2017"}, {"text": "I arrived at 545 my food didn&amp;#39;t get to me until 7:05. Another patron sitting across from me had their food within 30 minutes upon arrival so it&amp;#39;s not a very busy type of wait. Upon receiving a discount because of the wait and fruit flies, I tell them I have to leave package my food to go, I get home my daughters burger burnt totally and the little itty bitty serving of fresh fruit that came with my nephews meal they could have kept on top of the few fries that came with my daughters burger that also had lettuce and tomato added in which I said ONLY ketchup!! Anywho, very displeased and will not return again", "rating": 1, "date": "8/6/2018"}, {"text": "I ordered the Chicken Parmesan &amp;#34;Pizza Style&amp;#34; and it was very spicy. Spicy was not mentioned in the description and I can not tolerate spices due to a medical condition. I told the server and he did not apologize at all but he did offer for me to order something else. I ordered a burger. 40 minutes later my burger arrived once I asked for a manager. The french fries were cold. The manager said the burger takes at least 20 minutes to prepare. Again, no apology. From the time I ordered the burger to the time it was served to me the server never came to our table. The burger was nothing to rave about. I was so aggravated I told the server I did not want to pay for my meal. Another manager came to the table and said we can&amp;#39;t afford to pay for your meal. He said it was not our fault you did not like your original meal and you ate the whole hamburger. SAY WHAT??? I said well you lost a customer, I have been there at least 6 times since they opened. He did not say anything he abruptly walked away. PROFESSIONAL? He did give me $5 off my bill.... Too late they lost a customer. Bottom line is there customer service is the worst I have ever seen.", "rating": 1, "date": "11/12/2018"}, {"text": "A welcome addition to the area.  Expansive menu which is usually done with respectable quality.  Love the Korean cauliflower-", "rating": 4, "date": "4/13/2018"}, {"text": "Cheesecake factories serve the masses... you might scream &amp;#34;Wow!&amp;#34; However this is a family restaurant with a large menu to choose from. What more did you expect? A good place to get a decent meal with some cheesecake to follow. Our service was great considering we walked in @7pm on a Saturday.", "rating": 4, "date": "2/17/2018"}, {"text": "SO GOOD the food is really filling, and the cheesecake is absolutely over the top delish!! really rich in flavor and have a ton of menu options!! great restaurant", "rating": 5, "date": "1/19/2018"}, {"text": "This place is absolutely horrendeous. It started out good and went downhill fast. Went on a Saturday at 5 pm and was told it was a 20 minute wait. That&amp;#39;s ok.  At 5:30 we asked and were told we were next.  We didn&amp;#39;t get seated until 5:50, whatever.  The waitress was very nice but overworked, not her fault.  We ordered dinner.  My wife ordered a dish and asked to have it without the capers. When it can the food runner said Chicken without Capers and set it down and ran away and it was full of Capers. You could not miss it.  Then my Daughters food came out ice cold.  We told the waitress who took it back and didn&amp;#39;t bring a new one for 25 minutes.  The rest of us were done by then.  My wife didn&amp;#39;t want to send her dish back exactly because of this, she didn&amp;#39;t want to wait another 25 minutes.  Then I asked for the check and the waitress said she would send over the manager, which I stated I didn&amp;#39;t want to see the manager I just wanted my check and pay.  At this point I have already been at the restaurant for over two hours.  It took another 15 minutes to get the bill, I had to put on my jacket and get up and find waitress to pay.  Then manager wanted to talk about it but I told her I just have to leave as at this point I was there for 2 and 1/2 hours.  The food has consistently gone downhill at this location and it is obviously extremely poorly managed.  The food is definitely not worth the wait.  We will never go back to this location.", "rating": 1, "date": "3/29/2018"}, {"text": "Wait for them to work out the kinks before you go!<br&gt;Visited tonight with a party of 10 for a birthday dinner. The guy said there would be 30 minute wait.  No problem.  <br&gt;One and a half hours later...still waiting.  Big Problem! <br&gt;They finally crammed us into two high tops at the bar...and offered three free apps, FOR TEN PEOPLE!! <br&gt;Then about 45 minutes later...they give our table to another party assuming we were satisfied at the high tops.  Manager came by and we understood that they would be comping apps and a round of drinks.  I mean what&amp;#39;s $100 for the sake of making it right for the customer?  Not so much.<br&gt;Finally get seated at a table...enjoy and few more apps and drinks.  When the bill comes the manager tells us that we misunderstood her and that three apps would be all that is comped.  Not that we expected everything to be on the house...but c&amp;#39;mon! Give us a reason to forget a horrible first impression.<br&gt;They lost 10 families as patrons tonight!", "rating": 1, "date": "12/1/2017"}, {"text": "Our service tonight was the slowest and most unprofessional for a cheesecake factory I have ever experienced.  We were seated right away which was wonderful!  It  took 15 mins for  our server to come get drink orders for our table, then another 20 to order food.  It was also a good 30 mins before our food was served.  Our son who has allergies ordered a burger (we did not know there were seeds on the bun, it is not noted on the menu). When the burger arrived and we saw it had seeds on it, we asked if there was a different bun without seeds, she took the plate and told us there is an up charge for a non seed bun. So we waited another 25 min for the the existing burger to be transferred onto a seedless, children&amp;#39;s burger bun. Really? When we decided to order cheesecake we mentioned we were going to eat some of it at the restaurant and would probably need to-go boxes, (We had already been there for 2 hours) for what we didn&amp;#39;t eat.  She brought the bill over right after we ordered the cheesecake.  We had an &amp;#34;e-slice of joy&amp;#34; voucher on our phone.  She said she couldn&amp;#39;t accept it on our phone and she  could use a printed copy.   No where on the voucher does it say this.  She suggested we write down each different voucher number so it would ease her work load.  So we were furnished a pen and some paper.  Of course there was a transposition error between the 15 barcode numbers we needed to copy from phone to paper, and one voucher was invalid.  After another 20 mins of waiting to pay (without cheesecake) she brought our 4 slices of cheesecake to our table all boxed up in a bag ready to go.  She told us she put some plastic forks in the bag so we could eat a few bites before we left. We felt like our desert was being held hostage until the payment options were reconciled.  I just think that a visit by the manager would have solved a lot of problems here.  I believe he was aware of the situation as he seemed to be conferring with our server regarding the best response/strategy.", "rating": 2, "date": "2/7/2018"}, {"text": "I can always count on the Cheesecake Factory to have consistently good food from location to location.  I&amp;#39;ve been to these restaurants around the country.  I love that there is a wide selection of menu options, it&amp;#39;s great for the family because they have something for everyone.  I do like the Edina location better because the booths are more private and I feel like people aren&amp;#39;t staring at you.  (Probably just a rude customer)", "rating": 4, "date": "12/19/2017"}, {"text": "The night started off great. Got seated relatively quick for a group of 9. But it went downhill after that. The service was terrible, our waitress rarely checked in to see how we were doing. We waited 30 minutes for apps and another 30 for our food. We were there for about an hour and a half before we got our meals. Then they mixed up orders, and one of the people in our group got their meal 10 minutes after everybody else&amp;#39;s. Not to mention it was a cheeseburger and fries. When we brought up our concerns to the waitress she didn&amp;#39;t give 2 shits that her service was shitty. Simply replied with a, &amp;#34;Oh yea, I&amp;#39;m sorry about that.&amp;#34; So we asked to speak to a manager and they didn&amp;#39;t seem concerned that our visit had been ruined by poor service. Offered us an apology, and to buy the burger that was most expensive. For 1.5 hour wait for food and shitty service my only tip to them was better customer service training. Long story longer, we will not be returning.", "rating": 1, "date": "1/15/2018"}, {"text": "Was very excited for a night out with my fiancé. We attempted to make reservations and were informed that it was a first come first serve basis we arrived around 6:20 PM and were told there was a 20 minute wait we were not seated until around 7 PM our waitress came out and tried to upsell us on many appetizers which we weren&amp;#39;t interested in since we waited 40 minutes for our food I then ordered the fettuccine Alfredo blackened and my fiancé order the New York strip well done with extra seasoning our food arrive roughly 20 to 30 minutes later then the appetizers we ordered arrived after the entrées my fiancé&amp;#39;s New York strip was not well done it was very pink his french friesWe&amp;#39;re not fresh and we had to send them back the waitress came back within two minutes with a fresh order of fries which were just as old as the previous order my fiancé then asked the waitress to Touch the french fries to see if they were hat which she did she then apologized and said that her manager told her to bring us those fries because they were fresh we waited for another 5 to 10 minutes before the order Arrived at this point I shared myEntrée with my fiancé because his meal was not properly prepared we then found on the bottom of my plate was filled with butter I thought Alfredo sauce was more of a cream-based sauce our waitress I disappeared by this time so instead of informing her it was 8:25pm by now  we just asked for the check and left. I still tipped 20% because she seems overworked and flustered. Can&amp;#39;t say I will revisit this location.", "rating": 2, "date": "4/22/2018"}, {"text": "I went with a group of girlfriends to celebrate some birthdays. We knew we had a big group on a Friday (and they wouldn&amp;#39;t take reservations!) so we arrived early, thinking we&amp;#39;d chat and have a drink while we wait. We were told 30-45 minutes. We checked in after an hour (weren&amp;#39;t updated) and were told we would be seated soon. Sure, there was a lingering party (we understood). They comped a few apps (great)! But then we found a small table at the bar (many of us standing), made it clear to the manager we still wanted our table then it was given away. Again, we&amp;#39;re a big party so can&amp;#39;t just find another one. We waited a full 2 hours before being sat (and when I suggested to the manager &amp;#34;I think we need drinks now&amp;#34; she made it sound as if they&amp;#39;d be on the house.) this did not happen. Then it took them at least 30 minutes to settle our checks! All in all we were there for 4 hours for a few apps, drinks and a to-go dessert (which did taste good), and I still paid (even with some comped apps) what I would have at a much nicer restaurant. NOT good customer service. Cheesecake Factory, actually covering our drinks that you said you would have may have earned you back a few customers and wouldn&amp;#39;t have cost you much. A shame.", "rating": 1, "date": "12/1/2017"}]}