{"address": ["2715 Southdale Ctr", "Edina, MN 55435"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 2.5], [3, 3.0], [4, 3.5], [5, 3.5], [6, 3.0], [7, 2.5], [8, 2.5], [9, 2.5], [10, 3.0], [11, 3.0]], "2017": [[0, 4.0], [1, 3.5], [2, 3.0], [3, 3.5], [4, 3.5], [5, 4.0], [6, 4.5], [7, 4.0], [8, 4.5], [9, 4.0], [10, 3.0], [11, 2.0]], "2020": [[0, 3.0], [1, 2.5], [2, 2.0], [3, 2.0], [4, 2.0], [5, 1.5], [6, 2.0], [7, 2.5], [8, 3.0], [9, 4.0], [10, 4.0], [11, 3.5]], "2018": [[0, 2.5], [1, 2.5], [2, 2.5], [3, 3.0], [4, 3.5], [5, 2.5], [6, 2.0], [7, 2.0], [8, 2.0], [9, 2.5], [10, 1.5], [11, 2.0]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "What. happened. to. this. place?<br&gt;<br&gt;It was really hot yesterday.  It was the heatwave.  So, when we got in there, we were expecting they would be blasting the air conditioner... This wasn&amp;#39;t the case.  We were informed it would be a 15 minute wait, and to be honest, I wasn&amp;#39;t in the mood for that, and was ready to go anywhere else in the mall-  My date insisted, and my crabby-butt begrudgingly agreed, throwing shade.<br&gt;<br&gt;I&amp;#39;d basically decided on a burger, before we were even seated, because it&amp;#39;s something you typically can&amp;#39;t screw up at a place like this.  My date talked about the burrito, and I warned them it was a bad decision, but they were *all about* it, and said they&amp;#39;d enjoyed it in the past.  Did I mention I had a bad feeling about this place, and didn&amp;#39;t want to go here? ;-)<br&gt;When my food arrived (just mine) I tried some fries.  They weren&amp;#39;t cold, but they tasted like they&amp;#39;d been sitting in an oven?  Or like they&amp;#39;d been toasting under a warmer.  Ugh.  This pissed me off.  The Cheesecake factory isn&amp;#39;t cheap.  When you charge a certain amount of money for your entrees, and there&amp;#39;s always a wait for a table, you don&amp;#39;t DO STUFF like this.  The burger: cooked to a nice medium rare, but the bun was soggy, the lettuce was wilted to the point of tissue paper, and it was obvious it&amp;#39;d been sitting. Oh well?<br&gt;<br&gt;When my date&amp;#39;s food arrived, they asked if I&amp;#39;d like to try some:  Sure.  They cut it open, and as you&amp;#39;ll see in the pics, we found a rice burrito, with a few pieces of chicken meat inside.  This ruined the rest of my mood for the night.  I&amp;#39;ll repeat myself:  When you charge a certain amount of money for your entrees, you can&amp;#39;t get away with this.  Maybe they had new cooks?  Maybe they were running out of proteins and rationing them? Maybe this is just the signs of a chain on the decline.  Either way, it&amp;#39;s inexcusable.  When we flat-out asked them to take the burrito off the bill, the manager seemed put-off by the request;  No, we *picked* the chicken out of it, dude!  Ugh.<br&gt;<br&gt;The wait staff were decent, that&amp;#39;s what the stars are for, but I won&amp;#39;t come back.  <br&gt;<br&gt;What happened to this place?", "rating": 2, "date": "7/20/2019"}, {"text": "It was amazing! Our waiter was very polite! He was coming back around in a timely manner &amp;amp; did everything to accommodate us &amp;amp; our child!", "rating": 5, "date": "10/4/2020"}, {"text": "Always my go to for cheesecake, specifically strawberry cheesecake. This visit disappointed me a bit. The lady who took my order didn&amp;#39;t act like she wanted to take my order and after I signed my card payment she didn&amp;#39;t care to look at me or to say to have a seat, it will be a minute. I had to ask her and she replied &amp;#34;yep.&amp;#34; She acted as if I had did something wrong to her. I observed her interaction with everyone else she acted somber and didn&amp;#39;t seem all too excited about her job, although she has a sweet voice and nice face. She called out someone&amp;#39;s order half lazily and then mine. She is either working too much or needs a break to find some happiness and cheer. <br&gt;<br&gt;As for my cheesecake, it is as delicious as ever although I see my slice has shrunk. Lol. I still can&amp;#39;t finish the whole slice either way. I might have to buy the whole cake next time. <br&gt;<br&gt;All in all, my service wasn&amp;#39;t great but my cheesecake is still tasty.", "rating": 4, "date": "6/20/2019"}, {"text": "When it comes to the casual dining segment you have your typical choices which consist of Applebee&amp;#39;s (a Denny&amp;#39;s that serves alcohol), Buffalo Wild Wings (a Denny&amp;#39;s with paper plates but big televisions), Red Robin&amp;#39;s (a Denny&amp;#39;s that serves mainly burgers, fries, and alcohol), Hooter&amp;#39;s (a Denny&amp;#39;s with females wearing hardly anything), Old Chicago (a CiCi&amp;#39;s Pizza that has a full bar), and Ruby Tuesday&amp;#39;s (which has more empty tables than most Denny&amp;#39;s) just to name a few.<br&gt;<br&gt;There are about another six casual theme chains that are near the top of the class, however, one stands out: The Cheesecake Factory!<br&gt;<br&gt;First, the restaurants are huge, however, the wait times are still crazy.  Second, the menu.  It is by far the most diverse menu I&amp;#39;ve ever seen.  Their appetizer&amp;#39;s are awesome (try the spring rolls). They have sandwiches (try the BLT with shrimp that is sometimes off the menu but they can still make it), seafood, pastas, steaks, chicken, and salads. Third, the service set the standard and the casual themed restaurants should take note to see how it is done.  Fourth, their desserts.  You go there for the cheesecake and they have a countless number of variety.<br&gt;<br&gt;That is all the positives.  Now here are the downsides....<br&gt;<br&gt;First, wait times can be long as I have remember waits in excess of three hours on a weekend.  Solution to that is go shop.  Second, because their menu is so vast, I ALWAYS have issues deciding what app, what entree, and what dessert. Third, if I worked in the kitchen I would be very unhappy because I could never remember a menu that vast from the back-of-house (kitchen) perspective.", "rating": 5, "date": "1/1/2020"}, {"text": "The food was what I expected, not amazing but not horrible. The portions were large and the free bread is always a treat. The drinks were very overpriced. The food was also kind of speedy for what it was. I do enjoy the &amp;#34;skinnylicious&amp;#34; menú but hate calling it that. There are many good low cal options on it though. Wouldn&amp;#39;t choose to eat here over somewhere else.", "rating": 3, "date": "9/5/2020"}, {"text": "I have not been to the Cheesecake Factory for the food before. I loved the food and I was impressed. The decor is a little quirky but it works.<br&gt;<br&gt;Raspberry Lemonade-Very sour but better towards bottom of the drink.<br&gt;<br&gt;Table bread- Very nice and I love the pat of butter with it.<br&gt;<br&gt;Mac and Cheese bites-  This appetizer was asolutely delicious. It was perfectly crunchy with a very nice creamy mac inside. Also the sauce along with it is very good.<br&gt;<br&gt;Chicken parmesan pizza style-  The chicken is as big as your plate. It was very good I like chicken parmesan. I like the cheese and angel hair on it.<br&gt;<br&gt;Lemon raspberry cheesecake- This was delicious and different taste for cheesecake. The lemon and raspberry are tart the you have sweet cheesecake. It was perfect as well as the whip cream on the side.", "rating": 4, "date": "6/15/2019"}, {"text": "This place is a very nice place to eat at. When you get in, they give you some nice bread and butter. The place has a very nice atmosphere, and looks great. The food was decent. I got the Americano Burger, my one complain was there was way too much grease. Other than that, it was good. The fries are hot and crisp and very good! <br&gt;<br&gt;Now for what everybody&amp;#39;s favorite part of the meal is: The Cheescake. I got my go to cheescake, the Oreo Dream Extreme Cheesecake. It is very good and chocolaty and it has a large Oreo on the top. I would very much recommend this one.<br&gt;<br&gt;Overall, this place is a good place to eat, and a great experience! I highly recommend this place to everybody. I would rate this place 8/10, and I am defiantly coming again!", "rating": 4, "date": "2/7/2020"}, {"text": "Went to go celebrate my brother&amp;#39;s graduation and as usual there was excellent service and there was surprisingly a lot of good vegetarian options! My brother got the veggie burger, my sister got the avocado spring rolls and I got the cold pasta with veggies. It did not have a sauce but was truly delicious!", "rating": 4, "date": "6/26/2019"}, {"text": "Not sure if it&amp;#39;s due to COVID or the fact that it was Monday, but it was a bit slow and perfect for a date night. My wife and I went for our one year anniversary dinner. The waitress asked all the right questions from the start and was always friendly and smiling (I could tell even with a mask on), I believer her name was Lauren. The food wasn&amp;#39;t anything too crazy, but it was up to par and delicious nonetheless. Of course this place is famous for their cakes, I definitely enjoyed the chocolate truffle cake. One slice is more than enough for two to share", "rating": 5, "date": "7/30/2020"}, {"text": "Cheesecake Factory asked me to submit a review on their website after my Yelp review.  That was 10 days ago and I still haven&amp;#39;t heard back.  Not only was the food bad but the customer service seems to be lacking too.", "rating": 1, "date": "7/29/2020"}, {"text": "The ambiance and seating are ideal for larger groups. Our server, Ryan was extremely patient with my table and provided exceptional service. All those who came to our table were very friendly. <br&gt;<br&gt;I know some maybe thrown off by the prices, but it&amp;#39;s worth it. Their portions are large and everything is delicious. The hard part is deciding what to order from their extensive menu. <br&gt;<br&gt;They offer amazing cheesecakes too. Most never have room for dessert, but I recommend you order it to go at least. You won&amp;#39;t regret a sweet treat later in the evening.", "rating": 4, "date": "7/10/2018"}, {"text": "So disappointing after ten years of meals. Hope it was only the one day. Waitstaff was great but food was no good. Almost sent it back. Chicken piccata lunch portion. The pasta was dry, sticky and almost felt like it was reheated in a microwave. It overshadowed the chicken which was ok but shot the balance of what could have been a good meal. Instead, took home for children - they&amp;#39;ll eat anything.  I ordered a side salad and called it lunch. The beet salad was realIt&amp;#39;ll be awhile before I return. I was very  disappointed.<br&gt;<br&gt;Visited again. Ordered something good but the music was loud and not conducive to table discussion. Loud singing. Asked that music level be turned down.", "rating": 2, "date": "3/27/2019"}, {"text": "Greeted nicely, with all the open booths and tables they picked the smallest one to put us in, which was odd but it worked out as our waitress was great. She guided us through the menu pointing out not only brunch but where the lunch specials were. She was great for questions always smiling and friendly. Since we took a while looking over their 21 page menu, she went to get us bread, which then she apologized for because it was in the oven. Madison was her name I would as for her again of we came back.<br&gt;When the bread came it was so warm we were so excited but they bring you cold hard butter, how is that supposed to spread on bread, especially warm bread?<br&gt;I got the 2 egg breakfast with potatoes and their brioche bread as toast, which was good. Again with the cold butter, but I let the warm butter melt it. My companion got the everything flatbread pizza. Which he said it was ok, but it wasn&amp;#39;t very flat. He thought the veggies made it more went so he would skip that next time, know he is a meat puzza guy. <br&gt;We didn&amp;#39;t get dessert, I know gow could you not. But the bill came fast when we said we were done and she ran the card fast so not bad. Would go again for the breakfast for sure. They have happy hour starting at 4 in the bar area Mon - Fri.", "rating": 4, "date": "4/28/2019"}, {"text": "Went for my sons B-day dinner. Forgot to request the bar area since that&amp;#39;s where they have HH. Myself, my 2 teenage sons, and my parents were sat in a booth in main dining. When we asked about HH our server Judith was so kind and polite and tried to find us a table in the bar. We ended up not wanting to wait for a table to open up in the bar area so we stayed in her section. She was wonderful! We never waited for anything! I saw her walk by us repeatedly, but never bothered us. She was just making sure to be around IF we needed her. Always kind. polite, and personable. All of us loved our food. It was a great dining experience for us all. Thanks Judith", "rating": 5, "date": "10/28/2020"}, {"text": "The food is good but bit pricey  love the beef fajita and the cheesecake is so bummm  we&amp;#39;ll definitely gonna come back here", "rating": 4, "date": "7/26/2020"}, {"text": "Went there for a coworker going away happy hour. There were about 10 in our group and we told our server before we ordered that we would require separate checks. The food came mostly in a timely fashion (one order wasnt brought out until 45 minutes after it was placed). Server didn&amp;#39;t check on us and we frequently had empty glasses. When she did take additional drink orders, they took 10-15 minutes to come. <br&gt;<br&gt;The worst part was getting our checks. We asked for our bill at around 6:00. It took over an hour to get our checks. When asked about the unacceptable delay, the manager said that&amp;#39;s what happens when checks need to be broken out and put together differently. This is precisely why I make it a point to state that we would need separate checks before we ordered. There was no offer of compensation. Not even an apology. <br&gt;<br&gt;The food and drink isn&amp;#39;t good enough to offset this poor of service. Especially when management doesn&amp;#39;t even realize that there&amp;#39;s a problem. Take your larger parties elsewhere.", "rating": 1, "date": "2/19/2020"}, {"text": "Yikes. Not quite sure how to start this review.. So I&amp;#39;ll start from the beginning. We came here on a Sunday, it was actually really quiet - must have been the fabulous 58 degree (heat wave) weather we were experiencing. We were seated quickly at a booth and our drink order was taken quickly. Before long, a party of about 26 people took over the booth behind us and the 2 large tables to the side of us. The adults occupied one table while the kids (probably between 7 and 12) had their own tables. THEY WERE SO LOUD. Not only was I about to break a took after taking a bite of the bread that came with the Crab &amp;amp; Artichoke Dip, I was constantly being annoyed by this group of kids. The parents, of course, all had down 2 beers in the first 10 minutes and couldn&amp;#39;t care less about what the kids were doing. I asked if we could be moved and we were told that once we place an order, we can&amp;#39;t be moved. In my many years of dining, I&amp;#39;ve never heard that before. So we stuck it out. The food was less than delicious. I was actually quite disappointed. Their Passion Fruit Margarita actually wasn&amp;#39;t awful. But with the dining experience I had, I probably need a minimum of 10 of those to cope with the irritation. Most likely would not return.", "rating": 1, "date": "10/22/2019"}, {"text": "So, the last time I was here was probably 10 years (or more) ago. I have not been back since as back then the food was cafeteria like and definitely not worth the money...<br&gt;<br&gt;HOWEVER... that is definitely NOT the case now. <br&gt;<br&gt;For Christmas I was given some gift cards for free slices of cheesecake so we decided to head on over and check the place out. On walking in I noticed that the place looks like it sits the day it was built, which I find impressive knowing the kind of wear and tear a restaurant goes through. We were seated right away at a booth in the bar area right next to a server station. It was an out of the way spot that wasn&amp;#39;t very comfortable, the servers would frequently congregate there and talk and laugh loudly, it was very distracting. <br&gt;<br&gt;It took about 10 minutes for someone to come to our table for the drink order. On happily noticing that they have a happy hour I chose one of the drinks, the JW berry lemonade or something like that. It was good but you really didnt notice any alcohol and for the size that thing was I should have been calling an uber home!<br&gt;<br&gt;My friend ordered the happy hour burger and happy hour crispy chicken sliders and both were actually REALLY good!! I ordered the carbonara and I was more than pleasantly surprised!<br&gt;<br&gt;For my free cheesecake I got the coffee cream one and it is to die for!<br&gt;<br&gt;I&amp;#39;m pretty sure we&amp;#39;ve decided to come back another time and check out a bit more of their happy hour menu!", "rating": 4, "date": "3/4/2019"}, {"text": "Love love the food here! Large selection of cheesecakes which are always tasty!<br&gt;<br&gt;Delicious Fettuccine Alfredo that is super creamy and thick. Their avocado egg rolls are great as well. My boyfriend has tried their meatloaf which was just okay and he also tried their Spicy Shanghai noodles and thought it was tasty, just not spicy. <br&gt;<br&gt;They have a hugee variety of food which comes with pros and cons. Pros are you can get whatever your heart desires. Cons are with that amount of variety, their food can be hit or miss at times. A few times I&amp;#39;ve had chunky, uncooked noodles with my Alfredo, and my boyfriend&amp;#39;s meatloaf would occasionally be dried out. <br&gt;<br&gt;Overall, this place is pretty good. The cramped atmosphere and high prices would be the biggest downside.", "rating": 4, "date": "2/11/2019"}, {"text": "The lemonades the offer were pretty tasty. Strawberry was good. I ordered the friend shrimp appetizer, and it was not my favorite. Shrimp just kind of seemed like the end of the bag. But I loved the cashew chicken, and the pot stickers were good.", "rating": 4, "date": "1/26/2019"}, {"text": "Went in on 6/27/20.  Server wore gloves.  I didn&amp;#39;t see him change gloves between picking up dirty dishes at one table and delivering fresh food at another table. Also he didn&amp;#39;t bring me a new glass with refill, he took dirty glass to refill. Never had a restaurant do that with Covid restrictions. Doesn&amp;#39;t that create germs on the gloves and cross contamination? Make sure only bus people clean tables.  Just doesn&amp;#39;t make sense to do any of that during Covid.  Retrain staff.  Won&amp;#39;t be back and I&amp;#39;m a regular.", "rating": 1, "date": "6/28/2020"}, {"text": "I love the Cheesecake Factory!!!<br&gt;<br&gt;The seating is a little cramped &amp;amp; during rushes it&amp;#39;s very loud!!<br&gt;<br&gt;I personally love how big the menu is &amp;amp; how much they have to offer. I usually try to get a different entree every time I go. I usually like everything I order. One of my favorite things on the menu is the chicken potstickers! So good! <br&gt;<br&gt;The cheesecake is amazing! I especially love the celebration cheesecake!<br&gt;<br&gt;I understand they are the busiest during the weekend but I wish they took reservations! I&amp;#39;ve been invited to celebrate bdays here, show up &amp;amp; it&amp;#39;s a 2 hour wait sometimes. <br&gt;<br&gt;The staff all around are usually really nice &amp;amp; professional! It&amp;#39;s fancy enough to where they will box your food. <br&gt;<br&gt;They have a pretty decent happy hour in the bar area.", "rating": 4, "date": "4/29/2018"}, {"text": "I ordered take out. For take out orders you go to the bakery counter. I did have to wait a few extra minutes for my order which was fine. It was a bit crowded around the bakery as people were looking at the cases, picking up takeout, and waiting for their takeout. Inside seemed very clean. The food was great. I would recommend the California Guacamole Salad. I tried a cheesecake and the bottom was a little too hard for my liking as it was a bit heavy on the caramel and nuts. I would not have that kind again but would try something else if I ordered again. All the staff I met were very polite.", "rating": 4, "date": "1/5/2019"}, {"text": "Came to relax and eat with my daughter... received a very unrelaxing experience at the bar. While it was a very busy Sunday, only one bartender attending the bar. It seemed that every item was imputed in to be ordered. Was frustrated by the time I was ready to go. <br&gt;My food came out from kitchen in &amp;#34;pieces&amp;#34;- one by one! <br&gt;<br&gt;Cheesecake we ordered came out wrong, my bread sis not come with my order- no butter or utensils. <br&gt;<br&gt;This used to be a place that you could not wait to eat- gone downhill as attentiveness to details had gone down hill. <br&gt;<br&gt;Still time to resurrect this place of the key people are hired. <br&gt;<br&gt;Bleh", "rating": 1, "date": "8/18/2019"}, {"text": "I love my local Cheesecake Factory, but sadly, this place doesn&amp;#39;t care about take out/Door dash orders? I&amp;#39;ve been traveling here for last 4 weeks, I tried multiple times to give them a chance to do it right. Consistently had orders that were made wrong. Not sure what the point of putting preferences in order if no one is going to actually read &amp;amp; follow the customers preferences? Very disappointed with this location.", "rating": 1, "date": "3/5/2020"}, {"text": "Server gave me wrong martini, a watered down lemon martini &amp;amp; did not acknowledge it said I ordered it then I ask her to check her clipboard &amp;amp; she then says &amp;#34;oh you ordered a dirty martini&amp;#34;. Yes I did you liar that would not apologize! Then charged me both the crappy lemon martini that came in a small champagne flute when I ordered a dirty martini I expect a martini glass! Mngr comes says too bad you drank it so we are still charging &amp;#34;WE ARE CORPORATE&amp;#34;. Your CEO is going to hear from me. LOL. I hope you two lose your jobs. VERY BAD CUSTOMER SERVICE!!!", "rating": 1, "date": "7/29/2019"}, {"text": "My gf and I ate here for lunch on 6/16/19. We were seated very quickly and our waitress was very friendly. We started with the Mac N Cheese bites for our appetizer. My gf and I were impressed by how delicious this entree was. We than ordered our main course which my gf has gotten the open faced chicken parmesan pizza looking dish with which the chicken acted as the dough for a pizza flattened out and rounded. She said it was very good they definently give you enough quantity to be able to make 2 or 3 meals out of there entrees. I had the fettucini alfredo plain pasta. Pretty much fell to my top 5 favorite alfredo dishes I have ordered and have eaten at previous restaurants. Overall we loved the ambiance here at the Cheescake factory and will be visiting again in our near future. If you are near the southdale center feel free to swing by and try this place out for yourselves everyone has different experiences so you&amp;#39;re may be better or worse.", "rating": 4, "date": "6/16/2019"}, {"text": "Wasn&amp;#39;t impressed with my visit on Sunday evening. After being seated it took our server only 10 minutes to even stop by the table. Had to flag him down to get refills on drinks an the food was sub par at best. The Chicken alfredo sauce tastes a little strange. I&amp;#39;m wondering if it&amp;#39;s even true alfredo or just a cheese sauce.", "rating": 2, "date": "1/31/2020"}, {"text": "I&amp;#39;m on a mission to find the best happy hour! My friend and I went to the Cheesecake Factory for happy hour after work on a Thursday. We sat at a high top table in the bar area. The server was very friendly and attentive. I ordered a skinny mojito to drink. (I love how Cheesecake Factory offers many low calorie options!) You can still have yummy things and not worry about all the calories. To eat I had the spinach and artichoke dip with chips. This was yummmmmmy goodness! Obvi not a low calorie option but the skinny mojito balanced it out . My friend had the fried zucchini which was accompanied by ranch dressing. She also enjoyed her app. I loved the various drink and food options on the happy hour menu. I will definitely keep CF on my go-to list for happy hour!", "rating": 3, "date": "12/28/2018"}, {"text": "Reviewing for my wife. Bad experience today. They brought the wrong order for my daughter. She ordered chicken pot pie and got pasta. She had to wait until everyone else had finished before she got her lunch. Waiters unapologetic. Manager brought the right dish - no apology. No adjustment to the bill even though she didn&amp;#39;t have time to eat it all. I wouldn&amp;#39;t bother to write the review but we had the same experience last time, about three weeks ago. What is wrong with this place?  Used to be great. I can understand the mistake, but the lack of apology or even showing they care?  Will steer clear until they at least get back to 4 stars.", "rating": 1, "date": "7/10/2019"}, {"text": "I didn&amp;#39;t have high expectations coming in but I was shocked by how beautiful it was inside. The staff is very nice but the food takes its time. The music inside is very loud and a little obnoxious. Otherwise this is a very nice restaurant.", "rating": 4, "date": "5/27/2019"}, {"text": "Again top notch food from a wonderful restaurant! Truthfully their menu is so effin large that there really is something for everyone ! Staff is friendly and knowledgeable - love that ! Food is delicious as always ( this time I have the turkey avocado sandwich ... however I noticed this time that they do t ha e WiFi?!?!? WHAT IS UP WITH THAT? It must be an oversight because management can&amp;#39;t possibly be that cheap to not have WiFi for their guests ... Anyway I still love this place and simply used my phone as a hotspot #batterylife", "rating": 5, "date": "1/29/2020"}, {"text": "I went to this location of the Cheesecake Factory with a number of coworkers for a farewell happy hour. It was the worst service I have ever received in my life. Food was forgotten, when it did arrive, it was mediocre at best. It took the waitress 45 minutes to get our bills complete &amp;amp; distributed to us after we had requested them, and getting refills or new drinks required us to go up to the bar because we couldn&amp;#39;t get them from her. I will not be back.", "rating": 1, "date": "2/22/2020"}, {"text": "Unbelievably slow and unorganized for takeout. Left without even picking my order up because it was so disorganized", "rating": 1, "date": "2/14/2020"}, {"text": "I&amp;#39;ve been back to the cheesecake factory and not all of the restaurant is bad it&amp;#39;s particularly the wait staff at the to go counter it causes issues a few staff members don&amp;#39;t seem to be well placed in their roles they seemed frustrated bitter rude and disgruntled and they take it out on the customers.", "rating": 1, "date": "12/27/2019"}, {"text": "I come to this Cheesecake Factory a lot and the service workers specifically the servers are really horrible. I have spoken to managers many times at this location to ask if they would train their servers better. I totally understand if the restaurant is busy and it takes a long time for them to get back to us but when they have like 2 or 3 tables in my seating area they avoid interactions with my table. They continuously bring our cold or burnt foods and when you complain one server had the audacity to say &amp;#34;there&amp;#39;s no way your food could be cold&amp;#34; and &amp;#34;what do you want me to do&amp;#34;. That&amp;#39;s not acceptable behavior that&amp;#39;s actually so disrespectful. I&amp;#39;m a person of color so service people give me a hard time everywhere I go, getting great service is a once in a lifetime thing for people like me. I usually allow it but this Cheesecake Factory is the worst service ever consistently how is that even possible. It&amp;#39;s like they&amp;#39;re being trained to be rude and unhelpful towards the huge Somali community that come to this location. The management seems really nice and helpful, the bussers are really great, but the servers need some training because they&amp;#39;re unconscious biases are constantly on display. I do not see myself coming back to this location ever again. I hope they read this review and have a conversation or even a diversity training.", "rating": 1, "date": "10/9/2020"}, {"text": "what can i say that&amp;#39;s negative about this place? from the slightly upscale feel that&amp;#39;s offered to suburbians to the scrumptious food, its a midwestern slice of heaven!<br&gt;<br&gt;i&amp;#39;ve been here on a lot of occasions ranging from birthday dinners to take outs to cheat meal splurges, and i&amp;#39;ve never had a bad experience. The staff are very professional, warm, and friendly. If there is a problem, they rectify it immediately in my experience. They treat everyone fairly and with respect. <br&gt;<br&gt;The actual ambience of the place ranges from casual date night to formal dinners, but for the most part it is a dress up, wear your heels kinda place. If you come in around dinnertime, be prepared to wait for at least 35mins, more on weekends. But you can casually browse southdale-the beepers work within 100ft. if you order take out, it&amp;#39;ll take at least 30mins but you can park in the designated parking near the front and go to the bakery straightway. that&amp;#39;s where the take out/grubhub orders are picked up from<br&gt;<br&gt;I&amp;#39;ve tried a lot of dishes and im just going to list my favorites here:<br&gt;mashed potatoes-creamy,perfect blend of herbs, smooth and comforting<br&gt;crispy fried cheese-the fontina in this is whats giving it the kick!<br&gt;avocado egg rolls-smooth,yummy and when dipped with the green sauce, insatiable!<br&gt;chicken madeira-although their signature dish,its a little overrated<br&gt;chicken costoletta-crispy with just the right amount of lemon<br&gt;chicken alfredo-good but can get overwhelming<br&gt;cheesecake-divine! each one is unique so try them all, my fav is the mango key lime cheesecake. its coconut/mango/key lime flavor is unmatchable and a flavor that needs to be tried at least once before one dies", "rating": 5, "date": "2/28/2019"}, {"text": "Food was awful and ridiculously over priced. Was told that the patio was closed for seating and then ten minutes later noticed that they were seating it. The only good thing about this place is the free bread they serve.", "rating": 1, "date": "7/6/2020"}, {"text": "This is my spot. I love this place. Even when they piss me off they are great. I like to think my order I&amp;#39;d easy but it&amp;#39;s wrong most times I get it. But damn the food is so good. <br&gt;<br&gt;However I hate when I order my food for pick up and get there and still ha e to wait 20 minutes for my food. As if they don&amp;#39;t cook it until you get there. What&amp;#39;s the point of giving me a time frame on the phone if you&amp;#39;re going to do that.... <br&gt;<br&gt;Nonetheless....I love their chicken strips. <br&gt;They are a scratch kitchen. <br&gt;The blue cheese is chunky.<br&gt;Honey mustard is made daily.<br&gt;Along with the other dressings.", "rating": 4, "date": "4/10/2018"}, {"text": "Wow is this place busy. Here on a Thursday afternoon and the wait was 30-40 minutes m. Having only came here for cheesecake, we opted for the to go option.<br&gt;<br&gt;I haven&amp;#39;t been to a cheesecake recently but I was impressed by their selection! From classic flavors to decadent chocolate creations of art, this is one of the best ways to consume 1200 calories.<br&gt;<br&gt;Come for the cake, but expect to wait!", "rating": 4, "date": "4/18/2019"}, {"text": "I have been to The Cheesecake Factory on many occasions. There are good things about it and some bad things about it.<br&gt;<br&gt;One of the good things is that the restaurant itself is very cool and nice inside. It can get a little dark inside after sunset, but overall it is clean and a cool environment.<br&gt;<br&gt;One of the bad things is that the food isn&amp;#39;t super super great. It is good and is okay, but not worth the prices you are paying here. Some of the appetizers aren&amp;#39;t that bad like the stuffed mushrooms.<br&gt;<br&gt;You don&amp;#39;t come here for the meal though. You come for the dessert! This is honestly the best thing about the restaurant. The chocolate Godiva cheesecake is very good, but my personal favorite is the Linda&amp;#39;s Fudge Cake! It is very moist and rich. Definitely something you should share with a friend!<br&gt;<br&gt;Overall, fun environment, decent food, good dessert!", "rating": 3, "date": "3/23/2018"}, {"text": "So disappointed with my visit there. I wanted to take my baby sister and cousin out for a nice dinner but even they weren&amp;#39;t pleased. We waited so long for the food to come and our waitress even came and said she wasn&amp;#39;t sure why it was taking so long. When the order arrived, my fries were stale and sisters tacos were soggy. The waitress herself was a sweetheart but otherwise we weren&amp;#39;t too happy.", "rating": 2, "date": "10/12/2019"}, {"text": "For a party of 12, we already knew that the wait would be longer than usual. However when we called in before, they told us it would be only 1 hour wait. When we got there, they also told us it would be about 60-70 minutes wait, which is fine. Then after that wait, they kept telling us 20 minutes after 20 minutes, which then became a 3 hour wait.<br&gt;<br&gt;If you have a huge party that is better than 4 four, I would suggest a different place.<br&gt;The service was also poor.", "rating": 1, "date": "2/2/2019"}, {"text": "Bad for families with small kids<br&gt;Once again, we came to this place unable to make a reservation and were told we had a 20 minute wait. After 20 minutes we still had a 20 minute wait. The place is loud, and filled with families with grumpy kids like ours. This is because they&amp;#39;re all made to wait.  So, what initially sounded like a fun idea ended in frustration.<br&gt;Since this was the 3rd time the server had lied to us in three visits, we just left. The food is not worth it. Most of it has way too many calories, the taste is standard, and now the cheesecake is very overpriced at 8 to 9 dollars a slice.<br&gt;Maybe if they start taking reservations, stop lying to us at the server kiosk, and reduce a few of their prices to that of the quality of the food, we will come back.<br&gt;Until then, go to Peoples Organic across the street. There&amp;#39;s no wait, the food is more nutritious, and the prices are reasonable.", "rating": 1, "date": "6/23/2019"}, {"text": "This restaurant can turn out good food, but be wary if you order from them via a delivery service. After the food is in your home, you can&amp;#39;t send it back to the kitchen. <br&gt;<br&gt;Among the sadnesses we&amp;#39;ve received from them are eggs overcooked and burnt, toast done on one side and plain white bread on the other, lasagna constructed from glued-together layers of undercooked pasta with nothing in-between, pasta dishes and salads missing main ingredients, and so on. Other food items arrive complete and delicious, but it&amp;#39;s often a coin-flip on what&amp;#39;s in the bag.", "rating": 2, "date": "6/24/2018"}, {"text": "Stopped in for lunch while we had a break from the hospital service was good my first time here I like that the menu has a breakdown of calorie content as I do watch what I eat menu has almost too many options I ordered the lettuce wraps Asian style was delicious ordered a mojito that was perfect our party of 3 agreed that the food was very good nice portions", "rating": 3, "date": "12/7/2018"}, {"text": "Overrated! Waited so long for my food to come out. <br&gt;I had the steak Diane and shrimp scampi. I asked for medium rare, the steak was over cooked and dry! They gave me 3 shrimp (not worth my 22 bucks for that small portion). <br&gt;<br&gt;The calamari was soggy! No crunch at all. <br&gt;<br&gt;I also order the pork belly sliders. The flavors was good but the pork was super dry. <br&gt;<br&gt;Overall I had a bad experience.", "rating": 1, "date": "2/18/2019"}, {"text": "Ordered cheesecake online and went inside to wait for it.  Line around the corner inside and absolute chaos.  Manager is dipping strawberries leisurely instead of helping the guys behind the counter.  Very sad sight.", "rating": 1, "date": "2/14/2020"}, {"text": "A 3 hr wait was ridiculous. We called and was advised 1 hr wait time, and by the time we got there we got on the waitlist and it was for 70-80 minutes wait, which it was fine. We were a little bit larger party so we knew we had to wait, but they kept telling us 20 mins after 20mins, and then another 20 mins. It was almost 3 hrs by the time we got the tables. The waiter was fabulous but unfortunately the restaurant did not even bother to compensate for the time we waited. If they were upfront on the wait time, it would be fine. But they were not. Who wants to wait that long for their birthday dinner? Oh, on top of that, you get only a tiny scoop of sundae for you birthday. <br&gt;<br&gt;It&amp;#39;s not that special. Don&amp;#39;t come here to celebrate. Dont come here if you have more than 4 people unless you want to wait for 3 hrs or come here after 10pm so you dont have to wait.", "rating": 1, "date": "2/1/2019"}, {"text": "Leaving the famous Cheesecake Factory a 4, ONLY because I go often and usually have a great experience there. Though in my last visit, I would&amp;#39;ve ranked it a solid 2.5, and that kills me &amp;#39;cause I love CF.<br&gt;<br&gt;Went last night for the boo thang&amp;#39;s early birthday dinner. The breakdown of last night&amp;#39;s shenanigans:<br&gt;<br&gt;Drinks:<br&gt;- Asian Pear Martini: Yuuum! This more so felt like a dessert than anything. It was sweet, smooth, &amp;amp; delicious. Only complaint is that it felt like there was barely any alcohol in it (granted it&amp;#39;s supposed to be a sweet drink). If you&amp;#39;re looking for something boozy like me, this might not be the drink for you.<br&gt;<br&gt;Apps:<br&gt;- THEIR BROWN STARTER BREAD: That sweet, delectable, soft, brown goodness that they serve before every meal. Just... wow. I think I more so come just for that than anything else really. If I could start my days with that bread, I couldn&amp;#39;t pasta-bly (ha) ask for more.<br&gt;<br&gt;- Vietnamese Shrimp Summer Rolls: probably should&amp;#39;ve expected this &amp;#39;cause... I mean... it&amp;#39;s a pasta restaurant... but the their take on Vietnamese spring rolls were a huge no-go for us. We were pretty sure they pre-made it and left them in the coolers all day. Wasn&amp;#39;t fresh AT ALL.<br&gt;<br&gt;Entrees:<br&gt;- Farfalle w/ Shrimp &amp;amp; Roasted Garlic Pasta: Now THIS was bomb. You&amp;#39;d have to order it to see what I&amp;#39;m talking about. Normally comes with chicken, but I switched and paid the upgrade for shrimp. Only complaint is again- last night being the weird variable- I was pretty sure they forgot about us &amp;#39;cause the food took way too long to come out, and it also came out barely warm. Normally a great meal though and still highly recommend.<br&gt;<br&gt;- Jamaican Black Pepper Shrimp: the boo somewhat liked it. Huge portions which was a plus and had a colorful variety on the plate. First time ordering it so perhaps if it came out hotter, we might&amp;#39;ve enjoyed it more.<br&gt;<br&gt;Overall- though last night&amp;#39;s experience was off, in general, they&amp;#39;re a great place to eat. Didn&amp;#39;t get a chance to eat their cheesecake last night, but note that it&amp;#39;s one of the best!", "rating": 4, "date": "7/26/2017"}, {"text": "Second time we have driven 25 minutes away to come here and both times there is over an hour wait. It is absolutely RIDICULOUS how they don&amp;#39;t accept reservations. You are just being disgusting humans because clearly you&amp;#39;re only after the money. 1 star.", "rating": 1, "date": "3/6/2020"}, {"text": "My wife and I experienced friendly and helpful but incredibly slow service  during lunch today.  We were seated at approximately 12:15 and didn&amp;#39;t receive our food until a bit around 1:15 despite the restaurant only being 20% full.  The server explained that the greeters had forgotten to inform her that we had been seated.  <br&gt;<br&gt;We noticed that the prices on the food we ordered had significantly increased as well vs. our prior visit.  With the price gap between CF and Cov shrinking, we will likely head there for our next weekday lunch.", "rating": 2, "date": "7/11/2019"}, {"text": "We haven&amp;#39;t been here for a while so decided to try it again.<br&gt;Pros:<br&gt;Friendly host <br&gt;Seated with minimal wait <br&gt;Great Caesar salad<br&gt;Great manager<br&gt;<br&gt;Cons:<br&gt;Waitress-rude <br&gt;Waited 40 minutes for 3 entrees with no explanation or apologies <br&gt;All food arrived either lukewarm or cold so not  worth the wait. <br&gt;<br&gt;We sent the food back and asked for the check. Spoke with the manger and explained our frustration with food and service. He was sympathetic and handled it very well.  Waitress dropped the check off without saying anything. <br&gt;<br&gt;Last time for us at the Cheesecake Factory.", "rating": 1, "date": "9/8/2019"}, {"text": "Great service by Nick on my adult daughters birthday.  The dark bread was fabulous and they gladly brought another.  Drink prices are high. <br&gt;<br&gt;We were able to be seated within 10 minutes on a Tuesday in the summer.  <br&gt;<br&gt;Craft beer menu was IPA heavy so I passed, as I am a pale ale and dark beer fan.", "rating": 4, "date": "7/28/2018"}, {"text": "I am sitting here waiting for a to go order that was supposed to be ready over 25 minutes ago. Their food is good but count on a ridiculous wait if you order to go.", "rating": 1, "date": "5/1/2019"}, {"text": "The 1 star is only for the delicious cheesecake we had. <br&gt;<br&gt;We arrived at 9:00pm for dessert so that we could bypass the crazy dinner rush yet it still took us 15 minutes to get greeted, and that&amp;#39;s after going up to the host stand to tell the host, and then another 15 minutes to get the only food item we ordered which was 1 slice of cheesecake. Not to mention, the extra 5 minutes, after we got the cheesecake mind you, for our 2 cocktails. <br&gt;<br&gt;Save your sanity and money on this overpriced &amp;#34;restaurant&amp;#34; and venture somewhere else.", "rating": 1, "date": "6/11/2018"}, {"text": "This place used to be so great but it&amp;#39;s just not anymore. I ate there recently and found a plastic bread twistie in my pasta. Yes, they took it off the tab but hat was it! Then the server was crabby and acted like it was my fault! I should have known when there was no line like there used to be.", "rating": 1, "date": "12/27/2019"}, {"text": "My wife and I are regulars at this Cheesecake Factory location. Every time we go, we get super fast and professional service. It&amp;#39;s a super popular restaurant so don&amp;#39;t be surprised if you have to wait for awhile to be seated. To us, it&amp;#39;s worth the wait since we like it so much. Lots of people complain about the lengthy menu, but in my eyes it&amp;#39;s convenient that they have options for just about everyone, from meat lovers to vegans. Prices are pretty typical for a place like this. Steak and fish will be more just like any other place. If the two of us go and do not get drinks, the bill is usually between 30 and 40 dollars. Cheesecake and alcohol will raise your bill very quickly. <br&gt;<br&gt;We&amp;#39;ve had one server twice gave us a bit of a sour taste. She didn&amp;#39;t get our order right both times, and she was a bit rude. Otherwise the rest of the staff is wonderful!", "rating": 5, "date": "1/23/2019"}, {"text": "worst customer service ive experienced from a restaurant. we walked in and the welcoming girl didn&amp;#39;t say a word just stared at us.. I told her  for two she grabbed two menus then just walked off to  a table never saying a word. Once our food finally arrived we were never checked  on I had to ask a different server for what I needed... our waitress just stood in the  corner with another waitress joking around. If we new it was good places walking distance we wouldn&amp;#39;t went there the service was so bad....", "rating": 1, "date": "1/25/2020"}, {"text": "First of all, their crab bites are drool worthy with the perfect crisp on the outside and fluffiness of crab for the inside. Their malts or cream in their ice cream as well as the cream in their cheese food items has a delicious creamy aspect about it too that&amp;#39;s very high quality. Last night I went and ordered a skinny artichoke appetizer... because they only had one slice instead of two, they just simply gave the one slice to me for free and even apologized to me about it. Are you kidding me? What an awesome tasty gift that was for me! : ) That was, seriously, a very sweet gesture to do, so I really do thank them for doing that for me. Really great quality food and always a treat. A tad loud but that&amp;#39;s understandable considering their popularity. Tis well worth it. : )", "rating": 5, "date": "7/20/2019"}, {"text": "Do not order the cheese steak. This place is overrated in the first place and the cheese steak is very over hyped. It is extremely dry, the bread was tough and hard to chew and the seasoning on the steak is mediocre. The cheese is also almost non existent. Do yourself a favor and get something else", "rating": 2, "date": "1/7/2020"}, {"text": "I was a party of 4... the server started out strong but became absent when i asked her if she could do anything about a screaming child behind me ( btw the child had been screaming for 10+ mins).<br&gt;My food came out Luke warm, my bf came out half done, my brothers bun to his burger came out soggy.  She came back and my bf told about his meal.  The cooks literally threw it in a hot pan, evaporated the cream sauce and gave it back.  Horrible food-- <br&gt;Took a piece of cheesecake home and ate it 2 hours later - still frozen--- wtf <br&gt;I will never go back to this location again !!", "rating": 1, "date": "3/24/2019"}, {"text": "Damn! Last time I tried this place was years ago and it has gone from bad to worst. What is the deal with the eardrum shattering loud, annoying music?  It is not possible to have a conversation or even think! Hey Cheesecake Factory this is not a disco! I used to mildly accepted this place now I just hate it.", "rating": 1, "date": "4/21/2019"}, {"text": "Came here for the sangria.<br&gt;It was some of the best Sangria I&amp;#39;ve had in the Twin Cities metro area. Some of what we ordered didn&amp;#39;t come with our food and the server took a while to check after the food was delivered. But other than that we had a pretty good experience.", "rating": 4, "date": "11/9/2017"}, {"text": "We just completed a very enjoyable meal!  There was a minor hiccup in the kitchen on one of our orders, but the situation was dealt with quickly and professionally.  Our server, Bridgette has mastered her craft! She was pleasant, prompt and professional throughout our visit.  We appreciate the delicious gluten free pasta options for our two celiacs in the family, and the other dishes were solid as well!<br&gt;<br&gt;One minor suggestion: if you&amp;#39;re going to serve Asian style dishes like spicy cashew chicken, have chopsticks available (they&amp;#39;re cheap ). Thanks for a great meal!", "rating": 5, "date": "5/12/2019"}, {"text": "Sooo good! Even the bread that we started was good, crunchy on the outside and soft on the inside, warm too! The cheeseburger spring rolls was the best part. The shell was super thin and crunchy, dipping sauce really complemented the taste. The shrimp and steak combo entree was worth it as well, finished everything to the last bite. The cheesecake was so so for me because it was a bit too sweet.", "rating": 4, "date": "7/29/2018"}, {"text": "This was my first visit to this Cheesecake Factory, my second to any Cheesecake Factory. The food and service were great. I think that their wine is a little over priced but that would be my only complaint. I&amp;#39;m fond of the atmosphere and if course, the deserts. I will definitely be back based on this experience.", "rating": 5, "date": "5/26/2019"}, {"text": "Changes:<br&gt;<br&gt;The menu could use a total make over , like they say a picture is worth a thousand words, I bet they would sell more dish if they added pictures to their menu.<br&gt;<br&gt;Most people are visual when it comes to foods , having a lot of dish with picture would help sell more .<br&gt;<br&gt;The good : the seating didn&amp;#39;t take too long, the waiter came around almost right away.<br&gt;<br&gt;The bakery at lest have display of what they have to offer .<br&gt;<br&gt;Atmosphere is family friendly <br&gt;<br&gt;Price is a bit on the middle to high range<br&gt;<br&gt;But the portion is good not too small <br&gt;<br&gt;BUT the pizza is on the personal size pizza , if you order the slice, it&amp;#39;s very small<br&gt;<br&gt;The bad: silverwares are place just on the table , not sure how &amp;#34;clean&amp;#34; these table tops are , but placing in napkins or on the plate would be better then directly on the table .<br&gt;<br&gt;It took a long time to get the foods to the table .<br&gt;<br&gt;All in all, it&amp;#39;s good if it was something that you had made at home , but since it&amp;#39;s a restaurant .. it leaves you with the feeling , &amp;#34;there&amp;#39;s better stuffs out there &amp;#34;..", "rating": 1, "date": "3/27/2018"}, {"text": "It&amp;#39;s always a treat coming here because there is only one location in MN. Not only that but the drive from Arden Hills to Edina isn&amp;#39;t always ideal. <br&gt;<br&gt;I love coming here, the brown bread is the BEST with butter .. mmmm .. the white bread is great for dipping in pasta sauce if you choose to order pasta. <br&gt;<br&gt;Every time I come here I order the same dish and cheesecake. Spicy Chipotle Chicken Pasta --extra spicy. IT IS SOOOO GOOD, even if you don&amp;#39;t get it extra spicy it is still spicy. I love the sauce, the chicken is always cooked perfectly, the noodles .. goodness I never loved penne noodles so much. <br&gt;<br&gt;I always get the Chocolate Tuxedo Cheesecake, it is so delicious and rich with chocolate. I used to always get the German Cheesecake but they no longer have that .. they actually haven&amp;#39;t had that for years. <br&gt;<br&gt;I have had their lettuce wraps, they are tasty. They egg rolls ... pretty dang good, their mushrooms ..mmmmmmmm yum, calamari is always good. Those appetizers are pretty good. <br&gt;<br&gt;Their fries are good, chicken bang, bang, is delicious, fish and chips are good and crispy, their Diana steak is DELICIOUS too. They have good food but i prefer their pasta.", "rating": 5, "date": "12/13/2016"}, {"text": "The impulse to look upon chain restaurants with disdain is understandable. Too often they tend to live down to already modest expectations. That said, on the multiple occasions I&amp;#39;ve enjoyed lunch or dinner at the Cheesecake Factory, I find them a cut above average.<br&gt;<br&gt;Ordinarily a menu as voluminous as the one offered by CF would be a bright red flag. No place can be all things to all people. Right? While this may hold true in general, and while CF may have an occasional miss, I&amp;#39;ve found the majority of items that I&amp;#39;ve tried to be hits. I particularly like the Chicken Piccata (I substitute mashed potatoes for the angel hair pasta). It probably has more sodium than a family of five needs in a week. But it&amp;#39;s rich, savory and chock full of mushrooms and capers. It invariably makes for two meals since I end up taking about half of the serving home with me.<br&gt;<br&gt;The other day I ate here with my daughter before a visit to the Apple Store (my next review). She ordered the Vegan Cobb Salad described as &amp;#34;Crisp Lettuce Topped with Grilled Asparagus, Green Beans, Roasted Beets, Avocado, Cucumber, Tomato, Garbanzo Beans, Quinoa, Almonds and Sunflower Seeds with House Vinaigrette.&amp;#34; It was bright, crisp and filled with fresh veggie goodness. She can be quite critical of commercial salads but pronounced this a winner. She added to it an order of falafel. We both found them to be appealingly crunchy on the outside, moist and flavorful on the inside.<br&gt;<br&gt;I&amp;#39;ve never experienced anything other than cordial and professional service. Iced Tea and water are promptly refilled without asking. Food arrives in a reasonable time frame and is typically at the proper temp. There have been some longer wait times for a table but nothing too onerous. Most recently (on a Tuesday evening) we were seated immediately.<br&gt;<br&gt;This is not a hipster, foodie destination. Nor does it aspire to be such. It really is one of those relatively rare destinations where in my experience everyone should be able to find something much to his or her liking.<br&gt;<br&gt;Finally, of course the cheesecake is very good. I especially like the Dulce de Leche Caramel and the White Chocolate Raspberry Truffle. I also enjoy a very occasional slice of the Chocolate Tower Truffle cake. Extremely indulgent? Yep! Excessively caloric? You betcha! Completely over the top? No doubt. But I rationalize the dessert overload by noshing on it for a few days, pulling a huge slice out of the frig for a few bites at a time.", "rating": 4, "date": "8/18/2016"}, {"text": "I love the decor! It is stunning. It kind of reminds me of the mall in Las Vegas with the painted sky ceiling and the dim lights. <br&gt;<br&gt;Happy hour drinks:<br&gt;<br&gt;J.w.&amp;#39;s pink lemonade: Skyy Citrus vodka, raspberry licqeur and lemonade $5.50 - tasted like watered down lemonade but maybe it&amp;#39;s a good thing it didn&amp;#39;t taste strong. This is a popular drink that many people enjoy.<br&gt;<br&gt;Margarita: Classic margarita with gold tequila, triple sec and fresh lime $5.50 - this was strong but not too bad!<br&gt;<br&gt;Happy hour appetizers: <br&gt;<br&gt;Soy glazed edamame $4.95 - I&amp;#39;m not sure why they give you the option of having it plain or with soy sauce. Most restaurants offer edamame with soy sauce on the side. I wish that was the case here but it was good. If I had to order it again, I would take it plain.<br&gt;<br&gt;Portobello mushroom avocado and zucchini fries $6.95 - I liked the texture of it except the fried avocado was not my favorite. I think it was too soft for my preference but the batter was fried perfectly and it tasted very crisp. <br&gt;<br&gt;Entree: <br&gt;<br&gt;Miso salmon about $19 - delicious! I only ate half of it and saved the rest for lunch tomorrow. The sauce it as glazed in was sweet. This meal came with a few vegetable peas but I wish it came with broccoli or more. It comes with white or brown rice. I&amp;#39;d recommend this dish at least once to try.  <br&gt;<br&gt;Dessert: <br&gt;<br&gt;Lemon raspberry cream cheesecake - hands down light, fluffy, smooth, and all worth it! I&amp;#39;m so glad I tried this and I would get it again. It was mostly cheesecake with a lemon cake type of crust.. At least that&amp;#39;s what I think I tasted :)<br&gt;<br&gt;Waitress:<br&gt;<br&gt;Tara - hands down the best service I&amp;#39;ve had in a long time. She checked my birth date on my ID and noticed that my birthday was a couple days ago. So she gave me the cheesecake with happy birthday decorations on it. She recommended everything that I ordered, and she checked up on my table every once in a while. If you get her as a waitress, you will enjoy your dining experience!", "rating": 5, "date": "3/12/2015"}, {"text": "Pretty happy with our experience. I came in with a poor attitude yet we both enjoyed our lunches off the Skinnyliscious menu. I had a turkey burger and salad and my wife had the lettuce wrap tacos. They were both pretty good. Service was excellent. We will come back, had not been there for years. We were there about 2pm on Sunday.", "rating": 4, "date": "3/11/2019"}, {"text": "The food was really quite good. I&amp;#39;ve been a few times and never have been disappointed. Last time was more than five years ago. I usually think of Cheesecake Factory as feeling overstuffed by the end of the night, but they&amp;#39;ve really developed a nice skinny menu. Both my wife and I ordered off it and the meals were very tasty and satisfying. I had lemon garlic shrimp and she had the chicken salad. My boys ordered off the regular menu with steak medallions and chicken tacos and they were well seasoned and tasty. The Oreo and Godiva cheesecakes were of course rich and decadent. The waitress appeared fairly new and apologized a few times, thanking us for our patience. This surprised as she was rather quite attentive and available when we needed her. Only complaints would be the warmer-than-room-temp red wine and greasy-feeling menus.", "rating": 5, "date": "4/7/2019"}, {"text": "Third visit there and I don&amp;#39;t think I&amp;#39;ll be going back for sure after this experience. Went in on valentines day (no RSVP allowed for that day) and had a wait of roughly an hour, just to be seated (not a big problem given the circumstance of the event). Took about another half hour to recieved food (again, understanding the current situation). While waiting, the waitress to the table next to ours (not our waitress) had accidentally knocked over that tables water and had gotten water all over them and us, but she seem to be a bit oblivious about it getting on us since we weren&amp;#39;t her table. Yes, I understand its just water, no big deal, but I think an apology would suffice and would&amp;#39;ve been appropriate. What else was disappointing was that I ordered the chicken Bellagio and had received a plate of undercooked spaghetti noodles which then took at least 10 minutes to flag down our waitress to get a new plate. Estimated time spent there would be about 2 hours and didn&amp;#39;t even get the chance to eat because I just asked them to make the new one to go, since I&amp;#39;ve already been a bit irritated of the night.<br&gt;<br&gt;Overall, food for price is a good 50/50 ratio. And of course given the name, the Cheesecakes are melt-in-your-mouth worth it. Dine in on a regular day, or don&amp;#39;t bother dining in at all.", "rating": 3, "date": "2/15/2019"}, {"text": "Been to plenty of Cheesecake Factory&amp;#39;s before, was disappointed in this one. It was a busy weekend lunch, as usual. They don&amp;#39;t have a good vegetarian/vegan selection, even with this extensive menu. Whatever we did ask for, they were already out of! Baked artichoke, spaghetti, etc you get the picture. I ordered an vegetarian pasta recommended by our waitress, it was super chewy and not edible. They were gracious enough to take it off the bill. The fried Mac n cheese balls are delicious but super unhealthy. We got a couple of cheesecakes to go and those were ok. Red velvet cheesecake is overrated. All in all, I wouldn&amp;#39;t come back.", "rating": 3, "date": "11/23/2017"}, {"text": "I love the vibe of this place next to Southdale mall. Starting 4:45pm it starts to get busier and you have to expect a short wait depending on the number of people in your party. I love taking a couple of appetizers to get very different flavors going. The avocado eggrolls and also the chicken pot stickers are something that you would want to try if you haven&amp;#39;t already done so. They are great! Today I had the Asian lettuce wraps and they are a great dish if you&amp;#39;re not craving too many calories and still get a great tasty dish. Both the tamarind sauce as well as the soy-ginger sesame sauce are awesome. All the cheesecake desserts... Say no more and just come with a good and healthy appetite!", "rating": 4, "date": "9/22/2018"}, {"text": "I took two sixth grade girls here to celebrate spring break. We had lunch sized portions of fish and chips, herb salmon, and they had cheesecake. Last time I liked my meal better, it was an almond crusted salmon on a bed of kale and it was all chopped up and really delicious. This time the salmon was OK and it was even what he recommended as the most popular salmon. The girls seem to like their meal, but for $65 before tip and us all having water to drink, it was pricy for just being average meal.", "rating": 3, "date": "3/30/2016"}, {"text": "I&amp;#39;ve been here several times and I&amp;#39;m just getting around to writing a review. <br&gt;<br&gt;As usual they were pretty busy and waiting on a table for three was going to be a while.  Luckily we spotted a table in the bar area which was vacant and made a mad dash to it as it&amp;#39;s first come first serve. <br&gt;<br&gt;The menu includes tons of choices for starters, salads, small plates, entrees, sandwiches, etc. It&amp;#39;s actually too much (for me) and a bit bit overwhelming.  Therefore I tend to stick with the massive burrito big enough to feed four.  <br&gt;<br&gt;This time I ventured out and went for:<br&gt;<br&gt;- Buffalo Wings:  Delicious!  They&amp;#39;re breaded, not super saucy or extra dry, and have the right amount of spice.  Therefore no need to worry about your mouth burning. <br&gt;<br&gt;-Beet Salad: I loved it. Includes apples, goat cheese, pecans and arugala dressed with balsamic vinaigrette. It&amp;#39;s on the &amp;#34;skinny&amp;#34; menu for those to eat a &amp;#34;healthier&amp;#34; at Cheesecake Factory. <br&gt;<br&gt;I didn&amp;#39;t go for the Strawberry Lemonade which is so good, but hopefully next time.", "rating": 4, "date": "1/26/2014"}, {"text": "One of the greats when it comes to chains. All Cheesecake Factories deliver consistently on service and food. There always seems to be a wait for this place, but unlike in SF, the wait is generally around 30 minutes to an hour. Ambience is the same as any other Cheesecake Factory, strangely pleasing despite being a chain, they&amp;#39;ve really got the design and experience down pat! <br&gt;<br&gt;We got the grilled salmon (comes with mashed potatoes and broccoli) and the chicken bellagio (lightly crisped chicken breast on top of pesto spaghetti, prosciutto, and arugula). I&amp;#39;ve never been let down with any of the dishes I&amp;#39;ve had here, their pastas are always delicious (if you&amp;#39;re not expecting hand made pasta), their avocado egg rolls are amazing. I&amp;#39;ve never had anything sweet or savory that I regretted here, so it&amp;#39;s a safe choice and a great place if you just want a good, reliable meal without figuring out where to go. <br&gt;<br&gt;This is located in the Southdale Mall, so if you don&amp;#39;t want to wait you can try the other restaurants they have in the same mall (PF Chang&amp;#39;s, Rojo&amp;#39;s, an Italian fast food place) or you can go catch a movie @ AMC. There&amp;#39;s always shopping! But remember that their buzzer doesn&amp;#39;t work anywhere outside Cheesecake. <br&gt;<br&gt;The only thing they could do a little better is to have a bigger bar area to have a place for people to hang out before they get their tables - it gets way too crowded in there.", "rating": 4, "date": "1/2/2016"}, {"text": "The food here is a poor attempt to offer a verity of food.<br&gt;I order the Cajun jambalaya pasta, which was very disappointing. The pasta it self was not cooked all the way, and looked like it came in a package of $1 ramen noodles. There was almost no Cajun flavor or really any seasoning to the dish it self. The chicken was very dry, almost as if it had been pre cooked and left under a heat lamp for an hour. The shrimp was also tasteless and rubbery. Their attempt to offer an enormously large menu can must be the reason for the lack of effort on the food.", "rating": 1, "date": "3/3/2019"}, {"text": "I have never been disappointed coming here. Their food is stunning, their options are near endless, their staff are ridiculously nice. Wait times during the week are quite short and the weekend wait times are as expected with such a popular place! Definitely will go back!", "rating": 5, "date": "3/2/2019"}, {"text": "Love it!! Always a wait , unless you get a bar seat or high top in the bar. Nice patio in the season. Best cheesecake in town ?? Lol", "rating": 5, "date": "2/27/2019"}, {"text": "We live hundreds of miles from the Cheesecake Factory so when we&amp;#39;re in the neighboorhood, we stop by!<br&gt;<br&gt;We&amp;#39;d had dinner so just stopped by for... you guessed it, dessert! Hubby had White Chocolate Raspberry and I had Oreo. Both were just okay. <br&gt;<br&gt;However, we both got a slice to go for the next day&amp;#39;s breakfast. Clearly a vacation move. In any case, I got the Cherry Cheesecake (traditional with cherry topping) and hubby got a chocolate mousse (?). Both were fantastic! I don&amp;#39;t know if they&amp;#39;re just better flavors or if it was being able to eat cheesecake for breakfast in bed with no children clamoring for a bite, but both were A-Mazing!", "rating": 3, "date": "10/17/2017"}, {"text": "Great dinner and service! The cheesecake was also phenomenal as always! Yum! The staff was very friendly also", "rating": 4, "date": "12/27/2018"}, {"text": "A twist on every day&amp;#39;s comfort food with a blend of classic cafe varieties. <br&gt;The menu has more chicken dishes than there are grains in a silo.", "rating": 4, "date": "3/31/2014"}, {"text": "This place continually delivers. Met a friend for lunch on a Friday afternoon. He hasn&amp;#39;t been for an entire meal, just dessert. After perusing the menu he settled on a personal pizza with a good size Caesar salad. He commented that it was quite a hearty portion. I had the lunch size chicken and avocado salad. We washed our lunches down with a few beers and a bloody mary which was subpar. Nothing too special about that bloody mary. Service was great as always. Lunch time conversation, gabbing with my friend in the back booth was a perfect combination of food, great service and fun and we didn&amp;#39;t have to wait to be seated.", "rating": 4, "date": "5/12/2017"}, {"text": "Arrived around 5:30pm on a Sunday and had a 30 minute wait prior to being seated.  Our server was attentive and refilled our drinks without being prompted.  Upon ordering our food the server had a whole list of things that they had ran out of - two of which my friend had wanted.  The menu is extensive so finding something else wasn&amp;#39;t a problem.  I ordered the meatloaf which was plentiful and delicious. It almost has a French onion soup flavor. They bag up any leftovers for you.  Of course we had to get a slice of cheesecake to go. Awww lawdy the salted caramel is deeelish!  Considering how big the portions are the prices are reasonable.", "rating": 4, "date": "2/27/2018"}, {"text": "Really great Thai lettuce wraps. The best I&amp;#39;ve had and the dipping sauces were excellent.", "rating": 4, "date": "12/19/2017"}, {"text": "I felt like I was eating in a Persian or Greek King mansion. The lights were dimmed and I was greeted by the waiter. I ordered some hot water with lemon, given some complimentary bread, and ordered the California guacamole salad ($12.89) for lunch. Usually salads don&amp;#39;t taste good and are bland, but it was super tasty! I felt like I cleansed my body with the salad, felt fresh. The service was great and I will be coming back for lunch. They have pasta, steaks, pizzas, cheesecakes and they can make any drink that you request. I recommend this place to anyone who likes FOOD! I will comeback for a Cheesecake next time :)", "rating": 5, "date": "4/8/2018"}, {"text": "Always a great option!! Being honest I don&amp;#39;t go to the Cheesecake Factory for their entrees so I can&amp;#39;t really judge the food. This trip I had the key lime pie cheesecake (one of my favs!) and the raspberry lemon cheesecake (a new pic). I was extremely satisfied with both.", "rating": 5, "date": "8/9/2019"}, {"text": "I normally get the herb crusted salmon at the faction Chicago it&amp;#39;s absolutely delicious but here at this location it&amp;#39;s not good at all..... very very bland no season our server Taylor is horrible well not horrible but unprofessional and clueless won&amp;#39;t be returning ever !!!!!", "rating": 2, "date": "10/29/2018"}, {"text": "Met some of my coworkers here for my birthday dinner. I called ahead of time to make a reservation and was told they don&amp;#39;t take reservations, it&amp;#39;s just walk ins only. Three of us out of a total of eight arrive first and we&amp;#39;re told we couldn&amp;#39;t be seated until at least half of the party was present.<br&gt;While I understand they have rules, I was absolutely floored because the places was no where near being packed early evening on a Tuesday.<br&gt;Finally we&amp;#39;re seated; we had to close out our bar tabs and have all of the appetizers transferred to the table. <br&gt;The entree that I ordered was good but I had to ask for the sauces that come with it.<br&gt;All and all it was an okay visit.", "rating": 3, "date": "2/2/2019"}, {"text": "Quite possibly THE unhealthiest restaurant in America, but man, some of the dishes here are done extremely well, have quality ingredients and are tastefully presented!<br&gt;<br&gt;My favorite being the Chicken Bellagio on their Specialties menu. Angel hair, basil pesto sauce, crispy fried chicken breasts and my favorite part, the prosciutto and arugula on top. Wow. <br&gt;<br&gt;Their Chipotle Chicken Pasta is also good, and their Avocado Egg Rolls are delicious for an appetizer.  Having a husband who does not eat avocados, they are all mine! Yay.<br&gt;<br&gt;Their hamburgers are good, probably similar to what you would find at Applebee&amp;#39;s, not Red Cow. The Mac and Cheese burger is a yummy choice if you are looking for something different. Their French Fries are thick and fresh! Probably some of my favorite restaurant fries ever.<br&gt;<br&gt;The bread they serve with the meal is a French baguette and a Wheat Oatmeal loaf. Very good. For dessert I would recommend their Ultimate Red Velvet Cheesecake, Godiva Chocolate, Lemoncello cheesecake and this seasonal one I tried yesterday, the Mango Key Lime Cheesecake. Everything about that last sentence screams incredible and you should try them all if you are a cheesecake lover!<br&gt;<br&gt;What this place does best is utterly behemoth portions that last 2-3 days in the fridge and you can get lots of leftover meals from it. Cheesecake included.<br&gt;<br&gt;It looks like Vegas inside, with lots of ceiling decorations and painted walls. Reminds me of the Luxor and Caesar&amp;#39;s Palace, very pretty. You will probably need your stretchy pants and a nap when you get home. It&amp;#39;s the only Cheesecake Factory in Minnesota so enjoy in moderation!", "rating": 4, "date": "6/22/2015"}, {"text": "I don&amp;#39;t get it!<br&gt;<br&gt;This place is not always busy, but always has a excessive wait time. Saturday nights it&amp;#39;s not uncommon to see a wait time of 2 hours. <br&gt;<br&gt;The menu is huge. But it is so big that I think it creates the long wait time since you have to go through the book trying to decide what to order. <br&gt;<br&gt;Every time I&amp;#39;ve eaten there, I feel like the food is the same as a Applebee&amp;#39;s, but why did I wait so long for it? I just don&amp;#39;t get it! <br&gt;<br&gt;Is there a page I&amp;#39;m missing from the menu for delicious awesomeness? Because I feel like I&amp;#39;m missing the reason people wait so long.", "rating": 2, "date": "6/19/2015"}, {"text": "Ordered a chopped salad that was supposed to have chicken on it.  Paid $4 for extra chicken.  This is all the chicken it came with.  Can&amp;#39;t imagine how much I would have got if I didn&amp;#39;t pay $4 extra.", "rating": 1, "date": "12/31/2018"}, {"text": "I thought the looks was better than the taste. The food was very bland. Pretty but tasteless....the prices weren&amp;#39;t too bad,a lot to choose from all prolly just as tasteless as the angel haired pasta with shrimp that I ordered.", "rating": 3, "date": "9/10/2018"}, {"text": "The Cheesecake Factory is a great place to eat.  Nice portions, great food, cool atmosphere.  The decor is fun to look at.  The service is very good and snappy.  The food was simply delicious.  <br&gt;<br&gt;The down side of this place is it is the only one in Minnesota and it is in the Southdale Mall in Edina.  It is difficult to find a parking place close to the restaurant so plan on walking.  Ladies don&amp;#39;t wear the uncomfortable fancy shoes that will kill your feet by the time you get there.  The other thing is there is NOT a call ahead or reservation system in place so you have hoards of people crowding the place to wait an hour for a table.  The crowds block the entry, hallways and make this a tough place to go during the prime time eating hours.<br&gt;<br&gt;They definitely need more of these around the Twin Cities.  The food service and decor is a draw, but the lack of parking, long waits and crowds are a real turn off.  Try to plan you meal earlier or later than the normal times and it will be a better experience.  I would stay away on Friday and Saturday nights, it is just too crowded, expect a long wait.", "rating": 4, "date": "6/29/2013"}, {"text": "We waited an hour and a half. I ordered the spquetie and meatballs. The meat balls were so dry I could not swallow them. Very disappointing", "rating": 1, "date": "12/15/2018"}, {"text": "OMG... that&amp;#39;s alot of good food!  It was a great fam outing!", "rating": 4, "date": "12/5/2018"}, {"text": "The Cheesecake  Factory | $14 for the calamari. &amp;#39;Twas alright. Little soggy &amp;amp; bland. I had a $25 gift card from my birthday so my meal was free. The factory combo of the rare steak Diane, mashed potatoes &amp;amp; shrimp scampi was $24 I believe. This dish is actually very good. The portion size of the potatoes though, a little overwhelming, makes the presentation of the plating look bulky &amp;amp; unattractive. The steak was cooked perfectly.  for the factory combo &amp;amp;  for the calamari ZERO STARS for service .<br&gt;. .<br&gt;.<br&gt;.<br&gt;Now that we&amp;#39;ve talked about the plating &amp;amp; flavor, let&amp;#39;s talk about service, or lack thereof. Dannica, by far has provided some of the worst service I have ever had. The hostess sat us &amp;amp; we waited maybe 20 minutes or more before we were even greeted. &amp;amp; even after greeting, we didn&amp;#39;t get drinks. The intervals between greeting, taking drinks, apps &amp;amp; communication in general was far too long in between-maybe 20 min each time. Initially the place was packed because lunch rush of course, however, as a server, you should at least greet your table &amp;amp; check up on them. Dannica is forgetful, inattentive &amp;amp; not very personable. .<br&gt;.<br&gt;.<br&gt;We had a little water spill on the floor at the table &amp;amp; my friend cleaned it herself. She told Dannica, &amp;amp; Dannica said she&amp;#39;d be back, &amp;amp; never came back. By now, the place was already settled &amp;amp; almost empty. Will not be going back. #thecheesecakefactory #cheesecake #steakdiane #calamari #ahituna #tartare #thisismyminnesota #minnstagram #foodgasm #capturemn #captureminnesota<br&gt;#goodeats #tryitordiet #minneapoleats #letsfork #forkedup #foodbeforedudes #foodie #foodstagram #foodporn #foodtography #instafood #instaeats #foodblogger #exploremn #exploreminnesota #thisismymn #foodblogger #straightouttaminnesota #minnesotaaf", "rating": 2, "date": "1/23/2018"}, {"text": "We stopped in tonight for a single slice of cheesecake; let me tell you, they had a ton of options which well made me indecisive (as a piece of cheesecake is a huge commitment to someone with lactose intolerance). Anyway, I made my decision selecting the lemon raspberry with a raspberry drizzle. Overall, it was delicious had I been able to taste anything other than lemon; it was extremely rich which can be nice, but this was overkill. I could have saved myself the 7.50$ and just squeezed a lemon into my mouth. <br&gt;<br&gt;Even with my lactose, I am a sucker for cheesecake and will definitely return; just not for the lemon raspberry.", "rating": 3, "date": "6/23/2015"}, {"text": "My family had a lunch today and the veggie burger came with a live crawling bug. Be careful when eating here, I&amp;#39;m definitely not coming back.", "rating": 1, "date": "7/21/2018"}, {"text": "I ate st the Cheesecake Factory for the first time since childhood and it was awful. It was very loud and crowded for starters. We waited for a long time. We got some free bread which was yummy. I ordered chicken Alfredo. The noodles were over done. I found a bone or something in the chicken. The waitress  took it to &amp;#39;show the head chef&amp;#39;. I lost interest in my food after the bone. My husband ordered spinach dip. It was good. We both ordered two different cheesecakes. I got a cookie dough one. He got plain. They tasted waxy and fake. We both ate a bite then we were done. The worst part?  The waitress didn&amp;#39;t take off my Alfredo or even offer to. It was $64! And I left hungry. I highly don&amp;#39;t recommend eating at the Cheesecake Factory. Tons of other better places near by.", "rating": 1, "date": "5/19/2018"}, {"text": "Yes I am reviewing the Cheesecake Factory which is the chainiest restaurant ever but it has good food. There might be thousands of calories in one single meal but I have yet to order something that turns out to be average. Their happy hour deals are awesome with the app specials so I would highly recommend stopping there between 4-6 on weekdays. <br&gt;<br&gt;Here are my go-to items: <br&gt;-Avocado eggrolls (creamy, sweet, salty, rich)<br&gt;-Buffalo blasts (chicken in buffalo sauce wrapped in a wonton wrapper deep fried in batter i.e. a super fatty app but delicious)<br&gt;-Pasta bellagio (angel hair pasta served with pesto cream sauce, fried chicken, and prosciutto served over bed of arugula)<br&gt;-red velvet cheesecake (amazing cake and cheesecake hybrid, not too sweet)<br&gt;<br&gt;So just because I am recommending this place, does not mean you should go here every day!!! The portions are huge and the meals are very rich...moderation people!!! Side note, the menu has way too many items on it and sometimes I feel like I am reading a catalog when all I want is a quick bite to eat. I know, #firstworldproblems.", "rating": 4, "date": "11/11/2014"}, {"text": "This location is terrible!! The service was terrible! I sat down at the table at 3:55pm then she didn&amp;#39;t even come to get our food order until 4:15pm. I ordered a mojito and coke which they forgot to bring to us. She only remembered when we reminded her. I asked for my child&amp;#39;s food to come out first. When they brought the food over, they had my husband and my food but not my child&amp;#39;s! The waitress went to get my child&amp;#39;s food but that took 10mins. When she came back with it I said to just bring us boxes and checks so that we could leave and that we did not need the food for my child anymore. I wanted to order a slice of cheesecake but refused because of the terrible and slow service. The waitress even said to us, &amp;#34;I&amp;#39;m sorry for the bad experience and I hope the next time you visit us you have a better experience.&amp;#34;  I will never visit this terrible location again and I will also be leaving a bad review on social media, yelp, google and trip advisor to warn others not to visit this location.", "rating": 1, "date": "3/3/2019"}, {"text": "Luke was our waiter tonight and he was fantastic!! We ordered drinks, apps, entrees and last but definitely not least cheesecake. <br&gt;<br&gt;Wait time was 40 minutes and seemed to move quickly. <br&gt;<br&gt;I ordered the avocado egg rolls, chicken Madeira, salted Carmel cheesecake and a Georgia peach. Everything was perfection. I actually split the children Madeira with my friend. <br&gt;<br&gt;My mom got meatloaf, crab bites and salted Carmel cheesecake. Said her food was delicious. <br&gt;<br&gt;Sister got loaded baked potato bites and apple crisp for dessert. Apply crisp was bigger than each of our plates. <br&gt;<br&gt;I only got a picture of the chicken Madeira and one lonely egg roll. <br&gt;<br&gt;Cheesecake Factory is always a favorite. Thanks Luke for being so much fun tonight!! Your sense of humor was necessary for the evening!!", "rating": 5, "date": "10/17/2015"}, {"text": "I always have my go-to pasta dish when I go here that is consistently good - and that is no doubt thanks to the creamy buttery sauce that comes with it. <br&gt;<br&gt;Mom and I went on a Saturday evening, but thanks to our early 5:30 arrival we only had to wait about 15 minutes. <br&gt;<br&gt;Our server was a young guy who was very excited about everything. We were both a little irked that neither the drinks nor the cheesecake listed pricing on the menu. Mom was more than a little shocked to find out at the end of the meal that her chinsy watered down sangria was $9.50, especially compared to my $5 Sierra Nevada. When I asked him what the price was, he admitted he didn&amp;#39;t know.<br&gt;<br&gt;I wanted my Farfalle pasta with sundried tomatoes, roasted garlic, peas, and pancetta. It is so delicious that I do NOT want to know how many calories I just ingested. <br&gt;<br&gt;Mom asked the server for a recommendation and he had raving reviews for the Bang-Bang Chicken and Shrimp dish. When they arrived, hers was a huge mountain of rice surrounded by the meat/shrimp. While the flavor was good (mostly just the coconut), she did note that there was no essence of &amp;#34;bang-bang&amp;#34; to be found. He got very defensive and snapped he never said it was spicy, and that white people don&amp;#39;t understand what spice is. Odd...<br&gt;<br&gt;Our food was good, we were full with little leftovers, but somehow two drinks and two meals added up to over $50. He dropped the bill off with three other tables&amp;#39; tabs also in there which was odd. <br&gt;<br&gt;While I usually enjoy myself here, I find that the health/quality of the food and beverages just simply do not measure up to what the charge for them.", "rating": 3, "date": "12/1/2014"}, {"text": "If I could give this place a zero I would. I am from Chicago so I do frequently visit the Cheesecake Factory and love it. However I do not get the same feeling about the Cheesecake Factory here in Minnesota. Here&amp;#39;s my experience:<br&gt;<br&gt;Last night me and some coworkers visited this establishment in edina for a Christmas celebration. Being a Saturday, we knew there would be a wait on getting a table. However, at check in the hostess said it would be an hour wait. So we went over to partake in a drink at the bar while waiting. We saw that the high top tables were available and was told we could eat there and they were open seating. So we took two high top tables and the waitress brought us our menus, water, and bread. 15 mins later she came back and took our orders, I order the Fish and Chips and there was 10 of us. So it took about 30 mins for &amp;#34;our&amp;#34; food to arrive so multiple people brought our food but not our server. Any who after the last waitress showed up with a plate I still was missing my food. Waiting 5 more minutes my food still didn&amp;#39;t arrive and nor did our waitress come to make sure everything was ok. So midway through my party eating my waitress final shows up, which was about 20 mins after the food was served. It was clear that I had an empty place in front of me and I had not received my food but she went to the other side of the table with the people who were eating to ask if they were ok. So I motioned her to ask her where was and asked her where was my food. Her answer, &amp;#34;oh you didn&amp;#39;t receive your food, I don&amp;#39;t know what happened well what did you order I&amp;#39;ll have them remake it for you.&amp;#34; So I said, &amp;#34;remake, what do you mean it was never made, and what do you mean my coworkers were almost done eating.&amp;#34; I proceeded to say just cancel my order because at this rate I cant enjoy my food because my party was done. So as she brought the checks she came to me first and tried to tell me the reason I didn&amp;#39;t get my food was because I sent it back. So I said why would I do that, that makes no sense, then she told me the wrong item I ordered. I was so distraught, I couldn&amp;#39;t eat with my coworkers, I was really hurt and to have my coworkers sharing their meal with me because I was hungry. This is totally un acceptable after being there in total for about an hour and a half I had to go to wendys to get a chicken sandwich because I was hungry. The entire experience was horrible.", "rating": 1, "date": "12/10/2017"}, {"text": "Skip the long waits and dinner altogether and head straight to the cheesecake counter and purchase a slice to go. Take said slice of cheesecake home and eat it while in bed watching your favorite show. Had the white chocolate raspberry truffle and it was rich, but good.", "rating": 4, "date": "4/7/2018"}, {"text": "This place cannot handle groups. Our group of 10 waited for over 2 hours for our food. Our waiter continually said the wrong things like &amp;#34;It&amp;#39;ll be out in a minute&amp;#34;, &amp;#34;There&amp;#39;s only a few orders ahead of yours&amp;#34;, etc. I saw several people walk in after us and were served their food. We came to celebrate 2 birthdays and everyone started getting agitated over waiting a ridiculous amount of time. We left. We never got our food.", "rating": 1, "date": "8/10/2018"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory quite a few times, and the quality of food has always disappointment me.  That isn&amp;#39;t to say the sauces they use to coat all the food in fat, salt, sugar, and other natural flavors it&amp;#39;s fun and mostly tasty, but I just like crisp lettuce, hot fries, al dente pasta, tender chicken, and strong drinks.  Call me a snob?<br&gt;<br&gt;On other notes, service tends to be good, parking is Edina, and they don&amp;#39;t let you make reservations in advance.  Boo.", "rating": 2, "date": "1/24/2015"}, {"text": "Yesterday we went to have dinner At the Cheesecake. Apparently the kitchen was backed up and added 1 hour to the already long wait to be seated. They got every order wrong. Burned food and had the audacity to serve by 5 yo raw sliders!!! Today she has a terrible stomach ache; praying it&amp;#39;s not food poisoning.", "rating": 1, "date": "12/28/2017"}, {"text": "I had an awful experience here. We called ahead for a larger group. They told us no wait. We showed up and the manager Diego acted like we were lying. He told us one hour to an hour and fifteen minutes. When we asked after waiting 1:15 they lied and told us they said 1:45 in the first place. We ended up waiting two and a half hours and left for Snuffys.<br&gt;<br&gt;We had 5 kids under 10 years old and feel upset and mistreated.<br&gt;<br&gt;This experience was bad enough that I will never go back. Granted I would never have picked this place in the first place. Never trust a restaurant that has a book sized menu with ads in it. :)", "rating": 1, "date": "5/20/2016"}, {"text": "Let me just say they have a huge menu with lots of options for any eater. Depending on what you get the food is tasty. The cheesecakes are also good. We got the pork-chop with mashed potatoes and you won&amp;#39;t be disappointed, very flavorful and moist. We also got the vege egg rolls and those are very fresh and food. I gave this 3 stars bc of the service we received.  The lady was nice but terrible at managing her tables. We got no silverware so had to eat the porkchop with a spoon for the first bite or two. We didn&amp;#39;t receive our dessert and it was given to a different table. It definitely was not her night.", "rating": 3, "date": "11/5/2016"}, {"text": "I&amp;#39;ve been hesitant writing a review of this Cheesecake Factory as the overall experience has been so inconsistent. However, my last experience, made me see life through Gordon Ramsey&amp;#39;s eyes. <br&gt;<br&gt;The first thing I will say is that the avocado egg rolls were amazing. So excellent job. Most appetizers I&amp;#39;ve had here have been great. <br&gt;<br&gt;Yet, unfortunately the main course was anything but. I&amp;#39;ll keep it short in saying we ordered our daughter buttered noodles, a nice simple meal as long as it doesn&amp;#39;t sit under a heat lamp for too long. By our estimates, the buttered noodles were under a heat lamp for at least 20 minutes. The end result is severally brown, and hard noodles, you can&amp;#39;t put a fork in. I am not joking when I say this. Even the person helping our server looked at the dish when they were putting it on the table, paused before putting it down, looked curiously at the dish and then layed it in front of our 2-year-old. A piping hot plate, and dried food. <br&gt;<br&gt;I thought maybe it would have ended there, but by order of enchiladas were dried too, the sauce was entirely baked into the tortilla meaning: no sauce. The beans had a cooked layer of dryness, and the cilantro rice was so baked on the top layer, I could practically remove the entire layer as it&amp;#39;s own cover. I tried one, bite, but it was hard and I couldn&amp;#39;t finish it. <br&gt;<br&gt;My son said his spicy chicken sandwich was okay, except that the spice was inconsistent. One part of the chicken had almost no spice and the other was way too hot for him to eat. While this is an opinion of his, I would agree with him that there shouldn&amp;#39;t be so much disparity on a single piece of chicken. <br&gt;<br&gt;Our server was friendly when she took our orders, but never brought the bread she said she was going to bring, and only showed up once after we received our order. That was to give us a check. When she asked if I wanted a box for the pasta we didn&amp;#39;t eat, she looked down at the bowl, and said, &amp;#34;Oh. Probably not.&amp;#34;<br&gt;<br&gt;I thought about saying something to management, but frankly I&amp;#39;ve had similar experiences, and was just tired of saying anything. <br&gt;<br&gt;The cheesecake was of course very good. <br&gt;<br&gt;End result of my many experiences here: Appetizers are always amazing, service can be great, or shoddy depending on the server, main entrees are wildly inconsistent. Cheesecake is always very good. <br&gt;<br&gt;Overall, the inconsistency is very difficult as I don&amp;#39;t know if I am going to have a nice meal, or a bad experience. I&amp;#39;ve yet to have an overall good experience, but I&amp;#39;m hoping it does happen. I keep rooting for them!", "rating": 2, "date": "6/15/2016"}, {"text": "The Cheesecake Factory is one of the few chains I really enjoy. That said, the Southdale Cheesecake Factory is lacking. One problem is simply that this is the only Cheesecake Factory in the state, so the place is always crazy crowded.  You absolutely have to eat here at an off time or you&amp;#39;ll be waiting for an hour.<br&gt;<br&gt;The other problem is the service. For the most part, the hostesses and the servers treat their jobs like they work in, well, a factory. They see the customers as products to churn out on the production line as fast as possible before their shifts end. No friendliness or warmth, and they spend as little time at your table as possible, which means that orders get messed up.  Also, one server gave us an extremely nasty look when we ordered a lunch portion to share, even though everyone knows perfectly well that their lunch portions are enough to serve at least two people.  <br&gt;<br&gt;As for the insanely sized portions of rich food that everyone complains about, well, I&amp;#39;m not so put off by that. Yes, I realize that this place is almost a satire of American gluttony, but use common sense, people!  There&amp;#39;s no Clean Plates Club at the Cheesecake Factory. Share a dish family style or bring home the leftovers. I did eat an entire slice of cheesecake once, but I was seven months pregnant, and unless ths is the case or unless you are having a VERY bad day, do not engage in such foolishness. Share.<br&gt;<br&gt;Also, order the avocado egg rolls before Michael Bloomberg tries to make these illegal.  These may be more decadent and joy-inducing than the cheesecake, and that&amp;#39;s saying quite a bit.", "rating": 2, "date": "6/4/2014"}, {"text": "Very disappointing location. No one seems happy to be there, the food quality has gone downhill, and it&amp;#39;s not an enjoyable experience lately, especially in the last few years. We recently went to the new location at Ridgedale and it was a completely different experience than at this Southdale location. I&amp;#39;m amazed at the difference, but I do know Ridgedale will be our new location to visit.", "rating": 1, "date": "12/3/2017"}, {"text": "So awful! We waited for a table for over an hour! The place wasn&amp;#39;t even packed.  When we ordered, it took another 1 hour and 20 minutes. No refills. We decided to leave without eating. Went to PF Chang&amp;#39;s instead and got our food instantly. Luckily we were visiting from out of state for a conference.", "rating": 1, "date": "8/15/2018"}, {"text": "Great restaurant, good service and good Food!<br&gt;I loved their cheesecakes!  So many different flavors to pick and I am still trying out different flavors.  <br&gt;Very nice environment!", "rating": 5, "date": "3/28/2015"}, {"text": "I just. Don&amp;#39;t know. First of all, get their Bloody Mary. They make their own mix and they are FAB. But I&amp;#39;m confused. I don&amp;#39;t get the theme of the restaurant. The menu is too huge to comprehend. And the food tasted...weird. I got the chicken and waffles Benedict which is like all my favorite things rolled into one and I just couldn&amp;#39;t get past the hollandaise. That can make or break a dish and it definitely broke it. <br&gt;I&amp;#39;ll probably be back though for a bloody.", "rating": 2, "date": "4/26/2016"}, {"text": "Great food great service. Management is helpful and attentive. It can be busy so brace yourself. But nonetheless it&amp;#39;s worth the wait for the great service and tons of food options.", "rating": 5, "date": "2/22/2018"}, {"text": "Me and my friends came here for on of their birthdays, and it was some of the best service ever. The wait staff are so nice. Also our food was amazing especially the dulce de leche cheesecake! I recommend this to literally everyone", "rating": 5, "date": "4/5/2019"}, {"text": "I just wanted a latte. I couldn&amp;#39;t order because the official excuse given was &amp;#34;I am sorry we are out of cups&amp;#34;. Ridiculous!!<br&gt;<br&gt;otherwise the place is quite neat", "rating": 1, "date": "9/16/2016"}, {"text": "The ambience is as usual what you expect.. the place is bustling with the crowd n its great to be getting the cheesecake factory experience. So talking about he food, I had the Chicken Madeira which was ok. The chicken was tender n mashed potatoes were fine. My wife had the miso salmon which was ok as well. The desert my friends is to die for, we had the Chocolate Tuxedo cream cheesecake which is our favourite n as always, it&amp;#39;s great.", "rating": 3, "date": "5/22/2016"}, {"text": "Atmosphere: Warm, elegant, and inviting.<br&gt;<br&gt;Service: Depending on when you go, service can take a little while because this is such a popular restaurant. Everytime I have gone, service has been pretty quick for a full house. Everyone also seems friendly and checks on the table often.<br&gt;<br&gt;Food: Holy delicious! The menu is HUGE so there is something for everyone. Plus each item is bursting with flavor. Save room for a slice of cheesecake, I recommend the Dutch Apple!<br&gt;<br&gt;Price: $$$ Although a bit spendy, it&amp;#39;s worth it. The food is really good and the portions are large so you will definitely have leftovers.<br&gt;<br&gt;I&amp;#39;m not sure how this place only has 3 stars, I&amp;#39;m really surprised! If you can afford a nice night out on the town, The Cheesecake Factory comes highly recommended.", "rating": 5, "date": "4/17/2016"}, {"text": "Love the Factory and the extensive menu. No one has the depth and variety of menu. From Chinese, Italian, Mexican, Cajun, to meatloaf, where else can you get that variety. But the high end presentation at incredible pricing is the best. Oh, I forgot to mention the cheesecake. That&amp;#39;s for another review.", "rating": 5, "date": "1/8/2018"}, {"text": "Food was good, service was slow as hell, lunch bill was messed up (double charged me on lunch entrees and deserts).<br&gt;<br&gt;Overall bad customer service, slow service. Food was great.", "rating": 2, "date": "3/17/2017"}, {"text": "We had a very delightful holiday lunch last Friday at the southdale Cheesecake Factory. Lovely decor, very delicious food, and great service. We had a veggie burger and a Chinese chicken salad . No room for cheesecake though. Always have had a very enjoyable experience here. Bring money.", "rating": 5, "date": "12/22/2016"}, {"text": "I can speak to all the foods served, but these cheesecake factory is highly addictive- in a good way. There was a period where I would make frequent trips to the factory just for cheesecake to go. The restaurant can be busy, but its always worth the wait for the yummy cake.", "rating": 5, "date": "5/11/2018"}, {"text": "Still one of our favorites, always tasty food and drink and desert with enough to take home.<br&gt;<br&gt;And the service always superior. Special commendation for Nicholas P, he is giving Scott a run for his money for the crown for best waiter in the Twin Cities!<br&gt;<br&gt;Obviously a well-managed restaurant.", "rating": 5, "date": "12/12/2016"}, {"text": "Came with 8 other people to celebrate my birthday and we order drinks and food she says we&amp;#39;re out of 6 of our orders and they are out of 25 items. And nothing they can do I called corporate after and they wanted to give 20.00 gift card. Manager and corporate was very rude and I and my family will NEVER return. None of there locations", "rating": 1, "date": "4/23/2018"}, {"text": "We arrived at 815 pm. Waited the expected 35 minutes like we were told the wait was, which we were fine with. However, when we were seated we waited 20 minutes at our table with no greeting by a waiter, no water provided, we simply sat and waited patiently until we got up and left. NOT acceptable and will not come back", "rating": 1, "date": "3/8/2019"}, {"text": "We came on a very busy Saturday night. First off, our server was outstanding! On top of everything, friendly, accommodating etc. <br&gt;my husband had the ribeye and said it was one of the best he&amp;#39;s ever had in a non steakhouse setting-done Medium Rare to perfection, juicy, &amp;amp; tender. I had the Chicken Di Pana. Very moist, flavorful, and very generous proportions! <br&gt;The white Sangria was also fantastic..&amp;amp; strong! ;-) <br&gt;We will be back again. <br&gt;Menu is huge-something for every taste palate. Wait is always long because everyone realizes how great this place is, so I suggest putting your name on the list then doing a little shopping and calling to check in around the time your quoted wait time is up.", "rating": 5, "date": "5/14/2016"}, {"text": "So those reviewers who talked about how you should go at an odd time to avoid the wait? Yeah, do that. &amp;#39;Cause if you don&amp;#39;t, you&amp;#39;re gunna have a bad time.<br&gt;<br&gt;I mean, I imagine you might. We didn&amp;#39;t, &amp;#39;cause we went at like 4 pm. Smart!<br&gt;<br&gt;I got the chicken madeira and a lemon drop martini, and my bf got the smokehouse bbq burger with a long island iced tea. I&amp;#39;m really glad that we decided against an appetizer, because zomg big effing portions. I was so stuffed and couldn&amp;#39;t finish my chicken, which btw was delicious! I had asked the waiter to recommend some stuff to us, since their menu goes on forever (it truly is out of control), and that was one of the things he recommended, so I took a shot. It comes with mashed potatoes, a whole mountain of them, and two flattened chicken breasts breaded with....something, covered in cheese and asparagus, and then there&amp;#39;s this sauce....idk it&amp;#39;s like some kind of gravy that involves crack. All I know is that it was really really good.<br&gt;<br&gt;This could also be the lemon drop talking...I&amp;#39;m not sure. It&amp;#39;s entirely possible that they booze you up before the food comes so you think it&amp;#39;s amazing.<br&gt;<br&gt;We got cheesecake to go. That tuxedo business...it&amp;#39;s got a lot of chocolate in it, so it&amp;#39;s probably going to be good. <br&gt;<br&gt;I can DEFINITELY see how annoying this place could be on a busy night, though. For as much as we enjoyed the atmosphere and the lack of other patrons (although their decor features a repetitive &amp;#34;eye of sauron&amp;#34; theme), by the time we left the annoying mall people and their tiny, loud children were arriving. Don&amp;#39;t get me wrong, I love kids, I just don&amp;#39;t like dining with them.<br&gt;<br&gt;So, I guess what I&amp;#39;m saying is go. Go during lunch time...maybe around 1 or 2 pm, and bring a lot of people so you can all get different dishes and then eat off each other&amp;#39;s plates. Then get cheesecake to go.<br&gt;<br&gt;The end.", "rating": 4, "date": "12/23/2013"}, {"text": "This place is very spacious and buzzing with groups of people-- it&amp;#39;s cheesecake factory located at a mall. I always get spicy chicken chipotle pasta (when I want to splurge) or Chinese chicken salad. Their portions are hugeee. The wait was over an hour long on a saturday night-ish (7-8pm). Great place for groups, drinks, and american food...after all, it&amp;#39;s quintessential suburban family restaurant :)", "rating": 4, "date": "6/4/2016"}, {"text": "This place has not disappointed me even before I was yelping. Make sure you leave room for their great selection of cheesecakes and by the way, the only Gluten Free option is the Godiva Chocolate Cheesecake ... how awesome is that!<br&gt;<br&gt;They also have a full menu of low calorie options collected in a separate menu. There are a huge selection of options so make sure while you&amp;#39;re waiting to borrow a menu. There are long waits during weekends but it&amp;#39;s also by the mall so you can window shop while waiting.<br&gt;<br&gt;If you have kids, they even decorate the desert plate with a happy birthday written on chocolate sauce!<br&gt;<br&gt;Again, an awesome place!", "rating": 5, "date": "8/21/2014"}, {"text": "It was my first time eating here, we came as a party of 9 and couldn&amp;#39;t rsvp (on weekends) we waited for an hour and 20 mins.. finally got a table only to keep getting bad news that they were out of certain items on the menu and also the menu was pretty overwhelming.. I order lasagna verde and it was so cheesy that I couldn&amp;#39;t swallow it. Every bite was just mozzarella.. the fillings was mozzarella.. I couldn&amp;#39;t taste anything other than mozzarella... it was to the point I couldn&amp;#39;t swallow it anymore and gave up. I enjoyed the tomato sauce but didn&amp;#39;t get much of it.", "rating": 2, "date": "2/23/2019"}, {"text": "Does it bug me that they don&amp;#39;t take reservations? Yes. Does that stop me from going anyway? Nope. I&amp;#39;ve been coming here a long time and can honestly say we&amp;#39;ve never left feeling like the food or the service was bad or even just meh; it&amp;#39;s consistently so good. There are even apps that will do delivery from CCF when we don&amp;#39;t want to leave the house and still have an amazing meal.", "rating": 5, "date": "5/30/2017"}, {"text": "I often take my family out to eat someplace  to give it a trial run before taking clients or staff out to said place.  I hadn&amp;#39;t heard great things about this particular Cheesecake Factory, but to be honest I am running of restaurants that are close.  My family and I had just ate, but I thought we would stop in for  dessert just to see.  How bad could it be?  Ahhhh...it&amp;#39;s that bad.  I have never went to a restaurant and not been offered a drink.  Myself and my two children ordered a piece of cheesecake.  We were never asked what we would like to drink.  I had to go to the bar to ask for a water.  I would have liked a drink, but wasn&amp;#39;t going to make a separate tab.  We waited for at least 25 mins for the server to come get our check and payment.  The cheesecake was $10 for an okay piece of cheesecake.  The server came back to the table to ask which  credit card was mine.  She picked up several at the same time.  The next day when looking at my account I have been charged $70 for 1 piece of cheesecake without even the offer of a drink.  I called the manager, almost still wanting to give the benefit of the doubt.  As I said, I am running out of new restaurants.  He had an odd mixture of laughing and coughing the entire time he was on the phone.  He asked what time it was.  When I said 8pm, he stated he left at 6:50. What does that have to do with anything? He said if he had to pay $10 for a piece of cheesecake and had poor service he would be mad too.  I was not upset and told him so.  I thought he would want to know that I had poor service and was chaged $70 for 1 piece of okay cheesecake.  After speaking with him I see the problem was not the sever but management.  Not only will I not be back for business.  I will never bring my family.  I hope that I am refunded the extra $60 I was charged.  24 hours later I have not been refunded.", "rating": 1, "date": "8/23/2019"}, {"text": "I went here for my birthday celebration. I got seated at a booth. It took the server Richard over 5 minutes or longer to come over and say hi and take my order. The lunch rush was over a long time ago, this was at like 2:45 and there was hardly any people in the lobby or waiting area. Our main course took a long time to come out. And Richard hardly came over to check in and ask if we needed anything. We had to keep looking for him and flag him down. He said the chef walked out and a manager was cooking one of the courses, I think it was the teriyaki chicken. A manager never came over to our table to say anything about this. Food was good but bad service overall. Not a good birthday experience, definitely disappointed.", "rating": 2, "date": "1/1/2018"}, {"text": "Went here on New Years Day 2019. Probably the worst food and the worst service I have ever had anywhere!", "rating": 1, "date": "1/1/2019"}, {"text": "I got the jumbalya my wife got the superfood salad.The pasta was dry and blan it was supposed to be spicy.But even worse was my wife&amp;#39;s salad one bite was disgusting.I don&amp;#39;t know how she ate more then a few bites.Its like it sat out all day gross.The waitress did a good job.I did not directly complain because my wife insisted.", "rating": 1, "date": "3/4/2018"}, {"text": "The hostess&amp;#39; and manager were terribly rude, we waited over 40 minutes to be seated...people that came in after we did were seated immediately! We had originally asked for a booth but we&amp;#39;re told they had no wait staff for booths, we said a table would be fine then and we still were not seated!<br&gt;The manager said we could call corporate to complain but that was all he could do for us.<br&gt;Our waitress however was wonderfully pleasant and knowledgable. She bought us coffee because of the way we were treated when we first arrived.<br&gt;I will say my food was good and so was my cheesecake.<br&gt;I don&amp;#39;t know that I&amp;#39;d ever visit this location again though...", "rating": 3, "date": "7/29/2015"}, {"text": "The menu is overwhelming, the wait is ridiculous.  Food is salty as heck!  Ya I said heck, you better get the soap. Overpriced.", "rating": 2, "date": "2/19/2016"}, {"text": "Tried the steak... and it is the biggest disappointment ever. Not the worst I&amp;#39;ve had... but pretty bad. No flavor &amp;amp; burnt crisp. All you can taste is a little salt and the burnt bitter. I dont mind paying $30 for a steak... but for $30, I expect it to be well prepared. The salads are good but the nothing special.", "rating": 1, "date": "4/4/2018"}, {"text": "I love the food at this place! It&amp;#39;s a go-to for me for celebrating with my girl friends. We had avocado egg rolls and crispy Cuban rolls for our apps, both of which were hot, fresh and tasty. We had a slight wait on the bread because it came right out of the oven, which is OK by me! My savory Chicken Madeira hit the spot, although I also had a bite of the Chicken Costoletta, and I would definitely order that next time because it was light on the breading and the lemon was fresh in a tangy but not overpowering way. I was told the chopped salad was also excellent. We had cheesecake, of course! I branched out from my favorite (White Chocolate Raspberry Truffle) and I was not disappointed with my Caramel Pecan Turtle Cheesecake. My friends highly enjoyed their very chocolaty cheesecakes, too, of which there is quite a variety. <br&gt;<br&gt;The server was fun and friendly, but also gave us our space. We enjoyed the outdoor patio setting, which was much quieter and pleasantly warmer than the air conditioned interior, though this was my first time on the patio and I&amp;#39;ve had equally pleasant experiences on my previous visits.", "rating": 5, "date": "9/3/2017"}, {"text": "We normally love The Cheesecake Factory. The food and the service are usually great.<br&gt;<br&gt;This last time we were very disappointed in the temperature of the plates and the food.<br&gt;<br&gt;After the food runners brought our two kids meals and set them down in front of the children, they told us the plates were pretty warm and to be careful. I immediately moved the plate from in front of my 2 year old toddler and was astounded by how searing hot the plate was. I couldn&amp;#39;t even manage to slide it over in front of me without using a folded napkin. My wife and I were both shocked that they would even consider serving children food on a plate that hot. It&amp;#39;s weird because none of the food on the plate was very hot. It could have all been eaten immediately if it weren&amp;#39;t for the ridiculously hot temperature of the plate. <br&gt;<br&gt;Shortly after that our food came out, and again the plate was molten red hot magma temperature, but the food was barely above warm. <br&gt;<br&gt;Seems like a silly thing to get worked up about, but the part that really made us mad was the manager Jennifer Madison&amp;#39;s reaction to our concern about the plate temperatures for the kids meals. <br&gt;<br&gt;She basically insinuated that we were terrible parents for not cutting our children&amp;#39;s food and letting it cool before giving them the plates. (Even though HER runners are the ones that placed the plates in front of the children.) She stated that it was either company policy or a health code issue that required them to place all plates for service in the food window before being brought out to customers regardless of food type or age.  (Horse crap. I&amp;#39;ve eaten at PLENTY of restaurants where I&amp;#39;ve been served food on room temperature plates... and the food was actually hot to boot.) She gave off an air of indifference. I don&amp;#39;t appreciate spending 90 dollars in your restaurant and then being told that our concern was not valid.", "rating": 2, "date": "6/25/2015"}, {"text": "Long wait for food. 4 children &amp;amp; 6 adults. Children&amp;#39;s Mac &amp;amp; Cheese was large elbowroni with watery milk at the bottom of tbe bowl that didn&amp;#39;t stick to noodles. I asked the waiter if this is the usual and he said sort of. Children did not eat. Chicken fingers fried too dark. Most of the adult food was sub-par. Tomatoes green and tasteless, avocados hard, pasta not enough sauce, salads tastless, etc. I had not eaten here for 5 years. Live out of state now. I had good memories of this restaurant. Too bad it has changed. I hate to pay for food that is not eaten. In this time of so many restaurants in competition, The Cheesecake Factory needs to make some changes. Wish I had read the reviews before bringing my family there.", "rating": 1, "date": "11/26/2017"}, {"text": "This was my first time eating at the Cheesecake Factory. My girlfriend loves it and brought me for my birthday. <br&gt;<br&gt;The menu is huge. Anybody should be able to find something they like. <br&gt;<br&gt;The staff was very courteous. The waitress stopped back frequently to refill our drinks and was very knowledgeable about the menu. <br&gt;<br&gt;I would recommend this restaurant to anyone looking for a place to eat and am sure I will be returning in the future.", "rating": 5, "date": "1/28/2017"}, {"text": "My wife and I had lunch here with another couple. It was the first time for all four of us. All our meals were fabulous, the waitress was wonderful. I will definitely be going back again.", "rating": 5, "date": "1/27/2019"}, {"text": "I prefer to order curbside by phone, however the last couple times the bakery not answered after being on hold for over 30 minutes.   This time I ordered online. The online website is a bit annoying and it blanked out 4x so i had to keep going back and enter my info several times. I got to the restarant and a girl in the bakery answered. She said I ordered two salads. Told her I intended to order one and the total I saw was for just one salad. She stated I would have to come in and make arrangement to talk with the manager. Told her I may need to just cancel then. She then hung up the phone. She was very short and rude during the call as I was explain the situation. I just got done with over 10 hrs of work in customer service and was polite to all of my customers..to.be reprimanded by this girl. I would have spoke with the manager but after being spoke to so poorly and hung up on, I was so put off. I will not return.", "rating": 1, "date": "5/11/2019"}, {"text": "I loved Cheesecake Factory, this is usually our go to place when we want a nice quiet lunch/dinner. However today was not the day, out waiter was so rude to begin with, my order was wrong missing ingredients and when I told the waiter she was mad and came back and literally just added the avocado to my super hard tortilla I ordered the skinnylicious tacos which were so gross and this has definitely made my overall experience negative here. When she returned I asked if they can remake the whole thing and she turned around super rude and said I&amp;#39;m getting my manager. No one even asked for her manager all I wanted was my food to be correct. Anyways I would rate a one, but I have had good customer service here before and the food was always good. Definitely not going to this place in a very long time.", "rating": 3, "date": "1/23/2019"}, {"text": "I love The Cheesecake Factory. I love the decorations, how large the portions are, how unhealthy and delicious everything is, and that the desserts are as big as my face. If you get the apple crisp, it is bigger than my face.<br&gt;<br&gt;When I go to this restaurant it is definitely a treat. I usually order from the skinny menu because I can&amp;#39;t get myself to order from the regular menu. Well, that&amp;#39;s also because I would rather eat dessert than the main dish anyway.<br&gt;<br&gt;During this visit, I shared the apple crisp and strawberry cheesecake with a few people. As mentioned before, the apple crisp was HUGE. I do think they have cut down on cheesecake slices. I remember them being so huge a few years back, but recently they are quite small and possibly not sharable.<br&gt;<br&gt;I&amp;#39;ll be coming back here to treat myself from time to time. Everything is so delicious!", "rating": 4, "date": "8/17/2015"}, {"text": "We have been here once before and the food was great! My husband and I went out to lunch today and decided to get a loaded tater tots appetizer. We were happily munching on said tots until my husband found a bolt/screw in the one he just popped in his mouth. Thankfully he discovered it before biting down too hard. So we flagged down a manager, just wanting for them to be informed of what we found in our food. He was very apologetic, took away the plate and asked if we wanted a new one, we declined. Our meals came and as we were eating the manager came and told us our whole bill will be comped.<br&gt;<br&gt;We didn&amp;#39;t tell him about the screw to get a free meal, we actually felt bad eating for free so before we left we put down a generous tip ($20) for the server, because it wasn&amp;#39;t his fault. We were about half way to our car when the server chased us down to tell us what we put on the table didn&amp;#39;t cover our bill so Aaron said &amp;#34;Talk to your manager. I found a bolt in my food and he said we didn&amp;#39;t have to pay&amp;#34; so my husband followed the server back in and told the server to get the manager.<br&gt;<br&gt;Unreal that the manager didn&amp;#39;t communicate to the server what happened. That is the first thing that should have been done was to show the server the plate with the screw on it and to zero out our bill. That way we wouldn&amp;#39;t have been chased down like dine-and-dashers. I told my husband  after we left that he should have asked for the tip back.", "rating": 3, "date": "10/28/2015"}, {"text": "Entrees are very lacking flavor wise so if you&amp;#39;ve never been and are wanting to try the place out, I suggest going for a couple appetizers and then dessert of course! Can&amp;#39;t go wrong with any of their cheesecakes...Out of the few i&amp;#39;ve tried including oreo, and s&amp;#39;mores, the mango key lime cheesecake is by far the best! If you&amp;#39;re into fruity tasting stuff than this will hit the spot! I&amp;#39;m tempted to stop by tomorrow on my way back from work to get a slice! It is that good!", "rating": 3, "date": "6/9/2015"}, {"text": "First time here, for lunch. All the staff were friendly and helpful. <br&gt;<br&gt;I got the Lemon Herb Chicken, and loved it but was a bit too sour with the lemon touch, but was still super amazing!", "rating": 5, "date": "4/29/2014"}, {"text": "I love how they put the utensils directly on the table! It is so convenient and more sanitary than using a cloth napkin that someone could have blown their nose into!!!", "rating": 5, "date": "4/28/2018"}, {"text": "I like the Cheesecake Factory and have been here many times before.  The food and drinks are okay, and as far as my own personal experience goes, the service has always been on point.<br&gt;<br&gt;I met a friend today at the Factory for brunch and arrived right as they were opening, so there was no wait and I was promptly seated.  It had been almost a year since I was last at the Factory, so when I went there today, I was surprised that the amount of calories was listed next to almost each item.  The calorie count of certain dishes and slices of cheesecake that I had eaten before shocked me a bit!  One certainly does not go here if one is on a diet!  ;)  At any rate, the server was polite, courteous, and attentive.  I ordered avocado toast, which was OK, and some coffee.  I felt the avocado could have been slightly more well seasoned with a little extra lime and salt, but that&amp;#39;s just me.  I did enjoy the multiple fresh sprigs of cilantro but not sure why there were radishes included.  My friend ordered an omelette with ham.  She assumed the ham would be cut up and incorporated into the omelette, but instead, she was brought a whole slice of ham on a plate.  She told the server about it, returned her plate, and the problem was promptly rectified, and she seemed to enjoy her food.  The serving, of course, was huge, so she wasn&amp;#39;t able to finish it all.  <br&gt;<br&gt;As an aside, one of the fun things I like about coming to the Cheesecake Factory is, if it&amp;#39;s your birthday, they will give you a special plate with &amp;#34;Happy Birthday To You&amp;#34; written on the plate in chocolate sauce as well as receiving a free miniature sundae with a candle.<br&gt;<br&gt;Bottom line is that I will return here but mostly for special occasions and occasionally meeting people for brunch/lunch.<br&gt;<br&gt;Tip (that most may already know):  When planning to go to CF, go right at the time they open or during an evening weeknight, as it will be less busy.", "rating": 4, "date": "3/5/2017"}, {"text": "Some of the wait staff was very respectful. There was one who was very rude because it was busy. I had a very unpleasant experience. The managers were very nice by the way. My experience was more with the food and cleanliness. The silverware was very disturbing to the point I did not want to eat of the dishes. I believe u should hand wash and than put them in the dishwasher because that was horrible. The food was beyond disgusting. I heard other customers saying that too. I order buffalo wings and southern country fried chicken sliders as an appetizer. That was a HUGE mistake!!! The Sliders had so much grissle with ever bite I took it had some in it. The chicken wing Had The biggest Vain I ever seen in my life in it, it also seemed undone. Everyone kept asking me if it was undercooked. I did not complain about it though I still payed and tipped because it was not the waitress fault only the cooks.", "rating": 2, "date": "12/22/2018"}, {"text": "Great food, great service! And they give you loads of bread and butter. Pricey but it&amp;#39;s fancy! The average wait is normally 30-45 minutes! But it&amp;#39;s definitely, definitely worth it. It&amp;#39;s also a great atmosphere to be in. I love it!", "rating": 5, "date": "9/27/2017"}, {"text": "I&amp;#39;m always intrigued by this place. No matter when you go...it&amp;#39;s always packed. I&amp;#39;ve been to a couple of locations and this one is just like the rest. Food is average but you get huge portions. They also have tons of staff... yet always seen to offer very poor service. Maybe the staffing model needs tweaking? Our table, and the ones around us, seemed forgotten about as servers whisked by to other areas. Will I go back? Probably. But the experience is never memorable.", "rating": 3, "date": "8/26/2017"}, {"text": "We had the most frustrating experience at the Ceesecake Factory in Edina MN yesterday. 1st the service was very slow and had a shift change. We ordered our food and the new waitress came back and advised they do not have the hibachi steak we ordered. How do you not have the steak?? We ordered the dynamite shrimp for an appetizer which was horrible. We ordered a ribeye medium rare and it came out well done. We were so frustrated at this point and said forget just give us our bill we have been here for 1.5 hours and have had bread and water and the worst shrimp ever. It&amp;#39;s pretty bad when your server tells you she told the chef not to mess up the steak since we have had issues since we sat down. The manager came and said the dynamite shrimp is the worst appetizer on the menu and has requested it to be removed. They could not offer or do anything as it has to go through corporate. Don&amp;#39;t waste your time or money here. We feel this restruant has gone down hill with not only the dated decor but the price you pay for the food. The table behind walked out and the table next to us sent there food back twice. <br&gt;<br&gt;.", "rating": 1, "date": "11/12/2018"}, {"text": "Excruciatingly bad and slow service this evening. Food took forever to be served and was cold upon arrival. Appetizer never arrived. Special requests forgotten. Dessert ordered to go, added another 20+ minute wait before we could finally get out of there after almost 3 hours. Very frustrating and maddening.", "rating": 1, "date": "2/26/2017"}, {"text": "after being on hold for 15 mins. I called back and asked to speak with a manager...(Jen) who was quite snotty herself took my order and said 15-25 mins... 50 mins and $60 later my food was ready - finally. BTW my car was running in takeout parking. I finally get home and it literally looks like some thrown together slop.... <br&gt;<br&gt;never again cheesecake factory edina. I&amp;#39;m so disappointed.", "rating": 1, "date": "3/6/2015"}, {"text": "We waited over 40 minutes to be seated, which was fine it was Friday and it was expected.  The hostess was the rudest b%$&amp;amp;h ever after we asked why we were called up to be seated then left standing while people behind us were seated because they wrote &amp;#34;2&amp;#34; &amp;amp; not &amp;#34;3&amp;#34;. Really girl, if you hate your job that much....find another!", "rating": 1, "date": "11/3/2017"}, {"text": "I have always been a big fan of The Cheesecake Factory, but my last experience made me walk out. First off, when we entered, it took the host staff nearly ten minutes to acknowledge our presence. Walked in at 8:50 and didn&amp;#39;t get acknowledged until 8:58. Then once we were at the table, it just went downhill. We were seated for well over fifteen minutes with no waitstaff to grab us drinks, bread, or water. When I did ask, which was twice, I was told snidely that &amp;#34;this isn&amp;#39;t my assigned section&amp;#34;, and they walked off. I was livid. Meanwhile, the same two which I asked were having casual small talk by the restroom hallway for a good amount of time. I hope management reads this because I love the food and the experiences in the past, and I want to be reassured this will not happen again so I can keep coming back for great experiences.", "rating": 1, "date": "2/10/2017"}, {"text": "Always disappointed in the price and size. Except this time my husband&amp;#39;s piece was a good size. Mine ....not so much! They probably gave him a big piece because of the ridiculous kind he chose.", "rating": 2, "date": "10/7/2017"}, {"text": "I&amp;#39;ve been here twice before and loved my meals, however tonight&amp;#39;s dishes were a major disappointment. I ordered the Jumbalya and it was so soggy and watery I sent it back after one bite. The waiter didn&amp;#39;t apologize or ask what was wrong, he simply asked me what I&amp;#39;d like instead. I then ordered the Gumbo, as I&amp;#39;ve had it before and remember really liking it. Something must&amp;#39;ve been off with the kitchen, today, though because that was horrible as well. I asked for a to go box and threw away my $18 meal when I got home. <br&gt;<br&gt;While my meals were bad, what was worse was the service and our waiter&amp;#39;s apathy toward our experience. <br&gt;<br&gt;If you go here, steer clear of the chicken dishes (unless they are deep fried) otherwise, you&amp;#39;ll get chewy, soggy, fatty meat for a minimum of $16 a plate. <br&gt;<br&gt;I will say, my boyfriend&amp;#39;s dish (the Habachi Steak) was delicious as were the buffalo wings we split.", "rating": 2, "date": "6/5/2016"}, {"text": "Very very very upset that the<br&gt;Chicken Scampi was taken off the menu.  I went there for Mothers Day and told my mother for days how delicious it is only to find out she wont get to try it.", "rating": 4, "date": "5/11/2016"}, {"text": "Happy Hour is super affordable. Great drinks (especially the margarita and mojito). Happy Hour is Monday-Friday 4-6pm in the bar area. Come early it gets busy.", "rating": 5, "date": "6/16/2017"}, {"text": "Great experience every time!  Great meals, and of course, great cheesecake!  Red velvet is my fave", "rating": 5, "date": "3/8/2015"}, {"text": "Went last night to pick up a few slices for a girlfriend and I. I can&amp;#39;t complain about how delicious the dessert is. But the restaurant was chaotic. It was hard to figure out where I needed to go, what line to stand in, and what the process was. A sign or two would help immensely. Service was okay - maybe even good for the amount of pressure the worker was under to keep things going.", "rating": 3, "date": "3/12/2017"}, {"text": "We only had to wait 30 minutes for a table, but once we were seated (in uncomfortable wicker chairs in the lounge...at a high bar table), it seemed our server was either too busy or uninterested in serving. It took nearly ten minutes just to come over and take our beverage order. <br&gt;<br&gt;I ordered the Tuscan Chicken off of their &amp;#39;skinnylicious&amp;#39; menu. When it came out, it looked like a couple of grilled chicken breasts in a soup-like sauce. And there were SO many baby tomatoes, it was almost overwhelming trying to find the dish. On the menu, it said it came with a &amp;#39;green salad&amp;#39;. I can only imagine that that was smothered somewhere in that sauce. I ate the 3 pieces of chicken and tried to eat the tomatoes but they were just so soaked in sauce that I couldn&amp;#39;t bear to finish it.<br&gt;<br&gt;For dessert, I ordered the Toasted Marshmallow S&amp;#39;mores Galore cheesecake. It was good - obviously very rich, but just good.<br&gt;<br&gt;The whole ordeal to have our leftovers brought back to us and the bills taken care of us nearly added 15 minutes to our experience. It was just so slow. Food was alright, service left something to be desired.", "rating": 2, "date": "4/3/2016"}, {"text": "Went here last night and sat at the bar area to the left for a change of pace, never sat there before.  I&amp;#39;ve been here probably 5 or 6 times, but this time was awesome.<br&gt;<br&gt;Our bartender (according to the receipt) was &amp;#34;Ashley P.&amp;#34; and she was one of the nicest people I&amp;#39;ve ever encountered in a restaurant atmosphere.  I would give her 6 Starts out of 5 in terms of service, no joke.  She seemed to have exceptional bar tending skills, and was really knowledgeable about food - she made really good food / dessert recommendations for us.<br&gt;<br&gt;Would have given it 5 stars, but I&amp;#39;ve always been a little bitter with this place since I called to inquired about an application I submitted there (this is probably a few years ago now), and the manager that I spoke with on the phone was a complete d**k.  He was a male, and that&amp;#39;s all I remember from that experience.  Hopefully he has been fired or has fallen off the face of the earth by now.<br&gt;<br&gt;Both the Red Velvet Cheesecake and triangle-shaped mozzarella stick things I ate were &amp;#34;mouth orgasms&amp;#34; to say the least.  Thought that it was really cool that the kitchen staff knew which people the food went to without us even saying so, very impressive!", "rating": 4, "date": "2/12/2015"}, {"text": "Went to eat at the south dale location service was good quality of food poor. Most likely would not return based on poor quality food.", "rating": 2, "date": "3/4/2017"}, {"text": "Taj Mahal vibes are strong. Just got cheesecake, and honestly it was just sub-par. Like I love tiramisu but this tiramisu cheesecake was a let down. My friends also thought their cheesecake was sub-par. This is kinda strange cause I&amp;#39;ve eaten at other CFs and it&amp;#39;s been way better. So um come here if you want but please remember 1) It&amp;#39;s a knock-off Taj Mahal and 2) it&amp;#39;s hella overrated", "rating": 3, "date": "8/7/2017"}, {"text": "My husband and I visited this restaurant today on our day off.  I was disappointed to find that the customer service was delayed, even though the restaurant was not very busy.  Those thoughts aside, the quality of the food was our main priority.  Having eaten at The Cheesecake Factory with positive experiences, I didn&amp;#39;t doubt this visit would be any different.  I was wrong.  I ordered breakfast (over-medium egg, w/ bacon, English muffin and potatoes).  When my eggs arrived, they were UNDER over-easy, and this comes from a person who actually prefers eggs over-easy.  In addition, my bacon was missing.  My husband order the Louisiana pasta, which was warm, even though the plate was scalding hot.  The sauce in his entree was heavily watered down, with almost soup consistency.  Furthermore, the dish was not well served or in good taste on this particular day.  The food was brought out by someone other than our waitress, which was fine; except at no point did our actual waitress come to check on our table after our food had been received.  I returned my food to have my eggs redone and requested my bacon.  When it was brought back to the table, the eggs and bacon were drowning in oil.  I didn&amp;#39;t bother touching my food after that. I politely asked for the check and promptly left.  I realize everyone has off days, but this visit did not meet expectation.", "rating": 1, "date": "6/5/2018"}, {"text": "I&amp;#39;m truly at a loss on how to rate this place. <br&gt;<br&gt;It&amp;#39;s one of the most bewildering restaurant experiences I&amp;#39;ve had all year. By the time I left, I had experienced a number of emotions: shock, sadness, horror, anxiety, embarrassment, contempt, and apathy to name a few. My first observation on walking in is how vast the space is, with it&amp;#39;s large booths, presumably to better service it&amp;#39;s large patrons. <br&gt;<br&gt;As I took my seat I was given a menu the size of a novella. The sheer amount of choices was immediately overwhelming. For the first time of many that evening, I was forced to face some of the worst traits of American culture. How could a kitchen possibly handle such a hyperbolized variety? Only if your goal is to flame the culinary vanity of a mundane crowd.<br&gt;<br&gt;It seemed like mere minutes after I ordered when the food arrived. Apparently in America, you&amp;#39;re not supposed to order slow, and have a relaxed multi-hour dinner with camaraderie. The dining experience here has been reduced to an inhuman mechanical action: get in, eat, get out. In addition, the portions are offensively large, often achieving a caloric density not previously thought possible, perhaps even hitting the upper limits of physics. <br&gt;<br&gt;I felt as if I was being grasped at the back of the head, forced to gaze upon America&amp;#39;s disgusting gluttony, to revel in all the waste, to force me to contend with the obesity around me. The worst part? The Cheesecake Factory has no shame; it offers no apology. It accepts this cultural degeneracy, and happily promotes it. There is no noble goal to skirmish with the ignorance of it&amp;#39;s customers, but further raises the curtain. There is certainly no complaint from the eaters, as they stuff their bloated faces. <br&gt;<br&gt;Of the things I tasted, they ranged from okay to bad--expected given the size of the menu. The best thing I tried was this delightful little salad that came with my tacos. A tiny paradise amongst the sea of butter, cream, and grease.<br&gt;<br&gt;The disturbing experience left me enervated, leaving me to ponder my existential place in this country, and the future of our people. Let this review be a warning to all: if you have any decency or respect for yourself, go somewhere else.", "rating": 2, "date": "5/20/2014"}, {"text": "Love the atmosphere. Could use some more options that aren&amp;#39;t over 1,000 calories. My salad was good but my boyfriends mashed potatoes were excellent!  We got the avocado fried wrap as an appetizer which was very unique and good. It is pretty dark in there lighting wise but I like that, think it adds to the ambiance.", "rating": 4, "date": "4/20/2017"}, {"text": "Horrible service, the order was wrong twice. The fries were cold, wrong sauce on one of the sandwiches ordered, and my burger was burnt. My family and I waited  over an hour for our food.", "rating": 1, "date": "7/15/2018"}, {"text": "It is a fancy restaurant with lots to choose from but food tasted like an average restaurant just expensive. They could do better if they put a little bit of focuse on food rather than decor. Visiting once is okay.", "rating": 3, "date": "5/10/2017"}, {"text": "We love Ashley!!! Best bartender ever !!! <br&gt;She is kind, educated about the menu and always has amazing recommendations. It&amp;#39;s like she can read your mind as far as what you desire and don&amp;#39;t on the menu. <br&gt;<br&gt;My boyfriend and I go almost every Monday for date night. We love sitting at the bar. The passion fruit margarita is fabulous. My boyfriend loves the coffee selections. <br&gt;<br&gt;The Cheesecake Factory has a very extensive menu and something on it for anyone ! I enjoy the salads and I special order the Chicken Di Pana with extra broccoli. <br&gt;<br&gt;I believe that, if you want to search for the bad in something you will find it. Fortunately the worst thing I have to say about the staff and menu at the cheese cake factory is that it&amp;#39;s amazing. That&amp;#39;s it guys ! Check it out with an open mind and make sure to sit at the bar and have an amazing experience with Ashley or Ivan.", "rating": 5, "date": "12/16/2015"}, {"text": "A very disappointed pregnant girl. I was soooo excited to go eat at cheese cake factory on Father&amp;#39;s Day, yeah we had came later in the evening but I have never once experience the dish I wanted was unavailable. Also the waiter sucked, barley came by to see if we needed refills or even bring the wheat bread when we asked... had an attitude. I end up trying the shrimp and chicken gumbo shrimp was over cooked and did not even look or taste like gumbo. Bf got the meatloaf and the mashed Potato was clumpy and cold, also our fried macaroni and cheese was super dark and hard. It was an awful experience.. I don&amp;#39;t think I can go back even though I love their factory combo and cheese cake.", "rating": 1, "date": "6/19/2018"}, {"text": "Good restaurant for a chain. Good food for a chain it takes forever to get seated but once you get seated it goes quick. Food came a lot faster than I expected for how busy it is. The prices are kinda high but the portions are huge. I wouldn&amp;#39;t come back but that&amp;#39;s only because I don&amp;#39;t like chains but this chain wasn&amp;#39;t bad at all.", "rating": 4, "date": "3/14/2017"}, {"text": "So my family and I went here the other day... That was a horrible decision. Even though they have like 1 million things on their menu it doesn&amp;#39;t seem like they can even perfect one. I was highly disappointed and over spent way too much money and wasted time here.  It was the equivalent to having food from a frozen bag.  It was not clean I was overcrowded and the food was subpar by all means.  The only thing that was satisfying was the beer, which I might add the waitress delivered the wrong one the first time.  I don&amp;#39;t want to say I hate it but I have a had some great times at CheeseCake when I have gone in the past.  I don&amp;#39;t think I will be visiting here again.", "rating": 1, "date": "2/25/2014"}, {"text": "Presentation A1 food AMAZING service like no other! i recommended coming here if you&amp;#39;re looking for amazing food at a cheap price!", "rating": 5, "date": "5/21/2017"}, {"text": "We called in the morning to make  a reservation at 5:00 for a birthday gathering for my wife&amp;#39;s father, but Cheesecake Factory said that they wouldn&amp;#39;t take reservations. My wife and were told there wouldn&amp;#39;t be any problem getting in at 5:00. We arrived at 4:45, and there was a one and a half to two hour wait.   Needless to say, our plans were ruined. They shouldn&amp;#39;t have told us that we could get in; we could  have made other plans. My recommendation: don&amp;#39;t go here on a weekend evening unless  you&amp;#39;re prepared for, and don&amp;#39;t mind a two hour wait.", "rating": 1, "date": "1/30/2016"}, {"text": "I was so glad to finally be able to eat at the Cheesecake Factory! I had stopped in a few times to just get cheesecake, and was definitely not disappointed! <br&gt;-the red velvet is my favorite, by the way-<br&gt;I went with four friends, and none of us had been here before and it was amazing! <br&gt;I had the Chicken Madeira, and loved every bit of it! It&amp;#39;s highly recommended! <br&gt;I cannot wait to go back again!!", "rating": 5, "date": "2/19/2014"}, {"text": "Good foods and place but we don&amp;#39;t wanna go anymore, because good serves it&amp;#39;s the best way to keep customers, but we didn&amp;#39;t get it this time.", "rating": 1, "date": "2/25/2018"}, {"text": "So disappointed on my engagement day!!! My boyfriend suprised me and took me here for the first time after he popped the question last weekend. I ALWAYS wanted to come here but never had the chance. First we waited 40 mins to get seated WITH a reservation. Second of all they brought me the wrong food! I ordered farfalle chicken &amp;amp; garlic which had tomatoes in it and I told the server I am allergic to tomatoes when ordering and on top of that they did not include the mushrooms in the dish which I love mushrooms. I had to send my dish back due to the tomatoes and was told it would be 30 mins to get it remade. Instead of waiting my fiance shared his chicken Madeira which was good but Luke warm when they brought it to our table. The best part of the meal was the calamari, the banana cream and white chocolate rasberry cheesecake. The service wasn&amp;#39;t that great either we had to wave down our server for drink refills and waited 30 mins after we were done eating for the check. Sadly this is not what I would of expected for a nice restaurant. As much as I wanted to love this place they did not deliver on a very special, memorable day.", "rating": 1, "date": "8/17/2016"}, {"text": "When going in the evening the lights are down low to the point you have to literally use your phones flashlight to read the oversized menu. I have definitely had some good tasting dishes and cheesecake but the Alfredo Chicken Pasta is horrible. There is literally no flavor whatsoever. I&amp;#39;d never waste 19.99 on noodles, can sauce, and a tiny piece of charred chicken. The cheesecake is also overpriced. $18 for 2 pieces? Come on!", "rating": 1, "date": "6/13/2016"}, {"text": "Why a 3 and not a 4. Not sure. I haven&amp;#39;t been here in about 3 years. Happened to be shopping Southdale. Put our name in- it was a 40 minute wait. We took the buzzer and walked the mall. We knew we wouldn&amp;#39;t get beeped out of range. Came back and when we checked in they took us off hold. Some restaurants would have said too bad and put us back at the end of the line. Points scored! We ordered the chopped salad and the veggie burger. Both were good not amazing but really good. What surprised me was how attentive and good our service was. I poo poo chains but this one isn&amp;#39;t bad!", "rating": 3, "date": "8/18/2014"}, {"text": "The food was amazing, but the service was truly slow. We read some other reviews before coming but still decided to dine. Things are pricey but delicious. VERY SLOW THOUGH", "rating": 3, "date": "4/7/2018"}, {"text": "Emphasis was on &amp;#34;Factory&amp;#34; that night (11/26), especially with a party of 8. <br&gt;<br&gt;It started off odd. We had been told there would be a 15-20 minute wait. We were standing around (all seats/benches occupied with other wanna-be diners) for about 5 minutes when the pager went off. Excited that the wait was shorter, I showed others in our party and turned around to the host stand. Some host/manager guy said, hey, it&amp;#39;s going to be about 15-20 minutes. I didn&amp;#39;t know how to process the information, so I just said, &amp;#34;um, yeah, you already told us that.&amp;#34; I thought about it and the people behind me that thought we were going to sit down and said, &amp;#34;really, you paged me over here to tell me that? I thought our table was ready.&amp;#34; If it was a huge change in wait, I could see that, but it was more just odd.<br&gt;<br&gt;The food was mostly well-prepared, but the service was uneven. Any time you have people at the table going, &amp;#34;oh, you guys go ahead and eat,&amp;#34; you know there&amp;#39;s trouble because enough time has elapsed that everyone&amp;#39;s wondering where everyone else&amp;#39;s meals are. There was about 5-10 minutes between the first plate and the last plate getting laid down. And no, no one ordered anything unusual or wanted special modifications. It was a weird night service-wise. The server was very personable and attentive at the table, but it took a while for drinks and bread, then we&amp;#39;d have these gaps of time where we wouldn&amp;#39;t see him for a while.<br&gt;<br&gt;Their drink menu has a section of martinis - but none of the drinks on it are martinis, they&amp;#39;re just these weird made-up sugary concoctions of bizarre flavor combinations. There was - honest to God - not a single martini on the page. I had to manually order a martini, specify an actual gin, and ask for olives. Sheesh! And it basically sucked. I hate that word, but it fits in this case. Made me feel like a idiot even ordering it. Oh well.<br&gt;<br&gt;Oh well, and about the menus, this is rich. These guys are so hard up for money, that they actually put ads for other stuff inside their menu. Not some food tie-in, just other stores at the mall (Southdale). So while I&amp;#39;m looking over the ridiculous non-martini Martini section, on the opposite page, I have some model leering at me with tacky-looking jewelry from some store in the mall. Ha!<br&gt;<br&gt;Another pet peeve - I ordered one of their burgers with fries. The fries came in a little metal bucket with a paper liner. The fries were just luke warm. Everyone that wanted to try one did what I did - ate 1-2, then no more. They&amp;#39;re just gross when they&amp;#39;re not hot. Oh, and if you&amp;#39;re serving a burger with fries, you bring ketchup. Don&amp;#39;t make me ask for it. That&amp;#39;s another few minutes of waiting right there. They didn&amp;#39;t even bring a bottle, just a little dressing bowl with a dollop of ketchup in it. Boo!<br&gt;<br&gt;Okay, soapbox mode off, but it was a strange dining experience. Oh, and yes, they do serve cheesecake.", "rating": 3, "date": "11/30/2013"}, {"text": "The service was excellent. The one problem I had was one of the pasta dishes. Tomato basil pasta, it was good,  but there was too much garlic. It pretty much overpowered the dish. I left with a horrible nasty taste of garlic.. I am choosing a different dish.", "rating": 3, "date": "10/28/2016"}, {"text": "I guess you could say I&amp;#39;m a big fan of The Cheesecake Factory. I have never had anything here I didn&amp;#39;t like. Their menu is a little out of control with all the options, but everyone should be able to find something they want. <br&gt;<br&gt;The wait staff is great, they have always been very friendly, helpful, and knowledgeable of the 20 page menu. <br&gt;<br&gt;The food is always fantastic, and you can&amp;#39;t leave without a piece of their cheesecake. If you like chocolate, I would suggest the Godiva Chocolate Cheesecake, it&amp;#39;s like having chocolate silk in your mouth.  <br&gt;<br&gt;Parking at Southdale is annoying, and sometimes you have to wait, a long time, but if you plan it right and don&amp;#39;t come during busy times, you&amp;#39;ll be seated right away.", "rating": 5, "date": "12/4/2013"}, {"text": "Overpriced. But I seen that a lot on here and I had a gift card, so I had to use it eventually (don&amp;#39;t typically go to eat at places connected to a movie theatre)  had about a 3rd of my meal dumped on me by whoever brought the food out. Her only response was &amp;#34;this happens all the time&amp;#34; and then she ran off. When the waiter came back and asked how was everything, I told him it was ok despite a large portion being dumped on me, his response even better, &amp;#34;how rude&amp;#34; as he hurried away.", "rating": 1, "date": "3/26/2017"}, {"text": "I&amp;#39;m reviewing purchasing cheesecake to go from the counter.  I have eaten here before, but I hate the food.  Everything I&amp;#39;ve ordered has been terrible.  I think they should stick to cheesecake, but anyways... on to my actual review.<br&gt;<br&gt;I&amp;#39;ve ordered cheesecake several times to go from here.  Cheesecake is good, and the Cheesecake Factory does it best (most of the time).  I picked up two pieces for Valentine&amp;#39;s Day - Cookie Dough and Kahlua.  One old favorite and one new flavor, which is how we generally do Cheesecake Factory takeouts.  The Cookie Dough we had tried before and LOVED.  This time, it had walnuts all over the top.  We do not recall that from last time, and for me walnuts kill it.  I thought it was actually nasty with nuts on it.  Very disappointing.  The Kahlua was good though.  Cookie Dough I&amp;#39;ll never order again now.<br&gt;<br&gt;The biggest downfall this time was that I left with two very small slices of cheesecake and spent $18.  They&amp;#39;ve halved their slices and increased the price.  They have good cheesecake, sure, but they are bordering on robbery at this point.  It ain&amp;#39;t THAT good, guys.  Maybe tone down the ripoff factor before you&amp;#39;re charging 20 bucks per chew.", "rating": 2, "date": "2/15/2014"}, {"text": "I love this place! I live 30 minutes away and always make a trip to get some of their red velvet cheesecake. The service is average but the food makes up for it. Some of my favorites: fried zucchini, Louisiana chicken pasta, and brown bread (free). The menu is very large and it is easy to get overwhelmed.", "rating": 4, "date": "1/3/2016"}, {"text": "Worst experience we have ever had I would give 0 stars if i could. We waited for over an hour for our food then the manager brought it out and said she was sorry but they messed up and had to recook one of our meals. Then when we tried to eat the food it was obvious what they had done. They let the food sit and then tried to reheat it. The food was cold and soggy bit the plates were hot. And if this was not enough the manager came back and said she was not going to charge us for the food, my response was well thats good since we cant eat it anyway. Now after an hour drive to get there, 40 min waiting for a table and 1 hour waiting for food we still have to go get dinner. This is most certinaly not what we expect from the cheese cake factory and to make matters worse it was my wifes birthday dinner.  We wont be going back.", "rating": 1, "date": "3/17/2018"}, {"text": "I would like to say to food taste was great Great job kitchen staff. But have to say this restaurant has gone down hill like a lot of the establishments here in Edina Mn .I am not sure how these restaurants get away with serving dirty dishes to the customer and management and the health department thinks it&amp;#39;s ok . I have been a professional Chef for over 10 years and that would not fly in any of my restaurants. Accidents happen but to have five count it three forks a plate and food in the water glass that I never drank out of. That should tell you how many people our eating with dirty utensils at this establishment . I would warn the public beware someone is going to get sick and the manager does not care .  SO PLEASE BE SAFE IF YOU TAKE THE CHANCE AND EAT IN EDINA MN YOUR MAY BE SORRY LATER.", "rating": 2, "date": "3/10/2016"}, {"text": "Love this place, very classy, we went for lunch, great food, good size portions. Our server was very friendly, offered a variety of choices both for meals and cheesecake!", "rating": 5, "date": "3/8/2017"}, {"text": "I know this is a chain, so forgive me since this is the only one in the Twin Cities.  This location is adorable and classy on the inside.  I will say that they don&amp;#39;t take reservations for large groups and it can be difficult trying to squeeze everyone in (we ended up being split into adjacent booths).  I prefer heading in for lunch, but not always in the area to do so. The cheesecake is pretty badass.", "rating": 3, "date": "6/8/2014"}, {"text": "Went in waited 46 minutes to get food. Bartender even said our food was 15-20 minutes late than usual. Wait Nd finally ask for bread. We finally get our food it wasn&amp;#39;t hot it was warm to touch! Then I start eating Nd there&amp;#39;s pork in my food!!!! Mgr comes n has some nerve to give me a bill for my bf food yet his got cold waiting to get my food corrected. I left crying bc I DONT eat pork Nd the mgr acted like it wasn&amp;#39;t that big of a deal. Had nerve to ask if I wanted food remade so I can wait another 20-25 minutes for FRESH HOT FOOD. Yet my bf food is cold now Nd want to give me a bill for it. Horrible management nd service. I truly felt bc we were of minority&amp;#39;s we didn&amp;#39;t get the service most did. I found it funny how couples who came in 30 minutes later had food yet a refill on our drinks wasn&amp;#39;t happening. Then I get an email yet NOTHING IS DONE! This location is by far the worst. NOBODY HASNT EVEN ATTEMPT went in AGAIN THINKING ANOTHER CHANCE NOPE I FOUND A TOOTHPICK A TOOTHPICK A USED ON IN HALF  PIECE IN MY MASH POTATOES DONT COME HERE ITS A WASTE OF MONEY THE WORSE MANAGER THERE IS THE HISPANIC ONE LIKE HES JUST A WASTE", "rating": 1, "date": "3/9/2019"}, {"text": "My experience was truly appalling. The food we ordered was given to the table next to us. We understand that this happens, but the person that delivered the food (not our waiter) left and the person at the other table started picking through the dish noticing it wasn&amp;#39;t what he had ordered and asked his companion to try it to see what she thought it was. When the server came back with the parmesan, the gentleman asked if this was what he ordered. The server went back to the kitchen with the dish to check and came back out WITH THE SAME DISH and turned to our table and said &amp;#34;This is actually yours&amp;#34; and SET IT DOWN IN FRONT OF ME! When I made a face she said &amp;#34;It hasn&amp;#39;t been eaten, but I can exchange it if you really want&amp;#34; to which I replied that I would appreciate a new dish. She rolled her eyes and went back to the kitchen. When our &amp;#34;new&amp;#34; food was brought out, my companion&amp;#39;s dish was hot and fresh and mine was cold...and the same dish that had been previously delivered, fork marks and all. At this point I was frustrated and picked at the dish until our waitress returned in time to box up our food. When she came with our bill we told her what all had occurred. She was sincerely apologetic and said she would inform her manager and have him stop by our table. The manager never came by. I am outraged that any establishment would try to reserve food mistakenly given to another table that HAD BEEN TOUCHED even after I specifically asked for a new dish. Disgusting.", "rating": 1, "date": "2/18/2018"}, {"text": "Our server totally ruined our experience in my opinion. I would have given this place a much higher rating had she not been such a b*&amp;amp;%h. She had no emotion, was pretty rude, obviously didn&amp;#39;t want to be there...and made it really obvious. When we said goodbye to her, she didn&amp;#39;t even say anything even though there&amp;#39;s no way she couldn&amp;#39;t have heard us. RUDE.<br&gt;<br&gt;Anyway, the food here was fine - we came for chocolate chip cookie dough cheesecake and appetizers. The cheesecake was really good and a generous sized portion but really, really rich. I&amp;#39;m not sure my stomach can handle this anymore. <br&gt;<br&gt;My Mom had the potstickers and my Dad had the chile rejos (have no clue how to spell that) and they both seemed to like them.<br&gt;<br&gt;Like every cheesecake factory, this place has an impressive selection of food and is generally pretty consistent. Just don&amp;#39;t sit in the bar with the totally rude server. <br&gt;<br&gt;$25-ish in total plus tip. Standard for this kind of place.", "rating": 2, "date": "8/8/2013"}, {"text": "Worst service ever! I called for take out and over an hour and forty-five minutes later, still no food. They were very nonchalant about the entire thing.", "rating": 1, "date": "8/2/2016"}, {"text": "If you&amp;#39;re looking for a place that is open after midnight then you found it. Yea, I was surprise too! They are open till 12:30am on fri and sat.. regular days till 10pm<br&gt;<br&gt;I admit, I&amp;#39;m a fan of this chain. the service is always satisfactory and the price is very reasonable. Because this is the only cheesecake factory in the state of minnesota, it&amp;#39;s always busy. Expect to wait 40 mins during dinner hrs BUT only 10 mins during the late weekend. Like I&amp;#39;ve mentioned on my tip, I&amp;#39;m a devoted  lover of their Fettuccini Alfredo w/ chicken. I&amp;#39;ve been ordering the same dish for the past 12 years. It&amp;#39;s so rich in cream and the sun dried tomatoes definitely adds a zest to the taste. I also would recommend their miso salmon- the glazed salmon and rice goes perfect together. i tried to mimic their garlic noodles at home- mission failed. I&amp;#39;ll stick to ordering from cheesecake instead.<br&gt;<br&gt;as far as cheesecake goes, i like their white chocolate truffle and the Oreo one is great too.... but if you like red velvet like i do, skip the cheesecake and go for the ultimate red velvet cake instead!", "rating": 4, "date": "4/15/2012"}, {"text": "We went with the family and the server was great. He did so good. My brother in law was happy and is very very hard to please him. Great job. I love the fettucini alfredo. Will come back again.", "rating": 5, "date": "12/26/2016"}, {"text": "The Cheesecake Factory has been around forever, and yet, is still popular enough to encounter a 40-minute wait at 1:45 p.m. on a Saturday. Crazy. <br&gt;<br&gt;I usually dodge requests to go to the Cheesecake Factory because I&amp;#39;ve never not encountered a wait, but I relented over the weekend. The upside to waiting is that you can head into the mall and do some shopping as you wait for a table to open up. The buzzer won&amp;#39;t work, but staff are good about letting you know an appropriate time frame for coming back. <br&gt;<br&gt;The menu here is just obscenely huge. Whatever you&amp;#39;re hungry for, they probably have it. I ordered just a basic hamburger and was pleasantly surprised by how perfect it was. No frills, just cooked to order and tasty. <br&gt;<br&gt;My dining partner got the club sandwich and was also happy with her order. We split a piece of white chocolate raspberry cheesecake for dessert and while it had an excessive amount of whipped cream decorating the top, it was delicious. <br&gt;<br&gt;Wait staff here are very good - attentive and friendly. If this place took reservations, I wouldn&amp;#39;t hesitate to head back soon.", "rating": 4, "date": "3/17/2014"}, {"text": "Had an amazing dinner at the Cheesecake Factory, the Thai lettuce wraps for an appetizer were amazing, and so big! The food came right after our appetizer. The whole experience was fast and delicious and our serve was perfect! Our drinks were to die for too!", "rating": 5, "date": "6/6/2016"}, {"text": "Not impressed. If I pay 120$ for 3 entrées, 1 app, 2 drinks &amp;amp; 2 desserts I expect way better. Service was slow. They got our order wrong twice. Tip to wait staff: if u r refilling a drink, 1st bring the new one THEN take the original away. Don&amp;#39;t take my drink to remember what to bring back. Wait staff left fallen dirty utensils on the floor. Bathroom (ladies) was dirty, garbage overflowing. We left our app plates at edge of table when we were done. Waitress left them there as she walked by sev x. I left my credit card on edge of table for many minutes trying to get someone to take our dessert order and get our bill bc we were late for a movie. Ok. That said food was REALLY good. Way too many restaurants to try close by. Don&amp;#39;t bother w this one.", "rating": 3, "date": "4/3/2016"}, {"text": "I visited this restaurant with two friends. We went in on early evening time and were seated after 10 min wait. The waiter came over and asked us for our orders. We told him to give us few minutes to review the menu. We finally ordered and our food took almost half an hour to come out. When the food came out 2 out of 3 were messed up. We complained to the waited and he didn&amp;#39;t seem concerned. He responded if you need to complain i can get you a manager. They didnt bother even correcting the orders. When manager came out he sounded like he is used to such complaints and asked us what he should do. Worst part, the two people who had their food messed up both got food poisoning the next day. I missed work for almost two days because of the food i was given. Overall experience was terrible and i will never go back to this restaurant again. I warned my family members and friends about this place and the terrible experience we had.", "rating": 1, "date": "9/19/2018"}, {"text": "Love the shrimp scampi &amp;amp; combos...happy hour aps are great deals and food  comes out always PERFECT.....Love it!!!", "rating": 5, "date": "3/20/2016"}, {"text": "Usually the restaurant does a good job. Servers are nice and the food is great. Today, my server was not very attentive. She seemed to avoid her tables, didn&amp;#39;t bring bread out until 30 min after we sat, we asked the host for water refills and the two tables next to us had empty beverages. Someone at our table didn&amp;#39;t get her salad.", "rating": 1, "date": "8/15/2015"}, {"text": "Service was slow and server was distracted and inattentive. We waited 40 after ordering for the food and missed our movie. When we finally received the food, it had been made incorrectly and had to be sent back. The manager seemed unwilling to do much about it.", "rating": 1, "date": "8/15/2015"}, {"text": "If I had to give you a grade for our latest experience or would be an F- ! Normally we love it but after this time I doubt that we will ever return. I am a current restaurant manager and Having been in the restaurant industry for over 15 years I of all people understand being busy and how things happen.  for starters we arrived at the restaurant at 5:50 on a Saturday, they quoted me about an hour wait for my family of 5, my wife and 12yr old 9yr old and 3yr old, which was fine and expected so we took that time to walk around the mall and have a nice family evening together we ended up being seated at 6:30 so less than an hour which was great! All was good we were having fun and enjoying our night, our server stopped by right away and brought our drinks in a timely fashion and we placed our order for our appetizers at 640, but that is where the good ends. The music was so loud the server had a hard time hearing us order. then our spinach dip and Tex-Mex egg rolls took about 15 minutes and our spin dip was delivered first and the chips were so greasy and shiny there was a pool of Grease on the plate under the chips which we told the food Runner who brought our food out about when they brought our egg rolls 8 minutes later, then took another 7 min for new chips.  we placed our dinner order about 7:15. at 8:00 our server stopped back and apologized for the wait for the food.  dinner was delivered at 8:07 well everything but my son&amp;#39;s parmesan crusted chicken.  by now my 3yr old had fallen asleep.  her mac and cheese looked as though it had sat in the window for 30min, bowl was extremely hot and the top layer was dry and crusty with no cheese in sight... my buffalo chicken sandwich was not crispy by any means it was sopping in Greece and the bun was hard and dry and the fries were smushy, my wife&amp;#39;s cashew chicken was burnt and crispy, my son&amp;#39;s parmesan crusted chicken finally came out at about 8:15 and was not crusted at all the breading was wet and slushy on the chicken which the manager had ran out and that was the first we had seen or heard from a manager all night. the manager then took our food and offered to get us something else but did not come back for another 15 minutes, when he came back we told him about my son&amp;#39;s chicken and decided against ordering food that was going to take another hour and just decided to order some cheesecake to go. by then we had been there for over two and a half hours, and had expected the manager to stop back.  he never did.  our to go cheese cake took another 20 min.  I tried to find the manager but noticed that standing and talking to a few servers was more important to him than guest satisfaction. the server proceeded to drop off a check at 8:47. I told her we were not paying for anything tonight as none of its even ate dinner and we had now been there for going on 3 hours.  Absolutely terrible and disappointing.  never once in that entire time we were there did I see a manager touch a single table,  more did they seem to care if we would be back or not.  as a location of a corporate chain you cannot simply rely on the popularity of your brand to keep business. we will definitely not be back and I have passed this experience on to everyone I know and everyone I spoke with agreed that Southdale Cheesecake Factory food quality and service are going down the toilet which is sad to see cuz I myself used to work for Cheesecake Factory and know the standards that are to be held in that restaurant", "rating": 1, "date": "11/26/2018"}, {"text": "The Cheesecake Factory is really good! I love the Four Cheese Pasta. It has all these different cheeses in a pinkish sauce with penne. Then there&amp;#39;s ricotta cheese in the middle. It was AMAZING. Literally. The service is very good but the reason I gave it 4 stars is the wait. Didn&amp;#39;t expect a table right away and I guess for this restaurant 1 hour 10 minutes isn&amp;#39;t that long. The cheesecake is really good, and I don&amp;#39;t even like cheesecake. Very good for birthdays or special occasions.", "rating": 4, "date": "11/4/2013"}, {"text": "We&amp;#39;re from Chicago and visited Minneapolis for Father&amp;#39;s Day weekend. My husband and I couldn&amp;#39;t agree on a &amp;#34;new&amp;#34; restaurant to try, so we decided to go to Cheesecake Factory because in Chicago it&amp;#39;s always a solid choice; food is always good and you know what you&amp;#39;re getting. Sadly, this wasn&amp;#39;t the case at this location. We ate here twice on this trip and we were disappointed both times. <br&gt;The first meal was dinner. I ordered the Ne Orleans Shrimp, which is a dish I&amp;#39;ve had frequently at Cheesecake Factory&amp;#39;s all around the country. On this particular occasion, it was cooked with the wrong sauce (it was yellow) and it had a curry-like taste to it. This ruined my entire meal and it was really late, so I didn&amp;#39;t have the energy to complain and wait for a new meal to be prepared.<br&gt;The next meal we had here was brunch on Father&amp;#39;s Day. We ate here mostly be use of convenience. Every other restaurant had a long wait and we were trying to make it to the Twins game. Anyway, my husband ordered egg whites, ham, and toast. My son&amp;#39;s ordered &amp;#34;crispy&amp;#34; bacon with their meals. So, all of the food came out except my husband&amp;#39;s. The waitress said that the cook forgot to only cook egg whites. So, about 7 minutes later, my husband gets his food with steaming hot eggs and cold meat and toast........yummy!!! Next, they only brought bacon for one of my sons and it was no where near crispy. We requested crispy bacon again and the waitress attempted to take my 4 year olds entire plate of pancakes back to the kitchen, just to get crispy bacon. The distraught look on his face was all she needed to sit the plate back down and she said she would just bring a side of bacon. So, she shows up about 1 minute later with some COLD crispy bacon. I imagine this was pre cooked bacon used to top salads and/or soups, because it obviously wasn&amp;#39;t cooked that fast. We were tired of going back and forth an my son starting eating it so we just left it alone. My other son&amp;#39;s bacon was never brought out, but we just told our waitress to take it off the check. So........on future trips to Minneapolis, we now know that Cheesecake Factory IS NOT an option and we would NOT recommend this place to anyone. PAY ATTENTION TO THE LOW STAR RATING ON YELP!!!!", "rating": 2, "date": "6/18/2013"}, {"text": "Average appetizers and entrees.. Great dessert options. Service is hit or miss Always crowded and a bit cramped for space", "rating": 3, "date": "11/30/2015"}, {"text": "Food was good, but not for the price. Really expensive, for two adult meals, one kid meal, non-alcoholic drinks, and two pieces of cheesecake, bill was about $80. I&amp;#39;ve had better food at Applebee&amp;#39;s.  Service was good though. The wait was long, but that was expect used since it is a popular place to visit. The restaurant was clean and neat, bathrooms were also clean.", "rating": 3, "date": "12/6/2015"}, {"text": "Life in a restaurant inside a mall. Hmm not much my scene. Standard chain restaurant food. Excellent service here on two occasions! Really awsome happy hour! I think these places will do ok with all the new apartments going up around southdale.", "rating": 3, "date": "8/30/2015"}, {"text": "This place is always packed since it&amp;#39;s the only one in the city. I think of it kind of as an upscale family restaurant, that&amp;#39;s neither really good at one thing or the next. We waited 40 min for our entrees on a Sunday night. Food portions are decent, but overall you could probably find better versions of their items at different restaurants, ie pasta at an Italian restaurant", "rating": 3, "date": "1/10/2016"}, {"text": "Good grief, I have gone to this location maybe 8 times for dinner with the family, it has gotten worse each and every time to the point I have said never again. Last time was 3 disgusting glasses with stuff floating in them and one with what appeared to be chocolate chunks in my scotch along with a few dirty utensils.<br&gt;Tonight was crazy dumb. My chicken and cashew was not good enough for crows to eat. A gross unflavored breaded and deep fried chicken (the same chicken in one of my kids Orange chicken) with a sauce you couldn&amp;#39;t make that bad if you tried to make someone sick, no spice and flavor of dirty leather. One had the catfish and liked it, one pasta (which is always fair) the other Sheppard pie ( better than mine but thyme and burger I can make at home in 4 minutes) .<br&gt;Service from our waitress Alex was well below normal, with virtually no concern of what anyone  thought of the food and two dishes taken away, eventually, with no questions as to why we wanted no boxes and nothing was eaten -gross.<br&gt;Desert only if you go and make sure you plate, silverware and glass is clean.<br&gt;We have had some super sweet servers over the years here but tonight&amp;#39;s was crazy bad.", "rating": 1, "date": "5/14/2015"}, {"text": "I get that the identity is their cheesecake, but the pasta tasted like play-dough covered in salt sauce. I vowed never to eat here again but I keep getting pulled back in by someone craving cheesecake, and even when I try to explain that their cheesecake is average, they don&amp;#39;t listen! Seriously most of the variations of cheesecake they have are just gross and excessive, even the standard is nothing special.", "rating": 2, "date": "2/7/2015"}, {"text": "Great food, quick to seat.  Cooks slow and waitress said they were new. Crispy crab Rangoons looked liked it had burnt ends but was tasty.", "rating": 4, "date": "12/17/2015"}, {"text": "First time eating at this location. Restaurant was clean, the service was excellent and the food was awesome. The desserts were hard to pick from because they all sounded good.  In the end we tried an Oreo and Smore  cheesecake along with a Stawberry shortcake. I would eat here again for sure.", "rating": 4, "date": "7/25/2015"}, {"text": "The restaurant is nice.  The atmosphere is great but they cut your cheesecake thinner then other cheesecake factories. I feel like if I&amp;#39;m going 2 pay $8.50  for a slice of cheesecake then cut me a decent slice. Customer service was decent.", "rating": 3, "date": "7/10/2016"}, {"text": "I know and understand the complaints about the Cheesecake Factory and the fact that this restaurant is trying to cater to Edina residents with its&amp;#39; decor while catering to the Sumo Federation of America with its&amp;#39; portions, I really can&amp;#39;t complain based on the fact that huge portions make me happy.  It&amp;#39;s overwhelming to look through the menu with no idea what you&amp;#39;re feeling like so I would suggest picking a genre of food before showing up or you may find yourself in desperate tears while the waitress looks at you with a knowing condescension.  <br&gt;<br&gt;It really is lovely inside and the food is better than PF Changs.  <br&gt;<br&gt;What - it is.", "rating": 4, "date": "12/12/2012"}, {"text": "Noisy, slow service. Quality of the food was poor.<br&gt;Saturday night is definitely not the time to go.<br&gt;So dark it is hard to read the complex menu.<br&gt;We had to wait n hour to be seated.", "rating": 2, "date": "5/31/2015"}, {"text": "Bartender has good service skills. He even caught my bill mistake before I had a chance to say something to him. My food got skipped, and he personally checked to see what was going on. Unfortunately the food isn&amp;#39;t nearly as good as it used to be. And it is more overpriced that it used to be.", "rating": 3, "date": "10/21/2015"}, {"text": "What happened to this place?? Service is so slow!! Bar is so slow!! Kitchen is so slow!! And the Kitchen can&amp;#39;t seem to get the orders right. A real disappointment. Been there 30 times and it&amp;#39;s really gone downhill.", "rating": 1, "date": "2/12/2016"}, {"text": "This is definitely a beautiful place inside and out. This place is great for large groups and a place to take people from out of town. The service is always outstanding. They have something for everyone but on downside to that the menu can be overwhelming it is actually a book. Great happy hour specials on apps and drinks. This is definitely a place that I will always go back to. Avocado Eggroles, Louisiana Chicken Pasta, and Dulce De lecha Carmel Cheesecake, so so good, and Fresh Banana Cream Cheesecake I don&amp;#39;t really even like bananas but the banana is not overpowering. Very good. I have also been wanting to try breakfast/brunch I bet it will be awesome.", "rating": 5, "date": "4/14/2015"}, {"text": "The wait time was incredibly long, but sometimes that happens. The food was great, however our waitress was very snappy and did not care to give us the time or the courtesy to take our time to decide on what we wanted. She mainly just wanted to get us out as soon as possible to bring another group in. Other than that experience, we enjoyed the food and the environment.", "rating": 3, "date": "6/8/2016"}, {"text": "White chicken chili was quite good, though more like a chicken gumbo than a white chili.", "rating": 4, "date": "11/3/2015"}, {"text": "The food is medium - their salads are large in size and delicious, but some of their other items are basic. I highly recommend the luau salad and the avocado egg rolls. I also love the brown bread - it&amp;#39;s one of my favorite things even though the basket comes with every meal.", "rating": 3, "date": "7/30/2017"}, {"text": "Lots of food for the price and friendly service.  A young adult hangout spot that isnt in minneapolis.<br&gt;<br&gt;Ive had a ton of stuff on the menu and its always great.<br&gt;<br&gt;Get here early on friday or saturday nights.<br&gt;<br&gt;Waits can sometimes be 1-2 hrs.", "rating": 5, "date": "6/21/2013"}, {"text": "Went here for date night. Partially because it was only 1 of 2 places we could actually find in a mall over-run with people just &amp;#39;hanging out&amp;#39; before seeing the new Star Trek movie (Awesome).<br&gt;<br&gt;Place was packed so we sat at the bar, next to a 3 year old. Is that even legal?<br&gt;<br&gt;Maddie and Tasha were very attentive and chatty, probably because they were 2 of 5 employees behind the bar.<br&gt;<br&gt;Drinks were reasonable but found the food nominal and over priced. Overall it would have been a better deal to stick to my neighborhood places (I live in downtown Minneapolis) but they closed the movie theater in Block E.", "rating": 2, "date": "5/29/2013"}, {"text": "This is definitely my go to restaurant for any special occasion. Always a great experience and great food. They literally have pages and pages of options for you to choose from so your sure to find something no matter your mood. Tons of Oh em gee Cheesecake flavors too of course. Nice atmosphere and pretty decent staff that always hustling to bring you a nice dining experience :)", "rating": 5, "date": "10/29/2015"}, {"text": "It&amp;#39;s a Cheesecake Factory. What more needs to be said?!<br&gt;<br&gt;Realistically, it&amp;#39;s probably only a 4-star joint, but because my wife and I live in Fargo now we have to drive all the way here for a Cheesecake Factory or P.F. Changs. We miss living in a real city, and this place makes our visits all the more special.", "rating": 5, "date": "6/19/2013"}, {"text": "They have great desserts which most people know about. Beyond that there is not much to venture out for. The place is loud and difficult to hold a conversation.", "rating": 3, "date": "12/29/2014"}, {"text": "My daughter and I recently had dinner at the Cheesecake Factory at Southdale Center in Edina. Prior to this visit I had always had good food and service. But after this experience I will never go back. We waited an hour for our food. The table next to us was seated, ordered, ate their food and left and we had still not gotten our food. When we inquired, we found out our food had been made but was put aside and our server did not know. Then again, she never checked. Our meal tasted like it had been sitting out for an hour. Wilted salad and lukewarm burger and fries. We did speak with the manager who was very gracious and gave us complimentary cheesecake which was wonderful. I appreciate the cheesecake, but unfortunately we will not be back.", "rating": 1, "date": "3/25/2016"}, {"text": "Service was absolutely amazing and fantabulous. The Thai glazed salmon was the best seafood I&amp;#39;ve ever had. Love it.", "rating": 5, "date": "3/6/2016"}, {"text": "I used to really enjoy this place when it first opened at the Southdale Mall in Edina MN. So many amazing dishes. Good service. And cheesecake!  I think it goes downhill from time to time, though.  A few years ago, I found that the floor was too slippery and greasy and the restrooms had missing doors. No problem with that now. But has it always been as dark as a cave? This is the second time I&amp;#39;ve been there when it was so dark that I had to use the flashlight on my cell phone to order.  And I don&amp;#39;t recommend the crab and artichoke dip. The &amp;#34;grilled bread&amp;#34; that comes with it is really just awkwardly oversized rough croutons.  No fun to eat. Besides, the dip is too salty.  I sent it back.  Service was s-l-o-w.  Oh, Goodness!  We got seated right away; it was not that crowded.  But getting each thing took a ton of time.  We were there about two hours.  They were out of the cuban sandwich I&amp;#39;d planned to order, so I settled on the miso salmon.  There are just 5 snow peas in that dish. And the white rice I ordered turned out to be brown instead. I liked the waitress, but I she did not do that well for us. Other than that, it was OK. My husband&amp;#39;s egg dish was perfect.  I will try them again in a year or so. Or not.  A little pricey for this level of disatifaction.", "rating": 2, "date": "8/8/2018"}, {"text": "First and last time we go here due to awful customer service. My wife and I came after a movie since it was one of the few places open after 10 pm.  We were seated by a hostess that hardly acknowledged us. We sat outside. It was not particularly crowded. After putting our order in, a guy came over to tell us there was a glitch in the system and asked again for our order and he would get it in right away. After that we received a soup fairly quickly. 30 minutes later, the waiter came to clear the bowl. We told him to cancel the drink order that never came. 15 minutes later, my wife&amp;#39;s order came which was essentially apiece of bread with some avocado spread on it so not sure why it took over 45 minutes.  At that point, I asked the server (who was not our waiter)if my order was coming and if not to cancel the order. The waiter came back a few minutes later and I asked for the check. He said the manager would come over though I hadn&amp;#39;t asked for that. He brought the check and the soup and the avocado toast were in the bill. We split my wife&amp;#39;s toast, the manager never showed and we left cash and left. There were so many ways they could have made this a better experience. Apologizing would have been nice. A discount or the manager actually showing up would have helped. A drink or dessert might have helped. Instead they received a lousy review and a customer that will never go back. I have been to Cheesecake Factory&amp;#39;s all over the United States and this was hands down the worst. Although the food was pretty good, this experience turned me off to this so-so chain for good. I totally fault the management for not training or overseeing the inexperienced wait staff. There seemed to be other tables handled by competent staff, but we had at least 3 we came in contact with that did not seem to have a clue.", "rating": 1, "date": "8/4/2018"}, {"text": "It was a little busy but we found a place at the bar. And boy are we glad we did! A young man by the name of Patrick was our bartender- he was friendly and knowledgeable about the menu- thank god because there was a lot to choose from! I had the Ruby red sunrise and my partner had a Pineapple Moscow mule. It was a special visit for us mainly due to the outstanding service! Great job Patrick &amp;amp; the Edina Cheesecake Factory!", "rating": 5, "date": "2/1/2016"}, {"text": "A restaurant chain I would probably never have intentionally walked into to have dinner at back home in Cali..... became my birthday dinner spot.  I hear this is the only Cheesecake Factory in Minneapolis?  Or.. Minnesota??!!!<br&gt;<br&gt;Well, nonetheless, I had a great meal!  I had their chicken something... it was crispy on the outside and served with asparagus and mashed potatoes!!  The mashed potatoes were my fave and their rye bread, of course!<br&gt;<br&gt;One of my friends ordered the kobe burger, but since they cooked it wrong, it took another 15 minutes or more for her dish to come out.  The rest of us were almost done by then.  The manager was extremely kind though.  He came out himself to apologize and made sure that her meal was on the house and a free cheesecake too.<br&gt;<br&gt;For a &amp;#34;family restaurant&amp;#34; though, I found it a little awkward how they were playing baby-making music when the restaurant already had some dim lighting........ <br&gt;<br&gt;Haha<br&gt;Had a great meal.", "rating": 5, "date": "2/9/2013"}, {"text": "I am a gluttonous man and I don&amp;#39;t care if you judge me. Bring out an extra biscuit, because I will mop up the gravy all day long.<br&gt;<br&gt;It&amp;#39;s not chalked full of character here, but you get consistently good food and service. The food is high quality and the restaurant is clean. Those two things alone put this restaurant in a very elite category. <br&gt;<br&gt;Great variety on the menu and awesome desserts. The only negative is the wait... They could build  second Cheesecake Factory next door and you&amp;#39;d still have an hour wait on a Tuesday night. Otherwise, we love this place.", "rating": 4, "date": "1/30/2013"}, {"text": "I went here for dinner with my boyfriend tonight.  It&amp;#39;s always so busy when I go there and this was no exception.  There wasn&amp;#39;t a wait to get seated which was nice, but it was so loud inside.  <br&gt;<br&gt;I ordered the arugala salad and fried zucchini.  While waiting for our food, we both noticed how incredibly cold it is inside.  We were hoping our server would offer us a blanket with our meals.  No such luck.  <br&gt;<br&gt;My boyfriend ordered a chicken sandwich and fries and our server said his fries would just be a minute.  He was half done with his meal by the time the fries came.  My salad was delicious.  It had raisins, almonds, and lemon.  It was really zesty and yummy.  The fried zucchini was alright but I couldn&amp;#39;t eat very many of them.  These would be better shared with a group.  You get around 9 pieces, each about the size of a wedge cut fry.   The fries that the boyfriend ordered were extremely salty.  I tried the fries and I could only eat two, and that&amp;#39;s not like me.  I tried to wipe off the salt, but they were still too salty to eat.  <br&gt;<br&gt;All in all, this wasn&amp;#39;t my favorite visit here.  Next time I&amp;#39;ll stick with what I truly went there for - the cheesecake!", "rating": 2, "date": "8/7/2012"}, {"text": "The first time I came here, I was blown away. The menu is huge, there are endless choices, and they really live up to the cheesecake part of the name with a wide selection of expensive slices. Unfortunately, they also live up the &amp;#34;factory&amp;#34; part of the name, which is really not a good thing. Their portions are generally large, which is sometimes a good thing, and other times you wonder how you are going to get rid of a plate full of subpar, bland food.<br&gt;<br&gt;If you plan on drinking, make sure to ask for prices. They don&amp;#39;t have a price list, but they will &amp;#34;guess&amp;#34; how much each drink is. Mixed drinks run around $10 and up (and aren&amp;#39;t very impressive), and beer runs around $5. Happy hour is only at the bar. <br&gt;<br&gt;I also feel it&amp;#39;s my civic duty to warn any non-meat eaters: STAY AWAY! I have had meat in my meatless dishes not once, not twice, but THREE TIMES. Each time, staff was apathetic. The first time, there was chicken (small shreds, everywhere, so at first it wasn&amp;#39;t completely apparent) in a non-chicken fettuccine. The manager came over and said, &amp;#34;oh, well, someone in the kitchen must have used the same tongs for chicken as they did for the pasta.&amp;#34; Basically, he shrugged it off, didn&amp;#39;t offer to replace our dinner OR compensate us, and said, NO BIG DEAL. JUST CROSS-CONTAMINATION IN OUR KITCHEN. <br&gt;Actually, it is a big deal, and it literally made me sick. I had to email the company and they gave me a gift card, which I used to buy their portabella and zucchini fries. Nearing the bottom of the batch, I poured them out and found, guess what? FRIED CHICKEN SKIN. I gave one to a meat-eating friend to verify, and she said it was definitely chicken. I had to stop there and laugh, but I also quickly got the check and got the hell out.<br&gt;<br&gt;I really want to love this place. It has so much potential, but between the apathetic staff, the long waits, and the subpar food, there isn&amp;#39;t a whole lot to love. Not to mention the whole cross-contamination problem, which for some reason doesn&amp;#39;t seem to phase the managers or servers.<br&gt;<br&gt;To be honest, the only saving grace of this place is their bread baskets. Seriously, so good, and so far I haven&amp;#39;t found any meat lurking at the bottom.", "rating": 1, "date": "7/9/2014"}, {"text": "I&amp;#39;ve never had a bad meal here. Love the bread they serve before the meals. The Skinnylicious meals are really good, lower in calories, yet filling. The avocado spring rolls for Happy Hour are great. Love their White Chicken Chili, Bang Bang Shrimp and their Mouse Chocolate cheesecake. So yummy. Really can&amp;#39;t have sugar any more, but if you like lemonade, try their raspberry lemonade (refillable) on a really hot day. It&amp;#39;s nice that they have an outdoor patio, too.", "rating": 5, "date": "6/27/2017"}, {"text": "Curbside pickup to go service is horrible! I love the food at the CCF. Decided to try their curbside to go since we had two kids in the car and couldn&amp;#39;t wait for an hour for table service. I called them an hour in advance to put in my order. It rang 100 times with no answer. Called back, same thing. Called back again,she picked up and said &amp;#34;let me transfer you to the bakery&amp;#34;. Then it rang another 100 times with no answer. Called again, finally got someone. Placed the order for an hour later. When we arrived at the exact appointed time, I called the special number again with no answer! Called again as I was angrily walking inside to get the order myself, then someone finally picked up. They told me my order wouldn&amp;#39;t be ready for another 5-10 minutes! Aaarrrgg! I may give this another shot and hope it&amp;#39;s just a fluke but be forewarned.", "rating": 2, "date": "12/12/2014"}, {"text": "Sigh.  Yes, the cheesecake factory has the largest menu in the Twin Cities.  It is probably a great spot to go if you have a group of people that all want different cuisine.  You can get breakfast, Mexican, Asian, burgers, and pasta all at the same place.  However, the food is only okay.  And the wait is worse!  They do not take reservations and the wait times are crazy.  Furthermore, I have never had good luck with the hostesses.  They always seem really annoyed to be working that particular day.  <br&gt;<br&gt;I will not deny that the cheesecake is huge.  They do have a take-out counter specifically for the cheesecake.  I say use that counter if you must and otherwise try to avoid the wait times here.  There are so many other unique and delicious spots in the Twin Cities - go to these spots!", "rating": 2, "date": "4/12/2012"}, {"text": "Never had a bad meal at a Cheesecake Factory.    Quality food at a reasonable price and good service.", "rating": 5, "date": "3/4/2017"}, {"text": "I didn&amp;#39;t realize the big menu and took me awhile to read through the ingredients. Finally settled with Cajun Jambalaya Pasta. I don&amp;#39;t think I am ordering that again, nothing wow about it. My friend had spicy cashew chicken which was good but still plain. I have been there few times but I love their cheesecakes, they don&amp;#39;t fail to amaze me.", "rating": 3, "date": "5/11/2015"}, {"text": "I love The Cheesecake Factory, I absolutely love it.. BUT--I hate that it is a 50-50 chance that i will get bad service when I go. I have never gone twice in a row and had good service both times... NEVER.<br&gt;<br&gt;This visit the waitress just seemed to be sidetracked. I dont know if she was close to getting off or what, (or maybe she was just an airhead) but we had to repeat EVERYTHING we said, because she was never paying attention. I asked her if the Mac and Cheese was baked, she didnt know, so i told her that if it was, and if it came with Bacon (because it usually does when its baked) to leave the bacon off.<br&gt;<br&gt;10-15 minutes later, a chef brings me out Mac and cheese.. and annouces they removed the &amp;#34;breadcrumbs&amp;#34; as i requested!! What? no, no i wanted my breadcrumbs!!! <br&gt;<br&gt;At this point i was so hungry i was just like screw it, so i didnt even ask if they could fix it. I just hate going here not knowing what/who i will get. And its the only one in the tri state area i think, so im out of other options when it comes down to it", "rating": 2, "date": "1/25/2012"}, {"text": "Excellent quick bite to eat. Awesome food and excellent service.  We had an app, two small plates dining in and cheesecake to go!", "rating": 5, "date": "3/6/2015"}, {"text": "PLEASE READ: AN HONEST AND IMPORTANT REVIEW!!!!<br&gt;I have never, in all my years, had as horrible of an experience in a restaurant as today. The female manger was completely rude and unprofessional and our food arrived far beyond late. I live in California and came to Minnesota to spend the holidays with my family. Needless to say, our time was rather precious, so imagine our huge disappointment with the atrocious service we received. Sit tight because there is quite a story to tell! First off, our server was a really nice guy, but he did put in the order for our appetizers late. We get it, it&amp;#39;s New Year&amp;#39;s Day, it&amp;#39;s going to be crowded, but after waiting for an hour to get our table, we were not expecting this.  Even with the late order, the appetizers arrived exactly 50 minutes after ordering. Our appetizers not only took this long, but came one by one! Our first appetizer (the avocado egg rolls) was brought by a man who, after hearing about how long we waited, rudely responded by saying &amp;#34;do you want it or not&amp;#34;. Our appetizers soon followed after 2 hours dedicated all to this restaurant. Oh yeah, the food! The two tables sitting next to us all received their food even after coming at least twenty minutes after us. One of our family members had to leave because he had to work!!! Our food came and it was fine, but at this point, we lost our appetite honestly. The manger, Jennifer, was INCREDIBLY RUDE. She took two appetizers off out of an order from a group of seven people and made far too many rude comments. She said that she would take care of the food of my family member, but we didn&amp;#39;t realize she would take it off completely! When we asked to order it, she said that she would have to charge us. Really?!? He left because we had waited far more than an hour, and know we have to pay?! At this point, we were livid and wished to speak to the general manager. As Jennifer left, she said that she had been here for 12 years and was experienced for the job. She has been here for 12 years; that doesn&amp;#39;t mean they were good years! Absolutely horrible. Anyway, in short, the general manager came, but none of the &amp;#34;reductions&amp;#34; could fix this horrible experience. I will certainly be contacting the main facility as this was beyond absurd. The food was fine, but the process to get it was beyond crazy. The manager was absolutely rude and the length for food arrival was absurd. On a side note, the general manger was nice (he came after Jennifer) and did compensate us, but like I said, this was a horrible evening all together!", "rating": 1, "date": "1/1/2016"}, {"text": "Ugh. Why did we wait so long for that? It&amp;#39;s not that good, and tonight it was downright bad. We arrived at 4:30 on a Saturday. We were told 20 minute wait but it was more like 45 minutes. When we were seated, our server was surly. I asked if they served orange soda and she curtly said &amp;#34;no&amp;#34; and stared at me. Also, they only have three beers on tap! What kind of place with millions of choices has so few taps? Bizarre. I ordered gumbo and it was very disappointing--chicken and shrimp very dry and over cooked. Lots of tasteless chunks of tomato. Blah. I could have made that at home. My husband had some kind of chicken and shrimp stir fry that had way too much pineapple. He had his leftovers packed to take home. He forgot his food on the table and ran back to get it. Well, he said it was utter chaos inside and his food was gone even though the rest of the table hadn&amp;#39;t been bused. We won&amp;#39;t be back.", "rating": 2, "date": "5/12/2018"}, {"text": "Oh my god all I can say is portion size and menu!!!  It took me more than 30 minutes to get through the menu and then I had no clue what I wanted.  Its massive - review it online ahead of time.<br&gt;<br&gt;The food when it arrived was ginormous.  I swear that the two entrees we ordered would have served up to six family members.  I got a chicken parmesan sandwich and it was so large that it seemed like six sandwiches in one.  The other speciality dish had four chicken breasts!!! If you go, do not order more than one entree for two people.  If you are big, then go for it.<br&gt;<br&gt;Also, please please try the red velvet cheesecake.  If there is a heaven then it is that cake.  You may reach heaven soon after eating it too, but it was amazing.<br&gt;<br&gt;I will likely not go again as it is not my type of place.  But for the cheesecake I will be back.", "rating": 3, "date": "8/24/2012"}, {"text": "Food was adequate, but certainly not worth the wait of over an hour. The waitress deliberately avoided our table once she saw others seated after us getting their food, and then later came over and provided a lengthy and overly complicated story of how the kitchen staff was being finicky and our food still wasn&amp;#39;t ready because &amp;#34;You know how they are.&amp;#34;  She was awful. The management staff was incredibly awkward and unapologetic.", "rating": 2, "date": "7/4/2016"}, {"text": "they have take out!!!  Great food/desserts mighty powerful Godiva choc. cheesecake. I have sent many fo experience this great place!  The people make it an extra special experience ty!!!", "rating": 5, "date": "8/2/2015"}, {"text": "The pasta are nice. My friends took steaks and they finish it flawlessly so its good. The staff are very nice but it took long timw to cook the dinner. Outside placr are quite a lot of flies.", "rating": 3, "date": "7/21/2015"}, {"text": "The portions are obscenely large and the food is flavorless.  The cheesecake is very fatty and bland also.  And the dining room is rather chaotic.", "rating": 2, "date": "10/21/2015"}, {"text": "The Cheesecake Factory USED TO BE a great place to eat.  We loved the large portions, great food, and cool atmosphere.  The decor was fun to look at.  The service was very good and snappy.  The food was simply delicious.  <br&gt;<br&gt;But in the last 3 years; my husband and I have been watching this restaurant go downhill in its cleanliness dept. My husband, my daughter and I went back last night 6/28/13 in hopes &amp;#34;maybe&amp;#34; they have pulled it together but, nope... it&amp;#39;s become worse. <br&gt;<br&gt;We were seated and could not help but notice (from sliding) that the floors were filthy and greasy, the tables and booths same thing (food dropped from someone previous down below our table) and that&amp;#39;s when we really started to check things out... The drinking glasses were even dirty! <br&gt;<br&gt;They brought our food out all at separate times, gave me the wrong Ribeye steak (dry/over-cooked) and by the time we were done; we decided that it will be our very last time at the Cheesecake Factory which is sad because we used to LOVE this place.<br&gt;<br&gt;I am sorry, but Mc D&amp;#39;s is cleaner then this place and if I am going to pay a pretty penny to eat out at a semi-fancy restaurant, I want to know that the cleanness is priority on their list. If this is how the outer part of the restaurant looks, I sure don&amp;#39;t even want to imagine what their kitchen looks like.", "rating": 1, "date": "6/29/2013"}, {"text": "I only gave this place 2 stars because the cheesecake isn&amp;#39;t the worst that I&amp;#39;ve had. I have had better, even made better. Let&amp;#39;s start from the top and work our way to the desert. Waited maybe 20 minutes, which was a relatively short time compared to other places (which were way better to eat at) that I have been to. Sat down and started looking over the long menu of 200 something items. I&amp;#39;ll stop you at this point, that&amp;#39;s a list of 200 disappointments to choose from. While everyone in our group had something different, not a single person was impressed with their meal. Ordered a couple of things to try off the snacks/sides/appetizer sections of the menu. Was not impressed really with ANY of it. Placed our main order in and half of the table&amp;#39;s order came out. Waited several minutes before our waiter realized that only half the table got their order. Waited a few more minutes to get our plates. I had the bacon-bacon cheeseburger. There&amp;#39;s nothing I love more than a good classic. This was the complete opposite. Bacon was BURNT to a black strip of what had appeared to be bacon. I almost cried for the bacon abuse! Started conversing with everyone else and their thoughts about their meal. Not a single dish was really worth the cost nor taking more than a couple of bites worth and feeling sick. Fries were salty as BLEEP! Had a glob of what appeared to be the 2 different cheeses on top of my burger. The special sauce really isn&amp;#39;t a sauce, but more like some random ingredients pureed to a disgusting blob on the bottom of my burger. Everyone pushed their plates aside and waited, for what seemed like an eternity for our waiter to return. Ordered some deserts and was hoping at this time in the night that our horrid experience would make a turn for the better. Was let down yet again, and wasn&amp;#39;t surprised. A hot fudge brownie sundae was ordered, was nothing more than some mere few pieces of brownie (that tasted old) and ice cream with-get this-Hershey&amp;#39;s chocolate syrup that was cold served up. Whip cream? More like whipped milk! Even their so called famous cheesecakes were a joke! Over sugary, old, hard as a rock icing, thrown together mess of a desert better describes it! I would have had better chances eating at Chipotle&amp;#39;s and chance getting Ebola or salmonella than going back to this place!", "rating": 2, "date": "2/21/2016"}, {"text": "I&amp;#39;ve been a fan since 1990, but, this time was slightly disappointing for me.  I had the Sunday Brunch Green chile carna(something or other).  The pork was extremely dry and the tortilla chips were all soggy when the dish arrived at my table.  I was hungry so I ate a bit of it and decided to just save room for the good stuff!  I had the Adams special cheesecake (Peanut butter cups/Butterfinger/OMG).<br&gt;<br&gt;The waitress was super sweet, attentive and got a nice tip out of it!", "rating": 3, "date": "2/18/2013"}, {"text": "Was here many times before and this is the first time that the food both for my grandchild and for myself was barely ok.  I had fish and chips and both were meh warm.  I&amp;#39;m used to hot, right off the stove quality.  My grandson had hamburger and fries and they too were just warm, same quality. Both as if they had been sitting for awhile. I went Wednesday.  Disappointed. :(", "rating": 2, "date": "2/2/2017"}, {"text": "OK better server, still good food and finally got to try the Godiva Chocolate cheesecake, it was worth all the guilt people get around food.  We will come back another time", "rating": 4, "date": "10/2/2012"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory several times before.  However, the waitress was one of the best ones I&amp;#39;ve ever had there.  She didn&amp;#39;t look sideways at the fact my boyfriend and I were giving each other sex lorn looks amidst the Egyptian/Greek/Harem decor.  Being on the road can make one horny.  Just ask any truck driver.  Also, my boyfriend did a magic trick I had never seen in my life.  He made a salt shaker disappear, and then reappear later that night where the sun doesn&amp;#39;t shine for me.  It was also the longest magic trick ever.  I got a little jealous because I wondered what else he hides from me.", "rating": 3, "date": "5/27/2014"}, {"text": "My mother and I stopped in for an early dinner recently. Both hosts were very pleasant and greeted us with a smile. I was pleased we only waited about 5 minutes for a table (although even if we had waited longer, it&amp;#39;s not the businesses fault that they are popular!). Our waiter was James F. He was extremely nice and prompt when we needed something. He had the perfect server personality, charming but not so charming that you can tell it&amp;#39;s fake. He seemed genuinely concerned with making sure we were taken care of and enjoying our meals. The drinks from the bar were excellent and beautifully presented (they used all fresh mint, fruit, etc.). Food was great, including the pumpernickel bread or whatever it was that came free. We got the Cobb salad as an appetizer. The vinaigrette dressing was light but still flavorful and the avocado was soft and ripe. Will definitely order it next time. The cheesecake we took home was also bomb! One thing I appreciated was that we were there for almost 2.5 hours and James never made us feel like he was in a hurry for us to get out of there. I&amp;#39;ve worked in the service industry for a long time and understand the pain when tables &amp;#34;camp out&amp;#34; in your section. I even apologized to him but he assured us that we can stay as long as we want. Granted we did continue to order drinks and dessert so it&amp;#39;s not like we were sitting there sipping waters for an hour or anything. I briefly chatted with someone who i assume was a manger of some sort, and he was very personable and outgoing. Overall I was super impressed with our experience! I was shocked to see The Cheesecake Factory only had 3 stars on Yelp, so I wanted to be sure to leave a review. The only thing that i was less than impressed with were the bathrooms. It was a bit unkept and most stalls were out of toilet paper (something that&amp;#39;s understandable at 7:30pm mid dinner rush, but like I said it was like 4-5ish). I will definitely be back and will probably request James F!", "rating": 5, "date": "3/27/2017"}, {"text": "very good food and service despite how busy it was.  we waited an hour even tho they said itd be almost two. had the biscuits and gravy and it was amazing comfort food.  one could have fed two of us though!! yum!", "rating": 5, "date": "1/12/2017"}, {"text": "This place is a gold mine. It&amp;#39;s alway busy and the wait is always 20-30 minutes. If your prepared for that then fine..if not..your experience will not be the same. I think there menu is way to large with way to many choices...but when you get the food...all is well. Wait staff at times can be very inattentive and overwhelmed with the number of tables they serve. I&amp;#39;d go back, but at an earlier time of the day.", "rating": 3, "date": "1/7/2014"}, {"text": "Great restaurant, great service, and great food!<br&gt;<br&gt;Everything on their menu has been awesome that I have tried, particularly their burgers and fish and chips. The burgers are cooked perfectly and had great toppings on them, my personal favorites are the mac and cheese burger and the americana burger.... their BBQ ranch sauce is awesome as well! <br&gt;<br&gt;Cheesecakes: gotta try the red velvet and the white chocolate blueberry..... oh and also the caramel apple streusel!<br&gt;<br&gt;Service was fantastic, the two waitresses I had were Brittany and Kelsey and they were both very friendly, helpful, and attentive.<br&gt;<br&gt;Overall, probably my favorite restaurant I have ever eaten at.", "rating": 5, "date": "5/8/2015"}, {"text": "Came here for dinner on a Saturday evening in July. They quoted a 45 min wait time, but we were seated in about 20 mins. Waiter was friendly and very efficient. Love their bread-- definitely one of the highlights of coming here. Split a pasta with my mom, hubby got the Cajun pasta and I snuck many bites of mac and cheese from my 6 yr old&amp;#39;s bowl. Ordered a couple of slices of cheesecake to share for dessert and we had enough to bring some home. Had the s&amp;#39;mores cheesecake (soooooo sinful) and the traditional fresh strawberry cheesecake. Overall, a good experience at this chain restaurant.", "rating": 4, "date": "8/2/2014"}, {"text": "The food is delicious and the staff are generally nice. We noticed that they don&amp;#39;t employ only young kids which is a nice change. The older waitress we had was fantastic. Very polite and engaging. The food was so good and then choices were endless. Ive been there twice and have yet to be disappointed with my choices. The only problem..which isn&amp;#39;t really much of a problem is that they don&amp;#39;t have WiFi.", "rating": 4, "date": "8/13/2014"}, {"text": "Their menu has everything. You have a friend that only eats pasta and one that only eats burgers and one that only eats eggs? Cool, go to The Cheesecake Factory! However, you probably shouldn&amp;#39;t go if you have a friend that doesn&amp;#39;t eat meat, because some might sneak in, no matter what they order... Also don&amp;#39;t plan on coming here for drinks unless you have A LOT of money to spend, because they will not give you the prices.", "rating": 2, "date": "1/20/2014"}, {"text": "We were sat within 5 minutes which is quick for a table of 6. We had two small children with us, and we had to ask our server for the children&amp;#39;s menu rather than him asking us if we needed children&amp;#39;s menus. The food was alright but nothing outstanding. The cheesecake was delicious as always.", "rating": 3, "date": "3/18/2015"}, {"text": "I ordered the pear and endive salad with NO blue cheese to pick up. When I got home it had blue cheese all over it. My husband drove back to get a new salad with no blue cheese. I was so disappointed. The chicken was cold and tasted like it was out of a can and the pears were soggy and also out of a can.  I can&amp;#39;t believe I not only paid for this but drove twice to get. Horrible job Cheesecake Factory", "rating": 1, "date": "2/1/2016"}, {"text": "Mmmmmmmmmm.   Very tasty.  Good service.   The kids were all over it.   We all had pasta.  So good!  And yummy warm bread before our meal. Tasty!!!!", "rating": 4, "date": "7/19/2014"}, {"text": "Food is generally good, portions are HUGE so plan to either be super full, have leftovers, or share a dish between 2 (or 3) people!  The happy hour is amazing though!  Tons of great food dishes for $5 as well as drinks and beer specials.  Love it!  I get super full for $10.", "rating": 4, "date": "5/11/2014"}, {"text": "If I want to be sure I really enjoy everything about my meal and my experience I go here. I don&amp;#39;t even hesitate to bring friends and family because I am confident it will be terrific.  Why only 4 stars?  Almost always a ridiculous wait, they took my favorite dish off the menu, the portions are extreme. Pretty small list compared to all the things they&amp;#39;ve done fabulously every time I have visited.", "rating": 4, "date": "5/11/2012"}, {"text": "I enjoy cheesecake and I can always get a good piece from the Cheesecake Factory.   The menu is HUGE but each item I&amp;#39;ve ever tried I really like.  I recently had the Skinny Shrimp Tacos and they were A+++ w/a little spice :)<br&gt;<br&gt;My server was knowledgeable and friendly!  Her recommendation on the Asian Pear Martini was stellar! <br&gt;<br&gt;Because it&amp;#39;s located in the mall, you have to deal with mall parking.", "rating": 3, "date": "8/14/2012"}, {"text": "Went for late dinner (after 9pm).  Hostess was welcoming and friendly.  I sat at booth in bar area.  Server (Amber) was attentive, and order was prompt and accurate.  Food was very good and drink was refilled before running out.  Bill was brought at appropriate time and was quickly processed.  Great experience, no complaints.", "rating": 4, "date": "6/3/2014"}, {"text": "I refuse to write a review about the White Chocolate Caramel Macadamia Nut Cheesecake<br&gt;<br&gt;Or the Mango-Key Lime Cheesecake<br&gt;Or the Lemoncello Cream Torte<br&gt;Or the Red Velvet Cheesecake<br&gt;Or the Warm Apple Crisp<br&gt;Or the Strawberry Shortcake<br&gt;Or the Black-Out Cake <br&gt;Or the Kahlua® Cocoa Coffee Cheesecake<br&gt;Or the Pumpkin Pecan Cheesecake<br&gt;<br&gt;Doing so would be like admitting I&amp;#39;ve tried every single one of these desserts....and that&amp;#39;s just not going to happen (again!) - bbuuuuurrrrrp!", "rating": 4, "date": "6/23/2011"}, {"text": "The food is always on par! They try to do the best they can to feed a person with quality 5 star food. The seating issue and not having a reservation system at all times is ridiculous and such a cry for help for a restaurant that has maybe 100 tables and is one level unlike most Cheesecake Factory restaurants. They have people waiting for an hour or two for a table when they wouldn&amp;#39;t have angry customers if they did reservations. For a restaurant that is as popular as it is and has the patronage that it does, it does not go anywhere near 5 stars on seating and wait times. And their hosts or hostesses are horrible at giving good time frames according to tables leaving and such. For the Twin Cities Cheesecake Factory, they have two issues that need to be resolved...a fully active reservation system with better seating arrangement with the strong thought of expanding! Also, either expanding the one restaurant or building one or two more in a metropolitan area this size!", "rating": 1, "date": "4/23/2016"}, {"text": "Absolutely my favorite place! I had my bday there many years ago. I love all their appetizers! Amazing cheesecake! I know they don&amp;#39;t take reservations after a certain time on weekdays or weekends....i waited for an an hour one time and i didnt mind at all because i was craving for their food! They have the best long island!", "rating": 5, "date": "8/11/2011"}, {"text": "I am almost embarrassed to say that I really enjoyed my experience eating at the Cheesecake Factory. I ordered a Southwestern salad, and it was really good. <br&gt;<br&gt;That said, lower your prices, you are The Cheesecake Factory, and $8 for one slice of semi-decent cheesecake is highway robbery. Also, $9 for my glass of Sangria? You are The Cheesecake Factory.<br&gt;<br&gt;So much botox in this place that I felt I like I got botox by association.", "rating": 3, "date": "7/8/2011"}, {"text": "The portion sizes here are insane. You could feel your whole family with one dish. Instead of a menu they give you a book. Anything you can think of they probably serve, but its all pretty lame and over-priced.<br&gt;The decor is hideous. Some things look like they are trying to be Egyptian, other things look kind of Roman, and the light fixtures look like the eye from Lord of the Rings. Maybe they wanted the design to match the menu- lots of random stuff thrown together but none of it done particularly well. <br&gt;All dinner I was looking forward to the cheesecake. Since its in the name I figured it had to be good. I went with the classic cheesecake with strawberries on top. It was ok but nothing to write home about. <br&gt;To be fair, I&amp;#39;m not a big fan of huge chain restaurants so if thats your thing you may like it here. I for one won&amp;#39;t be back.", "rating": 1, "date": "2/28/2011"}, {"text": "I wasn&amp;#39;t very excited to try this place, but I wondered what all the rage was about.  When I got to the restaurant we were asked to wait 2.5 hours!  Seriously? Who in their right mind would wait 2.5 hours to eat food that is off a Sysco truck? Ok I&amp;#39;m a snob, I like food that is fresh, in season, and local,  so I waited for awhile to see if a table would open up. Meanwhile I got to watch some poor girl put whip cream on nearly 30,000 cheesecakes.  I wondered if this girl would ever eat cheesecake again? Then I wondered if these cheesecakes were made on location or if it came frozen from some factory thousands of miles away? All I could wonder is why would someone be asked to wait 2.5 hours?  The greeters at the door seemed nervous that the angry hungry people waiting might create an uprising.   <br&gt;<br&gt;Sadly enough I couldn&amp;#39;t wait 2.5 hours.  I left.", "rating": 2, "date": "3/27/2011"}, {"text": "I can&amp;#39;t even believe I went here. <br&gt;<br&gt;I was at the movies with some friends and we wanted lunch. Walked in around 1:30ish on a Saturday, it was very quiet. <br&gt;<br&gt;I hadn&amp;#39;t been there in years and now I know why - to me, it&amp;#39;s nothing special. I wonder who would wait for a while to get a table, but then I realized it takes so long to even get a grasp on the menu. <br&gt;<br&gt;We were seated at a fairly large table, which was good and we ordered some drinks, which came fairly quick. What isn&amp;#39;t quick is trying to decide what to have. The damn menu is just too big! Do I want a regular sized salad, an appetizer size salad, or a salad and something combo? Do I want an appetizer or a small plate? Ahhh. Too many decisions. <br&gt;<br&gt;I settled on a Coors Light, a small arugula salad, and a sausage and ricotta pizette. Our group ordered various items and I can say for sure, the fried mac and cheese balls (I know, what am I eating those for?) with marinara were the best thing we had. I had 1/4 of the large ball and that was enough. My salad and pizette were the perfect size for me considering the pizza and salad combo was gigantic. <br&gt;<br&gt;My bill was around $16 for the beer and snacks. I thought the price was fine, I guess I&amp;#39;m just not crazy about the place. <br&gt;<br&gt;The service was good, she was pleasant enough, but a little hover-y, the price was right, although I&amp;#39;m not sure a Coors Light bottle should be $4.75, the menu too big and nothing is spectacular. I would not go back if given the choice. <br&gt;<br&gt;PS - I don&amp;#39;t really like cheesecake, so I didn&amp;#39;t even try it,", "rating": 2, "date": "6/7/2011"}, {"text": "Their corn cakes are delicious--flavorful and soothing at the same time.  My favorite dish here.  I actually craze it sometimes. I also have enjoyed their lettuce wraps.<br&gt;<br&gt;Service on the slow side.", "rating": 4, "date": "9/20/2014"}, {"text": "Disclaimer: I have never liked the food at the Cheesecake Factory, and I&amp;#39;ve eaten at locations in Raleigh, DC, Atlanta, Milwaukee and now, Edina. My sister wanted cheesecake for her birthday, so I&amp;#39;ll admit I was dragged to this dinner.  I went in with low expectations, but hoping to be pleasantly surprised. It&amp;#39;s been a few years since I&amp;#39;ve been to a Cheesecake Factory... <br&gt;<br&gt;The decor is nice, the booths comfortable, the hostess stand was well organized, the cheesecakes in the case looked appealing, and the place was so busy on a Tuesday night I figured it couldn&amp;#39;t be that bad.<br&gt;<br&gt;Then I looked at the menu. First warning sign: It&amp;#39;s about 20 pages long. If the menu is unfocused, the kitchen is unfocused. That tells me they do a mediocre job on a variety of things - a little bit of Asian fusion, a little Tex-Mex, alongside burgers, seafood and steak. Second, the prices are high for what you&amp;#39;re getting. Sure, the portions are large, so there&amp;#39;s a high perceived value, but do we really need to stuff our faces? I&amp;#39;d rather be given the option to order half portions or simply go to a better restaurant and get quality food for my money.<br&gt;<br&gt;Ahi Tartare: small dices of tuna on avocado, plated in a ring mold and served with 4 crispy wontons and pickled ginger. Totally unoriginal, but the flavors were good.  However, the avocado was cut in huge unwieldy chunks, rather than diced the same as the tuna. I&amp;#39;m not just nit-picking on an aesthetic point. It makes eating the dish easier, and shows attention to detail on the part of the kitchen. This looked like someone scooped avocado chunks from the sandwich bar.<br&gt;<br&gt;Beets with Goat Cheese: not enough beets, not enough goat cheese. The candied pecans were good.<br&gt;<br&gt;Crispy Chicken Taquitos: bland, bland, crispy, bland. And I don&amp;#39;t even like that much salt. The salsa was bland; the guacamole was bland. <br&gt;<br&gt;Wild Mushroom Soup: I liked the large chunks of mushroom, and even though it was a little on the salty side for me, it was very creamy and tasty. It was too thick, though. I ordered soup, not porridge. <br&gt;<br&gt;Chocolate-Raspberry Truffle Cheesecake: disappointing. There was a vague aroma of raspberry liquor, but no actual fruit or raspberry glaze or sauce to provide the necessary tart, fruity tang to balance out the overwhelming creaminess of the chocolate cheesecake.  <br&gt;<br&gt;I used to think Cheesecake Factory had fine cheesecake and bad food. Now I just don&amp;#39;t understand the appeal at all. However, every location I&amp;#39;ve ever been to has always been hopping, there&amp;#39;s always a wait, and apparently people are willing to pay their outrageous prices, so there must be something I just don&amp;#39;t get.  The only time I&amp;#39;ll ever go back to a Cheesecake Factory is if someone else is paying.", "rating": 1, "date": "11/25/2009"}, {"text": "Love their menu.  Everything we have had has been good and consistent.  Even when its busy we can usually sit at the bar.", "rating": 4, "date": "9/6/2016"}, {"text": "This place was hoppin&amp;#39; at 9:30 pm on Saturday! We had a 20 minute wait but it was worth it! Large portions and delicious food. Took cheesecake to go. Yum!", "rating": 4, "date": "8/31/2014"}, {"text": "So I am reviewing this location because it was the last one I went to.. but obviously this is a chain restaurant and it seems to be about the same everywhere I go.<br&gt;<br&gt;What I like <br&gt;- Nice decor.. not so fancy that you can&amp;#39;t dress casual.. but not so casual that you feel strange if you look a little dressy.<br&gt;- The classic cheesecake with strawberries is amazing<br&gt;- I have always had decent service here<br&gt;- The menu is extensive<br&gt;<br&gt;What I don&amp;#39;t like<br&gt;- I STILL after being here more than 10 times have not found a dish that I love. I have tried something new almost every time. The food has been consistently mediocre.", "rating": 4, "date": "6/13/2008"}, {"text": "Oh my... My mouth is watering JUST by thinking of the Cheesecake variety here! Well, after all, it is The Cheesecake Factory!<br&gt;<br&gt;The times that I have been here, I have wanted to try something new... Because if you look at the menu, there are pages of delicious cheesecake for your taste buds to enjoy! That being said, I have stirred from my goal a few times... I have had Linda&amp;#39;s Fudge Cake about 3 times. Whoops! But it is just SO good! And the last time I went there, I had the Chocolate Tower Truffle Cake. The slice was so big, I had to take it home! And found a couple hours later that my entire family thought it was delicious, too! My advice to those who do NOT want to share: Order, eat as much as you can, bring it home, and HIDE it very well in the refrigerator!!!<br&gt;<br&gt;Cheesecake Factory, you know how to bring a hungry customer back for more!", "rating": 4, "date": "12/3/2011"}, {"text": "Way to expensive! $8 for a slice. Cafe latte in St. Paul has better taste and half the price!  Slow service, ordered 2 slices to go and wAited over 30 minutes to get served.  Should of went to Cossettas....", "rating": 2, "date": "8/18/2015"}, {"text": "Not original and kinda cheesy.  Everything about this place screams - over fed, over indulgent Americans.   <br&gt;<br&gt;Menu gave you way too many choices.  How can a kitchen be good at THAT many dishes?  Food was HUGE, too sweet, and too salty.<br&gt;<br&gt;Best thing was the service.", "rating": 2, "date": "8/18/2009"}, {"text": "Dined here on 12/31/2012, for my BF&amp;#39;s birthday! <br&gt;-During lunch hour- Busy but took about 7 mins for drinks to be served and 30 mins for the entrees to come out, decent timing for service<br&gt;-The BF ordered the  over the top meatloaf sandwich and I ordered Evelyn&amp;#39;s favorite Pasta<br&gt;-Food: Evelyn&amp;#39;s Fav Pasta consist of Penne Tossed with Broccoli, Oven-Dried Tomato, Roasted Eggplant, Peppers, Artichoke, Kalamata Olives, Garlic and Pine Nuts. <br&gt;Penne Pasta was very dry! It was so clumped together..Broccoli over-cooked, Artichoke was not fresh (chef claimed to be fresh, taste like canned) and Roasted eggplant was not cooked all the way through<br&gt;lol..I am no Chef Ramsey but I love food and I want food to taste like it should...<br&gt;I received my entree and took a bite and I was disgusted, but did not want to complain to the waitress because she seemed to be having a rough day but she was really nice, waitress saw my reaction from afar and came to see what was the issue and offered to bring it back and bring out a new order but the BF and I was on a time crunch and said no thanks, minutes later ASSHOLE manager comes and tell me, &amp;#34;Ma&amp;#39;am, I heard you don&amp;#39;t like your entree? Now let me tell you something, I am willing to bring out you a new entree because NO MATTER WHAT, I AM GOING TO MAKE YOU PAY FOR YOUR MEAL or I can give you two slices of cheesecake on the house&amp;#34; What an asshole, I was NOT looking for a free meal nor did I complain to the waitress about how dry my pasta was and how disgusting the dish was! Then I told the manager no thanks i&amp;#39;m in a hurry, I appreciated but if you insist I will take a house salad with vinaigrette dressing...10 mins later the same waitress comes back with the salad and APOLOGIZES for her RUDE MANAGERS behavior! <br&gt;I will def come back if I get the same waitress but as for the ASSHOLE manager no thanks! I feel bad that she haves to work for someone like that! <br&gt;Overall, Food was not great but will come back again to give them a redeeming chance, Service was great minus D-BAG manager.", "rating": 2, "date": "1/3/2013"}, {"text": "If you can look past the over zealous Stepford wifes eating what they think is fine dinning its not that bad of a place.<br&gt;Consider a sports bar without the TVs in every nook and cranny, throw some gouda cheese on the burger rather then American, dress the waitresses in white, hike up the price and you have The Cheesecake Factory. (if you don&amp;#39;t tip here, but tip at the sports bar, its the same price)<br&gt;<br&gt;Its good for what it is, the price isn&amp;#39;t the best, but they have a huge selection of entree&amp;#39;s guaranteed to please everyone!", "rating": 3, "date": "6/19/2009"}, {"text": "My friends and I came here on a Saturday night for our friends birthday dinner, and they told us that we would have an hour and a half wait, which we were fine with! As we waited about an hour in we asked how long and they said &amp;#34;we were next&amp;#34; so it would be about 20 minutes. We saw 3 groups our size get seated in front of us, we asked and they said sorry you&amp;#39;re next. Saw more get seated and looked at the time and it was 2 hours and 15 minutes later. This was unacceptable service and I was really excited to finally try your food that I heard good things about, but after this night I&amp;#39;m very disappointed and won&amp;#39;t be back anytime soon. Horrible service.", "rating": 1, "date": "4/16/2016"}, {"text": "Been here twice. Food is delicious, service was okay, price hurt my wallet.<br&gt;<br&gt;Had standard food like the filet mignon, chicken alfredo, salmon, lasagna, mozzarella sticks.<br&gt;<br&gt;The filet mignon was the best I ever had. I would go again.", "rating": 5, "date": "4/17/2014"}, {"text": "I only ate there once, and I enjoyed it very much! But I mostly do cheesecake to-go line. And I always enjoy buying it from them, the staff&amp;#39;s are wonderful at the register. So I can&amp;#39;t say more about the food area, but I know that the line is a long Waite.", "rating": 5, "date": "4/13/2016"}, {"text": "I&amp;#39;ve always loved Cheesecake for a variety of reasons, mostly the food:<br&gt;<br&gt;1. the soup and salad combo<br&gt;2. the lettuce wraps!<br&gt;3. steaaaakssss and shrimp<br&gt;4. the piece of cheesecake i can never finish<br&gt;5. the flying gorilla of course, extra liquor plsss<br&gt;6. the brown bread WITH butter, mmm i love bread<br&gt;<br&gt;the only sad part about this rating is the service my friends and i experienced at the Edina location on a Wednesday night. sad sad sad... it took an hour to get a table (which is fine, I guess, because we had a big group), but the fact that we found empty tables EVERYWHERE as we were walking to our table. what happened there? i don&amp;#39;t know. and the time it took for the lady to take our orders? aye.... sorry Cheesecake, you&amp;#39;re gona have to deal with my 2/5 rating for this one.", "rating": 2, "date": "1/25/2009"}, {"text": "Eh.  The cheesecake was good, we had the Turtle sunday cheesecake and it was really very creamy and nice. but expensive $7 for a slice.<br&gt;<br&gt;My boyfriend and i each had a salad, he enjoyed his (a spicy chicken avacado ranch salad)  I had a low cal salad with blue cheese, there was plenty of blue cheese (which suprised me) but i dont eat chicken so i substituted shrimp.  i got 4 shrimp, and they upcharged me $4!!!!.<br&gt;<br&gt;It&amp;#39;s a chain and i didnt expect to be WOW&amp;#39;ed.", "rating": 2, "date": "6/29/2009"}, {"text": "First Time I ever ate at the Cheesecake Factory was in Scottsdale Arizona (next to my hotel).  Well I could see the appeal immediately.<br&gt;<br&gt;The only thing I ever order is the Chicken Madeira....it&amp;#39;s magical and addicting...can never eat the whole dish (and soooo excited for the left overs).<br&gt;<br&gt;Just like a bar cashs in on drinks, this place must subsidize it&amp;#39;s self with the cheesecake bill.  I&amp;#39;m not a cheesecake lover at all, but the godiva chocolate cheescake can send anyone to heaven.", "rating": 3, "date": "10/31/2009"}, {"text": "THE BEST chocolate cake anywhere (blackout cake).  We have had some stellar meals here, and a few screwy ones.  Overall, it&amp;#39;s a favorite for &amp;#34;special&amp;#34; meals.  It&amp;#39;s HUGE....but still be prepared to wait.", "rating": 4, "date": "10/11/2013"}, {"text": "Lots of Choices;Lots of customers! Food was okay. Like the healthy salad options. Sent fries back because they were so salty we couldn&amp;#39;t eat them. Took forever to get a new order. Would love to see vegan cheesecake offered made with cashews. Most food has cheese or cow&amp;#39;s milk or cheese involved, so if you are dairy intolerant or allergic, it is challenging to find a food choice.", "rating": 3, "date": "4/3/2016"}, {"text": "Food was OK, but service was very bad. I would not recommend unless you wanted to buy cheesecakes.", "rating": 1, "date": "4/1/2016"}, {"text": "I had the cajun jambalaya pasta which was a phenomenal entree and for a desert the red velvet cheesecake was delicious as usual.  My favorite appetizer from any restaurant is the chicken lettuce wraps with the peanut sauce!!!<br&gt;<br&gt;I highly recommend this restaurant", "rating": 4, "date": "11/20/2011"}, {"text": "Worst lunch experience ever!  Taking my family out for my daughters birthday.  Two meals out of four were brought out. 10 minutes later the third. My wife&amp;#39;s lunch never arrived. The waitress apologized but was unable to get her lunch. I spoke to the manager about it and after another 15 minutes he brought her lunch. When we told him to just box it up since we were out of time, he gave an eye roll which was even more irritating. Will not EVER go back to this place.  JG", "rating": 1, "date": "3/5/2016"}, {"text": "Great dinner overall.<br&gt;<br&gt;Was busy as usual so we opted for the lounge.  We couldnt wait for food (starving) so I got a chocolate milk from the bartender.  Very willing to help my quasi diabetic request..lol.  Got a table in the lounge in 5 mins.  Server was friendly, knowledgable, and helpful.<br&gt;<br&gt;Rib-eye - ~13oz.  Rare.  Cooked perfect.  Great seasoning.  Good size.  Subbed out the fries for mashed.  Great mashed potatoes as I dont normally like mashed.<br&gt;<br&gt;Hibachi Steak - Cooked perfect.  Great marinade.<br&gt;<br&gt;Cheesecake was amazing as always.", "rating": 4, "date": "10/27/2010"}, {"text": "It&amp;#39;s a Cheesecake Factory. If you&amp;#39;ve never been to one, the menu is a bit intimidating with its large selection, but I enjoy this restaurant. The service has been consistently good. The portions are large, so you&amp;#39;ll either be having leftovers or sharing. The food is pretty tasty and of course, you probably should have dessert if you are treating yourself to this restaurant anyway.", "rating": 4, "date": "5/27/2013"}, {"text": "This was one of my favorite places to go when I lived closer to one in Arizona, but it&amp;#39;s worth the occasional jaunt down to Edina just for lunch.  <br&gt;<br&gt;As a vegetarian it&amp;#39;s rare that I look at a menu at a national chain and have a hard time picking what I want; there&amp;#39;s usually only 2-3 items to choose from.  But The Cheesecake Factory is different.  First off, their menu is a book....literally.  Granted it has plenty of ads, but there&amp;#39;s a lot of food to choose from regardless of your dietary preferences!<br&gt;<br&gt;My personal favorites are the avocado egg rolls and the grilled portobello on a bun, but be careful when you order.  Unless you can EAT, it&amp;#39;s hard to get through an appetizer and an entree, even when sharing.  Portions are large and filling!<br&gt;<br&gt;One of the things that stands out about The Cheesecake Factory is actually just a little thing that means a lot to me.  Anyone that dines out with children knows that the most stressful time is the time between sitting down at the table and the point at which the food arrives.  Kids tend to get restless during this time and chaos can ensue (which is why Mexican food, with chips and salsa, is always a good option with kids!).  The Cheesecake Factory solves this problem by bringing out a small plate with some banana, orange and Cheerios that the kids immediately latch on to.  It&amp;#39;s a great idea that is most appreciated by those of us with kids, not to mention those sitting nearby that might get some peace and quiet.<br&gt;<br&gt;And of course there&amp;#39;s the cheesecake.  The only bad thing you can say about the cheesecake is that it&amp;#39;s just too rich.  But that would be a stretch of a complaint!<br&gt;<br&gt;There can long waits for lunch and dinner so plan on spending a little more time waiting, but I can assure you that the wait is worth it!", "rating": 5, "date": "8/1/2007"}, {"text": "I like the Cheesecake Factory&amp;#39;s food.  Everything is made to order (with a few exceptions, ie app rolls, goulash, and that&amp;#39;s about it actually)<br&gt;<br&gt;My favorites are: Cobb Salad, Bang Bang Chicken and Shrimp, Miso Salmon, C&amp;amp;A, Pesto Pizza, Thai Wraps, and Tamale Cakes.  There are more but I am too hungry right now to think about it.  :)  <br&gt;<br&gt;Come in on a Saturday, the soup is the BEST: Cream of Chx with Artichoke Hearts and Mushrooms.  <br&gt;<br&gt;Something most restaurants don&amp;#39;t do:  You can sub anything for fries.  Yes that means a tossed salad that is normally 6.50, or mashed potatoes, or broc, or whatever..for the SAME price.  Killer!!   (asparagus is an upcharge, however, fyi)<br&gt;<br&gt;Also, bro, sorry about your server not being attentive.  Boo on them.  <br&gt;<br&gt;Yes it&amp;#39;s a chain but if your idea of dining out is Applebee&amp;#39;s *(don&amp;#39;t laugh, there are a lot of people like that.  Why do you think AB&amp;#39;s etc are still in business?) Come check it out for a nice dinner out<br&gt;<br&gt;If you&amp;#39;re a local dwelling-independent business type?  Go to eat street.  :)", "rating": 4, "date": "11/9/2007"}, {"text": "The...Best...Cheesecake...Ever!  I seriously can&amp;#39;t eat cheesecake from anywhere else.  Their cheesecake is so rich &amp;amp; creamy, and you can choose from over like 50 flavors.  My mouth is watering just thinking about it!<br&gt;<br&gt;The food is good, just expensive.  I love the Buffalo Blasts &amp;amp; the Chicken Picatta!", "rating": 4, "date": "4/14/2011"}, {"text": "Actually their pre-meal bread is awesome. :) Cheesecake of course. Pineapple one is good.", "rating": 4, "date": "1/8/2014"}, {"text": "I had a normal dining experience here.  The food was good and service was fast.  I did not enjoy the $20 tab when I only got a coke and the lunch  pizza and salad combo.  <br&gt;<br&gt;Let&amp;#39;s talk about this combo though.  They claim it is a lunch combo, but it was huge portions.  I got the caesar salad and it was definitely a dinner sized salad.  If it would have had a protein on it, it could have been my whole meal.  Secondly, the pizza was very large for being a lunch size..  I won&amp;#39;t complain about having left overs, but I was surprised by this.<br&gt;<br&gt;The air conditioning was really cold and made the whole experience kind of uncomfortable.<br&gt;<br&gt;Our server was very nice and attentive.", "rating": 3, "date": "9/12/2009"}, {"text": "This is a standard &amp;#34;dinner and a movie&amp;#34; place for us, since it&amp;#39;s right next to the Southdale theaters.<br&gt;<br&gt;And if you want a ton of food, the Cheesecake Factory is the place to go.  I always leave completely stuffed, so stuffed that I hardly ever get to ordering any cheesecake! Tonight I got cream cheese crab wontons (yummy, but dipping sauce not my fave), and a burger. The burger had more muenster cheese than I&amp;#39;ve *ever* seen on one piece of food, plus avocado and a nice, tart mustard sauce. It was excellent and so large I could hardly finish it.  Side salad with the burger was quite good too, although a little wilted from being &amp;#34;drenched&amp;#34; with dressing (but the dressing was good).<br&gt;<br&gt;Usually, I get the &amp;#34;small plate&amp;#34; endive salad (yum!) except I like it with Ranch dressing more than the vinagrette it normally comes with.  Then, I&amp;#39;ll order an appetizer like the avocado egrolls and call it a meal.", "rating": 4, "date": "4/4/2010"}, {"text": "An all-American chain restaurant, but it is pretty good! Huge restaurant, with large bar area and ample booth and table seating. The portions are also very large, even the lunch portions! Lunch prices are a little on the high side (including tax and tip I spent $17 for a sandwich and side salad). The cheesecake is good, and lots of choices. There&amp;#39;s nothing unique or different about te Cheesecake Factory, so if all you need is safe, stable, good food and service and to just go on a routine out to eat lunch/dinner, this will have you covered.", "rating": 3, "date": "2/19/2014"}, {"text": "Love this place. I think it&amp;#39;s the only one in the state (but i could be wrong). I wish i could tell you more about the other items on their menu unfortunately the first thing I had was their meatloaf and now i can&amp;#39;t dare to try anything else when i&amp;#39;m there. It&amp;#39;s too damn good and i would feel like i&amp;#39;m cheating on the meatloaf if i were to try anything else! <br&gt;<br&gt;I did, however, try one of their appetitzers and the Avacodo Eggrolls were scrumptious. Wait...i did dig in on one of their delicious cheesecakes too. Though how can you choose which one? They have so many options it&amp;#39;s hard to say which is the best. One thing to note: their portion sizes are crazy big. If i skip the app and dessert, i could finish the main course, but then i feel like exploding afterwards. Fun times!", "rating": 4, "date": "9/12/2010"}, {"text": "I have eaten at this chain restaurant in many cities (Boston, Houston, LA,). this was the worst experience: my salad was so obviously not fresh (cucumbers should never be cut 2 days ahead of time!), the enchilada was cold, and my mom&amp;#39;s filet mignon was just acceptable.<br&gt;the cheesecake was just ok, nothing remarkable either.<br&gt;of course, the service was slow", "rating": 1, "date": "5/26/2013"}, {"text": "Still the best.  I was away on a business trip and when to my most favorite chain restaurant.  The service is consistent with any other Cheesecake Factory.", "rating": 5, "date": "1/22/2011"}, {"text": "Say what you will about chain restaurants, but I like everything about The Cheesecake Factory and would tell anyone it&amp;#39;s one of my favorite places to eat. The menu is extensive and varied with a lot of veggie options, the lunch combos are great, the food is fresh, the service has always been friendly and efficient, and the passion fruit iced tea is so good, I actually get cravings for it.<br&gt;<br&gt;To start, you&amp;#39;re given wonderful sour dough and brown bread and they are happy to provide olive oil instead of butter. The edamame appetizer ($4.95) is perfectly steamed and salted, and a good portion of pods. The avocado eggrolls ($9.95) are delicious and decadent with chunks of avocado, sun-dried tomato, red onion and cilantro in a crisp wrapper with a tamarind-cashew dipping sauce. If you eat shrimp, the Vietnamese shrimp summer rolls ($8.95) are as good as those I&amp;#39;ve had in any authentic Asian restaurant. Also offered is guacamole made-to-order, sweet corn tamale cakes and a fire roasted artichoke with dipping sauce.<br&gt;<br&gt;The appetizer salads are abundant, colorful, fresh and easily a meal by themselves. The tossed green salad ($6.95) is the perfect house salad with tomato wedges, sliced cucumber and julienned beet, zucchini and carrot. I highly recommend the peanut cilantro dressing, but the Asian plum dressing and balsamic vinaigrette are also very good. Also tasty is the French country salad ($8.95) with beets, grilled asparagus and pecans (can hold the goat cheese) and the vegetable chopped salad ($8.95) with edamame, green beans, asparagus, cucumber, tomato, roasted beets and apple in a pomegranate vinaigrette (can hold the white cheddar).<br&gt;<br&gt;Lunch combos and portions are served every day until 5:00 p.m. and range from $7.95 to $10.95. My favorite is the roasted vegetable and goat cheese pizza with Japanese eggplant, artichoke, red and yellow pepper, Kalamata olives and tomato, paired with the tossed green salad. (Vegans, ask them to hold all the cheese on the pizza since there is parmesan in addition to goat cheese.) The Santa Fe entrée salad is simple southwestern goodness with greens, corn, black beans, tomato and tortilla strips in the spicy peanut-cilantro dressing ($9.95 for lunch portion; $13.95 for entrée size). You can hold the chicken and cheese and add avocado.<br&gt;<br&gt;The grilled portabella on a bun ($10.95) is a huge mushroom cap flavored with herbs topped with lettuce, tomato and grilled red onion (can add avocado and hold the cheese and the spicy mayo) served with fries, or they happily substitute any side. The incredible grilled eggplant sandwich is also great - again, I recommend adding avocado if you hold the cheese and mayo. A number of nice vegetable sides are available including broccoli, corn succotash, asparagus, sautéed spinach and snow peas with veggies, ranging from $3.95 to $6.50.<br&gt;<br&gt;Vegetarians can choose from more than 25 flavors of cheesecake and numerous other stunning desserts. There are no vegan dessert options, other than a pricey bowl of strawberries. The Cheesecake Factory is home away from home for my family as we&amp;#39;ve been eating at the Southdale location in Edina at least once a month since they opened and we&amp;#39;ve been to locations in other cities. Even after many visits, we&amp;#39;ve yet to try all the veggie options available, we&amp;#39;re always pleased with the staff&amp;#39;s willingness to accommodate our veggie requests and we always look forward to our meals there knowing that we&amp;#39;ll leave happy. <br&gt;<br&gt;For more info: <a href=\"/redir?url=http%3A%2F%2Fwww.examiner.com%2Fx-10371-Minneapolis-Vegetarian-Examiner&amp;amp;s=018da3a9f11c5aa68ae10ddc26678f195f88989155d7ce373fefc472a00f5d73\" target=\"_blank\" rel=\"nofollow\"&gt;examiner.com/x-10371-Min…</a&gt;", "rating": 5, "date": "6/19/2009"}, {"text": "oh man. Am i ready to give Cheese Cake factory a review. *(cracking my knuckles)* <br&gt;food was ok. Cakes were good. no complaints there. NOW... let me begin<br&gt;<br&gt;halfway through our dinner with my loved one. the waiter comes over with a smerk on his face. i could tell he didnt want to be there by the look on his face. or maybe moms just dropped him on his face one to many times while watching Oprah with a pack of Full Flavored Kool 100&amp;#39;s in one hand while juggling him and the bottle of Scotch in the other? so....... he comes over stares at me with a David hasselhof look and says anything else. We said No thank you. he reaches into his pocket and pulls out some sort of stick, leans up and over into my food and starts to sweep off some of the pepper that i accidently got on the table. Shocked with disbelief in my mind i was like WTF yo?!? he takes a step back, this time gives me a &amp;#34;The Apprentice&amp;#34; your FIRED!!! Donald Trump look and walks away with this peppered up glue stick in his hand. Seriously is this normal at the &amp;#34;DontSpillAnyFreakinPepperOnYourTableOtherwiseYouG­etTheGlueStickCakeFactory&amp;#34;    if it is then my apoliges. If not, Management seriously needs to hire and properly train their staff. <br&gt;<br&gt;Zero Stars in my books.", "rating": 1, "date": "3/6/2012"}, {"text": "It is 2014, and the Cheesecake Factory still doesn&amp;#39;t have any sort of call ahead or reservation system.  I figured we would give them a try anyway- a group of 6 adults ready to have a nice dinner on a Saturday night.  I was ready for a 30-45min wait before being seated when we arrived at 6:45pm. However- the hostess told us it would be 60-75 minutes when we were given our pager.  Meanwhile, we watched countless groups of 2-4 be seated. After 75 minutes, we asked the hostesses for an update on our wait, where they let us know that we would be waiting an undetermined amount of time because there was still another group of 7 ahead of us for one of their few precious large tables. We even watched 2 groups at adjacent tables leave at the same time and requested their spot but were told there were smaller groups that had been waiting longer than us.  Either we were being lied to, or a group of 2 had been waiting an hour and a half for a table.<br&gt;We left after waiting 1 hr 45 minutes with no idea of when we might be seated. I&amp;#39;ll continue to patronize restaurants that have entered the civilized world of reservations and technology.", "rating": 1, "date": "1/19/2014"}, {"text": "The wait at this place can be insane. Show up early, or be prepared to wait over an hour. The cheesecake is good, the food is... eh.", "rating": 3, "date": "2/13/2015"}, {"text": "Food is always good and they have big portions and love their cheesecakes. But me and my boyfriend came in a Saturday knowing there would be a wait, so we came at 5pm. We were told that the wait was going to be 1 hour and 10 minutes, which we were fine with waiting. After waiting 1 hour and 35 minutes I decided to check to see where we were on the list (which I never like to be the person that always does that) and the girl looked at our pager number and looked on the computer and told us we were next up. So we stood closer to the host desk, so we were ready to go. After a table of 5, then a table of 2, then a table of 3, then another table of 2 got seated, I was getting confused and annoyed. I asked a different person why we haven&amp;#39;t been seated and that we&amp;#39;ve been waiting for 1 hour and 45 minutes at this point when we were told it would only be 1 hour and 10 minutes and he quickly sat us and told the other hostess that the pager wasn&amp;#39;t ever working. While we were waiting, we saw the hostess sometime go out and call for peoples name and we have never heard our named called, even when we were told that we were next up. So I wasn&amp;#39;t furious for waiting that long, I was furious that they gave us a pager that didn&amp;#39;t work and didn&amp;#39;t attempt to call our name. After we got seated, I assumed that someone told them to put our orders on rush since we waited so long, because there was a couple that got seated 5 minutes after us and we had already gotten all of our good before they received their appetizers. We felt rushed to eat our 2 appetizers to have room for our entrees. Other than one bad experience, the servers are always friendly and the food is always good.", "rating": 3, "date": "1/3/2016"}, {"text": "Went here for my moms birthday. All our food came except hers. Waitress never checked back. Loud restaurant, hard to hear.  They ruined a nice birthday dinner out. Waitress was rude and impersonal.", "rating": 1, "date": "9/25/2014"}, {"text": "There was a thirty minute wait on a Sunday night, with limited seating for waiting customers. We also could not wait outside because the buzzer would not work outside the front door to the restaurant.<br&gt;<br&gt;Our server was very soft spoken and did not know the menu. When preparing to take our order for our cheesecake, he said there were a few cheesecakes not featured on the menu, but after hearing his description of the dessert, we realized that they were indeed on the menu.<br&gt;<br&gt;The Shepard&amp;#39;s pie was very big and very filling! The Shrimp Vietnamese spring rolls were not good. They had too many chives and only a few pieces of shrimp scattered throughout the whole dish. I had to cut the spring roll apart just to enjoy some portion of my meal. <br&gt;<br&gt;The restaurant is nice, as they usually are. The cheesecakes were the best part of our dinner!", "rating": 4, "date": "4/7/2008"}, {"text": "My mother would always take me here, and we would always share a meal and split the bill. They are pretty pricey... (I have also heard that the movie theater and this restaurant are the main things keeping Southdale mall alive) <br&gt;<br&gt;Anyhoo... This is the first and only restaurant I have ate calamari at and loved it. It was wonderful!! I also will only eat fish and chips from two places, Here, and Mystic Lake.... <br&gt;<br&gt;The bread is here also to die for. The place is pricey, but it&amp;#39;s pricey for a reason. Good customer service and great food!!", "rating": 4, "date": "8/7/2010"}, {"text": "Huge menu with huge portions.  The Pineapple upside down cake cheesecake is to die for. Food  and cheesecake are awesome!", "rating": 4, "date": "9/24/2012"}, {"text": "I am very much a fan of cheese cake factory.  I have been to several in my travels and they are consistent with food, speed, pricing.  Waiter/Waitress speed has never been that great at any of the resturants. I not eaten anything I don&amp;#39;t like.  Yes the sizes are huge but my family and I always plan for take home and you have lunch for the next day.  The stuffed mushrooms are awesome, crab cake sandwich, meatloaf dinner, veggie wraps etc.  Yum!!!  Drink prices are terrible. As for the desserts, we skip them.", "rating": 4, "date": "1/24/2013"}, {"text": "Visited the Southdale location yesterday and was mildly impressed.<br&gt;<br&gt;Upon entry I was pleasantly surprised by the decore. I don&amp;#39;t know if I have actually ever been to a Cheesecake Factory and if I have it has probably been a while, so it is completely possible that subconsciously definition of The Cheesecake Factory has been slowly built through the many episodes of &amp;#34;Big Bang Theory&amp;#34; that I have watched. The floors are white marble, the booths and tables are constructed of some sort of dark wood, and the lighting is a bit brighter than dim which helps make this place seem more classy.<br&gt;<br&gt;I ordered the Chicken Marsala which was served on a bed of bow tie pasta and one stray tube of penne pasta. Chicken Marsala is typically one of my favorite Itallian dishes as it offers the perfect balance of sweet and salty with the nice Marsala wine flavor. The portion that came was fairly large and came with a good amount of chicken and mushrooms and a nice brown gravy. If presentation were the only catagory I was judging this place on they would have certainly earned at least one additional star. After the first few bites I noticed that the chicken did not really have any flavor itself, and the Marsala sauce resting on the chicken was the only thing giving the dish any life at all. This immediately made me think of a large metal tin resting gently on a tub of hot water, in the kitchen, piled high with chicken breasts and &amp;#34;chefs&amp;#34; pulling from this pile, throwing them onto a bed of (insert pasta type here) then going over to the sauce bin, slathering the plate with (insert sauce type here), right before being served. More or less your high end production assembly line type of food service (for clarification: high end for this catagory is at best 3 stars). The Marsala sauce had nice initial flavor, unfortunately the back end tasted a bit watered down. I don&amp;#39;t like wasting food, so I finished the chicken and mushrooms, but the pasta and watery sauce was too much for me to be able to put it down.<br&gt;<br&gt;Being that we were at the Cheesecake Factory and that I love Cheesecake, this made for a very nice arrangement! If you are an avid Cheesecake lover such as myself they basically have every variety of cheesecake you would ever want. Fruit toppings, chocolate toppings, candy bar toppings, Orea toppings, combinations thereof, the list is endless and one should literally decide by throwing a dart into a board. We ended up with the Snickers Cheesecake and it was delicious! Had we just come here for dessert, easily 4 stars. It tasted like the whip cream was made in-house; it was nice and cold, thick, and paired very nicely with our cheesecake, and I can easily see it pairing well with fruit topped cheesecakes as well.<br&gt;<br&gt;Overall the experience was enjoyable, I just wish the food tasted better (especially for the price), and that the server came around a bit more frequently. Their long list of cheesecakes will probably bring me back sometime in the near future, but unfortunately probably not for dinner.", "rating": 3, "date": "4/12/2012"}, {"text": "Trendy, fun, and relatively unique for a chain. Great cheesecake. Nice date place. There is a patio in the summer.", "rating": 4, "date": "4/7/2012"}, {"text": "We loved the decor of The Cheesecake Factory,  and we only had to wait about 20 minutes to be served on Mother&amp;#39;s Day.  Our waiter was very friendly, efficient and helpful.  The brown oatmeal bread was delicious. Now, on to the other food.  It was just okay, and we all ordered different items.  Nothing stood out exceptionally except for the prices which are extremely high.  A beer was over seven dollars?  Are you kidding me?  Our bill came to over one hundred dollars.  The best part of the meal was my pineapple upside down cheesecake, it was yummy!!!!!!!  Probably had three thousand calories though!  It&amp;#39;s not a bad restaurant overall, we would probably go again, but it is overpriced.", "rating": 3, "date": "5/13/2012"}, {"text": "My husband and I had a superb experience at Cheesecake Factory.  It is a huge place, so the fact that there is a long wait at times tells you, people love it.  The Tuxedo Cheesecake was magnificient!  We did eat early on a weeknight so there was NO wait.  Server was great, helped us with recommendations and was very attentive.  Definitely will go again.  Check out the menu online before you go, it will help you decide from the many choices.", "rating": 5, "date": "10/15/2014"}, {"text": "Service is a tad slow, which is a bummer. It&amp;#39;s always busy and is a chaotic mess at times...Bringing in large groups also is a headache. If you do plan on going, be prepared to wait. The wait can last 5 minutes or an hour. However, the food is good (I encourage the Spicy Chicken Chipotle pasta) and the cheesecake is delicious. Been there a handful of times and can&amp;#39;t complain too much.", "rating": 4, "date": "8/26/2014"}, {"text": "Had the Mexican tortilla salad, under 590 calories and super, super good and big!", "rating": 5, "date": "1/11/2012"}, {"text": "I went because I had a gift card. Otherwise, I probably wouldn&amp;#39;t have gone. <br&gt;And well, I am torn on the rating. <br&gt;I will start with the positives- <br&gt;-The cheesecake is knock your socks off orgasmically wonderful. I don&amp;#39;t care if &amp;#34;orgasmically&amp;#34; is a word or not! <br&gt;The ok&amp;#39;s- <br&gt;-The food. It&amp;#39;s alright, although it&amp;#39;s difficult to say a club sandwich is worth $11.95. It should never be more than $5.95! <br&gt;-The service. It was alright. Wasn&amp;#39;t bad, wasn&amp;#39;t wonderful. <br&gt;The negatives- <br&gt;-Location. Southdale is always packed, for whatever reason. It&amp;#39;s tough to find a convenient parking spot. Which can be a plus I guess, to work off the 5 billion fat grams on the hike back to your car after eating a piece of cheesecake! <br&gt;-I don&amp;#39;t like Edina, but that&amp;#39;s just me. <br&gt;-Seating....we were seated at a tiny little table that was about 6 inches from each table beside us.  It was like dining with strangers.  Not easy to have a private conversation when you have strangers a foot away.  Who, by the way were fine on the right side, but weird as hell on the left.  They actually started questioning us about our food choices right as our food was brought to the table.  I was like, bitch, I am hungry, shut up so I can eat and mind your own business.  I didn&amp;#39;t say this out loud, but it felt good to say it in my head.<br&gt;-A little on the spendy side (see above comment on the $11.95 club sandwich) <br&gt;So, whatever. I got a kick ass piece of cheesecake. I also could of saved the trip and the money on the rest of the meal and picked up some Cheesecake Factory at my local Super Target where they sell it in their bakery.", "rating": 3, "date": "1/5/2009"}, {"text": "if the amplificatIon of your ass is the objective then the place deserves 10 stars.  <br&gt;<br&gt;the portions are large enough to feed a reasonably sized village the menus are chock full of adverts and I wouldn&amp;#39;t be surprised if they actually piped in additional crowd noise while you&amp;#39;re dining.  <br&gt;<br&gt;i&amp;#39;ve seen people order a salad (appetizer sized portion) and then cancel the order for the entree when the app salad arrives.  this is all about excess and it feels cheap and then you get the bill and then you realize, you really did have a weeks worth of groceries on your plate. so in terms of mass it was actually a good deal. <br&gt;<br&gt;good for groups, horrible for dates. think chilis with more noise, italian food, more ads and a wide range of tangential dishes all of mediocre quality.   that this place is in edina should surprise no one.", "rating": 1, "date": "9/19/2010"}, {"text": "Look, I don&amp;#39;t normally seek this place out, but I went for lunch with two friends today. I remember from past visits the food being OK, and most big chains will at least be able to get you lunch without much problem. Not here. Our service was incompetent. It took about 10 minutes just to get drinks, and another 10 for someone to take our order. We were given silverware, bread (which was basically stale), and a tablemate received her side of salad dressing for her salad. About 20 minutes later our server came by with dessert menus. The hell? We reminded him we ordered food and had not received it. 15 minutes later, were told food would be out &amp;#34;soon.&amp;#34; It came after about another 15 minutes. The guy was in a daze the whole time, and just appeared clueless. We were told that if we wanted to order dessert it would be comped, so I guess that&amp;#39;s sort of redeeming. So we each ordered dessert, just on principle. It was noon on a Saturday, and the place was about 1/2 full of people, and there were plenty of servers. <br&gt;Anyway, the food is meh, but there is a lot of variety (almost to a fault.), and you&amp;#39;ll get an OK meal.", "rating": 2, "date": "6/12/2010"}, {"text": "Raspberry lemonade was good, portions are big, good service, and good atmosphere. However, food was not that great. Nothing really stood out to me. Cheesecake is good if you like unusual flavors, but for a plain cheesecake it&amp;#39;s just average.", "rating": 2, "date": "7/8/2012"}, {"text": "Last Tuesday I went to dine here at 8:30 pm. The waiter seemed very nice and we got our drinks after a few minutes. I ordered the raspberry lemonade and it was so incredibly sour I could not drink it. I asked for the hibiscus instead. It took 30 minutes for that to come out.  When our food came, it was not what I ordered. The waiter who brought out the food told me he would have the manager come talk to us, that never happened. The waiter came back after 10 minutes and I told him the order was wrong and he said &amp;#34;Oh yeah those 2 are right next to each other in the computer, I&amp;#39;ll get it changed&amp;#34;. This would&amp;#39;ve been fine if they just re-fired the food right away. I know, working in the industry in the past, that you need to let the kitchen and manager know when you mess up an order so they can get it pushed to the front and it won&amp;#39;t take long to make. I ordered the chicken picatta and it took ANOTHER 40 MINUTES for me to receive my food. By this time my date was done with his food (I told him not to wait).  We only saw the waiter during these couple times and he never came back to check on us and we never  saw the manager. Finally, the bill came and we were charged for BOTH drinks I had ordered even though I did not even drink the first one! He said he couldn&amp;#39;t take it off the bill since it came to the table.. WHAT?!  For all the time we wasted (it wasn&amp;#39;t even busy) this was not worth it. We weren&amp;#39;t offered a discount or even free cheesecake or anything for all we went through. Luckily the food is good, but next time I am ordering to-go and won&amp;#39;t dine in.", "rating": 2, "date": "6/27/2016"}, {"text": "Food was very greasy and salty. (Fish and Yam Fries).  Pineapple upside down cheesecake was great.", "rating": 2, "date": "9/5/2012"}, {"text": "According to Chef Ramsey there are 2 rules to a great restaurant.  Rule #1 fresh ingredients.  Rule #2, keep it simple.  The Cheesecake Factory has never seen &amp;#34;Kitchen Nightmares.&amp;#34;  The menu alone contains 19 pages.  It covers just about every type of food you could possibly order.  And the interior matches the overwhelming menu.  For how extremely busy it always is there they do a great job of keeping up with the insanity.  And the food was good, better than what I was anticipating.  If the presentation wasn&amp;#39;t so messy and the prices were a little more reasonable I would have given it 4 stars.  Recommended for tourists in the area and fans of, SURPRISE, cheesecake.", "rating": 3, "date": "5/20/2012"}, {"text": "Probably one of my wife&amp;#39;s favs, and I enjoy it as well.  I don&amp;#39;t think I&amp;#39;ve ever had anything bad here, and overall most of my meals were really good.  expect to take some home.  <br&gt;<br&gt;The only downside is that there is typically a wait during peak times, but that&amp;#39;s pretty normal with good, no reservation restaurants.  <br&gt;<br&gt;And yes, it is a chain, but who cares.  It&amp;#39;s good, and has something for everyone, and almost all the food is made from scratch.<br&gt;<br&gt;and did I mention the awesome cheesecake.  The other deserts are so-so<br&gt;<br&gt;I suggest going later in the eve (after 8:30), and stay away during the holiday season.", "rating": 5, "date": "11/21/2008"}, {"text": "Im really not that big of fan to be honest with you, we went there for dinner and the food was passable, the real reason to come back would be the deserts. Just to say, the sign says cheese cake factory, not &amp;#34;super Italian and some foregin cheese on a burger with white shirts kind of trying to be an upscale macaroni grill but cant factory&amp;#34; That wouldnt fit the building and would cost a small fortune to light up. Go there for the cake and then leave. As we all know though, a chain never is as good as a one off.", "rating": 3, "date": "7/8/2009"}, {"text": "I went along with my girl friend to this place. It was on monday evening. We ordered chicken and steak, it wasn&amp;#39;t that great, but good", "rating": 3, "date": "5/12/2010"}, {"text": "over-crowded and no real system for people to follow or &amp;#39;over flow&amp;#39; room for waiting patrons to use.", "rating": 3, "date": "3/29/2014"}, {"text": "My sweet Cheesecake Factory, it pains me that we live in separate worlds - you, many moons away in the galaxy of Southdale Mall, and me, in the galaxy of eastern Twin Cities suburbia.  How am I supposed to survive on cheesecake from your great institution only every other month at best?  I have tried to find a closer replacement, but no one can compare to you.  You keep on making those heavenly Red Velvet, White Chocolate Macadamia Nut, and Pumpkin Pecan cheesecakes and I will keep dreaming of you morning, noon, and night.", "rating": 4, "date": "8/8/2010"}, {"text": "I don&amp;#39;t know what Mike is talking about. I&amp;#39;ve been to this location about half a dozen times and all of them have been winners. I generally go out later on weekends and always have to wait up to 45 minutes. The food is terrific, the atmosphere is dark and classy, and the cheesecake is easily the best I&amp;#39;ve had. I say this having been to the Elli&amp;#39;s Cheesecake Factory in Chicago...they&amp;#39;ve got nothing on the cheesecake they make at the Cheesecake Factory restaurants. The food is great Italian food and the list of cheesecakes is long. The food and desserts aren&amp;#39;t cheap, but wow is it worth it. You&amp;#39;ll want to make sure you save room for dessert here and it&amp;#39;s okay to to a box home because it will still be great tomorrow.", "rating": 5, "date": "5/16/2007"}, {"text": "First off, I love being seated between a group of women in their late 40&amp;#39;s having a wine themed birthday party and two women on the other side who judged everything they could. I was lucky enough to share the long booth bench smushed between such a perfect group on a date for my anniversary. The waiter couldn&amp;#39;t give a damn to really help us, never gave us the specials ( heard him tell others as they say down) and could rarely be found. What was going to be a nice three course dinner to celebrate we quickly (I say that liberally because of how long it would take before we saw our waiter each time) decided on an appetizer and cheesecake to go and went back to our hotel and ordered room service (probably better food anyways). This was my first and last time there. Not to mention our cheesecake to-go was just thrown in the boxes with no plastic silverware. When I go somewhere with such a reputation and higher prices I expect a little more.", "rating": 2, "date": "3/26/2015"}, {"text": "Perfect for stopping after the movies.  We had appetizers and mojitos.  Tried the chicken croquettes (croquetas de pollo) and they tasted like the real Spanish croquetas!", "rating": 3, "date": "2/10/2011"}, {"text": "I can&amp;#39;t believe this place is lower on the star list I am a huge fan! For the amount of food you get the price is just fine and the cheesecake oh my God in heaven it&amp;#39;s very good! Sooooo many favors to pick from and the menu for dinner options is the same way. It can be hard to pick! My husband doesn&amp;#39;t even like cheesecake and he loved the Oreo one! I have had many flavors but I think the vanilla bean is fantastic! Get the cheesecake to go though since I promise you&amp;#39;ll be to stuffed to eat!!!!", "rating": 5, "date": "10/30/2011"}, {"text": "I went there for my birthday dinner with my fiancé. My first time there but not his. For a Saturday (5:00) it was quite busy. Patio was full and we were anticipating a long wait but when we got in there, they said 10 minutes, and they weren&amp;#39;t lying. :) The menu is HUGE! I got an overpriced Long Island that wasn&amp;#39;t that great but his Stella was only $5. We ordered pot stickers for our app and I had the chipotle mayo chicken sand. He ordered the smokehouse BBQ burger. I am disappointed in the fact that our entrees arrived before our appetizer (meaning she forgot). We should&amp;#39;ve cancelled it because it wasn&amp;#39;t worth the $8.95 they charge. But the portion size of the entrees is definitely worth the price. Service was what you&amp;#39;d expect and I would return (just to try one of the other 100 items on the menu). Oh, and the red velvet cheesecake is alright. :)", "rating": 4, "date": "5/19/2013"}, {"text": "I absolutely love The Cheesecake Factory. I was traveling to MN and discovered this location. The food of course was amazing but the service was absolutely horrible. As I walked in there were a few girls standing at the hostess podium. It wasn&amp;#39;t until after they were done chatting did they acknowledge my party. As we were waiting on our food, which took FOREVER even though they weren&amp;#39;t even that busy, I witnessed 2 waiters picking at their nose without ever washing their hands or removing themselves from the floor to go to the restroom. Absolutely every employee that worked there looked miserable. Not one employee was happy or even pleasant to talk to. Our waitress never refilled our drinks and I had to sip on my boyfriend&amp;#39;s until we left. She was so rude and seemed like she absolutely hated her job. I feel the $3 tip we left her was way too much.", "rating": 1, "date": "3/27/2012"}, {"text": "The food was good, but only decent service. The price isis WAY to high for the quality of food and not personal servers. Not worth it unless you love the cheesecake itself.", "rating": 2, "date": "4/11/2011"}, {"text": "So my friend and I went here for truly just a glass of wine and that was not the case. It did take our server awhile to get our drink order but once we put it in along with our food all was well, awe not so much the case. Our wine showed up and it was not fast by any means and the glasses were extremely sticky and my friends have something floating in it. You know what it happens not a big deal, so we asked our server if she could just get us new glasses. A few minuets later a manager came and we told him we just wanted new glasses since these where where sticky, he asked if we still wanted the wine and we said YES just clean glasses. Well this took almost 15min, our food had come and we sat there eating it with nothing to drink, yes not even water (we said at the beginning no water since we where drinking wine, joke was on us) but 1/2 way through us finishing our lunch our server comes to tell us her manager was having to hand wash the glasses, that&amp;#39;s great but 15min. As we sat with our food done and wanting anything to drink at this point the manager finally showed up with our wine and wouldn&amp;#39;t stop explaining how he had to hand wash the wine glasses and sorry it took so long. It was like he wanted a medal. I&amp;#39;m a pretty patient person and was in the industry for 6 years so I get it but this was so ridiculous on the managers part. I don&amp;#39;t want to put to much blame on the server as she was getting slammed and her manager taking over but both did a very poor job taking care of there customer and the manager did an extremely poor job being a manager. I like the cheese cake factory but probably never this location again.", "rating": 2, "date": "2/11/2015"}, {"text": "Two words: Avocado Eggrolls, they are fantastic, and the sauce is delectable, I always start any meal at the Cheesecake Factory with the eggrolls, and I usually go for the Miso Salmon for my entree, it gets pricey in the dinner portion, but the lunch portion is super cheap and way more than enough food, even for those of you with hollow legs. They always have great food presentation, the service is generally superb, and their drinks are pretty great, the passion fruit mojito is really really good, the bellini is terrible. There is generally a wait so I would call ahead and put your name on the list just to be sure. ON the whole, this place is affordable and they have  a very large selection of foods, ranging from asian to american to meican to a delicious fusion. I am usually skeptical of a restaurant that tries to do too much with its menu, but I have to say that they do a wonderful job with all of their menu items, I have onlyonce had a bad experience, the food was cold, and the waitress switched our meals when she boxed the food, we didnt find out until it was too late to swap.... i took a trip to bummer town that night bc i was really looking forward to leftovers for lunch the next day... oh well! The cheesecake it pretty good, and they have a large varriety of choicess, but honestly, their entree menu is the only reason I stop in.", "rating": 4, "date": "6/23/2012"}, {"text": "First, the decor...what?  We couldn&amp;#39;t figure out the theme, and decided that they must have gotten a deal on Vegas strip leftovers.  Quite the hodgepodge.  There were way too many options, and the portions were almost comically huge (which could be good or bad, depending on your mood.)  Service was decent.  Nothing really stood out.  I guess it would be a good place to go if a large group of people who couldn&amp;#39;t agree on one cuisine were getting together.  Meh.", "rating": 3, "date": "10/17/2009"}, {"text": "I have to tell you about the most amazing meal. It is called the Spicy Chicken Chipolte Pasta and it is AWESOME! Never before have I tasted something so amazing. Honey Glazed Chicken, Asparagus, Red and Yellow Peppers, Peas, Garlic and Onion in a Spicy Chipotle Parmesan Cream Sauce... What&amp;#39;s not to love?", "rating": 5, "date": "12/16/2011"}, {"text": "The food are very delicate and delicious. From appetizer, entrees, dessert, they all excellent! The price is reasonable too, I always want to come back.", "rating": 5, "date": "11/26/2009"}]}