{"address": ["4701 Wyandotte St", "Kansas City, MO 64112"], "monthly_reviews": {"2019": [[0, 3.0], [1, 2.5], [2, 2.0], [3, 1.5], [4, 2.5], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.0], [9, 2.5], [10, 3.0], [11, 2.5]], "2017": [[0, 4.0], [1, 4.0], [2, 3.5], [3, 3.5], [4, 3.0], [5, 2.5], [6, 2.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.0], [11, 2.5]], "2020": [[0, 3.0], [1, 3.5], [2, 3.5], [3, 3.0], [4, 3.0], [5, 2.5], [6, 2.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 2.5], [11, 2.5]], "2018": [[0, 2.5], [1, 3.0], [2, 4.0], [3, 4.0], [4, 4.5], [5, 3.0], [6, 3.0], [7, 3.5], [8, 2.5], [9, 2.5], [10, 3.0], [11, 3.0]], "2021": [[0, 2.5], [1, 3.0]]}, "reviews": [{"text": "Great customer service while out is a HUGE deal to me. Especially while I&amp;#39;m out with my two toddlers. <br&gt;<br&gt;Our server was Jared, I believe is his name? He was awesome. Our drinks were NEVER empty. We never went without extra napkins or plates. He even made sure to keep bread on the table, probably thinking about my kids and understanding they don&amp;#39;t wait very well while hungry. <br&gt;<br&gt;He has a great attitude and never complained when I was asking for extras or changing my mind about something. <br&gt;<br&gt;There was a nice lady that also came by a few times to bring our food or help keep our drinks filled. I cannot remember her name, but she too was awesome! I absolutely love how friendly and happy they were, even though that place was PACKED and I know they were busy trying to keep everyone happy. <br&gt;<br&gt;I 100% recommend this location just based off the workers. I truly appreciate good people and they did so well with my kids as well. Which is extra gold stars in my book! If we ever visit KC again, we would definitely return.", "rating": 5, "date": "3/9/2020"}, {"text": "Cheesecakeepic fail on Cheesecake management and staff.  Being senceible and helping the people outside  No  wait in line for 35 minutes on an order that was placed at 4 hours in advance and paid for you must go inside REALLY   better planning would have helped everyone. No such thing<br&gt;#SkipTheLine", "rating": 1, "date": "5/10/2020"}, {"text": "My husband and I were terribly disappointed with dinner.  The service was good, but the food wasn&amp;#39;t.  My husband and I have come to the conclusion that ever since restaurants started opening back up since the mandated closure due to the coronavirus, things just haven&amp;#39;t been the same.  We eat out a lot and we can name 9 out of 10 restaurants that have gone downhill since reopening and this is one.<br&gt;Our taste buds were set on crab cakes.  We arrived and they were totally out of crab anything.  So we ordered other items we like...cheeseburger egg rolls came out hot but the flavor wasn&amp;#39;t good, they made my husband feel kind of sick to his stomach .  The French fries arrived limp and barely warm .  The fried mac n cheese balls came out hot and tasty .  The sweet corn tamale cakes were warm, flimsy and tasty  and the fried Korean cauliflower was soggy and barely warm .  The only item we ate all of was the mac n cheese balls, everything else we left half or more.  <br&gt;The restaurant wasn&amp;#39;t packed so we couldn&amp;#39;t figure out why the bad food.  Most of our food seemed like it sat in the window a long time before it was brought to us.<br&gt;I took pictures, but they aren&amp;#39;t the best because the lighting was real dim and their lights are yellow and orange.  I tried.<br&gt;I can say that if you didn&amp;#39;t have a face mask on, you were turned away  and the tables inside were socially distanced .<br&gt;We think we&amp;#39;re gonna spend more time eating at home till these restaurants can get back to the way they used to be", "rating": 2, "date": "7/14/2020"}, {"text": "Best place for dinner in downtown plaza . Love the Thai wraps vegetable . Delicious dinner plus the cheese cake cookies and cream yummm . Best desert ever .", "rating": 5, "date": "12/24/2019"}, {"text": "It is at country club plaza.The view from the second floor is pretty good.We went there last Sunday and waited for 20 minutes to get our food.It was so busy for lunch.We ordered two dishes, one is Thai coconut chicken with green curry sauce, the other is impossible hamburger.To be honest,the chicken dish is awesome, as same as I ate at the Thai restaurants.But the hamburger is just so so.We ordered the pineapple cheesecake, and it is yummy!The average cost of main dish is around $15, a little pricey.The atmosphere is good for dating or special events.", "rating": 4, "date": "2/25/2020"}, {"text": "It has always been a great dining experience here. The cheesecakes are wonderful. They serve one of my favourite salads and everything on the menu is fresh. On my last visit, my veggie friend&amp;#39;s order was customized really well and I absolutely loved my peach smoothie. <br&gt;I&amp;#39;ll be back soon!", "rating": 4, "date": "9/2/2018"}, {"text": "I enjoyed some great items for brunch (I forgot to include a picture of my mimosa). Every thing was wonderful. I&amp;#39;m looking forward to going back soon.", "rating": 5, "date": "3/1/2020"}, {"text": "I was there early because I had my table reserved and they said I could not be seated until half of my guest were there. I had to wait outside in the rain and then they told me that if my guest weren&amp;#39;t there I&amp;#39;m ten minutes they were going to give my table away. I reserved the table for a surprise for someone and couldn&amp;#39;t even get in the building that I had a table reserved for.", "rating": 2, "date": "11/21/2020"}, {"text": "Stopped by for happy hour... Monday not busy.... only 5:30....only giving 2 tables for HH", "rating": 1, "date": "8/24/2020"}, {"text": "EDIT: <br&gt;I would like to edit my review because although it wasn&amp;#39;t a pleasant experience to start, recognition is deserved when these subpar experiences are made right. Thank you to Catie (different manager) for reaching out and also listening. She handled things professionally and I look forward to my next visit at the Cheesecake Factory.", "rating": 4, "date": "7/23/2020"}, {"text": "As a table of 6, we were given an hour and twenty wait estimate. As if that&amp;#39;s not enough, they don&amp;#39;t have adequate seating while you&amp;#39;re waiting, so we&amp;#39;ve been standing that entire time. Everyone that we were behind were seated a long time ago, and many, many people who have come after us have also been seated, including groups of 7.<br&gt;<br&gt;After an hour and twenty, they told us that they assign you a table (instead of first come, first serve) and that the people at our assigned table had paid and were just sitting, drinking coffee, and talking. <br&gt;<br&gt;After an hour and 45 and at least 3 people in our party checking with them and being told 10 to 15 minutes twice, the hostess finally decided that the people at our assigned table weren&amp;#39;t leaving any time soon and THEN decided to give us whatever table was next available.<br&gt;<br&gt;A few minutes later, they tell us a table opened up and sent us upstairs. We were escorted to the table only to find it only seated 4 and then were told that a table was available downstairs. Nearly 2 hours later, we&amp;#39;ve finally been seated...as people who came BEHIND us have already eaten and are getting up to leave.<br&gt;<br&gt;This all could have been solved with reservations, which they don&amp;#39;t do.<br&gt;<br&gt;Our server was really great in terms of making sure our drinks were filled, and we tipped well for that reason. It&amp;#39;s not his fault that the rest of the restaurant doesn&amp;#39;t seem to be ran well.<br&gt;<br&gt;My dad always takes leftovers and didn&amp;#39;t even take his bang bang chicken. He&amp;#39;s not one to complain, and he said it was nasty. I tried it, and it was very sweet yet bland. (Update: he and I both got sick later, and we have iron stomachs...so something was off.)<br&gt;<br&gt;I got shepherd&amp;#39;s pie. It was good, but not worth the wait or ever going back honestly. And I had heard such good things about cheesecake factory... Maybe other locations are better, but it&amp;#39;s not worth the risk at your expense.<br&gt;<br&gt;The other 4 said their meal was good, but in all of the chaos, my mom&amp;#39;s order got mixed up with a similar title. She mentioned it to the server, but I don&amp;#39;t think he understood. She&amp;#39;s also not one to complain, so at that point, didn&amp;#39;t say anything else. <br&gt;<br&gt;3 hours... $150. Mediocre food. Not really worth it. Maybe try one of the others in the area.", "rating": 1, "date": "12/27/2019"}, {"text": "Chain restraint with a massive menu. I don&amp;#39;t remember seeing many healthy options. The cheese cake menu was huge, as the name might imply. It feels like a chain restaurant posing as a fine restaurant. Ultimately I&amp;#39;d only pick this spot again if I was looking for the biggest portions possible.", "rating": 2, "date": "11/5/2019"}, {"text": "I very seldom go to the Cheesecake Factory and my recent visit on a Friday night reminded me why.  There&amp;#39;s always a wait for a table and, of course, Friday and Saturday nights are the worst.  The hostess told us that it would be 30 minutes for a table.  After waiting about 45 minutes, we inquired and were told that it would be another 30 minutes. So, after 45 minutes - we were still 30 minutes out.<br&gt;<br&gt;Once seated, however, service was pretty prompt and our server was very polite and professional.  I was disappointed when he announced that they were out of Ahi tuna (at 8:00 on a Friday evening) and therefore couldn&amp;#39;t serve the Ahi tuna tartar or any of the salads with Ahi tuna in them.  We all found something to order and the food came out pretty quick.  The food was hot and tasty; I have no issues with the food quality or service.<br&gt;<br&gt;I&amp;#39;d rate the service (once seated) as 4-star; the food was either a high 3-star or low 4-star but I can&amp;#39;t give an overall rating higher than a 3-star for the hostess being 45 minutes off on her estimate of 30-minutes for a table.  By the time you&amp;#39;ve invested 340-45 minutes waiting in line, you&amp;#39;re not apt to leave and go somewhere else.", "rating": 3, "date": "7/15/2018"}, {"text": "Cheesecake is expensive to say the least. The food is traditionally good even though the prices are higher than most farm to table restaurants in the area. After ordering for the third time a to go order through DoorDash during Covid and spending over $100, it was still wrong. For some reason, their table bread is left out of the to go orders. I called to ensure we would get their delicious wheat bread. After receiving the order to find two slices (not two mini half loaves but two slices) I called to speak to the manager. Millennial Kate was the manager on duty who continued to talk over me and say we where given the right amount of bread for what we ordered, not even speaking to the fact that it has been left out the previous two orders. It&amp;#39;s gratuity bread! She proved her point- I won&amp;#39;t be spending my hard earned money on a corporate restaurant anymore. I&amp;#39;ll support my local food fares who care about my business.", "rating": 1, "date": "9/10/2020"}, {"text": "One of my favorite Cheesecake Factory restaurants.. Very nice location and food is awesome", "rating": 5, "date": "2/13/2020"}, {"text": "Typical Cheesecake Factory food. We had apps and drinks - nachos, chips w/spinach artichoke dip and egg rolls. Consistent with other locations. Seating was slow though the restaurant was half full. Waiter was not good. Slow, mumbled a lot and didn&amp;#39;t check on us until food almost gone. He Forget to bring bread until apps dropped 20 minutes after ordering. The building is unique and the Outside seating is nice by the fountain.  Restrooms are upstairs and that seemed strange.", "rating": 3, "date": "9/6/2019"}, {"text": "Made reservation apparently system happens to be down when we get there on time. Made us wait on anniversary. Food is usually good but service is trash", "rating": 1, "date": "7/15/2020"}, {"text": "Not to be confused with the Cheesesteak Factory, which is basically Pat&amp;#39;s and Geno&amp;#39;s, and is even more sh**.<br&gt;<br&gt;I don&amp;#39;t really like the products at the Cheesecake Factory. The burgers are expensive and just okay. The milkshakes can be good but a lot of them are not good. Their special milkshakes are usually better but they don&amp;#39;t have them year-round which is annoying. <br&gt;<br&gt;Don&amp;#39;t get me started on the cheesecake. I&amp;#39;m not a huge fan of Cheesecake anyway but if I was I certainly wouldn&amp;#39;t be getting cheesecake from this place. It just doesn&amp;#39;t compare to truly homemade delicious cheesecake such as the ones in New York City and Chicago that I love. Eli&amp;#39;s of Chicago, S &amp;amp; S of The Bronx, just to name a couple.<br&gt;<br&gt;I only ate here because one of my friends/sponsors brought me here with her family.<br&gt;<br&gt;The lovely service is the reason for the rating.", "rating": 3, "date": "2/1/2018"}, {"text": "Man, oh man I want to love this place. It probably has the best patio in The Country Club Plaza area and the location is primo...the service though, is lacking and the food quality has declined since it opened many years ago. We were able to score a lovely table outdoors last night where we sat for a little over ten minutes before a server came to greet us. She was very sweet, when we saw her, but she disappeared often, and for very long periods of time, which was difficult because we never received several things throughout the evening. A side of cilantro, a side of ranch, a basket of bread, a glass of water, two of our entrees, our check...these are all things we either never received or we had to ask for twice. The two missing entrees were so far behind the other two we ordered, our friends (who we told to go ahead and eat) were almost finished with their meals by the time they came out. My grilled shrimp tacos were cold as soon as they came to the table and fairly tasteless too unfortunately. That missing cilantro sure would have come in handy. Upon the completion of our meal I asked for the check. Seventeen minutes later, our server came by and said &amp;#34;And you&amp;#39;re still waiting on your check...&amp;#34; but did not have our check in hand. I handed her my credit card and just asked her to run it. <br&gt;<br&gt;If I can help it, I won&amp;#39;t be back to The Cheesecake Factory on the plaza. There are far too many restaurants in this area that provide extraordinary service and outstanding food to waste my money here.", "rating": 2, "date": "7/27/2019"}, {"text": "I&amp;#39;ve been going to this location for years and have always been impressed with the customer service and food. Tonight we attempted to check in our big party for a family meal. The person who was responsible for checking us in , was rude and unprofessional to the extreme. Earlier today we called to see what the situation would be for our large party and the lady was very accommodating and said yes, it could be done with one person sitting there with the buzzer. <br&gt;<br&gt;Armed with this information , we made it to the front desk. After giving him our party information, he made it very clear that it was just impossible. His shrugs, and noncommittal murmurs were off putting. I offered possibilities and each one was met with a shrug and shake of the head. We reached a stalemate and I said fine, just put our name in and hand me the buzzer. He said NO buzzer , but he offered a call to our cell if and when seating was possible. I will be calling Management in the morning. I also don&amp;#39;t think they understand the amount of sales and tips  that they missed out on a table of 31. <br&gt;Disappointed from start to finish about the situation .", "rating": 3, "date": "11/23/2018"}, {"text": "Very DISAPPOINTED! Ordered a simple CHEESECAKE for my wife&amp;#39;s birthday.  Was to pick up on curb side pick up at 5pm four days later. I was there called in and lady who answered phone had NO idea who I was.  Told her I ordered cheesecake and a choclate plaque that read Happy Birthday.  She says we are out of that. I said I was charged for it. She put me on hold, probably 15 minutes, never getting back on. Someone walked out with cake and apologized, but I was already pissed. Said he would take charges off my card. NEVER HAS A CHARGE BEEN REMOVED! I am VERY disappointed with YOUR ESTABLISHMENT!!", "rating": 2, "date": "5/16/2020"}, {"text": "It&amp;#39;s been awhile since I&amp;#39;ve had Cheesecake and boy was I satisfied. Kansas City&amp;#39;s location is in the mecca of downtown with many shops and restaurants.<br&gt;<br&gt;I had the traditional strawberry cheesecake for $8.00. So good! Crab cakes bites were pretty good as my appetizer. I may come back one more time before I leave Kansas City due to the bartender&amp;#39;s exceptional customer service.", "rating": 4, "date": "11/30/2018"}, {"text": "whoever one day said yes lets roll some mac and cheese together to make balls and then fry then i just have to say they were on to something because this is the only thing i get when i come here. Yes they have the biggest menu on the Guinness record but i have to say im a creature of habit these fried mac and cheese balls just cant let you down hellllla rich but so delicious their on the appetizer part of the menu but your not gonna regret it especially since you get your pre-bread meal (go for the rye bread with butter) yum yum. 10/10 as well recommend the Adams peanut butter chocolate fudge cheeeesecakeee ahhhhhh fudge, peanut butter, chocolate crust and topped with butterfinger i actually cant tell you what more you could add to possible make it taste better the answer is nothing. i used to go for the cheesecakes that are &amp;#34;cheesecake cakes&amp;#34; because their 2x the size and for me the bigger the better (red velvet or the peanut butter are also a must) ive even heard the lemon flavors are phenomenal but whatever you get the foods great love dis place especially putting in 3000+ calories in one meal #worthit (stay away from the celebration cake and 50th celebration no bien) (tuxedo, smores, hershey, Oreo, rasberry chocolate, cookie dough, original are all great too!!!)", "rating": 5, "date": "7/16/2019"}, {"text": "Wide variety of menu options, accommodations made for most sensitivities. Popular place any time of the week. Exceptional service.", "rating": 4, "date": "2/29/2020"}, {"text": "This was my favorite restaurant. The staff is now uneducated, the food is bland and the cheesecake recipe has changed completely. For the first time in the history of me going to this place I didnt eat all my cheesecake. NOT GOOD!", "rating": 1, "date": "10/12/2019"}, {"text": "It&amp;#39;s been a while since I&amp;#39;ve been back to KC and decided to give Cheesecake Factory a go. It was on a cold Tuesday during lunch time. Not very busy at all... but the service was EXTREMELY slow. Waited for about 15 minutes until our server came by our table to take our drink order. We just ordered everything at once, since we were on a slight time schedule. Food came out fast ironically. The food was... alright. It was nothing to rave about. My boyfriend did not like his dish all but forced it down. <br&gt;The cheesecake however, is always delicious! I usually get the original strawberry cheesecake. And the appetizer pork belly buns were great! <br&gt;Overall.. the food is okay. My server was extremely slow.", "rating": 2, "date": "11/21/2018"}, {"text": "Our wait time was an hour and 15 minutes. We reserved for a party of 10 and the hostess was extremely rude. She had blonde ombré tips and would not let us in because 5 of us were trying to find parking space. She said the whole party had to be present or we would have to wait another hour. Extremely ridiculous! She ended up splitting us up 5 and 5 and putting us farther away from each other when there was a long table that remained empty half the time we were there. Was done on purpose! Petty and unprofessional.", "rating": 1, "date": "8/28/2020"}, {"text": "We made a 6:30pm reservation and we were seated on time. I ordered calamari and shrimp scampi and both were amazing! My favorite cake is pineapple upside down cake so I ordered the pineapple upside-down cheesecake and it was amazing!!!! Everything was perfect for my 50th Birthday!", "rating": 5, "date": "8/24/2020"}, {"text": "We aren&amp;#39;t crazy about the food here but we LOVE the cheesecake! If we venture down to the Plaza for dinner, we also swing by the Cheesecake Factory for some dessert. You can&amp;#39;t go wrong with any of the cheesecakes here, but we really like the classic, vanilla bean, and dulche de leche.", "rating": 4, "date": "10/26/2018"}, {"text": "Having the understanding that things are different and stressful with COVID-19, was severely disappointed with taking my wife to Cheesecake Factory for our anniversary yesterday. I had made a reservation for 4pm knowing on a Saturday things were going to be busy and we had made some plans for after eating. Received a confirmation email, and a txt asking me to confirm and did. Arrived to the restaurant at 3:45. Told hostess we had a reservation and was told it wouldn&amp;#39;t be till 4 that we would be seated and we were fine with that knowing we arrived early. After waiting for 30 min past our reservation time we were finally seated at 4:34. <br&gt;When we were seated the table was dirty with what looked liked strawberry syrup and crumbs and still had the previous guests check and tip sitting on the table. With a pandemic going on we assumed that they would have at least wiped the table before we got to it. Then we sat for another 14 min before our waitress even came to the table to get our drink order for the first time. After another visit because she forgot we got our drinks. After this our visit and service was ok with a couple forgotten items, but due to the long wait after our reservation time and not even ordering drinks until almost an hour reservation, we missed our plans for after dinner.", "rating": 1, "date": "8/16/2020"}, {"text": "This has been one of the wwe worst nights ever at the Cheese Cake Factory. My wife and I always park at the top of the garage. We chose to park there so that we dont have a long ways to walk. I myself have a walking disability. On this night in particular we chose to visit the cheese cake factory. This was also Valentine&amp;#39;s day. To make a long store short the elevator was not working. I had to limp with my cane one leg at time down four fights of stairs. The food we ordered the night was cold and under cooked. I spoke with a manager about the situation and of course he said there was nothing he could do, even to compensate us on our next visit. I wish I had of gotten his name, but I just letting you who never have been here before think twice about coming here. I myself will NOT EVER come back.", "rating": 1, "date": "2/14/2020"}, {"text": "I went to the CF on a Friday afternoon with my boyfriend. It was about a 20 minute wait for a table around 1:30 pm. We were seated at a booth. We decided to order pot stickers as an appetizer. They were $10.99. I thought they were way overpriced. They were good, but not great by any means. They come with a ginger soy sauce. It had a lot of ginger. It was about the only thing you could taste. Then we split the grand factory burrito. It was huge! It was good! It had chicken and rice and cheese. It was pretty comparable to American Mexican burritos. Then for dessert, we split the Oreo dream cheesecake. This was amazing! It has a chocolate cake layer, chocolate cheesecake, and regular cheesecake. I highly recommend this cheesecake if you like Oreos. Overall, I&amp;#39;ve had better trips to TCF. This one wasn&amp;#39;t bad, but the food didn&amp;#39;t taste sepctacu", "rating": 3, "date": "7/14/2018"}, {"text": "Our waiter was amazing and the food was very good. What put a bad taste in my mouth was the hostess. I understand that we have to wear a mask when you walk in to a restaurant, we get to take it off at the table, and then put it back on when we leave. Understandable, but I got up to go use the restroom and the hostess out loud in front of everyone yelled, &amp;#34;ma&amp;#39;am can you please put your mask on&amp;#34;.  Everyone stopped and stared at me like I killed someone. Her tone was not so friendly and normally I blow things off, but the way she said it really pissed me off though. There&amp;#39;s a way to talk to people.", "rating": 4, "date": "7/30/2020"}, {"text": "I came on a Saturday afternoon for a late lunch with my kids, I don&amp;#39;t know why I didn&amp;#39;t think they&amp;#39;d be &amp;#34;that&amp;#34; busy, but they were. It&amp;#39;s okay though because the service was good. I got a steak and potatoes and green beans, and the kids got cheeseburgers. I thought my steak and green beans were a little on the salty side. <br&gt;<br&gt;I like this location I think it&amp;#39;s a beautiful building, but I think I&amp;#39;ll go to the OP one, it&amp;#39;s just less hustle and bustle", "rating": 3, "date": "4/1/2018"}, {"text": "I&amp;#39;ve never been able to put my finger on how, no matter where I go in the country, if there is a Cheesecake Factory it&amp;#39;s going to be busy and you&amp;#39;re going to have to wait for a table. They have definitely found the &amp;#34;secret sauce&amp;#34; of getting people in the door. <br&gt;<br&gt;My visit to the Cheesecake Factory in Kansas City, MO was no different. We showed up at 6PM for dinner and sure enough there was a 40 minute wait (which I found to be pleasantly shorter than usual). Note: They do not take reservations.<br&gt;<br&gt;I&amp;#39;m always amazed at how extensive the menu is. Page, after page, after page of food choices. I mean, the appetizers take up 3 pages! Surprisingly, despite the sheer number of options, the kitchens across the country deliver on execution of each plate flawlessly. I can&amp;#39;t recall ever having a bad meal at a Cheesecake Factory.<br&gt;<br&gt;Tonight we started with the Fried Cheese. Now technically, according to the menu, this was a small plate and not an appetizer but it was enough for 3 people to share. What I liked about it was, it wasn&amp;#39;t just your typical &amp;#34;cheese sticks.&amp;#34; Instead, it was actually cheese, freshly breaded, and fried to a golden brown served with a nice marinara sauce. My only complaint would be serving it with cold marinara. Why do restaurants do this? Cheesecake Factory are certainly not the only ones doing it.<br&gt;<br&gt;For entrees we had the Fettuccine Alfredo with Chicken, the Bacon, Bacon Burger with Fries and a cup of New England Clam Chowder. All delicious!<br&gt;<br&gt;And what&amp;#39;s a trip to the Cheesecake Factory without getting some actual cheesecake, right? On this visit we ordered up the Red Velvet Cheesecake and the Reece&amp;#39;s Peanut Butter Cup Cheesecake. There were 3 of us. Even after giving it our best efforts we needed a box to take some home. Absolutely delicious, as usual, but so rich. A few bites is all we could really handle.<br&gt;<br&gt;The last thing I will mention is the service. As with the food, I&amp;#39;ve never had bad service at a Cheesecake Factory and my visit to the KCMO location was no different. From the host, to the seater, to my server, and anyone else who came to the table, they were all amazing. Big kudos to them!<br&gt;<br&gt;All and all another great visit to the Cheesecake Factory.", "rating": 5, "date": "3/24/2018"}, {"text": "It took me a week to write this review because I was so disappointed, but was trying to find something about this visit that I could think differently. The only thing that I could come up with that was positive about this experience was the waiter, Brian. He took care of us the best he could.<br&gt;<br&gt;First off, the appetizers took over 30 minutes to arrive. I ordered the fried cauliflower, and will never do that again. They came out with a lot of grease at the bottom of the bowl. The breading taste as if they were coated in cornmeal. My entree was the Orange Chicken. Again, the breading taste like cornmeal and was greasy. <br&gt;<br&gt;As I was leaving the restaurant, I saw another patron had ordered the Orange Chicken and it looked perfectly fine! <br&gt;<br&gt;The entire visit took over 2.5 hours to receive our food, eat and leave. <br&gt;<br&gt;I will try the restaurant on 119th Street. I know I will not visit this location for a very long time. :-(", "rating": 2, "date": "6/27/2018"}, {"text": "Charged me $30 for an unseasoned dry filet. I ask for steak sauce. They only have A1. I had to put dirt sauce on a $30 steak just because they didn&amp;#39;t season it properly. I inform manager. Manager offers to remake my steak with seasoning :( after sitting in there waiting for an hour and then being disappointed with what I got the last thing I wanted to do was wait for another steak and eat it while the person I was with had already finished eating before the manager even arrived. Pro tip for managing a high scale establishment Take $30 unseasoned piece of meat off my bill and maybe I would come back to your restaurant to give you a second chance.", "rating": 1, "date": "6/23/2020"}, {"text": "I decided to go with my usual, I started with crispy crab bites, then shepherd pie, slice of caramel pecan turtle cheesecake with a passion fruit mojito.  The foods is always freshly prepared and home-made.  I wish I could keep the Cheesecake Factory all to myself.  For this reason, I recommend going to any Cheesecake Factory for a slice of cheesecake.", "rating": 4, "date": "12/18/2019"}, {"text": "All of the non-cheesecake food at the cheesecake factory is 3 stars.  Some things border on the edge of being 4 star worthy while others may droop closer to the 2 star level.  Everything is fine, if but a bit pricey (but hey, welcome to the plaza).  This location has a small bar area that keeps everything from relatively inexpensive good wine and baseline booze; i.e. Jack Daniels, Smirnoff, etc. on up to the better stuff; i.e. Macallan 12.  <br&gt;<br&gt;Wait, why did you come here to eat something other than cheesecake?  If you&amp;#39;re on the plaza, there&amp;#39;s a plethora of other lunch/dinner joints.  Come here afterwards for the cheesecake.  So far, I&amp;#39;ve tried about 15 different varieties and have never been disappointed.  They stay true to the namesake and offer up the best cheesecake in town.  From Dulce de Leche to the Tiramisu (my favorite) all the way to plain Jane and Godiva chocolate.  You can&amp;#39;t go wrong.  Even if this place is just on your way home, grab some dessert from the to go area and treat yourself.", "rating": 4, "date": "3/1/2018"}, {"text": "I have been to this location quite a few times and it&amp;#39;s always delicious. It&amp;#39;s a 2 hour drive from my house but it&amp;#39;s worth it!<br&gt;<br&gt;My group of 3 enjoyed everything we ate. I love the tex mex egg rolls with the delicious avocado dipping sauce. Today I had the grilled chicken avocado club and it was so yummy. The toast on that sandwich is so buttery but with just the right amount of crispness and delicious seasoned mayo. I do love their cheesecake but the regular carrot cake is amazing!<br&gt;<br&gt;Our waitress was also great.", "rating": 5, "date": "6/28/2018"}, {"text": "Pros: The food was very tasty and the service was decent. The Honey and Bourbon cocktail was pretty good.<br&gt;<br&gt;Cons: I get that restaurants have to make money. But, there&amp;#39;s a point in time when you need to just tell people you can&amp;#39;t serve them until the place clears out a bit. Yes, it was a Saturday afternoon and the wait was expected (1hr and 30 mins) but people were JAM PACKED in there, waiting up and down the steps and the lobby stayed packed with people the entire time we were there. It not only crammed everyone waiting but the people actually eating had to be shoved in a table while there was a huge crowd around, making it hard to get in and out not to mention the bathrooms were a mess. They do not have a changing table so we had to use a small area to change and it was just miserable. <br&gt;<br&gt;The fettuccine alfredo with chicken was really good and tasty but the experience was pretty bleh.", "rating": 2, "date": "12/9/2017"}, {"text": "What an absolute shit show on Mother&amp;#39;s Day. No social distancing was enforced. And dozens of people waiting outside to finally get their food and for it to be cold. The lack of organization is incredible. I hope all the people get an apology for this.", "rating": 1, "date": "5/10/2020"}, {"text": "Haven&amp;#39;t been to The Cheesecake Factory in along time.  A friend asked me if I wanted to go to Lunch. I had my car in the shop so Lunch was good.   My friend ask me months ago if I want to go to The Cheesecake Factory and I kept blow her off.   One thing I forgot about The Cheesecake Factory prices are off the roof.  To be honest I gave the restaurant three stars on service.  I ordered soup which was Chicken tortilla but it was so dang Bland that I couldn&amp;#39;t eat it.  Chicken Salad was my sandwich and it was horrible.   Maybe I should have ordered desert", "rating": 3, "date": "9/20/2019"}, {"text": "Love the avocado rolls, breakfast items, strawberry lemonade and the coffee cheesecake. The wait for a table was typical of Cheesecake Factory, lunchtime", "rating": 4, "date": "9/14/2019"}, {"text": "Two months ago I went on a Friday night for happy hour.  They were out of one of the items I ordered, but didn&amp;#39;t tell me.  I waited and waited.  They finally told me and I ordered something else.  It came out hot on the outside but still cold on the inside.  Manager comped my meal.<br&gt;I tried again on Friday, October 18th and once more they were out of one of the items I ordered.  I ordered something else.  This is Friday after noon between 4 and 5!!!  How do you 86 an item so soon before the weekend?  As I was waiting the bartenders were busy talking to each other and I had to ask for bread.  One of them said, &amp;#34;Certainly&amp;#34;.  It never came.  I don&amp;#39;t know where the managers are, or what they are thinking.  I won&amp;#39;t be back.  Too many other good restaurants on the plaza who take care of the guests.", "rating": 2, "date": "10/23/2019"}, {"text": "The architecture is a confusing mashup and so is the food. Some food items are done excellently and some are... not excellent. It is very clean and upscale, they also have quite the patio and fountain- they definitely have a great location!", "rating": 2, "date": "10/6/2019"}, {"text": "We went around 7 and had a 15 (or less) minute wait. That&amp;#39;s not a long wait for such a busy place. It was kind of hard to hear each other, because the general ambience is loud. Tables are so close together. My husband had the jambalaya (with rice instead of pasta) and I had the parmesan-garlic chicken. He wasn&amp;#39;t super impressed with his meal (he thought it needed more sauce), but I thought my meal was delicious!", "rating": 4, "date": "9/2/2019"}, {"text": "I haven&amp;#39;t been to Cheesecake Factory in a while but I was craving a slice of cheesecake so we decided to stop in.  Although we had already eaten dinner, we ordered the fried zucchini appetizer and a banana cheesecake. The fried zucchini was crispy and hot.  My husband and I love fried zucchini and it was nice that it wasn&amp;#39;t cut too thin and was cooked perfectly.  It comes paired with ranch dressing.  The cheesecake was delicious as well.  It had a slight banana flavor that didn&amp;#39;t overpower the cheesecake with a side of fresh bananas and whipped cream. Our waiter was friendly even though we only came to eat a snack and dessert.  Definitely will return to eat since I&amp;#39;m usually a fan of Cheesecake Factory.", "rating": 4, "date": "11/26/2018"}, {"text": "We don&amp;#39;t eat at chain restaurants very often, but so far, our experiences with this Cheesecake Factory have mostly been good.<br&gt;<br&gt;We have come here numerous times for a quick dinner on a weeknight and several times for brunch. Our service has ranged anywhere from excellent to terrible (only terrible one time though) and I really think that depends on who you get as your server.<br&gt;<br&gt;The brunch is definitely more outstanding to me than the dinners. The waffle with whipped cream, candied pecans and fresh strawberries is incredible. I could literally eat it every Sunday and never complain.<br&gt;<br&gt;The food here is very consistent and is always good. The extensive menu holds several options for everyone, which is nice.", "rating": 4, "date": "1/23/2016"}, {"text": "The menu is too big, but I assume this place ties its existence to the quality of the cheesecake. To that end, they came through. Everyone at my table was pleased with the dessert. The main courses blew no one away. Solid, but not game-changing.", "rating": 3, "date": "12/30/2018"}, {"text": "I ordered the steak medallions with Herb crusted salmon.  She had truffle honey chicken.  Good was great service was awesome, I just would like a bigger portions..Lol.", "rating": 5, "date": "8/31/2018"}, {"text": "Wow, really bad service tonight. Followed the instructions on the website for Curbside to go. Stated during the order it was for Curbside to go. Arrive at the Plaza location band cannot find designated parking, so call the restaurant to ask where they were. Were then told, uh, we don&amp;#39;t like take food outside. Ok, go inside to pick up our order and stood, ignored for 4 minutes (yes we times it, at this point, why not?) Treated very rudely by staff once someone came over to the to go counter. <br&gt;Not happy, and probably not returning.", "rating": 1, "date": "12/20/2017"}, {"text": "As usual the wait was about 45mins to an hour. We shopped at forever 21 while we waited. We finally got seated and got our drinks pretty quick. We all prefer the baked potato soup and it was not hot. I ordered the Louisiana pasta and it was delicious. We all ordered cheesecake to go and it took almost 20 mins for us to get our cheesecake. I got the Hershey&amp;#39;s cheesecake and it was delicious! My friend ordered the Parmesan chicken with broccoli and she said it was good and the portion was big.", "rating": 3, "date": "7/5/2018"}, {"text": "I&amp;#39;ve spent 20 years in the restaurant business from dishwasher to franchisee. After selling my stores I took a break to spend time with my family. On a whim I recently began freelance delivery for one of these popular menu aggregator platforms. It passes the time and I get to explore and discover our city like never before. Now, I&amp;#39;ve always been a fan of Cheesecake Factory and I am a patron. I have found that it&amp;#39;s the most popular high ppa concept I work with through this aggregator. Last night I went in to pick up a couple of large orders and they were absolutely slammed. This person I have repeatedly interacted with now was working and, as all ways, was performing with grace under fire. Today I had free time so I went back out and took another large CCF offer. Norma again was working. I overheard her manager tell her she had been singled out, put in a bad light in a Yelp review by grumpy guests. Norma even had her photo secretly taken and these people added it to this page! This staff, especially the gals that work the takeout counter (the busiest I&amp;#39;ve ever seen!) are incredibly hardworking. I&amp;#39;m the least pretentious guy you&amp;#39;d meet and to them I&amp;#39;m just a driver. But they are kind, gracious and responsive to me as if I were a tipping customer. I highly recommend this restaurant, the food is fantastic and aesthetically perfect. The guest service is high-level. You won&amp;#39;t be disappointed. Here&amp;#39;s the real Norma.", "rating": 5, "date": "7/31/2019"}, {"text": "Not the worst service but certainly not the best. Order the Jamaican pepper shrimp and chicken. Presentation is everything so with that being said I give 3 &amp;#39;s for presentation. Food was colder then it should be and the fried plantains, BURNT! Look I&amp;#39;ve probably been cooking longer then you&amp;#39;ve been alive...please don&amp;#39;t tell me how plantains are &amp;#34;supposed&amp;#34; to be. Burnt is burnt and when I tell you it&amp;#39;s burnt you replace them them still burnt and undercook, mushy plantains! Turn the fire down genius allow to cook within and then cook til golden...NOT BLACK! The photos below are just examples of how plantains should look.", "rating": 2, "date": "10/13/2018"}, {"text": "Not to happy with them. Short wait to sit, that&amp;#39;s about the only plus. Waiter is slow, then when food came out, he uses pot holders and hands my kids scalding hot plates. Dry burgers, food is just okay. Dessert is good, can&amp;#39;t really screw up cheesecake/sugar.", "rating": 2, "date": "7/18/2019"}, {"text": "I love the Cheesecake Factory. I don&amp;#39;t know if it is their 20 page menu or the endless baskets of warm bread and butter that keep me coming back. I just know I leave this place happy almost every time.<br&gt;<br&gt;My favorite menu item is the chicken belagio. It is a huge plate of food, so my wife and I always share. It is two large pieces of breaded chicken topped with prosciutto and arugula, served on a mountain of pasta bathed in a pesto/alfredo type sauce. It&amp;#39;s amazing. In my opinion, this specific location made it better than all the others I&amp;#39;ve been to. <br&gt;<br&gt;I&amp;#39;m giving this location 5 stars for the food, service, and location. After eating at the Cheesecake Factory during my travels to California and elsewhere I almost swore off this restaurant for good. These other locations had horrible service and the effort they put into making their food was severely lacking. For example, the pasta had very little sauce on it, and it looked/tasted like it sat out for over an hour. <br&gt;<br&gt;Of course you can&amp;#39;t leave without getting a slice of cheesecake. We have probably tried over half of them by now. I don&amp;#39;t think you can go wrong with any of them.", "rating": 5, "date": "8/27/2017"}, {"text": "Food extremely dry &amp;amp; cold  establishment is very dark in lighting. Server not attentive and it isn&amp;#39;t busy.", "rating": 1, "date": "11/15/2018"}, {"text": "I&amp;#39;m scoring a 3... average.  That explains our visit quite well.  <br&gt;<br&gt;We had average service.  Our waitress was nice, courteous, and friendly.  She just had too many tables and could not provide us the quality of service we expected.  Tea and water glasses were empty many times.<br&gt;<br&gt;My wife enjoyed her salad, a new kale and quinoa salad.  It was good.  She normally doesn&amp;#39;t do salads.  I asked her what&amp;#39;s up?  Her reply... at least I&amp;#39;m expecting it to be cold.<br&gt;<br&gt;A great set up... my meal was supposed to come heated.  It was a cold Steak Diane.  Cooked right, good flavor, but cold.  They also forgot my grilled onions.  I wanted to complain.  My wife encouraged me not to as we were there with others.  It was their night to celebrate.  She didn&amp;#39;t want us to make a fuss.<br&gt;<br&gt;So this visit reinforced our feeling we had prior to coming tonight.  We come for the fellowship, not for the food.", "rating": 3, "date": "10/7/2018"}, {"text": "Been to this location a couple of times . <br&gt;I always get the Shrimp and chicken Gumbo . I believe it&amp;#39;s a Jamaican inspired dish - <br&gt;It&amp;#39;s a little on the spicy side but nothing unbearable, it&amp;#39;s a great first choice , depending on what you like.<br&gt;Portions are large so expect to have leftovers. <br&gt;Overall delicious food and of course what is dinner without cheesecake.<br&gt;They have a Fantastic selection of cheesecake- I always get the Mango cheesecake its not too sweet So it works for me. <br&gt;I&amp;#39;ve also tried there happy hour drinks - I got the Mojito and cosmopolitan (great drink selection) and presentation.<br&gt;Definitely recommend coming to this location", "rating": 4, "date": "4/24/2017"}, {"text": "It seems to me that The Cheesecake Factory and consistency are synonymous. Any one of their locations I have been to around the nation has been solid. I have been to this location a handful of times and can say that I have had all great experiences. Being on the Plaza though, this location can be packed to the gills with people along with a wait that is longer than an hour on a weekend night in summer. Happy hour here is the way to go for cheap eats and great drinks. Don&amp;#39;t forget to save room for cheesecake, though!", "rating": 4, "date": "7/12/2017"}, {"text": "So after arriving and setting out side 2 table around me and the 4 waitress that are here no one is asking me if I want help or anything. Even after they all are looking at me. This is horrible service I&amp;#39;ve been sweating here for 25mins and no one is asking me if I want water or anything. <br&gt;<br&gt;Trying to tell me that I am not in a section that is yet in service. Even tho there are multiple people around me that are being serviced...... this place is agents homosexuals. It&amp;#39;s quite obvious. <br&gt;<br&gt;This will be the last and only time that I&amp;#39;ll be coming to this place. I called a head and was told to set anyplace that I liked outside. This is just a big joke on the service of the place. I had to call the store to get a server to serve my section. Because I was one table to the left of what was being &amp;#34; served&amp;#34; I&amp;#39;m like what the fuck. This place is just trying to screw people over.", "rating": 1, "date": "8/23/2019"}, {"text": "Returned at the request of my daughter visting from out of town. Service was great and friendly. Glad I gave it a second visit.", "rating": 4, "date": "12/23/2019"}, {"text": "It&amp;#39;s an expensive meal, but the meal is great nonetheless. The cheesecake is to die for. Any meal on the menu is great but don&amp;#39;t get lasagna verda! it&amp;#39;s not good!", "rating": 4, "date": "7/14/2019"}, {"text": "Food was great, but my service was TERRIBLE, just because i am 17 does NOT mean i dont tip good, i ALWAYS leave 20% or more because i work in restaurants and i depend on tips sometimes and i understand the importance but this waitress did not help us, check on us, we asked for another fork and she told us to go get it ourselves at the front??? NOT GOING AGAIN. I get better service at McDonald&amp;#39;s and spend wayyyy less", "rating": 2, "date": "6/30/2019"}, {"text": "Great location. Has beautiful outdoor seating but it was a bit humid out so changed our minds and sat inside. Server was on point and accommodating. Our go to firecracker salmon was delicious. Asked about a certain dish since it had shrimp and plantains but it said very spicy which I didn&amp;#39;t want. So I opted for my go to shrimp with angel hair and he got me a side of plantains! Oh so happy! My daughter always gets the chipotle chicken pasta which she loves and the lunch portion is plenty with some for dinner! Bathroom is upstairs and restaurant was clean. Enjoyed our visit.", "rating": 5, "date": "5/24/2018"}, {"text": "Mr Akolade G. gave my family perfect service tonight. If I owned a restaurant, he&amp;#39;d be working for me. Great food too.", "rating": 4, "date": "5/5/2019"}, {"text": "This was my first time at cheesecake factory and I am in love. They have an extensive menu with so many food choices it was hard to make a decision. Because this was my first time I decided to eat small and save room for cheesecake! I tried the crab bites they came with mustard sauce and i loved them. They were crispy on the outside and soft and flavorful on the inside. My friends also had chicken &amp;#39;taquitos and cheeseburger spring rolls. Both were very happy with their choices as well. We all had different cheesecake and each piece was wonderful!", "rating": 5, "date": "3/28/2018"}, {"text": "It&amp;#39;s a bit of a Christmas season tradition for our family to make at least one trip to the Plaza for frolicking around under the glimmering Christmas lights and enjoying a nice, festive dinner by the windows of a nice restaurant, watching passers by as we eat.<br&gt;<br&gt;This year, we landed at Cheesecake Factory for the aforementioned meal.<br&gt;<br&gt;Yes, I know that CF on a holiday weekend is slightly ill-advised, but we had a giftcard, and with kids in tow, you just can&amp;#39;t go wrong with their mega-menu.<br&gt;<br&gt;We thought we&amp;#39;d beat the rush by arriving at 4:45.  We thought, &amp;#34;Oh, maybe we&amp;#39;ll wait a few minutes, but surely we&amp;#39;ll miss the 2-3 hour wait.&amp;#34;<br&gt;<br&gt;Dead wrong.<br&gt;<br&gt;Name went in at 4:45.  We were told it would be a 90 minute wait.  Ugggh.  Will the kids make it?  Should we go somewhere else?  Ehh, by the time we walk 15 minutes back to the car, drive 10-30 minutes somewhere else, undoubtedly wait a few minutes there...we might as well have stayed.  So we did.<br&gt;<br&gt;After an hour and forty minutes, I went to check up on where we were at within the line.  <br&gt;<br&gt;&amp;#34;It&amp;#39;ll be about another 25 minutes.&amp;#34;<br&gt;<br&gt;Double uggggghhh.<br&gt;<br&gt;Forty-five minutes later, our buzzer buzzed and we were shown to a (windowless) table by the kitchen.  But, by that time, we were ready to eat eight-day old garbage within a dirty, third-world ghetto, so it didn&amp;#39;t really matter.  And, also, we found great &amp;#34;seats&amp;#34; (window sills) inside, upstairs, outside the bathrooms that we sat at for about half our wait.  The view was Plaza-Christmas-tastic!<br&gt;<br&gt;The food was as the food is at Cheesecake Factory - solid.  As it should be, the namesake dessert was F A N T A S T I C.  I can&amp;#39;t recall the exact name, but lots of Nutella and hazelnuts were involved.<br&gt;<br&gt;Table service was just slightly under-average for Cheesecake Factory, but the dude said he had been working since open, which would have had him there well-past a normal shift.  A little goofy, but still attentive, helpful, and half-way charming...in a sleepy way.<br&gt;<br&gt;Were it not for the grossly inaccurate estimates for wait times (for which I&amp;#39;ve docked them on &amp;#34;Service&amp;#34; below), the overall for this location would have scored a bit better.  I&amp;#39;ll make sure to provide an updated review next time we&amp;#39;re in on a non-holiday weekend to give ol&amp;#39; CF a fair shake.<br&gt;<br&gt;Food = 4/5 <br&gt;Facility = 4/5<br&gt;Service = 1/5<br&gt;Ambiance = 2/5<br&gt;Value = 3/5", "rating": 3, "date": "12/9/2016"}, {"text": "We&amp;#39;ve always been a fan of this location but yikes. Just took a family friend out for her birthday. We were basically ignored by our waitress for an hour. Our chicken dish arrived very pink. The manager eventually came over and apologized, took the dish off our bill, which was appreciated. But the service was just lacking and kind of a bummer. My mom had to remind the waitress twice about it being our friend&amp;#39;s birthday. When reminded, she reluctantly said something like, &amp;#34;oh... I could do a small sundae...&amp;#34; Just a lot of waiting and lackluster service. Big shrug.", "rating": 1, "date": "4/7/2019"}, {"text": "Great selection of items to choose from.  Our server  Kool Aid was amazing - made great recommendations for entrees and made sure we had plenty to drink.  Chicken Riesling was amazing!  Too bad we were too full to get dessert!", "rating": 5, "date": "3/31/2019"}, {"text": "This was one of my worst experiences ever. I&amp;#39;m going to assume that it&amp;#39;s because it was a busy Saturday night but it was still poor service. I came in around 8:45 and asked for a table for 17 (8 adults and 9 children) which is understandably a large party. The hostess looked at me like I had 3 heads.<br&gt;Then says &amp;#39;I&amp;#39;ll have to get my manager&amp;#39;. Then he came out and likewise looked at me like I had 3 heads. He then tells me it&amp;#39;ll be a 2hr wait. I&amp;#39;m ok with that because of our size (a birthday party). Hostess says &amp;#39;contact your party and come back and let us know what you decide&amp;#39;. I already decided ma&amp;#39;am. So we wait. After an hour I got a buzzer (which she reluctantly handed me). We still wait. After it had gone PAST the 2 hour mark with no updates from staff or manager my party decided to leave and order to go. Nobody asked me if I wanted that or checked on me. I then had to wait in that line another 20 min. Then they tell me the food will be another 20min (ended up being 30+). My food was burned by the time I got it open at home. Manager walked past me SEVERAL times and said NOTHING. I will NEVER visit this establishment again.", "rating": 1, "date": "3/31/2019"}, {"text": "Extremely poor service.<br&gt;<br&gt;Manager not managing.<br&gt;<br&gt;Messed up 3 orders!!!<br&gt;<br&gt;Used to be a favorite place ... not sure how they messed up so badly.", "rating": 1, "date": "7/25/2018"}, {"text": "I really like this place! Great food with nice scenery while you eat. I had the jambalaya which had plantains and black beans with a jerk taste to the shrimp and chicken. Real Caribbean style dish and it was delicious.", "rating": 5, "date": "4/24/2018"}, {"text": "What can I say, it&amp;#39;s the Cheesecake Factory.  The service was good, food was good but the best thing was the bartender made one of the best dirty martinis in have ever had.", "rating": 5, "date": "3/7/2018"}, {"text": "Super food, very creative with their salads, soups and flatbreads.<br&gt;My sister&amp;#39;s on a vegetable based diet, the waitress went out of her way to accommodate her needs. Plus she loved what she ordered as did I.", "rating": 4, "date": "9/10/2018"}, {"text": "Cheesecake Factory, a must visit if you&amp;#39;re hungry.  They have redefined portion size to the detriment of the American Waistline...but when the food is good, you might as well get a lot if it.<br&gt;<br&gt;The space is not overwhelming, but a theater type atmosphere with tons of booths and tables.  There is a spiral staircase that takes you to extra seating, and a not so handy bathroom.  The nicely dressed servers give a dressy appearance, but cheesecake is super casual, additionally reinforced once you open the novel length menu.  Page after page of delicious entrees temp you on every level.  Only the truly adventurous foodies would dare order an appetizer, as the mammoth main dishes are sized to feed two.<br&gt;<br&gt;We went for a lighter meal this evening, my son grabbed the omelet, and fixings.  Nice size meal, good flavor, but it&amp;#39;s hard to screw up breakfast, even in a factory of cheesecakes.  I had the chicken pasta with asparagus.  The pasta and chicken were perfect, adding a light pesto, did the trick on my taste buds...try the smaller portions if you want to enjoy one of their many cheesecake offerings...none for me...I have a dairy allergy that keeps me away from those sinful treats...<br&gt;<br&gt;Go to cheesecake, if you&amp;#39;re hungry, otherwise, be prepared to eat the same dish a couple times...LO central...", "rating": 4, "date": "3/16/2015"}, {"text": "Every time I&amp;#39;ve come to this location I have always had excellent customer service. The Cheesecake Factory is my favorite restaurant so for any occasion I come here. This time it was my boyfriend&amp;#39;s birthday and he didn&amp;#39;t want anything major so we came here and I informed our waiter. Our waiter brought out our cheesecake of choice with &amp;#34;Happy Birthday&amp;#34; written on the plate. Was a really nice gesture. I love the food here, I always get the Chicken Piccata and it&amp;#39;s always amazing. He loves getting the Cajun pasta/jambalaya. There lunch menu is a really good value too. I have such a sweet tooth so I&amp;#39;m still trying to try every flavor of cheesecake, about halfway there.", "rating": 5, "date": "2/22/2017"}, {"text": "My husband and I LOVE Cheesecake Factory! Some complain that it is too pricey, but my husband and I always share an entree because the portion sizes are huge! You are always treated with warm delicious bread before your meal and I&amp;#39;ve never had anything at Cheesecake I didn&amp;#39;t like. Do yourself a favor and order the Chicken Bellagio, and it is the CHEESECAKE Factory...so getting a slice of cheesecake is a must!", "rating": 5, "date": "3/19/2018"}, {"text": "About as Average as you can get. <br&gt;There are so many great options in the plaza area, this should be your near to last choice. <br&gt;<br&gt;Wait times in the plaza can be 2-3 hours on a Friday night. Most places take reservations. TCF does not, and also does not do call ahead seating. They do have a nice outdoor waiting area and a few good shops near by to visit while you wait.<br&gt;<br&gt;The restaurant it self is your standard Cheesecake Factory. A big menu full of average to bland food. If you&amp;#39;re set on making a stop here, save it for dessert or light lunch.", "rating": 2, "date": "5/12/2018"}, {"text": "Avocado Egg rolls, Chicken Madeira, and Cheese Cake!!! Service was excellent. The bartender made an excellent mojito while waiting for our seats.", "rating": 5, "date": "5/11/2019"}, {"text": "Always busy but that&amp;#39;s a sign of a great place to eat. Didn&amp;#39;t wait long and service was prompt and efficient. Got the Thai chicken lettuce wraps for a healthy start and ended with the lemon raspberry cheesecake! Took home a low carb options (which is great to have this option!)<br&gt;Always yummy", "rating": 5, "date": "8/13/2017"}, {"text": "Better hope nothing goes wrong with your meal because they won&amp;#39;t refund you, even after saying they will. I&amp;#39;m pregnant and all I wanted on Christmas eve was some fettuccine alfredo. I live right by this location and my boyfriend has had to make several runs to pick me up some food from The Cheesecake Factory. I placed an order for pickup directly on their website for some fettuccine alfredo along with a Margherita pizza for my boyfriend and a slice of cheesecake for the both of us. It came out to about $55. He went and picked it up. The fettuccine alfredo was overwhelmingly garlicky but I dealt with it. About six bites in, I find a hair. It&amp;#39;s clearly not mine or my boyfriend&amp;#39;s hair. I instantly lost my appetite and actually gagged a bit and almost threw up. I was still in my bad morning sickness stage and it hit me hard. I couldn&amp;#39;t finish my meal or eat my cheesecake. My boyfriend was pretty annoyed that the hair was in my food since I hadn&amp;#39;t been able to eat in days and he was happy I finally had an appetite. He called the store and was told that they needed to get a manager for us. He&amp;#39;s on hold for ten minutes when someone else greets him and then puts him on hold again while they find a manager... Five minutes later and an apologetic manager tells him he will refund the pasta and a slice of cheesecake back to my card. Two weeks later, I still have a full charge on my bank app and no refund anywhere. He calls again. Same dance with the &amp;#34;hold while I get a manager&amp;#34; game, twice. Then a manager comes and tells him that it just takes a while to process the refund and we should have it by the next week. We&amp;#39;ll, I&amp;#39;ve been waiting for my refund for almost a month now. Still nothing. I guess I need to call the bank and issue a charge back. This is ridiculous. You lost a good customer. A pregnant girl that usually loves your food and she&amp;#39;s right next to your store? Should have just given us our money back. Bad form. I&amp;#39;ll leave a bad review every where I can now.", "rating": 1, "date": "1/17/2019"}, {"text": "What can I say...the menu is so extensive it would be hard not to find something that you like.  Personally, I think they are trying to do too much and many dishes aren&amp;#39;t very good, so I have my go-to items and pretty much only order those all the time.<br&gt;<br&gt;It&amp;#39;s very busy most of the time and there&amp;#39;s usually a wait.  Our waiter was ok, but didn&amp;#39;t really have time to go above and beyond in terms of service.<br&gt;<br&gt;In short...nothing is going to &amp;#34;wow&amp;#34; you about the Cheesecake Factory, but it&amp;#39;s a solid place.  Decent prices and huge portions.", "rating": 3, "date": "2/25/2018"}, {"text": "The presentation of the food was kinda messy but the flavors were there. What can you really expect from a large chain like this, though? <br&gt;Service was mediocre, at best. The server promptly took our drink orders but brought the wrong drinks so she let us have the wrong drinks for free along with the ones we actually ordered, which would have been great had I actually liked what she brought.  The rest of the night we had to search for her. Maybe she was embarrassed but we had look for her to place our food order, get drink refills, and get the check. <br&gt;Hopefully it&amp;#39;ll be better next time.", "rating": 3, "date": "5/27/2017"}, {"text": "They don&amp;#39;t take reservations, so our party of 10 came on a Saturday around 2:45. We knew we&amp;#39;d have to wait, and the hostess said an hour and fifteen to an hour an forty five. It took about an hour and fifteen. We were sat and we were close to the door and with the line out the door most of the time, the chilly air plagued us most of the meal.<br&gt;<br&gt;We froze, but were pretty hungry due to being there for a while. I liked my Romano chicken. The chicken itself was tasty, but the pasta was a bit bland. We had an amazing server that kept up with us. He was friendly and very professional.<br&gt;<br&gt;I feel I&amp;#39;ve consistently had mediocre, non-memorable experiences here. The whole time we were eating, more and more people crammed around us, causing an unpleasant atmosphere to eat in.", "rating": 1, "date": "12/9/2017"}, {"text": "My wife and I have been coming to cheesecake factory for many new year eves. The menu is extensive and the food is pretty good but a little expensive.<br&gt;<br&gt;Service has been good every time but was disappointed this past new years. They did pass out champaign but no party favors. No biggie but that&amp;#39;s part of why we go every year.<br&gt;<br&gt;So! If you want cheese cake, yes this is the place to go. If you want a fancy dining experience, head on over. Good selection of great tasting food and good service...yes.<br&gt;<br&gt;There will always be a place in my stomach for the cheesecake factory but it&amp;#39;s only for cheesecake and/or new years eve celebrations. If you haven&amp;#39;t been and want a fancy dinner...I&amp;#39;d recommend it.", "rating": 3, "date": "1/7/2018"}, {"text": "So I had a gift card...I decided to come in and get the factory meatloaf that never disappoints. It&amp;#39;s about 830 and I know the staff is preparing to close but the service was sub par. No receptionist at the front. I came to the bar the bar tender appeared after 5 minutes. My meal was amazing but I had no silverware, no bartender to get them, and the counter is filthy. I&amp;#39;m just sitting waiting for a box at this point and it&amp;#39;s been a quite some time... I&amp;#39;ll be back but this is not the deal..", "rating": 3, "date": "1/15/2019"}, {"text": "Busy and slow.  I like the Cheesecake Factory but the wait staff is very slow at this location.  Besides that hat the food is great!", "rating": 4, "date": "9/24/2016"}, {"text": "We chose cheesecake over shake shack because we wanted a nice, enjoyable dining experience. From the host that greeted us with a scowl and poor attitude, Luke warm lunch food that took over an hour and came out 15 minutes a part for a table of two, to the frozen cheesecake...I can&amp;#39;t Recommend this as an option to family or friends.", "rating": 1, "date": "2/16/2019"}, {"text": "I would not normally come here unless I was bribed with free cheesecake. I attended a work dinner and wondered why they had to choose this place.... it&amp;#39;s not the worst place ever, but chains aren&amp;#39;t my first choice for a Friday night dinner. <br&gt;<br&gt;We waited about two hours for a table. Yeah, it was a Friday night but waiting is never fun. I really wondered why so many people lined up for this restaurant when there are so many better restaurants. <br&gt;<br&gt;The menu has wayyy, way too much. Bad sign in my opinion. This place was insanely busy, so my first thought was, &amp;#34;What is something that they cannot mess up?&amp;#34; I chose the Fried Macaroni and CheeseBurger&amp;#34;. While this is something I would never usually order, I figured it would be delicious and fail proof. It turns out it was freaking delicious. Out of our party of ten, pretty much everyone agreed they should have ordered what I did. Everyone else complained or was dissatisfied with what they ordered. I agreed - none of their food looked good. Things were over-sauced and over-seasoned. <br&gt;<br&gt;Our server sucked. I will never understand why people wait two hours for overpriced food with the risk of crappy service.", "rating": 3, "date": "8/27/2017"}, {"text": "We took our God- daughter for a birthday meal. The wait was over 30 minutes which I wouldn&amp;#39;t have waited that long if not for her looking forward to it. The service was pretty good, can&amp;#39;t complain. Now the food, my wife tried a Mexican corn cake chicken taco/enchilada plate that she didn&amp;#39;t love. She said the black beans were dry flavorless, they called the tacos but by my photos, they&amp;#39;re enchiladas. I think the chef may be a Gringo. Our God-daughter had the orange chicken which looked great and her and my wife liked it. I tried the Cajun jambalaya which was good but the the value isn&amp;#39;t there for almost $18 (noodles, couple shrimp, chicken and spices are pretty cheap. They make a killing on that order. White chocolate chip macadamia nut cheesecake kept it from being a &amp;#34;2&amp;#34; overall. It&amp;#39;s definitely only a place I&amp;#39;ll go if I&amp;#39;m taking nieces, nephews etc.", "rating": 3, "date": "8/10/2016"}, {"text": "I have tried New York steak and Key Lime Cheesecake, both are great!<br&gt;And the service is great too. We ordered for 4 people and a friend came and joined us. They helped to join 2 tables for us although we can add a chair in the 4 seats table.<br&gt;Personally I highly recommend. lol", "rating": 5, "date": "5/18/2017"}, {"text": "This is probably my favorite cheesecake place but the wait is so long and its always filled inside even filled if people are not eating. But the food is really good.", "rating": 4, "date": "12/20/2018"}, {"text": "One star to many;; <br&gt;on a constant awful service (not from just one visit but multiple visits)<br&gt;<br&gt;Food is usually wrong; or tastes awful.<br&gt;Management has not accountability for poor service/ wrong orders/ mishaps etc.<br&gt;<br&gt;If you want to enjoy your food/ atmosphere etc I would avoid this place.", "rating": 1, "date": "6/14/2018"}, {"text": "We came on a Friday night at 7:00pm, and waited 80 minutes (wait time was expected; not the reason for the 2-stars).  Here&amp;#39;s all the things that were wrong:<br&gt;1) There were eight people in our party and the server only brought out two bread baskets.  There should have been at least 3 or 4.  <br&gt;<br&gt;2) There were times when our server disappeared for extended periods of time.  He dropped off bread and disappeared for fifteen minutes, and we had to keep asking for bread.<br&gt;<br&gt;3) I ordered the Crispy Chicken Costaletta, and the meat was dry.  Usually, there&amp;#39;s a tangy cream sauce that the chicken breasts lay on top of, but there was barely any on my plate.  I didn&amp;#39;t even bother asking for more, because our server disappeared after dropping off our food and didn&amp;#39;t even come by to check if everything was alright until our food was halfway eaten.<br&gt;<br&gt;I&amp;#39;ve eaten at a handful of Cheesecake Factory locations across the United States, and this one was the worst.  Poor service &amp;amp; poor quality food--not worth the money.  Only ONE out of the EIGHT in our party enjoyed their food.  I sure am noticing poor-quality trend in mid-West chain restaurants...", "rating": 2, "date": "8/26/2017"}, {"text": "First of all the people was racist. I did order my food and did not like it. I did not eat it then the manager told me that I had to pay. Server never came by to the table to ask if the doos was good. They made a scene like I was stealing. I paid them and left but their food was left untouched on the table. <br&gt;I will never go back there nor will my family or my friends. I felt very disappointed and disrespectful. Cheesecake Factory, never again!!!", "rating": 1, "date": "3/18/2019"}, {"text": "Food wasn&amp;#39;t done. Too much fat meat on my meat. Terrible customer service. Employees had bad attitudes. Very small food portions. Items were missing from my order. My meal was so greasy the food was floating in grease! Reported the problem to the manager and the manager didn&amp;#39;t care. The manager had an attitude problem too!", "rating": 1, "date": "9/11/2018"}, {"text": "I love the Mango Key Lime cheesecake here and that is always what I order prior to my meal!  Our recent visit was an OK visit.  I enjoy the atmosphere along with the patio seating when it is a nice day.  I will say though I was not happy with the wait though.... We waited a long time to order our water and then for it to arrive and the place was not very busy.  We never got checked on when we ate desert first and then when we were done we finally were asked what we wanted for dinner.  Dinner came out in less than 10 minutes, way to fast, I was not ready for food to come out so fast and super hot on the plate so I knew it was super fresh!  We ordered a popular pasta marina dish with two large pieces of crusted chicken, amazing!  The flavors at cheesecake factory are amazing I just don&amp;#39;t always receive the best service here from the employees.", "rating": 3, "date": "6/20/2016"}, {"text": "Even though the Cheesecake Factory is in the Plaza area it is pretty hard to find. It has a sign that says &amp;#34;The Cheesecake Factory&amp;#34;. There is a very nice garden/fountain in a little courtyard. When you walk in, there is a big display case just full of cheesecakes. I like to admire them while I wait. There is a lot of seating. And that&amp;#39;s probably a good thing. They get a lot of people at the Cheesecake Factory. As you wait you can look at the TV. It shows a slideshow of all the food and cheesecakes plus the names of all of them. Speaking of food, even for a cheesecake place they have the best food EVER. I got Skinnylicious Chicken Enchiladas and let me tell you they are to die for!!<br&gt;<br&gt;Now for the thing you have been waiting for: the cheesecakes. They are also to die for. There are so many different flavors that you can choose from. There are fruit flavors and chocolate flavors and crazy flavors and original flavors, I could go on and on. My favorite is the Reese&amp;#39;s Peanut Putter Cup Cheesecake. If you like peanut butter, chocolate and cheesecake you will love this one! That being said, they are all good. This time though I got the Peppermint Bark Cheesecake. It was fabulously good. It has candy canes inside it too!! This place is the best. I would totally recommend going here for any meal (except breakfast).", "rating": 5, "date": "11/30/2017"}, {"text": "Favorite place to eat at the Plaza in Kansas City! The cheesecake is wonderful save room for dessert!", "rating": 5, "date": "3/23/2018"}, {"text": "Great service even for a busy Saturday afternoon. Great food as always. Waiter we had was phenomenal. Will be back again next time.", "rating": 5, "date": "3/13/2018"}, {"text": "It is a great restaurant and our waiter got our food out in a snap he was very king and he asked us to refill our drinks this place is a five star restaurant", "rating": 5, "date": "1/4/2019"}, {"text": "Every time I have gone to The Cheesecake Factory I always get something different. This last time I went (1/1/18) I tried the Chicken Bellagio. It is now my favorite dish &amp;amp; will definitely get it next time I go. Our server was very friendly and informative about the menu. I will definitely try to go back more!", "rating": 5, "date": "1/4/2018"}, {"text": "Well there you go!<br&gt;Completely happy with this place! I&amp;#39;ve been to many of them but this one really set the bar. Extremely friendly staff, well organized and really nice. <br&gt;I had a huge family et together and we had a blast. I haven&amp;#39;t been in Kansas City in years and we had a blast.<br&gt;I had the salmon on a bed of brown rice. I also had their IPA to wash everything doe with.<br&gt;The salmon was amazing!!!! And the rice had a little bit of sauce on it. It was none the less amazing too haha.<br&gt;Thank you for a great experience! Happy holidays.", "rating": 5, "date": "12/17/2015"}, {"text": "Just called to make reservations for out of town company.  Even though site has a check mark for reservations, it is ONLY for the FIRST HOUR of operation, which is 11 to Noon...oh and you HAVE TO EAT THERE", "rating": 1, "date": "8/15/2019"}, {"text": "Cheesecake is amazing! The food was ok. Do not order the Cajun pasta with chicken and shrimp, it has no flavor for $20. The lettuce wraps are good. Nice atmosphere.", "rating": 3, "date": "6/2/2019"}, {"text": "Really disappointing experience here last night. I&amp;#39;d called earlier in the day to verify the happy hour was 4-6. My friend &amp;amp; I arrived at 4:45. Seeing the downstairs bar full, we headed to the upstairs bar where I&amp;#39;ve sat before. We were told it wasn&amp;#39;t open yet, but would be in about 30 minutes.... We went back downstairs to see if any spots had opened up yet &amp;amp; they hadn&amp;#39;t. I asked the hostess what she recommended (thinking she might offer to seat us near the bar &amp;amp; still let us enjoy the happy hour pricing) and she offered nothing.  I asked if we just needed to go someplace else and she &amp;#39;guessed so&amp;#39;.  The good news is we went to Plaza 3 to enjoy their happy hour and had a great experience! (Loaded house made potato chips with blue cheese &amp;amp; bacon $3.95, tenderloin skewers $3.95, prime rib sliders $ 5.95- many other choices very reasonably priced!) <br&gt;At the end of the night we went back to The Cheesecake Factory to get a couple pieces of cheesecake to go. While there was a very large crowd of people waiting to be seated, the line for to go orders was only about 8 deep. It took OVER 30 MINUTES for us to finally get to place our order for cheesecake and then at least another 5 minutes to get our cheesecake to go.<br&gt;Serious management problems here with planning and execution.", "rating": 1, "date": "3/4/2017"}, {"text": "There was a long wait to get inside, but it was a Saturday without reservations downtown. It was definitely worth the wait. Cheesecake Factory is famous for cheesecake for a reason. <br&gt;<br&gt;I had the s&amp;#39;mores cheesecake covered it hot fudge paired with the pineapple mojito. Both were fantastic! I was too excited to snap a picture of the cheesecake. I split the cheesecake with my boyfriend. It&amp;#39;s extremely heavy and delicious, but it&amp;#39;s too much to eat in one sitting. You&amp;#39;ll need to take it home or split with at least one other person. Whew! I can&amp;#39;t imagine having dessert  and dinner here. Wow. I would love to come back as try their delicious dinner entrees. I&amp;#39;ll be back! Wonderful service and tasty desserts. What&amp;#39;s not to love?!", "rating": 5, "date": "1/23/2016"}, {"text": "We went to celebrate one of my friends birthday.  We ordered Thai lettuce wraps, avocado rolls and fried macaroni.  Everything was perfect and delicious until we found a hair in the Thai wraps.  That may have ruined our lunch appetite but didn&amp;#39;t let it ruin the chance to order cheesecake for desert.  If it wasn&amp;#39;t for Carlos and the fantastic serving; I would have given this two stars.  But his service made up for the hair in the food.", "rating": 3, "date": "4/27/2018"}, {"text": "One of my family&amp;#39;s favorite places to go whenever we find one from the Galleria in the San Fernando Valley, Beverly Hills or here in our new location Leawood, KS. This time we went to the Plaza location to see the lights and do a little shopping while we waited the estimated 1.5 to 2 hours for a table of eight. An hour and 45 minutes later we were seated. We ordered five pastas, A Cheeseburger, Chicken Madeira and a Cuban Sandwich. It took about 15 minutes to get a drink order in and delivered, I get it, it&amp;#39;s busy. The waiter asked if we wanted bread, who doesn&amp;#39;t? Finally, about 25-30 minutes later the food started arriving to the table. We all are waiting to eat until everyone is served, and I noticed the only one who doesn&amp;#39;t get a plate was my wife. She is the main reason we are there. The one who needs a night off after making the holidays perfect for everyone else. I hear the waiter say &amp;#34;your Cheeseburger was accidently taken to another table it will be about two to three minutes to get a new one. My wife tells us all to start eating and we do. Literally after everyone is finished or stopped eating because they are full the cheeseburger arrives to the table. Of course, this is upsetting and really took the enjoyment out of A $265.52 dinner. As disappointed as I was watching my wife take just a couple bites before asking for a to-go container, I was floored when the check came to the table. Absolutely nothing off the tab and an automatic 18% GRATUITY plugged in! In my 25 years of restaurant work myself I have never complained to another manager, that was over. I contacted the manager about what accrued, and he said he was aware of the mistake and was sorry. I asked &amp;#34;that&amp;#39;s it? I said they even still charged the $14.95 for the cheeseburger, do you think that&amp;#39;s right? He said he would remove it and did. That was it. The name says it all. The Cheesecake Factory, It&amp;#39;s run and operated like a profit maximizing factory", "rating": 1, "date": "12/30/2019"}, {"text": "I like this place and have been to many throughout the country.  Their menu is always somewhat overwhelming but the food and service is generally pretty good.  This Kansas City location in particular has been very good, always offering up friendly service and good quality food items.  Today I tried the Gumbo which was nicely presented and had plenty of shrimp and meat but was slightly on the bland side.  I also chose the Asian Shrimp Spring Rolls which were very good and came with two very nice dipping sauces.  <br&gt;<br&gt;This is the Cheese Cake Factory and their specialty is cheese cake!  Unfortunately, I had no room for desert today but I&amp;#39;ve had their cheese cake before and it&amp;#39;s good!  All their baked goods are excellent.  I could eat their bread all day long! As chain restaurants go, this one is very good.", "rating": 4, "date": "12/24/2012"}, {"text": "I have to admit that my guilty pleasure lies in a creamy, majestic piece of Cheesecake Factory cheesecake. I don&amp;#39;t care if they&amp;#39;re a chain or even if their cheesecake is frozen....I love it. One piece can make a meal and I write their 1/2 price Cheesecake Day on my calendar like it&amp;#39;s a National Holiday. The White Chocolate Raspberry and Mango Key Lime are both top runners for favorite flavor. <br&gt;<br&gt;Now I&amp;#39;m hungry.", "rating": 4, "date": "12/20/2014"}, {"text": "I&amp;#39;ve not been here in a while. I limit my sweets so when I come for cheesecake it&amp;#39;s special. I was excited about tonight. I haven&amp;#39;t had cheesecake in like 5-6 months. I had it narrowed down to 4 flavors. Lemon Meringue, Carrot Cake, Lemon Raspberry or Cherry Ghirardelli. The waiter was like the Ghirardelli Cherry is the absolute greatest tasting ever. The best we have here. I acquiesced and got it. Boy was that a mistake. To wait months for cheesecake and be so disappointed. It was mediocre at best. Very disappointing. My advice don&amp;#39;t get the Ghirardelli Cherry.", "rating": 2, "date": "5/27/2019"}, {"text": "Third time here and they can NEVER get the steak right! How hard is it to cook a medium well steak! Then the manager he says oh well at least you have your Mac and cheese to enjoy for now...", "rating": 2, "date": "11/4/2018"}, {"text": "Very busy location, extensive menu, very noisy inside. Good food/drink in a not so relaxing atmosphere.", "rating": 4, "date": "9/3/2018"}, {"text": "Alyssa is the best server/hostess. Her hospitality is top notch and she is fast. Consistency is her key and she is all around an amazing hostess. Request her. The food was delicious of rut being my first time. Will most definitely be back here very soon. She is so good!", "rating": 5, "date": "11/29/2018"}, {"text": "Hey Sandra, the Bartender...<br&gt;<br&gt;Please don&amp;#39;t argue with the customer. YOU ARE in the wrong...", "rating": 2, "date": "6/24/2017"}, {"text": "Typical cheesecake factory.  Everyone should know whay they have by now and this one is no different. They get VERY crowded at peak times, so keep that in mind.  The fried macaroni and cheese is our favorite.", "rating": 5, "date": "7/8/2018"}, {"text": "Unbelievably slow. Went there for a late lunch, they were not busy (we were seated in 8 minutes) but took 20 min to get our order and another 45 min for food. Thus over an hour from sitting to getting food. I understand sometimes this is the kitchen and not the server, but we sat there the entire time, she never checked. She mocked a member of our party, who had asked very nicely if maranara sauce could be on the side because she saw her eating a tomato later...and has never been taught how to hold a hot plate without sticking her thumb in your food. Food was poor as well. Chewy fries, their &amp;#34;California Cheesesteak&amp;#34; sandwich is apparently 3 flakes of meat between two hockey pucks that were supposed to be bread. Their other location on the Kansas side is night and day compared to this one. The only good thing I can say was that we didn&amp;#39;t have any cheesecake this time so they weren&amp;#39;t able to ruin that for us.", "rating": 1, "date": "3/17/2019"}, {"text": "I enjoy the pasta dishes at Cheesecake Factory and of course, the cheesecakes, but waiting around for an hour was a cluster due to the absent mind individual that was the host. <br&gt;<br&gt;Our buzzer gave us the indication that they were ready for us after 20 minutes, we gave it to them, the host took it and looked lost as to why we were standing there. We were waiting for our ticket for proof that we are able to be sat soon. He accused us of not giving him the buzzer at all. So strange as we were standing in front of him the entire time. I understand that it was a hectic Saturday night, but he could at least apologize and let us know that he will do what he can instead of such accusations. <br&gt;<br&gt;The manager came and spoke with us and apologized. He stated that it&amp;#39;ll be another 30 minutes. We waited around and after checking up on the host 2 more times, he finally said he got us a table after 40 minutes. Total wait time was about an hour and a half. <br&gt;<br&gt;It was a busy night with high school homecoming so we gave them some slack and was happy with the service that we received from the wait staff.<br&gt;<br&gt;Food is always consistent and delicious! <br&gt;<br&gt;Thanks to our waiter for bringing up the mood! He was great!", "rating": 3, "date": "11/4/2014"}, {"text": "I usually don&amp;#39;t leave negative reviews, but this place sucks. My most recent experience involved them cancelling my to-go order for no reason and they did not notify me until I checked my delivery app. I ordered within their open hours and didn&amp;#39;t order anything overly complicated. I guess they just didn&amp;#39;t feel like cooking food and being paid for it. No idea why I would have expected that from, you know, a restaurant. The food is also overpriced and kind of bland, honestly. I just wanted some cheesecake. I&amp;#39;ll order from somewhere else next time.", "rating": 1, "date": "3/3/2018"}, {"text": "The food is over cooked and over priced.  All our meals were way over cooked.  The salmon was burnt.  The meatball in the spaghetti was dry.  No mashed potatoes on one of their busiest days of the year.  The pasta was over cooked. The cheese on top of the pasta was microwaved to a point that it was rock hard.   It was the nastiest food I&amp;#39;ve ever tried in my life.  Bathroom was nasty. Toilets were full of urine to a point they were almost over flowing and they wouldn&amp;#39;t flush.  When I told the manager about the condition of the bathroom I was told, &amp;#34;They aren&amp;#39;t that bad&amp;#34;.   The elevator is broken.  It doesn&amp;#39;t go to the proper floor.  We had to hit the Level 1 button several times for it to finally let us off on Level 1.", "rating": 1, "date": "1/1/2019"}, {"text": "Jessica was our waitress and she was incredible. All of our food was delicious and the portions were huge. Place was packed and didn&amp;#39;t take reservations and the wait was long but the great service made up for it.", "rating": 5, "date": "7/10/2018"}, {"text": "I have always loved Cheesecake Factory but my visit on july 4th was disappointing. We had to wait 10 minutes for a table. Whwn we were seated, there were several empty tables, it was myself and my husband. They took forever bringing ulour drinks, appetizer and food. Food was excellent!", "rating": 3, "date": "7/5/2018"}, {"text": "The Cheesecake Factory is decently priced and a great place to go for dinner while on The Country Club Plaza. The ambience is calming, as the lights are usually dim during dinner time. The food is flavorful, and I recommend the Louisiana Chicken Pasta. They offer a large variety of creamy cheesecakes.", "rating": 5, "date": "1/11/2017"}, {"text": "So a friend stopped to get something to go. I ordered the mushrooms. They didn&amp;#39;t look anything like the picture on the online menu. They were the tiniest mushrooms I have ever seen. But props to the person who actually stuffed them. Had to be a lot of work stuffing those. Will not order again!", "rating": 1, "date": "3/9/2019"}, {"text": "This place can be hit or miss. I have eaten here roughly 3 times. Twice take out once dinning in. This last time I ate at the bar and had a drink. I ordered the shrimp tacos and a couple of margaritas. They were good the drinks were ok. I have 2 major problems with places like this. When your drinks are $12 they should pack a punch. After 2 I was sure I would be feeling good. Nope nothing. The tacos were 4 small sized soft tacos with one piece of fish cabbage and a chipotle sauce. Rice and black beans. The beans were great rice bland and horrible. Tacos had a unique flavor with the slaw. $16. Places like this take regular meals that are normal $10-12 and jack them up and served iced up drinks. I only give into this place if I haven&amp;#39;t eaten all day and don&amp;#39;t know what I want but want options. The cheese cake itself I could careless about. <br&gt;<br&gt;The times I have ordered takeout I have been asked if I want bread but get none after saying I do. So I have given up on that and didn&amp;#39;t need it so not to mad. I only eat fish so I order the salmon the first time my potatoes were a tad salty on the second visit my green beans were burnt. Like I said for the price the food should have better quality. $20 meals but they can&amp;#39;t cook sides properly is displeasing.", "rating": 2, "date": "10/28/2016"}, {"text": "Food was good and well seasoned but a bit over priced for the small portions they serve. My waitress didnt offer any bread not that I need it. I asked her if she could bring my child&amp;#39;s beverage with her meal so sh wouldn&amp;#39;t fill up on juice and she brings it before the meal anyway.... But I enjoyed the outside seating on that beautiful day.", "rating": 3, "date": "5/22/2017"}, {"text": "I like the Cheesecake Factory a lot they got great food &amp;amp; amazing cheesecake . But it can do better , like have lower prices and WiFi plus Apple Pay . But pretty cool place.", "rating": 3, "date": "2/3/2018"}, {"text": "Very disappointed. 1st- we sat down the silverware had dried food all over it!! It took over an hour to get our food. The waitress brought our food and half of it went on the table and my daughters lap. She took my husbands coffee literally out of his hand at the same time asking if he needed a refill.. have to say.. unfortunately we won&amp;#39;t be returning.", "rating": 1, "date": "3/23/2019"}, {"text": "Went here last night after a few other places failed. Yes, we are out of town and ate at a restaurant we have in our hometown. But this meal was amazing!  we had the orange chicken and chicken bellagio. Both were fantastic!! We had the ultimate margarita and a Long Island to drink, although pricey, they too, were amazing. We will definitely go back!", "rating": 5, "date": "6/21/2016"}, {"text": "Having dinner at CFactory should be an amazing experience, we all agree! ....well tonight was not the experience expected; either with Food or Service that we received...<br&gt;<br&gt;Started with a phone in order....after being left on hold for 7 mins we decided to call into another line, of course it was answered....took our order. Started a little bumpy....should have been our first sign to go a different direction. But we wanted CF so bad.....<br&gt;<br&gt;Arrived, My wife went into the Restaurant ( while I waited in the car)....15mins later (which is @10-15 mins after we were told our dinner would be ready for pickup) my wife returns to the car not so happy...she was apparently told to wait in the &amp;#34;need a table line&amp;#34; for a pickup order , while our dinner sit at the counter getting cold.<br&gt;<br&gt;5 mins later we arrive back to our Hotel ( CCPlaza)....and noticed that our $65.00 dinner was a mess ( picture included) ...it was cold...and NO cheesecake in the bag! Yep - the signature item was left out of the bag and yes we were charged the $8....<br&gt;<br&gt;So we called again ( third time now) - spoke with Manager ( Nick), explained the incredible experience that began about an hour and 25 mins ago....and was told to return and we could have our $8 cheesecake, we of course we could we paid for it...<br&gt;<br&gt;...after I reiterated that our dinner was an upside mess and cold he agreed to remake the $65 order( seemed obvious to me that would be a given ....was I suppose to be grateful? Thought I was the customer....guess not! <br&gt;<br&gt;Confused...why would I make a second trip and hour and 30-45 mins from our first phone call to finally get my food (and pay the full ticket)...surely he would make the right call ( customer first)...not quite...after I stressed my continued unhappiness Nick said he would comp a slice of cheesecake...so now we&amp;#39;re making progress - I expected the entire dinner to be com&amp;#39;d ( seriously two trips/ three phone calls -nearly 2hrs from my first phone call- is this too much to expect?!?). Manager Nick disagreed....slice of Cheesecake and nothing else...true story!<br&gt;Well my wife and I decided to eat the cold food, let the Manager take the additional profit from charging us and not giving us anything and next time eat elsewhere....<br&gt;<br&gt;What did the customer do wrong?<br&gt;Doesn&amp;#39;t a manager have the authority to remedy a horrible customer experience?? <br&gt;I<br&gt;Additionally, is CFactory leadership comfortable with an experience ending this way?  Why are loyal customers being treated like this...are profit margins at corporate stores so tight that the  customer pays more and gets less...another reason why we love eating &amp;#34;local&amp;#34; owned/operated...better quality food and certainly better customer service!", "rating": 1, "date": "8/28/2017"}, {"text": "The Cheesecake Factory is never a disappointment. I have always enjoyed whatever I choose off the menu. Today I decided to go with the greek salad small plate. It was filled with chunks of miniature cucumbers, tomatoes, red onion, feta cheese and olives. I loved it!", "rating": 5, "date": "7/10/2016"}, {"text": "Something for everyone on the menu. Cheesecake Factory has probably the largest menu of any restaurant I have ever been to. <br&gt;<br&gt;All the foods are prepared and presented professionally. All the foods taste fantastic. Highly recommend the BBQ Salmon, which is one of my favorites. <br&gt;<br&gt;And of course you can&amp;#39;t go there without ordering dessert. Having over 30 different cheesecakes makes this the hardest choice of the night for you. Recommend the Oreo Extreme Dream Cheesecake. Oreos cooked into the cheesecake?  Yes please.", "rating": 4, "date": "8/23/2013"}, {"text": "Came here (a part of 4) for lunch. The experience is consistent with my prior experience here.<br&gt;Food - 5<br&gt;To start with the best, the food here is pretty good. I&amp;#39;ve only been here twice, but on both occasions me and my companions have enjoyed the food here. Portions are large and dishes are tasty. They have a tremendous variety so it&amp;#39;s good for those that don&amp;#39;t know what they want or if you have many different tastes in the party. However, the menu can also be overwhelming. Cheesecakes are super tasty. Drinks are good as well. I do hate that they don&amp;#39;t put prices on both. <br&gt;<br&gt;Service - 3<br&gt;Again, both times i have been disappointed with the service. They don&amp;#39;t take reservations so you will usually wait if you come on a busy day. Our wait wasn&amp;#39;t long (2-5) minutes, but expect up to 60 minute wait during very busy evenings. The service is very slow (probably the kitchen and not the servers themselves). No  matter, we waited for our food for way too long. Each time the servers apologized, but that doesn&amp;#39;t do much and seems like a common occurrence. The servers are friendly despite being very busy.  <br&gt;<br&gt;Atmosphere - 4<br&gt;The decor is all over the place, but it isn&amp;#39;t bad, it just doesn&amp;#39;t have a very uniform theme. Outside (when it&amp;#39;s not hot) the setting is really nice, next to the fountains.<br&gt;<br&gt;Value/Price - 3.5<br&gt;While the food is tasty and portions are great the service is negative due to long waits and propensity to get things wrong. The atmosphere is relatively neutral. Prices are above my expectations, but not totally out whack with the area. I hate that they don&amp;#39;t put prices on cheesecakes and drinks. Drinks range at around $12. Overall, i would recommend to attend, but aim for the least busy time and know that the place is priced slightly above average.", "rating": 4, "date": "9/4/2017"}, {"text": "Friday morning came here to buy a cheesecake. There many worker here but it look like they are busy talking to each other and then doing there job.", "rating": 3, "date": "9/14/2018"}, {"text": "Very big menu , but you can&amp;#39;t go wrong! This is one of those restaurants that you&amp;#39;ll have to keep trying a new dish , but once you find your favorite dish you&amp;#39;ll fall in love with this restaurant", "rating": 5, "date": "6/29/2016"}, {"text": "Great food at a great value. They have a very extensive menu, there is sure to be something for everyone!  I had the pit beef dip sandwich, and tried the veggie melt, both were outstanding.", "rating": 5, "date": "10/10/2016"}, {"text": "I&amp;#39;ve purchased 2 cheesecakes to go this morning and when I came home, I checked my bags and found 2 pretty small slices compared to the big ones I&amp;#39;ve always gotten. It is pretty outrageous to receive such small amount after I ended up spending $17.  I&amp;#39;ve also ordered another time a sandwich getting no butter,. Will no go there anymore. Been going to the Cheesecake Factory for years. Extremely disappointed!", "rating": 1, "date": "12/7/2018"}, {"text": "Michelle is the epitome of low class. She is a classic example of a person with zero people skills.  Never in my life will I look at cheesecake the same again without thinking about this experience.  I never plan on going that Applebee&amp;#39;s like restaurant ever again. Brio kona mccormicks jack stack or any other restaurant on the plaza would love the added business.  I&amp;#39;m just mad at myself that I wanted a slice of frozen cheese cake that&amp;#39;s not even made in house<br&gt;<br&gt;816-977-7737 if you want to ask me about my experience over the phone.  Disrespect is not something I will tolerate. <br&gt;<br&gt;Mazin Jabr-", "rating": 1, "date": "9/24/2016"}, {"text": "Once upon a time there lived a girl who resided in Wichita, Kansas. From the time she was just a wee lil&amp;#39; sprout until those awkward teenage years, her parents would cart her to the shopping/food mecca 150 minutes away known as Kansas City - which she would later refer to as KCK thanks to high school debate.<br&gt;<br&gt;What started out as trips to Laura Ashley where she and her mother would walk out in floral jumpsuits, and that little German sweets shop, where she and her father would walk out with chocolate smears on their faces, evolved into more hip outings. She would drag her parents to Abercrombie and insist on eating at that looming restaurant on the corner.<br&gt;<br&gt;The Cheesecake Factory became her favorite restaurant - it&amp;#39;s uniqueness unbeknownst to Wichita, and having only visited one other time in Chicago, the demanding 16 year old would insist on ordering multiple baskets of brown, gooey, oaty bread - warm and fresh from the oven.<br&gt;<br&gt;She would scarf down avocado egg rolls - damning the abmoniation that those surely are against her Asian background - sparing not the even the puffy rice noodles adorning the plate. Soft, warm and creamy avocado filling be-speckled with peppers wrapped in delicate, golden brown fried wonton wrappers - surely these were health food that would not disrupt her teenage diet.<br&gt;<br&gt;And to cap off a meal, she would indulge - depending on the season - in either a chocolate peanut butter cookie dough cheesecake (which she now bemoans the loss of and didn&amp;#39;t/still doesn&amp;#39;t give a hoot about the inevitable hives that would accompany that luscious histamine inducing dessert) or her favorite dessert of all time: the White Chocolate Peppermint Bark cheesecake that would debut only in the holiday season. <br&gt;<br&gt;Not much has changed: instead of engorging in all 8 half eggrolls solo, she now shares these with her kinfolk - ordering, instead, some raw tuna piled atop avocado and served with four delicately fried wonton chips (Ahi Tartare). But somehow she manages to lick clean the luscious mashed potatoes adorning her father&amp;#39;s plate and the sweet potato fries served with her aunt&amp;#39;s beautiful burger. These, she declares, are sweet potato fry perfection. Chain restaurants have the advantage of millions of tasters, and thanks to that, those fries rule...when dipped in honey mustard dressing.<br&gt;<br&gt;And once a year, she insists...ABSOLUTELY DEMANDS that she get her White Chocolate Peppermint Bark cheesecake, a red peppermint dotted cake with a white chocolate topping that sits upon a dense brownie bottom...and please, serve this with hot fudge.", "rating": 4, "date": "1/8/2013"}, {"text": "The food gained this place an easy 4 stars but the service knocked it down a bit.<br&gt;<br&gt;Cheesecake Factories are always a reliable good time. This trip, though, was bizarre. The guy working the host counter was a bit creepy and gave off a pedo vibe. Unkempt and stared at everyone.<br&gt;Our waitress was pleasant but not very smart. Her timing was also incredibly off. She interpreted &amp;#34;give me a minute to look at the menu&amp;#34; as &amp;#34;neglect us for 20 minutes without even bringing the drinks already ordered.&amp;#34;<br&gt;When the food was finally delivered by someone else, our server decided to come up from right behind the other server before we even took a bite and ask &amp;#34;how is everything tasting?&amp;#34; Can we have ten seconds? <br&gt;Leftovers were stuffed into a tiny box which leaked all over by the time we got home. She got us two pieces of cheesecakes to go in two separate small containers... now we have three separate (tiny) boxes in three separate smaller plastic bags. Apparently, it would take too long for her to get a bigger bag to consolidate everything, so we walked up to the cheesecake counter ourselves and got a large bag within two seconds.<br&gt;Great food experience spoiled by poor hiring decisions and, perhaps, inadequate employee development.<br&gt;Your experience may vary. Cheers!", "rating": 3, "date": "11/20/2017"}, {"text": "What can I say that hasn&amp;#39;t already been said? Nothing. That&amp;#39;s because that&amp;#39;s really the impression that I get here. Everything that is here has been done before. There is nothing that just catches my eye and says pick me, Kim. That&amp;#39;s sad to me.<br&gt;It was a 50 min wait on a Thursday which hey, I&amp;#39;m okay with as long as I will be dazzled. I&amp;#39;m easily dazzled. I&amp;#39;ve been dazzled by shiny buttons but back to the subject at hand.<br&gt;The seating is discouraging. We were a group of six adults and we were sat in a booth that would have been uncomfortable for me and my four teens. That&amp;#39;s standard for them according to their manager though. He apologized profusely.<br&gt;So I picked the chicken Parmesan sandwich and can say, yep it&amp;#39;s a sandwich. I wasn&amp;#39;t wowed but I wasn&amp;#39;t upset. I was overwhelmingly underwhelmed. I ended up bringing it home. I don&amp;#39;t know what&amp;#39;s the deal with the current trend of big bread on sandwiches but I don&amp;#39;t like it. The flavors were meh. I will say I&amp;#39;m glad that I got the chicken parm since two people at the table opted to not even take their leftovers since they were disappointed.<br&gt;I will say that they are generous with their portions. Also, I truly did enjoy the raspberry lemonade. It was the shining star of my meal. I couldn&amp;#39;t get enough of it. I hate that this restaurant makes me feel like a food snob because I&amp;#39;ve found joy in $1 tacos. This just doesn&amp;#39;t do it for me.", "rating": 3, "date": "12/12/2014"}, {"text": "Not bad for a chain! I&amp;#39;ve always had good service. It&amp;#39;s great to come here for a couple small plates. I love the (not so) little house salad! The crab cakes and crab bites are also very good. For dessert I ALWAYS get the Tiramisu cheesecake, is the absolute BOMB. Try it!", "rating": 4, "date": "7/11/2015"}, {"text": "Always great food, always great service.<br&gt;<br&gt;Mostly we go here for appetizers and drinks. Because they are delicious. I was just now listing all of the ones I love but it was ridiculous so I&amp;#39;m instead going to merely highlight the Crispy Cuban thingies and the Firecracker Salmon.<br&gt;<br&gt;I don&amp;#39;t even try to remember which cocktails of theirs I&amp;#39;ve gotten before, haven&amp;#39;t had a bad one yet, so I just choose the ones that appeal to me most that day.<br&gt;<br&gt;If you go during busy times SHOCK it&amp;#39;s going to be busy. So we like to go during the less busy times so we can enjoy ourselves at our leisure without feeling bad.<br&gt;<br&gt;Bartender guy is awesome, and of course the waitstaff is all quite good.", "rating": 5, "date": "3/13/2016"}, {"text": "Try their Oreo Cheese cake and their New Orleans Cajun Dish. Both are very good! Also, the coffee is fantastic! <br&gt;<br&gt;Sincerely,<br&gt;Jonathan Fayard", "rating": 5, "date": "7/7/2016"}, {"text": "Get something new every time I go and this is the first time I could&amp;#39;ve done without the meal chosen. Matter of personal taste and confident it was not the fault of theirs at all. As always the Cheesecake is perfect. Great location and friendly service.", "rating": 4, "date": "10/17/2017"}, {"text": "The male host as you walk in is funny and greets everyone as soon as you walk in. We ate at the bar and it was entertaining watching him make people laugh...he&amp;#39;s a character. <br&gt;Everyone knows the portions are huge so we ordered appetizers for lunch. Had my favs: Thai Chicken Wrap, Spinach &amp;amp; Artichoke Dip and Strawberry Shortcake. Just the right amount for 2 hungry people without feeling overly stuffed. <br&gt;Whitney was the bartender as we sat at the bar. She is friendly, service-oriented and attentive. She took care of our needs before we even asked. We&amp;#39;ll be back!!!", "rating": 4, "date": "4/20/2013"}, {"text": "The wait was over an hr, then they stuck 6 women with coats and purses in a tiny booth, then said we could wait another hr for a larger table, then manager was not helpful, kept giving excuses that did not make the experience any better. I told him to go away, he huffed off and said fine. Really, so much for our first annual Christmas Party! We decided to stay, hell been here all night anyway! Will see about the food. Our server Holly, very apologetic, better manners!", "rating": 1, "date": "12/11/2014"}, {"text": "So we love the Cheesecake Factory but this trip was just so so. Went at lunch they were not busy yet but service slow. They took away the shrimp bacon sandwich that I am so bummed about. Key lime cheesecake AMAZING!!", "rating": 4, "date": "7/20/2017"}, {"text": "Let me tell you this location of the Cheesecake Factory has great service!<br&gt;I believe that service can make or break a business. <br&gt;Well this location had no problems with serving our party of 10. Even after having our waitress come back several time to take our orders &amp;amp; continues to have later people needing to be added to our tables the waitress didn&amp;#39;t miss a beat. <br&gt;I can really appreciate how well organized &amp;amp; knowledgeable of the menu she was. There were several people who asked for her opinion on what to get &amp;amp; they we all happy with their selections. I ordered the crab cake balls &amp;amp; they came out excellent.  They were served with a lemon sauce &amp;amp; I didn&amp;#39;t know how that would taste with them but the waitress assured me that they were good. When is got the balls they were crunchy on the outside &amp;amp; moist on the inside. The flavor was well seasoned but had a little bit too much breading for my liking but I still ate them! Lol <br&gt;When it was time to pay the waitress only took a few a<br&gt;Credit cards &amp;amp; bills at a time. I really appreciate that so that she doesn&amp;#39;t get mixed up &amp;amp; mess up someone&amp;#39;s charges. It takes great waitress to know what your limitations are &amp;amp; to work within them. I would rather wait a extra few minutes to be charged correctly then to get done faster now &amp;amp; have to fight about the wrong charges later.", "rating": 4, "date": "12/10/2016"}, {"text": "Got seated pretty quickly.  Waitress started with us and was pleasant while getting getting our waters.  &amp;#34;Michael&amp;#34; came, appearing slightly annoyed, and informed us that he was going to serve us.  Appetizers cake out and they were excellent.  Our entrees took quite a while and once received, the plates almost burnt our hands.  Michael blamed my son&amp;#39;s pizza for the delay.  Took another 5 minutes for the pizza and it was hard on one side and soggy on the other.  My other son&amp;#39;s burger bun was soaked through.  Asked for two cheesecakes to go and Michael brought them out on plates.  Very annoyed that he had to box them up.  First time in years that I left no tip.  Makes me uncomfortable, but when some of the food was ok and the service was extremely disappointing, I feel like I did the right thing.", "rating": 2, "date": "7/7/2018"}, {"text": "Just finished eating. 1st off we did not get any bread until just before 2 of our party received their food. The rest of us waited and waited then low and behold my sons order and my order arrived after the 1st two had only a bite or two left. The waitress said someone should have brought it out. Ya think? My side dish was room temperature. Poor experience. This was only my second visit here. I feel the food and service is far from what one would expect from the price you pay in this part of town.", "rating": 1, "date": "9/1/2018"}, {"text": "The Chicken Madeira &amp;amp; Steak Diane combination is a great dish. Both have unique, fantastic flavor and for only 21.95 it&amp;#39;s a great price. Topping it off with any of their signature cheesecake makes the meal complete.", "rating": 5, "date": "11/5/2016"}, {"text": "Wow. Very disappointing. I ordered the filet and it had a huge tendon through it. They did replace but took over thirty minutes so I got it to go. We have been here over 90 minutes and asked for bread repeatedly and they didn&amp;#39;t have any.   To top it off- no toilet paper in the ladies room. I&amp;#39;ve gone to many Cheesecake Factories across the US, but this one was a mess!", "rating": 1, "date": "6/5/2018"}, {"text": "Went here for a to go order. Specifically asked for bread and butter. Bread and butter didn&amp;#39;t come with. The staff was rude as well. The CF in Overland Park is much better.", "rating": 2, "date": "7/21/2017"}, {"text": "Say no!!! Today I waited over 30 minutes for my food, my utensils were dirty with old salad pieces and my burrito had at least two pieces of hair in it! I spoke with the general manager name Jackie and she was extremely rude. She didn&amp;#39;t seem to care that my lunch date with my sons was ruined and I had to literally beg her to offer more compensation other than a slice of cheesecake! Don&amp;#39;t waste your money or energy here.", "rating": 1, "date": "4/14/2017"}, {"text": "We hadn&amp;#39;t been here in a while so decided to check it out again for lunch.  I noticed they now have small plates, quite a variety too.  We ordered the Vietnamese Tacos off of that menu and then our regular orders of Shrimp Bistro (my fave) and burgers for the boys.  The tacos were very tasty, but could have had a higher quality of pork in them.  There were so many other flavors going on with it that the stringy, overcooked pork really didn&amp;#39;t detract from it too much.  The Shrimp Bistro was excellent, as always.  I don&amp;#39;t know how, but they seem to have the freshest tasting shrimp in that dish.  For the price, next time we are going to order several small plates and see how that goes.<br&gt;<br&gt;I do not eat the cheesecake here.  I guess I&amp;#39;m a cheesecake snob, but for a place to have it in their name you&amp;#39;d think it would be better than it is.  I have been spoiled by Eli&amp;#39;s in Chicago, Claim Jumper&amp;#39;s out west, and of course, my own.", "rating": 4, "date": "7/9/2012"}, {"text": "The service is impeccable, but you can comparable food at most other places cheaper.<br&gt;<br&gt;On my last visit, I had ordered a pizza. The crust on half of the pizza was as black as can be, but they still brought it out. Due to time constraints, I didn&amp;#39;t send it back. <br&gt;<br&gt;The Peach Bellini here is very delicious.", "rating": 2, "date": "6/12/2015"}, {"text": "I called ahead of time to advise I will have a party of up to 15. The lady I started talking to did not allow me to finish and cut me off with an abrupt &amp;#34;We don&amp;#39;t do reservations&amp;#34;. I advised that it&amp;#39;s not my concern, I told her she was rude and turned to speak with Jenny who was friendly and helpful. We had a few ladies trickle in late and we felt pressure about one of our tables, the manager came and started clearing the table and scooting it from us. We advised we still need the table and he stated &amp;#34;We thought you were consolidating&amp;#34;. He was not happy and it was visible. I do not suggest a big party eat here.", "rating": 1, "date": "8/27/2017"}, {"text": "HORRIBLE SERVICE!!!! The sad thing is, my wife really enjoys their cheesecake...but we can&amp;#39;t stand bad service! A group of friends and I decided to go here to celebrate my birthday, this past weekend, which was a bad idea. Lousy waitress (didn&amp;#39;t receive drinks for at least 30 minutes after being seated), Delayed food, and worst of them all....poor customer service!!", "rating": 1, "date": "9/6/2016"}, {"text": "Great restaurant.<br&gt;Bangbang chicken my favorite one.<br&gt;The bread was wonderful and I had the carbonara. Hubby had the pizza. Loved the cheesecake and our server was excellent! They know how to treat their customers!!", "rating": 4, "date": "6/28/2015"}, {"text": "I used to really enjoy The Cheesecake Factory but they have become so focused on creating profit that they have taken away from a great experience.  Tables are too close to each other to the point that it&amp;#39;s awkward and uncomfortable.  At the 2-top tables you might as well be sitting with the people to your left and right.<br&gt;<br&gt;Then there&amp;#39;s the price.  We ordered 2 sandwiches and shared a dessert and the bill was $40.   The meal and the experience were certainly not worth that.  The service was timely and friendly but the sandwiches were not hot.  Perhaps they sat in the queue waiting to be served for a bit.  It will probably be a long time before I&amp;#39;m back to give them another chance.  There are just too many other places that are better across the board.", "rating": 3, "date": "6/7/2014"}, {"text": "I eat here all the time!! It has a great happy hour with happy hour drinks and apps! The waiters are always great and attentive. My favorite is Adam at the bar downstairs! He is great!! The managers are always nice as well. They help out their staff and everyone seems to enjoy their job! <br&gt;<br&gt;The menu is extensive. You will always find something you like here! And they have a great cocktail list!", "rating": 5, "date": "3/19/2015"}, {"text": "The food was pretty good, the atmosphere was nice, but the real winner here was Kristin. She was smokin hot and acted as an A1 wingman for my friend. You a real one Kristin. You a real one. She deserves a raise", "rating": 5, "date": "6/1/2018"}, {"text": "I completely love this place. Their food is delicious and they don&amp;#39;t call it the Cheesecake Factory for nothing. I love the variety in desserts and drinks. I have yet to have a bad experience here.", "rating": 5, "date": "11/25/2016"}, {"text": "Of course the food is always fantastic, (I&amp;#39;d highly recommend the chicken and biscuits if you&amp;#39;re looking for a delicious comfort food). But I brought my sister here for her bachelorette party as her first Cheesecake Factory experience, and our server made the night unforgettable. Jared B. was attentive, knowledgeable of the menu, and had the best personality that kept us laughing all night! Thank you for the incredible ending to our night!", "rating": 5, "date": "6/11/2016"}, {"text": "They are always super busy at this location. Even if you want just cheesecake at 10 pm on a Saturday night it&amp;#39;s still a wait. They do have the bake case right by the entry though so if you&amp;#39;re there for just dessert you can easily get it to go and eat it on a bench on the plaza.", "rating": 4, "date": "10/1/2016"}, {"text": "If your main objective for lunch with a sister is an enormous menu of choices and decent service in a dynamic atmosphere, then The Cheesecake Factory will fulfil your needs.  I have not had a bad experience there, the food is always tasty and it is certainly plentiful.  But, considering they have been on the Plaza for quite a number of years and I have been a customer only 3 or 4 times, it isn&amp;#39;t exactly what I am seeking very often.<br&gt;<br&gt;Lunch on Monday was Sis&amp;#39; treat and so the choice was hers.  I had a very good and extremely filling selection from the SKINNYLICIOUS® menu.  I chose the Chicken Salad Sandwich with a side salad dressed with Balsamic dressing.  The greens were plentiful and a nice Spring mix with absolutely no iceberg in sight.  The housemade chicken salad included Roasted Almonds, Lettuce, Tomato and Mayonnaise and was served on Toasted Brioche Bread that really made the sandwich something special.  Sis also ordered from the Skinnylicious menu and got a Hamburger on a Toasted Bun with Lettuce, Tomato, Onion, Pickles and Mayonnaise which is also served with a Green Salad.  Neither of us had room for dessert, which was disappointing, as luscious looking cheesecake slices as well as other goodies kept whizzing by our table for delivery to all our dining neighbors (who had planned their eating and drinking more judiciously -- or else they just waddled out of the restaurant, I&amp;#39;m not sure which). <br&gt;<br&gt;We arrived at about 1:15 and after a five minute wait were seated.  To correspond with my recollections of past visits, the noise level made it difficult to carry on conversation and I remembered why I tend to avoid the experience.  But the service was very efficient and the food was quite good, so I balanced the pros and cons to a solid 3-star rating.  The Cheesecake Factory is never going to be a favorite for me, but it is obviously a winner with hundreds of customers every single day, so they must be doing something &amp;#34;Right&amp;#34;.  And maybe I&amp;#39;ll make another visit in about five years and remember to &amp;#34;Save room for some Cheesecake&amp;#34; when I go. PS: Thanks again for lunch, Sis.", "rating": 3, "date": "3/17/2016"}, {"text": "I want to acknowledge Brett, the manager who so kindly took care of me during my entree moment of distress, he was very polite and pleasant to encounter.  I first ordered the Bang-Bang Chicken and Shrimp, not expecting the taste to be so sweet, I am used to spicier thai type food. I called Brent and explained my distress, without any hassle, he asked me which entree would I like to replace my order with. I ordered my usual the Shrimp and Chicken Gumbo, one of the best dishes on the menu.  I also ordered the cuban sandwich with fries for my hubby, it was a very delicious experience, and his first experience trying it at The Cheesecake Factory.   My husband is picky when it comes to cuban sandwiches and he found the cuban sandwich from The Cheesecake Factory to be the one of best cuban sandwiches.  He would order it again.", "rating": 4, "date": "11/19/2016"}, {"text": "Always delicious! My favorite entree is the orange chicken. It&amp;#39;s well spiced and huge portion. The typhoon punch is $10 but also with the splurge. There seems to always be a wait, I always check the bar upstairs and downstairs for a seat or two and usually get right in.", "rating": 5, "date": "1/5/2017"}, {"text": "I know a lot of people love to hate big chains like The Cheesecake Factory.  I&amp;#39;m not one of those people.  I&amp;#39;ve been to this location a half-dozen times over the years and have never had a bad experience.  It&amp;#39;s usually very busy but the wait has never been as long (in my experience) as their estimate.  On my most recent visit, I wasn&amp;#39;t super hungry so I chose the Vietnamese tacos from their small plates menu; it was less than six dollars for one of the best meals I&amp;#39;ve had all YEAR, folks.  Truly phenomenal.  I split a piece of chocolate something-or-other cheesecake with two other ladies and we still did not finish it all.  It was great, but a little too rich and the portion was ridiculously large.", "rating": 5, "date": "5/31/2012"}, {"text": "Great service! Wanted to sit outside and had to wait 15-20 mins even though there were several open tables outside but we understand sometimes we have to wait. Our server Cory do an amazing job! He was on top of our orders, gave us great recommendations on the food, and was constantly stopping by to make sure we were going fine. AMAZING JOB by Cory!", "rating": 5, "date": "4/12/2017"}, {"text": "Such a surprise to know that my husband can read minds and bring home an entire strawberry cheesecake from The Cheesecake Factory. So delish!!", "rating": 4, "date": "10/9/2016"}, {"text": "Just a warning dont ever order to-go from this restaurant. I should have quit while I was ahead and hung up after being put on hold for nearly 10 minutes. When I arrived to the restaurant i waited 5-10 minutes to be acknowledged after their delivery partner cut in front of me to get her take out order. Not their fault, but nonetheless irritating. When I finally am acknowledged she needs to go to the kitchen to check on the order. She comes back, has me pay, and says it would be another 5 minutes. She runs my card and still no sign of my food; I asked if I was early since this was 15 minutes past my pick up time with the line debacle. She said no something happened with my order but it would be out soon. Fast forward 20 minutes later I&amp;#39;m still waiting and she offered complementary cheesecake for the wait but all I wanted was what i ordered. Almost 30 minutes in and still no sign of the food. Since I already paid I continued to wait growing more frustrated as time passed. Finally she says they&amp;#39;re boxing up my order after 45 minutes of waiting for a carryout order. I will never order from this restaurant again and can&amp;#39;t believe I paid full price to waste an hour of my night. The cashier was nice and apologetic but the sitution was absurd. I wont be returning.", "rating": 1, "date": "2/7/2018"}, {"text": "The Cheesecake Factory is open year around, but I want to begin my synopsis with a holiday time recommendation.  During the holidays when the Plaza lights are on, ask for a seat on the second level by the windows.  Your wait might be a little longer than if you regularly had to wait, but you will enjoy a fantastic view of the Plaza Lights while you enjoy your dinner or your dessert.<br&gt;<br&gt;Okay, now for main review.  Most of the menu features sandwiches, burgers, small pizzas and comfort foods.  None of the dishes are particularly mind blowing, but they are solid meals served in large portions.  You might want to ask for a to-go box.  I particularly like the artichoke and crab dip.<br&gt;<br&gt;After you&amp;#39;ve boxed up your leftovers please make sure to leave room for dessert.  The cheesecake is amazing.  It comes in plenty of flavors and my favorite is the pineapple upside down concoction.<br&gt;<br&gt;The service is pretty good, but I will say things will slow down during times when the restaurant is at its peak rush.  The restaurant will become busy and there is usually a wait, but luckily there is a nice patio where you can wait until a table opens up.<br&gt;<br&gt; If you&amp;#39;re out and about and looking for dinner or dessert on the Plaza, this is a good place to start.", "rating": 3, "date": "1/15/2012"}, {"text": "Our food was excellent today for lunch. The service was great. Want to give a special hand to our waiter, Corey R. He has been the best waiter by far at any restaurant in a long time. Attentive, anticipated what we wanted before we asked, genuine. Made lunch so enjoyable. He&amp;#39;s a keeper. We had two kids with us and he took the effort to engage them. Everyone of the wait staff were on their game today!", "rating": 5, "date": "12/22/2017"}, {"text": "I went with my co workers tonight and I got the spicy skinny chicken tacos.  So good! Plenty of food too! I would normally not order off the &amp;#34;light&amp;#34; menu, but I am SO glad that I did! My co workers also enjoyed their meals and no one left hungry! I also got the salted caramel cheesecake to go and it was the bomb! All the ingredients were fresh as well!", "rating": 5, "date": "1/25/2016"}, {"text": "CHEESECAKE!!!<br&gt;<br&gt;That&amp;#39;s why I come here because the food is just ok. So I decided to get the Reese&amp;#39;s cheesecake because I was in the mood for some peanut butter and it was just peanut butter overload! It was too heavy and rich for me and I should have just stuck to my fave, the Red Velvet cheesecake that is encrusted in white chocolate shavings. There cheesecakes are usually very light, but this Reese&amp;#39;s one was just too much! We sat outside since it was a nice day out which I&amp;#39;m really glad we had this option in the Plaza. I wish more Cheesecake Factorys would do this! <br&gt;<br&gt;Pros:<br&gt;-CHEESECAKE=YUMMY!!!<br&gt;<br&gt;Cons:<br&gt;-none really....I just don&amp;#39;t think the food is that spectacular here so oI only come for the cheesecake<br&gt;<br&gt;Why I gave it a 3......<br&gt;Come for the cheesecake and leave the food behind! Seriously people, the food is something I could make but that cheesecake is like a little slice of heaven because it is very light and rich at the same time. Definitely will be back for the cheesecake!", "rating": 3, "date": "5/30/2012"}, {"text": "well whats not to love about the cheesecake factory.  pretty good food at a decent price.  My only complaint was the server completely forgot to put our kids order in.  so we all got our food and then had to wait for our kids hot dog to come out.", "rating": 3, "date": "4/14/2015"}, {"text": "So, confession.  In a past life, before I became absolutely obsessed with food, I went to chain restaurants like Red Lobster or Olive Garden and...Cheescake Factory.  But I definitely considered Cheesecake the top of the heap.  And here&amp;#39;s why:<br&gt;<br&gt;1.  I&amp;#39;ve eaten at Cheesecake in 5 states and there was a consistent high standard of service and food at all five.<br&gt;2.  Great selection of dishes of all kinds of varieties.<br&gt;3.  Really reasonable prices.<br&gt;4.  Huge portions.<br&gt;<br&gt;Have been here with friends for drinks a couple times and had - of course  - the amazing cheesecake.  This location is scenic and always busy.", "rating": 4, "date": "8/23/2011"}, {"text": "This place is great regardless of what city I&amp;#39;m in. Everything from the orange chicken to the seafood gumbo is fantastic. My family loves the food here. 4 different cheesecake slices today and none of them disappointed.", "rating": 4, "date": "7/30/2016"}, {"text": "Sara and I were down on the plaza, and contemplating dinner. I had never been to the Cheesecake Factory, (yes, me, I HAVE never been to the famous Cheesecake factory till now) so we decided cheesecake for dinner. There was no line, we walked in, and were waited on immediately. Fantastic service. <br&gt;<br&gt;The bathrooms are up a spiral staircase. There are gorgeous columns of stone in the dining area. The dining area has both tables, and also booth tables. There is a cake rack with most of the cheesecakes near the cash register. We were handed the menus,and the happy hour menu! My God, Kansas City, the happy hour drink prices were $5.00 for a mojihito, makes me think the actual drink prices are...what? Seems to be a pattern. We didn&amp;#39;t order from the drink menu. <br&gt;<br&gt;On the cheesecake menu, it lists over 30 types of cheesecake. It is in the back of the menu, which is a spiral bound menu of many pages. I took a while to read them all, and settled on a yummy piece of pineapple upside down cheesecake. I wasn&amp;#39;t sure of the price...uh, they could add the price to the menu, it&amp;#39;d be kind of kind. Some of the prices are $6.95, some are 7.95. Sometimes that might make a difference,and the individual prices aren&amp;#39;t on the menu. My cheesecake rocked my world. It really was good. <br&gt;<br&gt;Other than the little things, I can think of 30 reasons to go back to the Cheesecake Factory. Is it worth a huge line? I&amp;#39;m not sure. I&amp;#39;d not go there when there&amp;#39;s a huge line, but that&amp;#39;s just me.I don&amp;#39;t wait in line in Kansas City, I go to the next place.  It is a beautiful place to eat, with outside eating, a bar with over priced beverages, and wonderful cheesecake.", "rating": 4, "date": "9/8/2011"}, {"text": "Service was great and cheesecake was amazing as usual! My only complaint is that I ordered the four-cheese pasta and there was almost no cheese on it. It did not taste very good and was overpriced.", "rating": 3, "date": "2/24/2018"}, {"text": "Delicious, reasonably priced, and always busy! We typically come here for cheesecake alone but we went for the full meal this time. <br&gt;Arriving at 9:00 on a Saturday night we were put on a thirty minute wait. Once sat we were promptly greeted by our server who was good, no real complaints with him.<br&gt;Food was okay, margaritas were okay and expensive for the quality we got. <br&gt;This review only get four starts because of one little issue that arised. I had ordered the pasta dish, meat on the side. Once our food arrived the chicken was in the dish and I had it sent back. By time it came back, my boyfriend was finished with his meal and it had already been boxed up. Although the manager did deliver my meal there was no further action taken. It kind of dampered the entire meal and we weren&amp;#39;t compensated in any way. Finishing with the usual cheesecake we were out of there two hours later full and content. <br&gt;Next time were just going to do cheesecake and go elsewhere for dinner like normal.", "rating": 4, "date": "8/12/2015"}, {"text": "I am really sad that they no longer offer Thai chicken pasta. It was always my go to dish.", "rating": 3, "date": "4/13/2014"}, {"text": "I have yet to come into the Cheesecake Factory and actually eat dinner -- My husband and I swung by to pick up a couple slices of cheesecake to go one night.  Unfortunately, we had to rough it and stand in the to-go line for well over 30 minutes just for those two pieces of cheesecake but lemme tell ya.. It was worth it! I can&amp;#39;t wait to go back and have another slice of the banana creme cheesecake!! :)", "rating": 4, "date": "4/11/2016"}, {"text": "It was soooo good. Had dinner last night with my friend, it was about 10:30 when we got there, the service still excellent and they didn&amp;#39;t rush us until we finish our meal after 11:10. Ordered mango lime cheesecake as desert at the end, even I was so full, can&amp;#39;t help to finish it all.", "rating": 5, "date": "8/10/2016"}, {"text": "I&amp;#39;ve been to a bunch of Cheesecake Factories in various states: NY, NJ, GA... and then I come here and i&amp;#39;m like &amp;#34;Meh?&amp;#34; <br&gt;<br&gt;Arrival and Ambience: <br&gt;<br&gt;Like every other CF, this location is beautifully maintained. Impeccably clean, even on a rainy night. We went on a Friday evening and got immediate service. We sat at a booth by the window. <br&gt;<br&gt;Service: <br&gt;<br&gt;Waitress seemed really &amp;#39;green&amp;#39;. Wasn&amp;#39;t sure if she was new or having an off day. She didn&amp;#39;t visit us regularly and forgot a few things. Cute, sweet lil girl though. <br&gt;<br&gt;Food: <br&gt;<br&gt;This is the stingiest portioned Cheesecake Factory in terms of bread. Every one that I usually visit gives you 3 loaves of bread, and this one only gives you 2 --- and they are so small in comparison to other locations. Were the grains on strike in the kitchen? I need answers. <br&gt;<br&gt;I ordered the pizza... and it was large, fresh and delicious. Crust was on point. The heartburn was worth it. <br&gt;<br&gt;Drank lemonade... tart and delicious as usual. <br&gt;<br&gt;Got the Reese&amp;#39;s peanut butter cheesecake. Delicious but couldn&amp;#39;t finish it all. <br&gt;<br&gt;I LOVED the atmosphere though. Cheesecake is always a place where you can go and kick back with your friends in an unrushed, unhurried manner and catch up. <br&gt;<br&gt;So I would go again, and just hope the service is a little better --- thassit!", "rating": 4, "date": "5/9/2013"}, {"text": "The service was horrible. The menu is huge, but everything that we had was gross. I think they would benefit from decreasing the options and perfecting the items that they keep. The side salad had virtually no dressing and was only a bed of lettuce. The remainder of the food tasted like a frozen meal that was warmed up. The bread we received was as hard a rock. We will not go back.", "rating": 1, "date": "1/12/2018"}, {"text": "Food was fantastic- Chicken Lemon Couscous, patio dining and tasty drinks made for a perfect summer evening. Cesar took great care of us and our puppy!", "rating": 5, "date": "8/21/2016"}, {"text": "Wow. If I could give this 0 stars I probably would. My boyfriend and I decided to go to cheesecake the other night to celebrate his birthday before he went out of town. This will be the last time I go to this cheesecake because of this experience. I work in the industry myself and am not one to complain but this needed to be reviewed. We sat at the bar and were greeted by a super nice host! That was the last good thing of the night. My boyfriend and I have been to the cheesecake a million times and ordered one of our favorites the fried Mac and cheese balls and a couple of cocktails. After receiving our cocktails and some bread that we had to ask for he took our order and gave us our check? We hadn&amp;#39;t even gotten our appetizer yet why print us the check? I understand it&amp;#39;s busy but sheesh. Thankfully I did look at the receipt because I noticed that we were waiting on appetizers that were never going to come... he had forgotten to ring them which is totally fine until we realized the people who had sat down after us by almost 10 minutes were now eating... Mac and cheese balls cake and were phenomenal. I ordered the chicken Madeira and it was also great my boyfriend on the other hand ordered the Cajun jumbalaya pasta  and found hair that was most definitely not either of ours in his pasta. After notifying our waiter he said &amp;#34;oh wow I&amp;#39;m sorry about that&amp;#34; did not offer to get us a new one, get us dessert, or even notify a manager... it was very apparent it bothered my boyfriend so I was thinking oh maybe he&amp;#39;ll get out cheesecake! He even asked us what we were celebrating! We ordered cheesecake and the waiter insisted we take it to go because I said I was full? And after all of that catastrophe not one manager was notified and we paid a total of $130 for some of the worst service I have ever had hands down.", "rating": 1, "date": "12/30/2018"}, {"text": "Was there yesterday evening with family and was told 1 hour wait. After 1 hour and 30 mins we were seated.We were so hungry that we all ordered right away. Food came with in 15 mins. All good so far. I ordered factory grande burrito, which came in cold. After 7 mins got hold of our waitress, she took the burrito back and said we will warm it up. After 15 mins she emerged again and said it&amp;#39;s taking longer as they are making me a new one. Another 10 mins later same old plate emerged and burrito was hot this time but it was very dry. Marinara was sticking to plate. We go to cheesecake quite a few times but this time I was dissatisfied and disappointed", "rating": 2, "date": "11/20/2016"}, {"text": "Decided to go to this restaurant for my birthday to celebrate. After looking through the menu for 20 minutes not a single server came to my table. I was not even offered water. This is terrible service and don&amp;#39;t expect to be coming back anytime in the future when the server was more focused on holding side conversations with others.", "rating": 1, "date": "12/11/2017"}, {"text": "This was the second time coming to this location and we were not disappointed either time. We went over the noon hour on a Saturday and surprisingly they were not busy at all. <br&gt;<br&gt;The mac and cheese burger is definitely a favorite of mine. How can it not be with all that cheese! We then followed our meal with cheesecake of course. I enjoyed a piece of raspberry lemon cheesecake. <br&gt;<br&gt;Overall it was a great experience with great food. From now on I think we will order our cheesecake first and then decide if we want something else because I left feeling miserable.  I didn&amp;#39;t want to take a doggy bag because we were walking and definitely couldn&amp;#39;t let it go to waste.", "rating": 4, "date": "10/10/2016"}, {"text": "Poor service, overly salted potatoes,  verrryyyy fishy salmon, chicken gristle in pasta dish. Won&amp;#39;t  return. Not the restaurant I  remember  visiting a few years back. What a disappointment  for my  son&amp;#39;s  birthday dinner :(", "rating": 2, "date": "10/8/2016"}, {"text": "Their food sounded great but I never got to find out since they don&amp;#39;t have a parking lot to accommodate their carrying capacity.  The location of this place is ridiculous and even downright dangerous. The traffic I had to go through just to get there was enough to make any good person lose their shit quick. The outside patio area and the inside areas were standing room only. The location is like going into a protest war zone. The cheesecake factory needs to change locations. That whole plaza is a hazard. I even saw a crazy dude with a huge sign ringing a bell yelling about the end of the world outside the restaurant. There were hundreds of tourists walking around blocking traffic and being very disruptive and vulgar. Total nightmare circus. No respectable person wants to go through any of this trouble.", "rating": 1, "date": "10/3/2016"}, {"text": "The wait was 1.5 hours. We opted to take the food to go and eat it elsewhere. It took 15 minutes for my food to be ready as carry out. I definitely recommend taking this route if you are craving Cheesecake factory food! I ordered the Bistro Shrimp Pasta. Its my GO-TO dish for Cheesecake factory. I love this stuff! So what if it was voted the worst food in America 2010?!?!<br&gt;<br&gt;Cheesecake Factory&amp;#39;s Bistro Shrimp Pasta<br&gt;2,730 calories<br&gt;78 g saturated fat<br&gt;919 mg sodium<br&gt;141 g carbohydrates<br&gt;<br&gt;<a href=\"/redir?url=http%3A%2F%2Fhealth.yahoo.net%2Fexperts%2Featthis%2Fworst-foods-america-2010&amp;amp;s=ed2e6e05d62dd69f96d56fea93f36f833eb53eba0ccd4b99604942825502b4c8\" target=\"_blank\" rel=\"nofollow\"&gt;health.yahoo.net/experts…</a&gt;<br&gt;<br&gt;Service was good and fast. Me likes!", "rating": 4, "date": "12/15/2010"}, {"text": "I have no idea why I don&amp;#39;t go here more often.  The menu is HUGE, staff is friendly, food is good to great. They ALWAYS have tables because it is seriously huge inside.<br&gt;We went for brunch and I had the Monte Christo sandwich which was lovely.  Everyone at the table enjoyed their food and the bonus was that we were sitting out by the fountain, it was gorgeous out and Plaza Art Fair weekend so the people watching couldn&amp;#39;t be beat!", "rating": 4, "date": "10/19/2013"}, {"text": "Food was mediocre, disappointed in food.,service good, ambience good. I ordered the mango avocado salad with chicken was overcooked and dry.", "rating": 3, "date": "11/24/2017"}, {"text": "Can not rate anything because everything there is awesome and best. Avocado rolls, and what so ever.", "rating": 5, "date": "5/15/2016"}, {"text": "They do not take reservations even for large parties.  The yelp listing are misleading.  The food and ambiance is superlative but expect to wait.  Every.  Single.  Time.", "rating": 3, "date": "2/2/2016"}, {"text": "Can&amp;#39;t make a reservation on your birthday for a large party, so unless you want,to waste 40-60 minutes, on your birthday avoid.", "rating": 1, "date": "11/5/2015"}, {"text": "After an evening at the theater we decided to have dinner at the Cheesecake Factor.  We arrived around 9:30 and things were very slow.  No one was at the hostess station and very few tables were occupied.  We asked for a table for two and we were told we would have to wait 5-10 minutes.  Really?  The hostess continued to organize things behind her station, carry on conversation with waitresses and totally ignore us for a good amount of time.  She then looked up and called out our name as if there was a crowd of 100 there when it was just the two of us.  We were taken to our table and waited almost 10 minutes to be waited on.  We finally put in our order.  We ordered Nachos as an appetizer and Spicy Cashew Chicken and a Chopped Salad.  When the Nachos came they were burnt, not just browned but actually black on the edges.  The food finally came and it was fine.  We had to almost beg for drink refills.  The Cheesecake Factory  has really raised their prices to where it&amp;#39;s almost a fine dining experience (or should be).  It&amp;#39;s hard to find even a simple entree for under $15 and most are more than that.  We ended up spending over $50.  Needless to say we won&amp;#39;t be going back.  It&amp;#39;s crazy to have to pay that much for bad service, being ignored and burnt food.  There are great places on the Plaza to dine.  I&amp;#39;d steer clear of this one.", "rating": 2, "date": "2/3/2017"}, {"text": "Cheesecake Factory has good food, enormous portions, and a menu the size of a book. I&amp;#39;ve been to both KC locations numerous times, and my wife and I typically split an entree (usually the orange chicken). The portion sizes are such that you can get two full meals out of one entree. Maybe not the burgers, but most of the $16-20 items. The cheesecake is also delicious. I&amp;#39;m a big fan of the pineapple upside down cheesecake. The Plaza location is a little cramped and super busy. If you&amp;#39;d like a Friday/Saturday night cheesecake fix, I&amp;#39;d recommend the Overland Park location. It is laid out better, and you aren&amp;#39;t packed in like sardines while waiting for a table. My favorite time to go to the Plaza location is on a nice warm day for Sunday brunch and get a table outside.", "rating": 4, "date": "3/23/2015"}, {"text": "If you&amp;#39;re going to take part in Postmates at least follow through. Every time I&amp;#39;ve ordered from you through them you&amp;#39;ve dropped the ball. Unexpected for a corporate fancy Applebee&amp;#39;s.", "rating": 1, "date": "7/29/2017"}, {"text": "I have a wonderful time everytime I go..even in the summer when it&amp;#39;s packed and you got to get a pager or blinker and wait. I do know if you go to the bar you can get in faster and order and eat. They make wonderful drinks and great white wine. I usually order appetizers the tacos and fried calamari. Daughter gets nachos son gets jambalaya my fried gets spaghetti with large shrimp. And yes cheesecake red velvet, snicker, turtle and my die hard flavor is PINEAPPLE UPSIDE DOWN. how could you not enjoy the buttery goodness of the cake and sweet pineapples with the luscious smooth cheesecake.", "rating": 5, "date": "1/8/2016"}, {"text": "When in Kansas City I always try to make a stop at the Cheese Cake Factory on the Plaza. This trip was no different with the exception that Sunday brunch was the only time I had available. Expectations were high but I must say I was let down.<br&gt;<br&gt;I arrived with my party at 11:00 and we ordered Bloody Mary&amp;#39;s and examined the menu. There were only aout 8 other people in the restaurant but we noticed right away our server seemed distracted and was absent a great deal. She took our orders but the drinks too 15 minuets to arrive and later she brought water and some bread. We kept looking but it appeared she was busy elsewhere. <br&gt;<br&gt;Our orders took nearly 40 minuets to arrive and the Mexican egg dish I ordered was cold and did not have much flavor. Our server never asked if we wanted another round of drinks and finally brought out our checks. Since we were a group of 6 an 18% gratuity was automatically added which did not set well with our group based on the service we had received. <br&gt;<br&gt;Everyone in our group was disappointed. It could have just been an off day for the restaurant  crew but  overall  this was not a very satisfactory brunch. We will be back the next time we are in KC but with some apprehension.", "rating": 2, "date": "11/20/2012"}, {"text": "Food (aka appetizers):<br&gt;1) Avocado Egg Rolls:  Generous amounts of avocado, tomato, onion, with a dash of cilantro in a fried crisp wrapper.  Quite delicious and paired nicely with the tamarind-cashew dipping sauce.  <br&gt;2) Fried Avocado, Mushrooms, and Zucchini: paired with a ranch and another slightly spicy dipping sauce.  Fried avocado was ok, but the fried zucchini was quite good<br&gt;3) Tropical Fruit Smoothie: fresh mango, passion fruit, pineapple, and coconut blended and topped with a strawberry and pineapple slice.  Refreshing, not too thick.  <br&gt;<br&gt;Ambiance:<br&gt;Nice restaurant, great location near the plaza, but the service was incredibly slow.  Maybe I&amp;#39;m comparing to quick LA style service, but it took FOREVER!  <br&gt;<br&gt;Bottom Line:<br&gt;A-OK.  Would probably dine elsewhere if I ever came back to KC.  Good vegetarian options, though.", "rating": 3, "date": "8/6/2013"}, {"text": "I was here about a week ago and had a really tough time being satisfied when I finally walked out the door. I don&amp;#39;t eat here often, but met some friends this week for a birthday dinner. The food was good, but the poor waiter was over-extended having several large tables at the same time. But, that wasn&amp;#39;t why I was so disappointed. Mostly, I had a the toughest time with the host stand.<br&gt;I had arrived first because out of my friends that were coming, I live the closest. This normally isn&amp;#39;t a problem because I am usually just sat at our table and allowed to wait. NOT THE CASE HERE!! When I got to the front of the mass of people in the restaurant, after mentioning that there would be six of us I was promptly told that I had to wait until at least three people from our party were present before I could be put at a table. I have never heard of this before... Really? Being willing to be patient I accept their answer and took my buzzer and sat down. Well, when it became clear that my friends were running late due to traffic and an accident on the highway, I thought maybe they would make an exception and let me sit at a table. I was wrong. Not only did I get the feeling that I didn&amp;#39;t matter to them because I was just one person, but they continued to give tables to fit the size of our party to other people and when my friends finally arrived we still had to wait an additional half hour to be seated! So a customer that got to a &amp;#34;first come first serve type restaurant&amp;#34; got shoved to the side and made to wait over an hour and a half before getting a table. This &amp;#34;there must be half of your party present&amp;#34; idea does not make for a good customer experience. Whether you are super-busy or not, EVERY customer should be made to feel important.<br&gt;I&amp;#39;m pretty sure the next time someone asks me to come to the Cheesecake Factory on a weekend, I am going to politely decline!", "rating": 2, "date": "4/16/2015"}, {"text": "I wish i could give it 0 stars. First off our buzzer never went off so eventually i went up and they were like &amp;#34;oh i don&amp;#39;t know what happened&amp;#34; so we had to wait longer to get our table. Then we ordered and our waiter got literally every single one of our orders wrong. It was just a mess. They didn&amp;#39;t even take anything off the bill. I got a soda, pizza, and slice of cheesecake. After tip, it ended up being 30 dollars, and i tipped the minimum i could. Not worth it. terrible and over priced", "rating": 1, "date": "9/21/2015"}, {"text": "My wife and I typically steer clear of corporate chain restaurants whenever possible, but when mom sends us a gift card to Cheesecake Factory for Valentine&amp;#39;s Day, all sense of discretion apparently goes out the window.  Seriously!  What kind of person in their right mind would choose to go here on a Saturday night?  Well that, my friend, would be us - and about 5,000 other insane and hungry people.  <br&gt;<br&gt;When you set foot inside this Cheesecake Factory, it&amp;#39;s a wonder that this place could ever actually be filled to capacity.  It&amp;#39;s enormous... with 2 levels of dining space, 2 bars, and (I believe anyway) 2 separate kitchens.  But no - when we arrived shortly after 7pm we were told that it would be 1.5 hours before we would be seated.  They didn&amp;#39;t even have any more pagers left it was so busy!  Don&amp;#39;t people know that there are a bunch of other great restaurants on the Plaza?<br&gt;<br&gt;Instead of waiting, we decided to wander upstairs to the bar area to see if we could snag an open high-top table (first-come, first-served).  Getting upstairs proved to be an adventure as we had to climb over hordes of people who were seated on both sides of the stairway waiting for their name to be called.  When we finally reached the top, we were in luck - there was a table just getting up from their meal, so we quickly grabbed it and took a seat.<br&gt;<br&gt;Now for the actual dining experience.  Have I mentioned yet that I&amp;#39;ve never been a fan of Cheesecake Factory?  They have one of the most overwhelming menus that I&amp;#39;ve ever seen in my life.  I swear it&amp;#39;s 20-something pages long, with every type of food imaginable represented.  Personally, I&amp;#39;d prefer them to pick one or two types of cuisine, perfect those, and get rid of the rest.  But nobody asked me, so I had a decision to make.  Not really in the mood for anything in particular, I decided to order the Cajun Chicken Pasta.  My wife ordered some type of salad.  When the food arrived, I immediately thought to myself, &amp;#34;Wow... this is why the obesity rate in America continues to rise.&amp;#34;  My oversized plate was full of pasta, which was drenched in an oil (or butter)-based sauce and topped with 4 pieces of breaded chicken.  The taste was fabulous, but I couldn&amp;#39;t even finish half of it, and I wasn&amp;#39;t about to try because I knew I had to save room for the best part of the meal - the CHEESECAKE, which as always was delicious.<br&gt;<br&gt;All-in-all, our visit really wasn&amp;#39;t all that bad.  We didn&amp;#39;t end up having to wait for a table, our service was very good, and the food exceeded my expectations.  I just wouldn&amp;#39;t choose to come here on a regular basis and battle the crowds when there are all sorts of other great dining options available in the area.", "rating": 3, "date": "2/23/2015"}, {"text": "Utter perfection! From the steak Diane to the always yummy mashed potatoes, you can&amp;#39;t go wrong. And they will serve you cheesecake!", "rating": 5, "date": "11/5/2015"}, {"text": "Not a fan. Generic American food. Too many things on the menu that I feel they don&amp;#39;t specialize in anything. I never eat here.", "rating": 2, "date": "10/23/2014"}, {"text": "Food was okay. Place was clean. 2 Stars for service. Waitress decided to let our drinks stay empty for 5m at a time while she was fussing over another table. Under staffing imo. Giving too many tables. Will probably not return.", "rating": 2, "date": "9/22/2015"}, {"text": "Came here for dinner before my appointment at Apple Store. We sat at the bar and was greeted by the bartender. I could not understand a single thing he said to us. It&amp;#39;s not a language barrier that we encountered, it was his mouth full of marbles that prevented us from understanding him. With that being said, every time he talked to us, we just agreed out of sheer embarrassment or just stupidity. Lol. Other than that the food was awesome and picked up the S&amp;#39;mores cheesecake, which is AAAMMMAAAZZINNNGG!  It must be Gods food!", "rating": 4, "date": "8/4/2014"}, {"text": "Hello, thank you for taking the time to read this review. I was extremely disappointed and disgusted about my visit tonight. While visiting the Kansas City Missouri Country Club Plaza location, myself and my family waited for our table, while waiting there were two employees cleaning out the refrigerated case that the cheesecakes are displayed in while doing so she was trying to kill a fly cleaning the bottom of the cabinet out with a white rag wrapped around a spatula that she touched the side of a whole cheesecake with and then put it back in the cabinet and was going to leave it to sell it. This is not only completely unsanitary it&amp;#39;s disgusting and gross as a customer to be standing there witnessing this along with other employees and nobody did anything. I spoke with the manager, Brock I believe was his name, he had a very nonchalant response to me, and to me seemed put out that I brought this to his attention. His only response to me was which cake was it? No apology, no comment that what had happened was completely unacceptable... nothing, at all. He walked back behind the counter and leaned in to speak to the two employees that had been cleaning the cooler and had one of the ladies remove the cheesecake I pointed out had been touched with the dirty cleaning rag. I will post the on Yelp also this evening to make sure the public is aware of how your manager handles things. I would have wanted someone to speak up if they had also witnessed this and that&amp;#39;s the only reason I brought it to the manager&amp;#39;s attention tonight. I will not return to this location and regret that I even stayed for dinner tonight. My family was there to celebrate my daughter&amp;#39;s birthday and that is the ONLY reason we did not leave immediately after I witnessed this. Needless to say, no one in my party ordered dessert. Very disappointing Cheescake Factory...  on a very special occasion. Please use this as a learning experience. This used to be one of our very favorite places for birthdays... please do better.", "rating": 1, "date": "9/20/2018"}, {"text": "Great place... Extremely fattening, but great, hahaha! This is a once a month or every other month affair, because once you leave here, in between the bread basket (plus butta), excellent entrees and cheesecake and coffee, you will need to let your pants out by the end of the evening. They do have a lighter menu... but let&amp;#39;s be real... AIN&amp;#39;T NOBODY GOT TIME FO DAT! IT&amp;#39;S THE CHEESECAKE FACTORY MAN!!! So eat your fill and enjoy yourself. The food will not disappoint and the decor is beautiful! Every time I go I have a great waiter or waitress and enjoy my experience through and through! And chocolate lovers, it is your duty to try the Chris&amp;#39;s Outrageous Cheesecake... CHOCOLATE OVERLOAD!!!! YEEEESSSSS!!!!", "rating": 5, "date": "7/25/2015"}, {"text": "The service and food preparation are always consistently good at this location; we&amp;#39;ve only had a few bad experiences, but they get the problem cleared up. My husband loves their kale and quinoa salad w/ salmon. I&amp;#39;ve ordered their Shelia&amp;#39;s cashew chicken salad, the Bistro Shrimp pasta, and the Antioxidant salad, and they are very good. Can&amp;#39;t say a bad thing about any of their deserts. The Rocky Road Sundae, Apple Dumpling, and cheesecakes are my favorites. This location is definitely superior to the Overland Park location, so we don&amp;#39;t go there anymore, even though it is closer to our house.", "rating": 4, "date": "4/25/2016"}, {"text": "The food was good and decently priced.<br&gt;The wait was non-existent.<br&gt;Our waiter was professional but needed to be a little louder than the environment.<br&gt;The cheesecake pieces are huge but exactly as described.<br&gt;<br&gt;The downside?  The manager wearing grey on this date needs to learn to not hover over tables and be less loud communicating using his earpiece.", "rating": 4, "date": "7/11/2015"}, {"text": "This place is going to overwhelm you with food. It&amp;#39;s going to be pretty good, more than you wanted, better than you expected, and somehow still wanting some cheesecake afterward. God bless the heroes who can eat all their eyes desire at this place.", "rating": 4, "date": "1/6/2015"}, {"text": "I am not used to waiting an hour and a half to eat, and normally would not do it if it was not for a family outing. It was a week night and the place was packed, elbow to elbow standing around waiting. After being seating the service was good, Our waiter was very attentive and did a good job taking care of 5 adults and 2 teenagers. Everyone was pleased with their dinner. My major problem was value. $16.95 for a bowl of pasta is a bit on the expensive scale for me. If you want to go eat out at a nice restaurant and don&amp;#39;t mind waiting and paying inflated prices then you will enjoy it here.", "rating": 3, "date": "1/2/2016"}, {"text": "It&amp;#39;s not too often I write a negative post. And to write one for a Cheesecake Factory is almost absurd, But I have to! Minus the server poor guy .. Today I was served cold bread to start and then for breakfast I got served MOLDY bread and a cold breakfast. Bacon and eggs were cold!  manager came out with fresh hard bread and said he really does apologize and to let him know if there is anything else he can do .. And also promised  this had never happened before. Really?come on.", "rating": 2, "date": "9/4/2016"}, {"text": "First off, the food was great. I wish I could say the same for the service, but I can&amp;#39;t. Our waiter was too &amp;#34;preoccupied&amp;#34; staring at the woman next to us. Im guessing that she was his friend, but I thought it was supposed to be customers first? Anyway, while he kept talking to her, we saw our cheese cakes sitting on the counter ready to be served, and which they sat there a little too long. To round it all up, in the end while he was still preoccupied, he messed up our bills and gave us the wrong change. I think all of this could&amp;#39;ve been avoided if our waiter would of just done his job right, and saved the friend visiting for after work.", "rating": 2, "date": "10/29/2014"}, {"text": "We have always had good food and good service here , that said,sometimes you feel somewhat close to other tables and it is a little on the noisy side. The menu is comprehensive and if you can&amp;#39;t find a cheesecake you like out of THAT selection there is no hope for you!", "rating": 4, "date": "6/25/2014"}, {"text": "This place is a wreck. I waited an hour to be seated and the food was warm, not even hot and the prices are sky high. Last time I ever go there.", "rating": 1, "date": "11/22/2015"}, {"text": "Will was our server and he was great! Great sense of humor and very kind. Southwest chicken sandwich was very flavorful and right amount of spice. They make their Bloody Mary mix in house and it is fabulous! Totally recommend.", "rating": 5, "date": "5/7/2015"}, {"text": "The tables were dirty.  We were too close to other couples.  Poor service.  The food was good, great location, and a beautiful building with a short wait.", "rating": 2, "date": "7/7/2014"}, {"text": "We came here for a co-worker&amp;#39;s birthday and told them that we needed to be timely with our return to the office. The server was good about being conscientious about the timing. Good job!<br&gt;<br&gt;Since the last time I have been here (who knows how many years??) they have added more items that are smaller sized or lower in calories. That&amp;#39;s good but the sheer number of items on the menu is overwhelming.<br&gt;<br&gt;Typical, I chose poorly. I saw a chopped salad that was smaller and lower in calories and it had blue cheese. Sold. It was very flavor-less. Boo. The other people all seemed to really enjoy their choices. No cheesecake was consumed on this visit.<br&gt;<br&gt;Overall, our service was good and, for the most part, our group enjoyed their food. I would say this is a decent place to visit if you have a diverse group that cannot decide on one option. Just don&amp;#39;t order the boring little chopped salad.", "rating": 3, "date": "9/12/2012"}, {"text": "I am still baffled about what happened to me last night at Cheesecake Factory. I was dining by myself (very close to my hotel) and waited about 10 minutes when my buzzer went off. I saw the hostess grab a stack of menus and lead me to a table set up for 6 people. I informed her it was just myself, and she looked at me like I was crazy and asked if I was sure I didn&amp;#39;t have a party of 6. Yep, pretty sure it&amp;#39;s just me...<br&gt;Ended up there was a mix up at the hostess stand; they paged the wrong buzzer. Then the three ladies at the hostess stand basically started arguing in front of me and other guests about their mix up. <br&gt;I ended up getting taken to a different table and sat down. Shortly after the server came by, but offered no greeting. The first words out of his mouth were &amp;#34;you need to give me a few minutes to get caught up&amp;#34;. WOW! There are more tactful ways to address a waiting guest, such as &amp;#34;hi, how are you? I&amp;#39;ll be with you shortly&amp;#34;. I was just taken aback by this and sat at my table about two minutes before getting up and leaving. There was no chance I was going to get good service even when he did &amp;#34;catch up&amp;#34;. Had a very nice meal across the street at PF Changs instead.", "rating": 1, "date": "4/5/2016"}, {"text": "Depending on when you show up here, it could either be a nightmare to get in or a breeze.  When they first opened...back in the roaring 90s...this was a frequent gathering spot after work.  And it was ALWAYS packed.<br&gt;<br&gt;My last visit was this weekend and we were seated right away by an overly friendly host.  Having not been here in a while, I was surprised at how empty the place was on a beautiful Saturday afternoon.  But I&amp;#39;m not gonna complain about getting seated quickly.<br&gt;<br&gt;The menu, as always, was a novel.  I had a hard time narrowing down my choices.  They have a new &amp;#34;Skinnylicious&amp;#34; menu with low-cal options that looked delicious.  Especially the Lettuce Mushroom Wraps.  I was tempted to try the veggie burger, but opted for the comfort of the Four Cheese Pasta.  I was happy that they offered most of their dishes in lunch portions, knowing the gargantuan size of their normal dinner dishes.  <br&gt;<br&gt;The pasta was right on the money.  Tender penne pasta with a creamy tomato sauce.  Just what my belly was looking for.  <br&gt;<br&gt;Service was friendly and attentive without being overbearing.  All in all it was an extremely nice lunch on the Plaza.  And it reminded me how much I really like this place.<br&gt;<br&gt;My visit reminded me how much I love their brunches on Sunday, so I&amp;#39;m definitely going to remember to come here.  The Lemon-Ricotta Pancakes look divine!", "rating": 4, "date": "1/17/2012"}, {"text": "Yes, it&amp;#39;s a chain, but I&amp;#39;m not ashamed to admit that I love Cheesecake Factory.  It never disappoints!  The portions are huge and it&amp;#39;s reasonably priced.  This location in particular has a great outdoor dining area.  Cheesecake Factory also offers a great cocktail menu....martinis, mojitos, etc.<br&gt;<br&gt;My favorite things to eat at Cheesecake Factory:<br&gt;The Whole Grain Bread!!<br&gt;Luau Salad<br&gt;Thai Lettuce Wraps<br&gt;Crispy Chicken Costoletta<br&gt;Brownie Sundae Cheesecake (which I usually take home since I never have room)", "rating": 4, "date": "12/16/2011"}, {"text": "The food was great. My only complaint was how long it took to get our lunch. It took 30 minutes for us to get the food we ordered. This was on a Monday afternoon when it wasn&amp;#39;t that busy. I suggest you take their offer when they ask you if you want bread. That way you won&amp;#39;t starve before your meal gets to the table.", "rating": 3, "date": "2/28/2017"}, {"text": "We had a wonderful experience here! There was a large party of us coming for dessert and drinks after my friend&amp;#39;s wedding. Kyle, our server was amazing! He gave beautiful service and the cheesecake was to die for! Thank you Kyle with your awesome beard for making our night extra special with great service!  He was on top of drinks and added in the perfect amount of humor to the night! Ask for Kyle! He&amp;#39;s da shiiiiiiit!", "rating": 5, "date": "7/18/2015"}, {"text": "We went to Kansas City tonight for something different to do and go to one of our favorite places to eat. Well we got seated pretty quick which was great but it took a little long to get our supper but I understand it was busy. But my daughter ordered the salmon dinner and we had to send it back because it was raw and it took another 30 minutes to get it back in which my daughter lost interest in it. So that was disappointing. None the less the waitress kept telling us it was just a few minutes away well that was not true. All I suggest is that the manager should of come over to apologize for the inconvenience and what was disturbing was the still charged me for it. You know it&amp;#39;s not our fault the cook didn&amp;#39;t do his job properly. It&amp;#39;s amazing how we expect so many things to be perfect and we get disappointed when it doesn&amp;#39;t go over well. I hope I get some feedback so I can feel like I can go back someday. Thank you for your quick response  but not to be greedy is there a way to complete my satisfaction with a gift card or something to get me and my family back as loyal customers.", "rating": 3, "date": "1/2/2017"}, {"text": "I must say it was truly amazing! Of course The Cheesecake Factory is known for its deserts, but unfortunately we didn&amp;#39;t get a desert. We still let ourselves go with a delicious appetizer as well as a Stake Diane and a Hibachi Steak! Despite the waiting time it was still worth it in the end! 5/5 would do again", "rating": 5, "date": "2/21/2015"}, {"text": "Sure it&amp;#39;s a chain, but sometimes you just want some comfort food, and to know what you&amp;#39;re going to get.  Food was decent, service was good. Sitting next to the goalkeeper of the 2013 MLS Champions, Sporting KC, was pretty cool, too!  I don&amp;#39;t go here much, but I&amp;#39;ve spotted some sports &amp;#39;stars&amp;#39; here on more than one occasion.", "rating": 3, "date": "12/11/2013"}, {"text": "Cheesecake Factory<br&gt; <br&gt;I have gone to the Cheesecake Factory in the past and I have always had mixed feelings about the food. I often get the orange chicken lunch size, but once I got it dinner style. Well, I was astonished. They were both about the same size, yet you should be getting more for the dinner size. Second, I wish there had been less chicken and rice and more veggies. There were some veggies, but not as much as was needed to call it a side. The chicken was very high in calories and the chicken had too much batter on it. I was literally taking huge bites of batter when it should have been chicken. The Cheesecake Factory advertises it as Orange chicken, but when I was eating the chicken I could not taste the citrusy taste that comes with oranges. Their cheesecakes though are delicious and creamy. . The Cheesecake Factory has been criticized in the past by many people and even in books about the portion sizes and the portions are indeed huge.  But, that shouldn&amp;#39;t surprise anyone!", "rating": 3, "date": "12/5/2013"}, {"text": "This is our &amp;#34;go to&amp;#34; dessert place on the Plaza and it has never disappointed. I can&amp;#39;t imagine a cheesecake that isn&amp;#39;t delicious. The fresh whipped cream on the side just adds bonus points. The coffee is good, not great, but that is ok since the dessert is soooo good. My review is strictly based on Cheesecake and I promise, it is all good!", "rating": 4, "date": "6/8/2014"}, {"text": "Food is delicious. Service was prompt and very acoomodating. The lunch portion is very generous and I can only imagine how big the dinner portions are.... and of course there are plenty of cheesecakes to choose from. If you&amp;#39;re a coffee lover. . I recommend the tiramisu. We had the Banana cream and oreo cheesecake tonight and it was exquisite. I think the crowds are usually a little slow on Sundays between 2-5 ( which I believe are the best times to visit if you want to avoid the standard 30-40 minute waits for a table). Will return.", "rating": 4, "date": "1/25/2015"}, {"text": "Went on Friday of last week again and enjoyed the service and the quality of food is just that quality!", "rating": 4, "date": "8/18/2014"}, {"text": "Our server was AWESOME! One of the nicest servers I&amp;#39;ve had in a long time. She was knowledgeable, brought our food as soon as it was done, apologized for the delay with our food, and was really great. The food, as usual was good. i had the Thai glazed salmon dish; love, love, LOVE the sauce for that dish!", "rating": 4, "date": "12/3/2016"}, {"text": "I&amp;#39;ve been here with family and friends and have yet to be disappointing. The other night, my friends and I went there for late night cheesecake, and even though it was getting late, the waiters were as friendly and accommodating as ever. The cheesecake was sublime and he even rounded down our checks! The reason for the 4 stars and not 5? The price. Delicious food, decadent cheesecake, but a little pricey. But great in every other aspect!", "rating": 4, "date": "3/18/2015"}, {"text": "This being our first visit here I&amp;#39;m almost opposed to give it 5 stars because I try &amp;amp; go at least twice before giving such an outstanding rating. We had such a good experience I could not resist!! <br&gt;<br&gt;Our waiter was very nice &amp;amp; warming as soon as we sat down.. we had our toddler with us and went from a booster to a high chair and he was more than willing to help us get comfortable.  We started off with some cocktails, apple juice &amp;amp; cherry coke.  Nothing fancy.  Then came our appetizer which was ordered the spicy chicken nachos.  Fresh guac, sour cream, pica de gallo  atop the enormous tray of cheesy nachos.  They were really good and almost filled us up.  Not to mention they serve you warm french &amp;amp; this oat bran bread at the beginning with your drinks.  Then came our appetizers... I went with the spicy Louisiana chicken pasta &amp;amp; my husband ordered the chicken &amp;amp; biscuits.  OH MY GOSH!  No words can describe my pasta, the sauce absolutely perfect &amp;amp; spicy, creamy!  Went perfect with the honey glazed chicken, peas, asparagus, and penne pasta.  Best pasta I&amp;#39;ve ever eaten!!!  My husbands dish was equally simple yet divine in taste!  The sauce they used on the chicken and biscuits was to die for!  Our toddler LOVED both.  He absolutely loves spicy so he favored my dish! :)  <br&gt;<br&gt;We couldn&amp;#39;t resist to try the mouth watering cheesecake that we had seen in a display case when awaiting our table.  There&amp;#39;s so many to choose from &amp;amp; it&amp;#39;s hard to decipher which you want.  So we went with the white chocolate macadamia nut cheesecake (at the table for dessert to share)................................ need I say more?  The name explains it all and it was drizzled in caramel sauce with homemade whip topping!  Best cheesecake ever!  We ordered the carrot cheesecake to GO--- nothing short of amazing &amp;amp; indulging as well.  <br&gt;<br&gt;Our first trip here was great!  We many laughs, our serves were fabulous, the food was even better, drinks were the right price for consistency of the drink.  We left VERY happy &amp;amp; very full.  Our toddler didn&amp;#39;t even make it out of the parking garage without falling asleep.  Great evening.  I must say the decor of the place is outstanding as well.  <br&gt;<br&gt;We will be returning very shortly &amp;amp; recommending to all of our friends and family! <br&gt;<br&gt;Thank you Cheesecake Factory for an extradoniary evening!", "rating": 5, "date": "4/7/2014"}, {"text": "Who hasn&amp;#39;t been to the Cheesecake Factory by now? Until this afternoon it was ME, that&amp;#39;s who!<br&gt;<br&gt;I know it&amp;#39;s been there for what seems like forever but I&amp;#39;ve never been. I went this afternoon with the intention of coffee and conversation. I ended up ordering two small plates (which I couldn&amp;#39;t finish), cheese cake, AND coffee. Honestly, when you compare my order to the vastness of the menu, it&amp;#39;s measly. I didn&amp;#39;t even read through it all it was so large! I did make a note that they offered lunch until 5pm. Who does that?! <br&gt;<br&gt;Some of the items are pricey, but the small plates were tempting and on the cheap. I got a Greek Salad. It wasn&amp;#39;t very Greek in my opinion. There was so much chopped cucumber and tomatoes I didn&amp;#39;t even notice the arugula. It was positively swimming in vinaigrette too. I don&amp;#39;t like an over-dressed salad. The worst error of all was that it had goat cheese instead of feta. I adore feta. I detest goat cheese. <br&gt;<br&gt;I also ordered the Vietnamese Tacos. The order came with 3 and I had to pawn one off on my friend because the steamed bun was so filling I could not eat all 3 and also eat cheesecake. They were absolutely delicious!! I would order them again in a heartbeat. <br&gt;<br&gt;Finally the cheesecake: I ordered the Godiva chocolate which was a chocolate lovers dream. I ate half of it, which is a normal portion, I&amp;#39;m sure. The coffee was just as my friend expected. It was a little too strong with a bitter aftertaste. Loads of cream and two Splenda&amp;#39;s made it drinkable to me. I had one and a half cups. <br&gt;<br&gt;Our waiter was friendly and appeared at just the right moments. The bathroom was clean, but lacked hooks to hang your purse in at least one stall. Boo to that!<br&gt;<br&gt;I have no idea if I will ever find myself back at The Cheesecake Factory, as my Hubby doesn&amp;#39;t like cheesecake and for the price we would choose a different place. If invited by friends, I would happily return however poor the coffee.", "rating": 4, "date": "7/8/2011"}, {"text": "Stopped in for a drink and was blown away by the hospitality. Everyone was friendly and had a smile on their face and that&amp;#39;s all I&amp;#39;ve ever wanted from a restaurant.", "rating": 5, "date": "9/23/2016"}, {"text": "I had never been to the Cheesecake Factory although it has been here for quite some time.  I am not one to dismiss &amp;#34;chain&amp;#34; restaurants just because they are a chain. I have had some pretty decent dinners or breakfasts in &amp;#34;chain restaurants.<br&gt;My husband and I went last Saturday around 3:00 p.m. We hadn&amp;#39;t eaten all day and wanted something filling.  The wait was only 10 minutes.  We ordered the Tex-Mex Egg Rolls appetizer which came with 2 dipping sauces.  One salsa and one avacado.  There was barely a tablespoon of the avacado dip but the salsa dip was plentiful.  The avacado dip was delicious but not nearly enough for even one..forget about 2 people.<br&gt;<br&gt;I ordered Salisbury steak with green beans and mashed potatoes.  My husband ordered the Chicken Enchiladas with rice and black beans. I like my steaks medium but I want my chopped meat to be done. It wasn&amp;#39;t.  There were several pretty pink spots.  Maybe that is my problem however. The very first bite consisted of a very small piece of bone.  I didn&amp;#39;t blame the restaurant, I blamed the vendor of the meat. The bright spot of the meal was the mashed potatoes. I did like them with the peel mashed up in them. Several of the green beans, while I know they grow above ground, tasted dirty or musty and while I don&amp;#39;t want my vegetable mushy and soggy, these bordered on almost raw.<br&gt;<br&gt;I thought my husband&amp;#39;s chicken enchiladas came with rice casserole because it was so green.  It was all cilantro and rice.  While cilantro is good combined with garlic, onion, peppers etc., it was awful with just bland white rice.  They could have just boiled some cilantro and thrown it in a bowl and it would have had the same effect and taste. Not good. The echiladas were good, but I have had better elsewhere.  <br&gt;<br&gt;We did order cheesecake and while I have heard from others that they are frozen and shipped in, I thought they were pretty good.  I had the pineapple upside down cheese cake and my husband had the red velvet cheesecake.  The flavors were unique and unusual and actually  I thought, rather good although half of both of them came home with us.  <br&gt;<br&gt;The service was very, very good.  We had a young man who never let our tea or water glasses get empty and stopped by several times to see if we needed anything. I would give him alone 5 stars.<br&gt;<br&gt;I think the Cheesecake Factory should concentrate on a smaller menu that is done very well as opposed to the huge menu which is done &amp;#34;just ok&amp;#34;.", "rating": 2, "date": "8/12/2011"}, {"text": "I love the cheesecake!  Love it!<br&gt;<br&gt;Some of my past experiences have been less than stellar.  The wait staff disappears, the food takes forever, there is a 2 hour wait, and the worst strike: I&amp;#39;m not in love with any of their menu items (but the mandarine orange chicken dish is YUM).  However, my last visit was for dessert only, and I was extremely pleased.<br&gt;<br&gt;It was about 10:40 pm when my friend and I wandered in for dessert (and to kill some time before the midnight premiere of the Sherlock Holmes movie).  A long island was ordered (perfectly mixed and in a large glass!), along with a Carmel Macadamia Cheesecake (our waitress&amp;#39; favorite) and their Chocolate Tower Truffle Cake (death by chocolate, anyone?).  The desserts were amazing, the drinks wonderful, and the service excellent.<br&gt;<br&gt;Even though it was just a few minutes before closing, the waitress didn&amp;#39;t rush us at all.  At 11:15 (15 minutes after closing time), she told us to take our time and enjoy ourselves.<br&gt;<br&gt;I noticed that they had several new low calorie options on their menu, and had changed some of their entrees.  I&amp;#39;m hopeful that I can find some &amp;#34;real food&amp;#34; that will steal my heart in future visits.", "rating": 4, "date": "12/25/2011"}, {"text": "Enjoy coming to the CF and have been many times.<br&gt;Decided to try brunch and was extremely disappointed. I ordered a basic omelette that came with three cheeses and lots of veggies. The omelette was thick, hockey-puck like and perfectly round, texture of a sponge. Avocados didn&amp;#39;t make it on the plate, the three SLICES of cheese were still hard, unmelted and extremely oily. Mushrooms were burnt. <br&gt;Wastress spoke so fast that we had to have her repeat everything. Not a good visit this time.", "rating": 3, "date": "8/13/2012"}, {"text": "I love this place!<br&gt;<br&gt;My fav is the turkey burger w/black beans. I can somewhat stay on my diet and still get a slice of cheesecake low carb with splenda!<br&gt;<br&gt;Who wouldn&amp;#39;t love that!<br&gt;<br&gt;The atmosphere is awesome on the Plaza, def. a must see!<br&gt;<br&gt;Not so great is the beggers that stand right outside waiting to ask you for change as you come out of the restaurant.:(", "rating": 4, "date": "7/21/2011"}, {"text": "It was a sunny afternoon, we were stuck in that in between time post-wedding &amp;amp; pre-reception.  We had hours &amp;amp; I was hungry.  I was also obsessed with sitting outside since it was much nicer weather than the foggy San Francisco I&amp;#39;m used to.<br&gt;<br&gt;I spotted their expansive outdoor seating complete with fountain from across the street and made a dash.  Unfortunately, they were not serving outside until 5pm.  (Huh?  It was so perfectly gorgeous out!  Why not take advantage?)  Seeing my fallen expression, the host quickly suggested that I order take-out &amp;amp; sit outside.  Perfect.  We had drinks at the bar (nice Bloody Mary!) while we waited.  <br&gt;<br&gt;Sitting outside, slurping up my Vietnamese spring rolls was mighty fine.  Nothing outstanding, nothing horrid.  Just even-keel, pleasant.", "rating": 3, "date": "5/29/2008"}, {"text": "Had a drink which as great and crab dip. Me no likey. I tried my best to eat it. After hating Chicago&amp;#39;s Cheesecake Factory and now this one I&amp;#39;m done with this place in any city.", "rating": 1, "date": "8/13/2013"}, {"text": "Got there at 245pm to eat dinner. They won&amp;#39;t take reservations. We had a party of 8 adults, 1 child, 1 baby. We were told 1hr 15 min to 1hr 45 min wait. They clearly don&amp;#39;t like and can barely handle large parties and should have said so. Jack Stack last year had no problem. It took the entire 1 hr 45min (of course). The entire restaurant was packed with people standing and sitting on the steps, standing around the tables where we were eating, the entire lobby was full etc. Most likely some fire codes were being broken and definitely some safety rules for blocking safety exits. The food was ok, but barely warm and placed on a hot plate. Brought me the wrong glass of wine to top it off. Cheesecake was delish though. Do not plan a holiday gathering here or you will be disappointed. Severely mismanaged. If you can&amp;#39;t handle large parties  just say so and we can go to another restaurant that can. Or, how about a new idea....RESERVATIONS for large parties. VERY DISAPPOINTING!!!", "rating": 2, "date": "12/10/2017"}, {"text": "Look, everyone has got a story about Cheesecake, good and bad. Everyone has been waited on by that ass of a server, everyone loves the bread. Here&amp;#39;s why I like it: <br&gt;<br&gt;1. You don&amp;#39;t ask yourself, &amp;#34;What am I in the mood for?&amp;#34; before coming here, because there is no speciality - it&amp;#39;s the cuisine for all peoples. If you want pasta and your friend wants American, no problem. Cafeterias provide the same concept only the food is, well, cafeteria food. Cheesecake is not cafeteria food. It&amp;#39;s food to fill you, it tastes good - I don&amp;#39;t care abut the stigma that it&amp;#39;s a chain. <br&gt;<br&gt;2. You pay for the portions. Most of the dishes I&amp;#39;ve seen or eaten are fit for two. I&amp;#39;ve even noticed couples sharing a plate, which I would never do (I can eat my own well past a single portion to be too honest with you) but you get the point. CF isn&amp;#39;t friendly for dieters - it&amp;#39;s more like outright hostile. <br&gt;<br&gt;I&amp;#39;ve even heard from their own staff members that Cheesecake salads are as healthy their fried macaroni and cheese. It&amp;#39;s pretty killer food and CF is notorious for sliding around any exact figures as to how high in calories their dishes actually are and although I think&amp;#39;s that&amp;#39;s pretty slimy of management -  it&amp;#39;s America! If the restaurant skimped rather than plate too much, the franchise wouldn&amp;#39;t have made it past the first restaurant. <br&gt;<br&gt;3. The bathrooms. I&amp;#39;ll inevitably take the trip if I&amp;#39;m at CF and starving (but trying to keep a promise to myself not to eat the full loaf of molasses rye bread before my meal comes) and bored too. So, I&amp;#39;ll excuse myself and walk around a bit, take the long way up the stairs twisting around the ridiculous crowds in the waiting area. I&amp;#39;ll look at other people&amp;#39;s food choices (the menu is so large, I&amp;#39;ve only tried a fraction of it so it&amp;#39;s a smart idea to peak around). Finally, I&amp;#39;ll get to the bathrooms. Great bathrooms, love the full-length mirror. <br&gt;<br&gt;And it&amp;#39;s so important for a restaurant to have a nice bathroom. It&amp;#39;s like the tell tale sign that the food will be good or something, I swear. It&amp;#39;s like how a woman looks to see if her boyfriend treats his mother right (if he doesn&amp;#39;t, he&amp;#39;s supposedly going to be a cruel husband) - well, the same goes for bathrooms.<br&gt;<br&gt;4. The cheesy male servers. This isn&amp;#39;t what I consider the &amp;#39;best&amp;#39; part about CF, more like the most entertaining to exhibit. Look, five of my friends have been picked up by these goons -FIVE - ew, I hate to admit that, but it&amp;#39;s true. It&amp;#39;s like they see a table of women and call dibs on it or something, very strange. And for the 5 that have been picked up, probably 50 more have been harmlessly hit on, myself included. CF must attract an oversexed staff - maybe it&amp;#39;s in the water - who knows?!<br&gt;<br&gt;5. The dessert. It&amp;#39;s what everyone looks forward to, it&amp;#39;s the reason why so many women throw caution to the wind and go off their crazy fad diets, it&amp;#39;s the topic of conversation among a group of female girlfriends, just chatting:<br&gt;&amp;#34;Oh my GOD - we have to split it cheesecake,&amp;#34; one says.<br&gt;&amp;#34;Um....I&amp;#39;m getting my own,&amp;#34; the other replies.<br&gt;&amp;#34;LET&amp;#39;S BE BAD!&amp;#34; they both say.<br&gt;And then, kind of sadly, they&amp;#39;ll eat it and talk about how BAD it is for them. <br&gt;<br&gt;6. Their strawberry lemonade - served in a glass with the rim lined with a tablespoons&amp;#39; worth of sugar and a giant strawberry. I don&amp;#39;t like to order fruity drinks, especially if it&amp;#39;s nonalcoholic - but I always make an exception for this one drink - TRY IT.<br&gt;<br&gt;And honestly, the list goes on. Cheesecake attempts to make your meal as comfortable and appealing as you want it to be and few chains, be it Applebee&amp;#39;s or McDonald&amp;#39;s can state that in their restaurant manuals.", "rating": 4, "date": "11/8/2008"}, {"text": "I prefer the Overland Park location. The plaza location is busy 24/7. Definitely not their fault, but with lots of customers comes not as great of service. I also have not been impressed with my food the past couple of times I have been here. It&amp;#39;s just been mediocre overall.", "rating": 3, "date": "2/1/2014"}, {"text": "My issue tonight was not with the food, my cheesecake taste wonderful as always. The service tonight was absolutely horrendous. I only ordered a piece of cheesecake to go, so I can&amp;#39;t say anything about the dining service, although I&amp;#39;m sure it was less than superior due to the fact that 6 of the waiters and waitresses were huddled around the cheesecake counter talking and joking around with each other. Shoving each other, hitting each other and very obviously flirting (which was incredibly cringe worthy.) Instead of interrupting their party I decided to wait and observe,  It took a good 2 and a half minutes for anyone to notice me standing at the counter. Which I can understand on a busy night, but not when I am the only one waiting in the front area. I ordered my cheesecake, and was told &amp;#34;give us a few minutes.&amp;#34; A few minutes? I am the only one in line and clearly see 2 giant cheesecakes (so they didn&amp;#39;t have to make another one or anything.) After 2 minutes of watching the employees continue to talk and mess with each other, I started looking at my phone. It only took another minute for me to be rudely interrupted by the behind the counter employee yelling &amp;#34;HELLO!&amp;#34; to my face multiple times to get my attention, and dangling my cheesecake off her finger. I grabbed my cheesecake and abruptly left. Unbelievable service. I will not be visiting this location again.", "rating": 1, "date": "12/5/2017"}, {"text": "This place is way over-hyped. And over-priced. The wait staff is OK... just like anywhere depends on who you get! I remember back when they first came to KC, it was almost difficult to get a job there, they were so hard core about experience and training. <br&gt;I hate to burst anyones bubble about the cheesecake itself.. IT COMES TO THEM FROZEN!!!!!!!! It is made in a factory, yes, but it is trucked. Dont dare say the word frozen there, though! They call it &amp;#34;deeply chilled&amp;#34;. If Im lyin Im dyin.. ask anyone that works there and they will probably tell you the truth! <br&gt;There are MANY MANY better places to spend your money- and get home made desserts!", "rating": 2, "date": "1/9/2009"}, {"text": "So the wait for a table can be a little long, the parking can be a bit down the street, and the menu can be overwhelming, but I  must say that these are all things I LOVE about this Cheesecake Factory - I feel like I am at an event of sorts in a downtown escapade of class and super indulgent food. Even if I am in Kansas City : )<br&gt;<br&gt;I don&amp;#39;t know why people have to hate on &amp;#34;chain&amp;#34; places - in the past month, I have gone out of my way to try local favorites, mostly out of an obligatory feel that I should support, ya know, &amp;#34;local.&amp;#34; After each disappointing experience (and they have ALL been disappointing, I hate to say), I say to my pals: &amp;#34;You know, for that much money, I could have eaten twice as much at CKF and been four times as satisfied with the food!&amp;#34; <br&gt;<br&gt;That said, this place is an anchor in the Plaza as it welcomes you while you drive down Emmanuel Clever and past that beautiful KC fountain. It is especially beautiful around Christmas-time when the whole Plaza is lit up, ready to entertain you (and your money!). The facility is quite unique in its two-story layout (bathrooms are upstairs - there is also an elevator), always very clean, and of course boasts a little cheesecake display at the entrance where all your sweet tooth needs are indulged. Who cares if the cheesecakes aren&amp;#39;t made there - they are heavenly!", "rating": 4, "date": "1/8/2011"}, {"text": "Let me just start off by saying I love the Cheesecake Factory!  Whether its been in L.A., Phoenix, Atlanta or Kansas City, I&amp;#39;m usually never disappointed.<br&gt;<br&gt;However, they have changed the menu and some items have been removed, like the Fried Chicken Salad.  But anyhow.<br&gt;<br&gt;The location on the Plaza is everything that you expect.  We went for lunch, about 1p on a Friday.  We had to wait about 15 minutes.  Not too bad.  Our server was very nice, prompt and knowledgeable.<br&gt;<br&gt;And my Chocolate Mousse Cheesecake - to die for!", "rating": 4, "date": "5/21/2007"}, {"text": "So, normally I don&amp;#39;t like eating at these kinds of restaurants, but today I wanted some variety. They have an extensive menu so I ordered a few small plates and an appetizer. I ordered the portabella, avocado, zucchini fries but when it came out, there were no zucchini pieces. Now had they told me they&amp;#39;d run out, I wouldn&amp;#39;t be so peeved. The server came back saying she would send over the manager for the kitchen not letting the server know &amp;#34;they had not prepared any.&amp;#34; Oh, the manager never came by! They did try to amend their mistake by making up a fresh order for us to take home, however. The chicken samosas were very oily... I&amp;#39;d already been waiting for thirty-five minutes for the apps to come out and then my entree, sweet corn tamales, came out and it was lukewarm! My friend&amp;#39;s pasta da vinci had an over  abundance of black pepper for anyone&amp;#39;s taste. Overall, I was not pleased with my dining experience today. The food quality was poor. Customer service was lacking. This is the reason why I don&amp;#39;t like chains. Their inconsistency in food preparation and taste, and their lack of attention to its consumers is a pity.", "rating": 2, "date": "11/8/2015"}, {"text": "lemon-raspberry cheesecake is really all i need to say about it....<br&gt;wash it down with either a hot chocolate or a glass of champagne. you&amp;#39;re all set. great location too. there are cheesecake factorys all over the U.S. so whichever you go to probably has the same menu", "rating": 5, "date": "11/20/2008"}, {"text": "I&amp;#39;m giving this place three stars because the cheesecake here is great...duh!  it&amp;#39;s called the Cheesecake Factory.  However, the food here is not good...AT ALL!<br&gt;<br&gt;My friends and I ordered the nachos as an appetizer and they were okay.  And then I split a steak with another friend and had a salad.  The salad consisted of 4 or 5 wilted leaves of lettuce a bunch of salad dressing and a couple of tomatoes.  Please!  The steak was okay but had to be sent back once because it wasn&amp;#39;t cooked right.  The waitress literally looked like she wanted to kill me.<br&gt;<br&gt;We waited for almost an hour and a half.  Our wait was suppose to be 45 minutes but when we finally asked they lost our name and weren&amp;#39;t going to call us.  They said it would be ANOTHER 30 minutes.  Did I mention this was on top of the wait we already had.  After having a talk with the manager we were seated immediately but the mood had already been set!<br&gt;<br&gt;There are much better places to eat in KC.", "rating": 3, "date": "2/24/2008"}, {"text": "Delicious!!<br&gt;This was well worth the wait! It was very busy but the whole staff was very nice and helpful. We will be going back next time we are in Kansas City!", "rating": 5, "date": "7/29/2014"}, {"text": "This place is okay, the last few times that i have been here, I haven&amp;#39;t really liked it. The food is kind of over-priced for the quality of it (but the portions are HUGE). I haven&amp;#39;t tried anything that I have especially liked. I think at first, I came here (and most other people did) was because well, it&amp;#39;s the Cheesecake Factory! You have to go! Everyone&amp;#39;s gone!<br&gt;<br&gt;But really, I think that The Cheesecake Factory is over-rated in all areas except for their namesake- the cheesecake. But then again, how can you go wrong with cheesecake? I&amp;#39;ve never really had a &amp;#39;bad&amp;#39; tasting piece of cheesecake. Sure, the inside and outside, but usually the wait staff is lousy and the food is sub-par.", "rating": 3, "date": "11/20/2008"}, {"text": "I love the Cheesecake factory, this location was one of the first places i ate at in KC,  but i prefer the location at 119th and Metcalf to this one. my work friends and i always had good lunches here but the 119Th street location is the one closest to my apartment and has given me excellent meals since it opened along with my out of state guests that raved about it and the cheesecake. the menu is huge, <br&gt;my favorite is the tex mex eggrolls, i&amp;#39;ve tried other menu items but this is the one i go back to and will stop for after shopping in the afternoon. nice bartender and waitstaff huge portions and the handy takeout cheesecake counter.", "rating": 4, "date": "5/6/2008"}, {"text": "I&amp;#39;ve long been a fan of cheese cake, though have always suspected that you could not expect to get good cheese cake from any place calling itself the cheesecake factory.  The name alone implies what I&amp;#39;ve come to unfortunately learn is true, the food is as bland as if processed in a factory line.  <br&gt;<br&gt;Incredibly overpriced for the quality and level of hospitable service, I was unimpressed and will never return to one of my own free will. <br&gt;<br&gt;Cheesecake factory seems very much like the McDonalds of deserts.<br&gt;<br&gt;Their presentation and taste are lacking in inspiration.", "rating": 1, "date": "3/14/2010"}, {"text": "My husband and I decided that this year we would celebrate our anniversary at Cheesecake Factory. When we woke up my husband called to try and make arrest stood to find that unfortunately they don&amp;#39;t take reservations, which was fine, however whoever answered the phone was very rude about it. We still decided to go cause my husband had never been. When we got there you could tell the hostess wanted to go home and was a little agitated and actually had an argument with one of the servers at the stand right by the main door. Just so happened that the server she was fighting with was our server when we sat down. Our food was great we had two different appetizers cause we couldn&amp;#39;t decide on just one. Our meal got there and it was fanatic however halfway through our meal the hostess came around the corner and was talking to one of the busboys rather loud saying she wanted to go home and was ready to locked the doors. I looked and my phone cause I though we couldn&amp;#39;t have been there that long I knew that we had gotten there late about 8:00 but there was no way we had been there for three hours. Overall the food was great and our server who I saw get chewed out at the front was fairly good. I just could not believe the way the hostess was acting. I understand wanting to go home but there is no reason to go through the restaurant like that.  If it hadnt been for the hostess I would have given the restaurant a 4 star.", "rating": 3, "date": "2/28/2016"}, {"text": "Cheesecake Factory is a place I&amp;#39;ll go to once or twice a year, more often than not, just for dessert.<br&gt;<br&gt;The food is pretty good -- the chain is famous for big portions, and that&amp;#39;s what you get.  But, unless you choose to eat your meal really early or really late.... you&amp;#39;ll have to deal with the crowd.  And there&amp;#39;s always a crowd.  The restaurant is big, but it still always seems like there&amp;#39;s a ridiculously long wait.  There&amp;#39;s nothing that can really be done about it -- it&amp;#39;s the nature of the beast -- but it&amp;#39;s it&amp;#39;s just obnoxious.<br&gt;<br&gt;As for the cheesecake, when it&amp;#39;s good - it&amp;#39;s great.  When it&amp;#39;s not... it&amp;#39;s not.  I&amp;#39;ve been blown away by the 30th anniversary cake and the Godiva cake -- yet extremely disappointed by the tiramisu cake and the chocolate chip cookie dough cake.<br&gt;<br&gt;There are plenty of dining options on the Plaza, and unless you&amp;#39;re lucky enough to get in at a time when there&amp;#39;s no wait, I just can&amp;#39;t see the place as worth waiting for.", "rating": 3, "date": "6/26/2011"}, {"text": "I was very happy with my experience. It was my second trip to this specific Cheesecake Factory and both times I was highly satisfied. I ate at the bar and the bartender was on top of things. Not once did I have to ask for a refill. The food was also great, as usual.", "rating": 5, "date": "7/21/2013"}, {"text": "Cheesecake Factory is A-Ok.<br&gt;<br&gt;Our family consisting of husband, 7yo, 5yo and 3yo plus g&amp;#39;ma and three adult family friends dined there on Thursday evening.  We arrived at 5:45 and the approximate wait time for an inside table was 25-30 minutes.  The outdoor tables were available right away.  We opted to wait for the indoor table.<br&gt;<br&gt;We were seated in about 20 minutes.  The service was OUTSTANDING.  She was very helpful, suggesting several items for the kiddos.  We ended up splitting the slider app with broccoli and fries b/w the three kids.  They loved it.  <br&gt;<br&gt;I had the Santa Fe Chicken salad which I absolutely love.  MrAimeeG had the jambalaya pasta &amp;amp; he literally wiped the plate clean.  Our other guests had sandwiches and pasta which received good reviews as well.<br&gt;<br&gt;My dessert was a bowl of strawberries.  The cheesecakes ordered were strawberry, chocolate Oreo, Butterfinger and a cake/cheesecake combo.  <br&gt;<br&gt;It was perfect for a big crowd like ours.  <br&gt;<br&gt;Service was excellent!<br&gt;<br&gt;Not outstanding food but absolutely o-kay.", "rating": 3, "date": "7/24/2009"}, {"text": "Looked great but unfortunately we were there about 8:00pm on a Sat night &amp;amp; the wait was 3.5 hrs. Didn&amp;#39;t stay.", "rating": 4, "date": "12/26/2012"}, {"text": "I always enjoy Cheesecake Factory. The food is consistent, but that&amp;#39;s to be expected from a major chain. Service is always good. Can&amp;#39;t really complain about the Factory. Their happy hour is AWESOME!!", "rating": 4, "date": "7/16/2013"}, {"text": "Nothing good, nothing bad = Mediocrity.  Excellent restaurants close, while the Cheesecake Factory marches on.  I guess it helps to have 500 menu options, even if none of them are particularly good, and Very Large Portions.  Meh.", "rating": 2, "date": "1/31/2009"}, {"text": "This place is always packed so show up early or be prepared to wait.  When you are finally seated, the service is quick and the food is excellent.  It can be a bit pricey but well worth the money.<br&gt;<br&gt;Make sure you save room for desert, they have a separate menu dedicated to cheese cakes.  Or do what I do, order the cheese cake first :)  Highly recommended if you&amp;#39;re downtown and want a decent meal and desert (or in my case, desert then meal).", "rating": 4, "date": "6/4/2011"}, {"text": "Went for my daughters Birthday with a large party and the waiter disappeared during dinner and finally someone came around and said he had to leave because of an Emergency but we saw him arguing with the GM at the front. The service from there was terrible. We never got asked if we needed another drink or anything. The GM basically stood at the end of the table waiting for us to leave so he could turn the table. The General Manager had no clue what he was doing. Food was horrible and not fresh. Will not go there if I want to spend money on a nice meal.", "rating": 1, "date": "3/30/2016"}, {"text": "First I will tell the reason it got three stars: The food quality and taste are phenomenal!! That alone got three stars.<br&gt;<br&gt;Unfortunately, there is one big reason I probably won&amp;#39;t be going back of my own volition: Prices and portions.<br&gt;<br&gt;I had not been to the factory in many years remembering that the meal portions were gargantuan and the food often over-cooked (especially chicken). I went as part of a bachelorette party. <br&gt;<br&gt;First, they refused to take a reservation, even for a group as large as us, so we had to sit and wait for nearly two hours outside in the rain, because they do not have an indoor waiting area. Then, being on a bit of a budget and remembering those enormous portion sizes, I went for the small plates. The waitress confirmed that two small plates was perfect for a meal. Wrong! These were not small plates. They were baby plates! I had the ahi tare tare and the mushroom/zucchini/avocado fries. Those put together would equal a standard appetizer in your typical restaurant. No where near a full meal. Nonetheless, I had spent all I had allotted for my meal so I ordered cheesecake. I didn&amp;#39;t have a menu in front of me to know that it was nearly $10 for one slice!!! I could understand that if they made it all fresh in house, but they don&amp;#39;t! Then add to it the fact that my &amp;#34;skinny&amp;#34; margarita (150 calories or less) cost as much as the cheesecake! I could have bought two standard margaritas at the bar we would be heading two for the same price (still in down town KC).<br&gt;<br&gt;Then it came time for the bills. Several from our party asked to take pieces of the brides check. The waitress fumbled orally for a minute then just announced that she would figure it out and left, declaring she was smart enough. Well, that wasn&amp;#39;t entirely true. I ended up with part of the bride&amp;#39;s faire, and everyone else declared their checks correct and handed over their money before I even figured out why mine was so ding dong expensive. I ended up paying for a $12 dollar drink I didn&amp;#39;t even get to taste (most expensive thing on my bill) and have gratuity included already.<br&gt;<br&gt;All in all, the food is fantastic, but you better be willing to empty your bank account if you do anything but nibble at this place. Thank God I got to bring my cheesecake home cuz with the amount of money I dropped there, I should have had a whole meal waiting for me in the fridge!<br&gt;<br&gt;Great food. Horribly overpriced for the portions I received.", "rating": 3, "date": "6/6/2013"}, {"text": "This is one of the rudest places to eat I called to place a to go order I was left on hold for twenty minutes I drove there while still on hold as soon as I reached to open the door the girl picked up the phone and asked who was I holding for I replied to place a order she said I don&amp;#39;t know where the girl went to take your order but I&amp;#39;ll just do it. Then she took my order so after we hung up I walked in no one acknowledged me I stood there and listened to about five employees complain about people calling in and placing a to go order so close to closing time. In my defense I called around 5 till 10 . So the order taking girl walked over gave the cashier my order and said it was some lady with a weird name. Still I said nothing so after listening for about five to seven minutes I walk over and say in my defense I was left on hold for twenty minutes. They all got quiet then one guy said we wasn&amp;#39;t talking about you we were talking about employees. I said ok at that point I was just Praying they didn&amp;#39;t spit in my food or do some other gross thing to it because one of the girls gave me this look like yeah I got you walked to the back came back out looked at me and left. So by now my food was ready which it was cold ugh!!!!! I just took it and left I was very upset. Never again will I ever eat at that location . I emailed the office over a week ago I still haven&amp;#39;t heard anything back. The funny thing is I stood there and watch them goof off like they were just hanging out.", "rating": 1, "date": "6/30/2017"}, {"text": "Cheesecake is to die for! We only come here for the cheesecake and we drive 2.5 hours from our hometown to come here jus for it", "rating": 5, "date": "7/7/2013"}, {"text": "If you are going to the Cheesecake Factory, just get the cheese cake. The food was ok but not worth the money. However, the cheesecake was awesome! So I would recommend going to diner somewhere else and then going to The Cheesecake Factory for dessert!", "rating": 3, "date": "6/27/2012"}, {"text": "Really long wait to get seated, and a really long wait to get served.. Food was okay. Appetizers were better than the entrées. We asked the server for a more plain cheesecake that would be less sweet and he recommended one with apple streusel- sweetest cheesecake I&amp;#39;ve ever tasted. Took a few bites and left the rest. Kept having to ask people to find our server. Waited almost twenty minutes just for the check. Wouldn&amp;#39;t recommend it.", "rating": 2, "date": "10/14/2015"}, {"text": "This place gets worse every time I dine here. The first couple times I enjoyed it alright, but the last two times were unbearable. The place is mostly popular with teenagers and tends to be very loud. The menu has so many options that it really shouldn&amp;#39;t be surprising that the food tastes like it was hastily thrown together without much attention to taste or detail. I tried the avocado egg rolls and enjoyed them once before, but the last time I tried them they made my friends and I very sick. For dessert during my last visit, I asked the server to recommend the least rich/sweet cheesecake, as I wanted something mild, and he recommended some sort of apple cobbler nonsense that ended up being the most overpoweringly sweet thing I had ever tried there. I tried to make a complaint but it was over 30 minutes before he came back. At this point, we were both out of water, very thirsty, and ready to leave. My date was ready to just walk out, but I managed to get the attention of another server who was kind enough to go find our own. It was about another 10-15 minutes before we finally had our check, and of course it took him another 10 minutes to run my card. We both ended up being very late for our plans and very disappointed in our meals.", "rating": 2, "date": "1/10/2016"}, {"text": "The service was amazing from the start, the food was amazing, and we had the Oreo dream cheesecake  a very good choice. Seating arrangements could be better, but overall for the stuff that mattered it was great! This thing at the bottom says &amp;#34;keep those thumbs rolling, you wizard of words.&amp;#34; That&amp;#39;s where I draw the line. Good job Cheesecake Factory.", "rating": 5, "date": "5/15/2015"}, {"text": "Mmmm, I&amp;#39;ll have a plate of uninspired food with a side of annoying waiter who will be &amp;#34;taking care of me.&amp;#34; High school prom photos out front, anyone?", "rating": 2, "date": "3/29/2012"}, {"text": "Very disappointed when we came for a single slice of cheesecake to go. We were the only people in line, weren&amp;#39;t greeted by anyone due to chatter behind the counter. After we were rang up it took an extended period of time for our order to be relayed to the person prepping the cheesecake, and once our order was given it took an even longer amount of time to receive our cheesecake due to the employee behind the counter being on her cell phone. After the cashier told her our order for the second time, she continued to say &amp;#34;hang on&amp;#34; in order to finish whatever she was doing on her phone. After taking a sip of her drink she prepared our food without gloves and continued to carelessly chatter with her coworkers. We did not feel like a priority to employees behind the counter, we felt second to her cell phone. Very unprofessional, we came here in a great mood and left wishing we had gone to the Overland Park location closer to home.", "rating": 1, "date": "5/1/2017"}, {"text": "We went to your restaurant on the Plaza, which is our annual tradition, and were told that there was an hour and a half wait.  This was 4:15 pm.  We put our name on the list.  We sat and waited for our turn.  We were a party of nine.  We watched many small and large parties come and go while we waited.  At 5:45 pm we were told that it would be another 30 minutes.  We waited that 30 minutes and were told that it would be another 45 minutes.  When we complained we were told that it was our fault because we asked to be taken off of the list.  It was not true.  They said that we would be added to the bottom of the list again.  We were finally seated at 6:30 pm. after many words were exchanged with your rude manager, Ash.  Finally at the end of the nightmare they admitted that they had given our table away and had placed us at the bottom of the list.  For this they comped us an appetizer that had less chips than we get for free at any Mexican restaurant.  This was for nine people.  It was hot on one side and cool on the other.  The whole experience was a nightmare.  Many of us wanted to leave, but five of the members of our group are from out of state and wanted to continue our tradition.  If it had been up to me, we would have left at 5:45 pm.  There was hardly anyone on the wait list when we signed up at 4:15 pm.  It shouldn&amp;#39;t have been an hour and a half wait at that point.  It never should have taken 2 hours and fifteen minutes.  Ash represented himself as the manager.  He was rude and very unprofessional.  We will no longer continue this celebration.  We will find a new place to celebrate the holidays.   At the end of this nightmare we were presented with our individual checks with an 18% gratuity attached.  I understand this is the practice, but, in this case, we would have never left such a tip.  We were finally given our checks at 8 pm.  This means this whole nightmare took close to four hours.  I will be posting this on my social pages so that everyone will know what happened to us and what to expect at Cheesecake Factory.", "rating": 1, "date": "11/30/2013"}, {"text": "The food here is hit or miss.  Stay away from the pizza and pasta.  They overcook the pasta, and the pizza tastes like it came straight out of a tostino&amp;#39;s box.  There are much better places on the Plaza for Italian.  The good food here is the bar-type food:  burgers, chicken, fish, anything tex-mex.  Never had a bad appetizer here, and the salads were actually fresh with an interesting combination of flavors (my favorites are the Santa Fe salad and the BBQ ranch chicken salad).  The drinks at the bar are so tasty, I have come here just for cocktails.  As for the cheesecake..I am not really a cheesecake person, but my daughter is crazy about the strawberry cheesecake.  Service is consistently good.  Try to eat on the patio if the weather&amp;#39;s nice..the inside can get crowded and noisy.", "rating": 4, "date": "3/17/2014"}, {"text": "We love coming here, the only critique I&amp;#39;d have is the food is a little pricey for what it is. The cheesecake is to die for though/!!", "rating": 4, "date": "5/24/2015"}, {"text": "Great cheese cake with huge variety.  Menu still big but not as big as I remember cheesecake factories used to be , but have not been many years since I&amp;#39;ve been to one.  We ended up here cause the kids always wanted to go and if they have been to one they didn&amp;#39;t remember it and this one has a great patio and the weather was perfect for it.", "rating": 3, "date": "7/8/2014"}, {"text": "We sat outside as it was one of the last nice nights of the year. The waiter was a little sporatic, but we only came here for dessert anyway. I had the original and it was not as good as I remember. I also tried some of the banana cheese cake and it was not as special as the price would dictate. I am quite sure that this place is not worth the coin they are charging. But it has a great building in an awsome location.", "rating": 3, "date": "10/30/2011"}, {"text": "This location was close to the Embassy Suites where we stayed, so every time we drove by it on our way to somewhere else my mouth watered. They have a free parking garage and there is some street parking. It&amp;#39;s close to lots of shops and other restaurants (including Jack Stack Barbecue where we also ate). We went on a Thursday night around 6:30 and there was no wait. The staff was friendly and the service was good. It was a little loud (echo and the music was too loud). I really liked my food. I had the Carlton Salad, which I thought was divine, and the Tiramisu Cheesecake; which I wanted to marry because it was that good. My husband had the cheese steak sandwich and the strawberry cheesecake. He didn&amp;#39;t care for the bread on the sandwich, but thought his cheesecake was very good. The menu is huge and the cheesecake selection is so fun. I would recommend eating here.", "rating": 4, "date": "2/4/2013"}, {"text": "I come here for cheesecake and their strawberry leomande. The food here is bleh. The ONLY dish I like is the jambalaya pasta. Other than that, skip this place. My grandma makes better cheesecake!", "rating": 3, "date": "9/14/2011"}, {"text": "Pretty good stuff as far as uber-chains go. Huge portions and a menu the length of the Magna Carta, if you can&amp;#39;t find something you like you may have a medical problem. Usually go here with the whole fam in tow, and they&amp;#39;re always very accommodating.", "rating": 4, "date": "7/21/2011"}, {"text": "The service, Erica at the bar, the cheesecake(Dulce De Leche Caramel) and drinks were great!", "rating": 5, "date": "12/14/2014"}, {"text": "I was recently here on a Sunday. I would have to say that i was not very satisfied. When i first sat down the table was very dirty, i had to wait 7 minutes before the waiter came to get our drink order. Once he brought our drinks there was a huge piece of bubble gum wrapper floating in my drink. The manager offered to pay for one entree. I wont return.", "rating": 2, "date": "3/10/2015"}, {"text": "Boooo.  I found the Overland Park store to be far better run and operationally efficient.  The servers here are unsophisticated and sloppy looking. What a shame.", "rating": 2, "date": "10/31/2011"}, {"text": "I so love there entrees,  The atmosphere is great and the wait staff are wonderful.  I especially like the deserts.... yum", "rating": 4, "date": "7/10/2012"}, {"text": "The menu is huge, the wine list lengthy (the Coppola Cheescake Factory is excellent Cabernet) and of course the cheesecake is delicious!", "rating": 5, "date": "9/9/2011"}, {"text": "People rave about Cheesecake Factory.  I have been there three times now, and everytime I leave,  I leave happy, but am not overly blown away by the place.  We ate here on Easter Sunday for our Easter dinner.  Pretty short wait considering it was crazy busy.  We were seated upstairs and service was PERFECT.  Our waitress was incredible, especially considering how busy it was.  You get an excessive amount of food here, even with the lunch portions.  I had a 4 cheese pasta which was OK, and some crab rangoon with my husband for an appetizer, which was good, but a little too well done.  Anyway, I leave again, thinking, good meal, but just &amp;#34;OK&amp;#34;.  Great location though.", "rating": 3, "date": "4/5/2010"}, {"text": "Lunch today was incredible. I don&amp;#39;t know how they keep up with the extensive menu they have. Wow", "rating": 5, "date": "6/15/2011"}, {"text": "Thickest menu I&amp;#39;ve ever seen.  They&amp;#39;ve got some of everything and it&amp;#39;s all good.  The atmosphere is dress/casual.  And, of course, the cheesecake is out of this world.  They have an outdoor patio for warmer weather, and the smoking area is upstairs, well away from non-smokers.  These guys truly understand how to provide a great dining experience.  A good place to take a date for dessert (especially since there&amp;#39;s a Coldstone Creamery across the street) or for a formal dinner (like prom).", "rating": 5, "date": "11/2/2009"}, {"text": "People are being really hard on the Cheesecake Factory.  I do admit there are some fantastic places in KC but I think it is convenient enough though it is very popular which makes it difficult to get a seat on the weekends and a little over price because it&amp;#39;s a chain.  The people are nice and the portions are good.  And they cheesecakes are great.  So here&amp;#39;s a little internet hug for the Cheesecake Factory.  We can be friends. Enjoy!", "rating": 4, "date": "5/4/2009"}, {"text": "We&amp;#39;ll be back! <br&gt;<br&gt;I took my wife to The Cheesecake Factory to celebrate our 12th year wedding anniversary. It was on a Saturday around 4pm so the lunch menu was still available.  We started out with their lemonade which was very good and fresh tasting in a sugar-dipped rimmed glass.  Nice presentation.  I ordered their four cheese pasta.  It was absolutely wonderfull and their mozzarella cheese that was heavily applied was fresh and decadently delicious.  My wife had their chicken salad which was humongous and very delicious with a beautiful presentation.  One very small complaint with the pasta was that I found it to be too al dente. It needed to be cooked just a speck longer, but it wasn&amp;#39;t too bad. I prefer it that way much more so than the pasta being overcooked.  We had their delicious fried avocado appetizer with the tamarind cashew dipping sauce.  It was tangy and delicious.  For dessert, we split the Godiva Chocolate Cheesecake.  It was beautifully decorated with &amp;#34;Happy Anniversarry&amp;#34; written on the plate&amp;#39;s border in chocolate syrup.  The chocolate cheesecake was to die for.  It was more than enough dessert split between the two of us. The service was very good but not quite excellent as I had to request more water and it would have been nice if the server would have wiped the dinner crumbs from the table (I had to do that myself) before serving dessert.  But overall, the service was very good, the food fantastic and we&amp;#39;ll be back for our date nights.  Nice atomosphere too!  Try to get a booth window so you can watch the passerby&amp;#39;s shop in the plaza.", "rating": 5, "date": "6/20/2011"}, {"text": "slurp!  i just wish there was more parking and more tables to fit more people so i could come here more often.", "rating": 4, "date": "5/26/2013"}, {"text": "I LOVE the food, but it&amp;#39;s very cost-prohibitive.  Don&amp;#39;t even bother to order alcohol at $10 a drink.  The wide selection of food and every cheesecake I&amp;#39;ve ever tried are delicious.  I like this location, because there are 2 floors, which makes the wait a little shorter.", "rating": 3, "date": "11/8/2009"}, {"text": "The wait can be a little long, especially on the weekends.  There is outside seating, which in good weather seems to fill up quickly.  The food was good, as was the service.  I&amp;#39;ve eaten here a couple of times and would go back again.", "rating": 4, "date": "1/28/2011"}, {"text": "oh man i remember going to cheesecake factory once because i got a cheesecake factory gift card. the second time i went with my bf and some friends because they wanted cheesecake factory. i didn&amp;#39;t know what to order since they had so many variety of food. the vietnamese tacos caught my eyes and gave it a try. wow it was really freaking good and love eating it. i wish they deliver i live so dam far from one. vietnamese tacos is like peking duck but a lil different. yummy i want some more now dam it.", "rating": 5, "date": "2/12/2013"}, {"text": "As all cheesecake factorys.... Standard service and great huge protions! I dont even know what to recommend... My faves are the &amp;#34;bang bang chicken and shrimp&amp;#34; and the &amp;#34;Wasabi Crusted Ahi Tuna&amp;#34;... Both are sensational and the cheesecake is to die for. Great tasting food , huge selection and protions all for a great price. I love this place... unfortunately my diet doesnt though!", "rating": 5, "date": "5/19/2011"}, {"text": "I love the Cheesecake Factory but this location is not the best. We had to wait FOREVER for a table and they weren&amp;#39;t even that busy. In fact the manager came over to apologize to us and actually sounded like a complete moron. They were out of some of the appetizers we ordered so another manager apologized and said she would take the other 2 off of our bill. Then we got our receipts to find that they added gratuity to our checks automatically. We only had a party of 6 and I&amp;#39;ve been there with a larger party and have not had that happen. My food wasn&amp;#39;t that warm when it was served. I was really disappointed with the whole experience.", "rating": 2, "date": "2/12/2011"}, {"text": "Went for dinner at the Cheesecake Factory for the first time Friday evening. Went early because we knew it would be packed. We got there just in time before the dinner rush and were seated right away. The food was really good and the server was excellent and very attentive. I had the eggplant parmigiana and it was delicious. My boyfriend had the chicken and biscuits and he really enjoyed it. The prices for entrees are just a bit high, but where they get you are the appetizers and the alcohol. We didn&amp;#39;t order appetizers because we thought they were just too overpriced. My boyfriend had a Long Island iced tea and it was $10 and change and that wasn&amp;#39;t even for the top shelf. We got 3 slices of cheesecake to take home and share. Plain, white chocolate blueberry and the outrageous. They were awesome. Too much to eat in one sitting so we saved the rest for the next evening. Nice place to go for a special evening out for us but a bit too pricey to go regularly.", "rating": 4, "date": "8/2/2015"}, {"text": "I&amp;#39;ve been here for dinner dozens of times, but I finally got to visit for brunch and I wasn&amp;#39;t disappointed. The wait was long, as usual, but once we were seated we got the same awesome service and tasty food Cheesecake Factory is known for. There were four people in my group and I can&amp;#39;t remember what everyone ordered, but I got the crab hash. There were too many onions or something I wasn&amp;#39;t crazy about, but the combination of the hollandaise and crab and hash brown was so good! My husband and I also each ordered a cheesecake to take home and both were delicious. I have probably only tried three or four of their cheesecakes ever, but they are consistently very good, probably even better than the food. Caramel is my weakness so I ordered the dulce de leche cheesecake and it was freaking amazing. Even my husband, who doesn&amp;#39;t care for caramel, ended up eating half of it. Of course this is always more of a special occasion kind of place, because there&amp;#39;s no way I could afford a trip here just on a whim, but every time I visit I thoroughly enjoy my meal start to finish.", "rating": 4, "date": "1/8/2013"}, {"text": "Fiance and I go here every year for Christmas Eve and have had great service every time. Food is always great as well.", "rating": 5, "date": "12/24/2010"}, {"text": "The wait time was insane.  I understand a wait but when you are told 15-20 minutes and wait for over an hour it gets ridiculous!  The food is amazing because it&amp;#39;s the Cheesecake Factory.", "rating": 2, "date": "2/15/2011"}, {"text": "I was in KC for a few days, and got hungry while checking out their downtown country club in the early eve.  Not knowing which restaurant to try, I decided to conservativcely go into Cheesecake Factory for quick bite.<br&gt;<br&gt;I ordered some dinner and cocktail.   The cocktail arrived after I was done with my dinner.  Oh well, I must be eating fast than normal.  That&amp;#39;s when I realized my drink costed me more than my meal.  Interesting discovery.  Upon paying the bill, the waitress was trying to figure out how to spell my last name... I think she felt bad for bringing me my bill before my drink.   Nice girl, but overall the restaurant was slow and not attentive.  Food was just ok.", "rating": 3, "date": "5/23/2010"}]}