{"address": ["6675 W 119th St", "Overland Park, KS 66209"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 3.5], [3, 3.0], [4, 2.5], [5, 2.5], [6, 4.0], [7, 3.0], [8, 3.0], [9, 3.0], [10, 2.5], [11, 2.0]], "2017": [[0, 4.0], [1, 4.0], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.0], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.5], [11, 3.5]], "2020": [[0, 2.0], [1, 3.0], [2, 3.0], [3, 3.0], [4, 2.0], [5, 1.5], [6, 2.5], [7, 2.5], [8, 3.0], [9, 3.0], [10, 3.5], [11, 3.0]], "2018": [[0, 3.5], [1, 3.5], [2, 4.0], [3, 4.0], [4, 3.5], [5, 3.5], [6, 3.5], [7, 2.5], [8, 2.5], [9, 2.5], [10, 2.0], [11, 2.5]], "2021": [[0, 3.0], [1, 3.0]]}, "reviews": [{"text": "Mismanaged and shady.<br&gt;I came in at about 5:15 pm on 8/8. The website indicated that reservations were not available, but that this was because the majority of the restaurant have been reserved for walkins. When I arrived, there were 15 to 20 tables on the patio, and only two were taken. I went in and the restaurant was at under half capacity. The hostess said: &amp;#34;I have about an hour and a half wait.&amp;#34; I asked: &amp;#34;even for patio.&amp;#34; And she said: &amp;#34;oh yes, that&amp;#39;s a TWO hour wait!&amp;#34; She indicated that all tables were reserved. Either the website was lying or the staff was. Either way, the process was horribly mismanaged and suspicious.", "rating": 1, "date": "8/8/2020"}, {"text": "Been to this place twice recently, and both times the food is consistently solid. The first time I was there was for my friend&amp;#39;s birthday dinner. I was mopey and needed something soothing so I got the chicken and dumplings. The dumplings are tender and took on the flavors of the chicken broth that they were cooked in. The white chicken meat was flavorful and tender as well. The meal really hit the spot and made me feel better. Wished I was in better spirits for her birthday though.<br&gt;<br&gt;The second time I came was for breakfast after church with my friends. I was trying to watch what I was eating, but all hell broke loose when I ordered the lemon ricotta pancakes. I wanted to lick the plate because it was good, but I refrained myself and only ate half of my order.<br&gt;<br&gt;The place is constantly busy and in a location very close to my church so it&amp;#39;s convenient to go  there. I&amp;#39;ve yet to try any of their cheesecakes actually. I know, who goes to a place called Cheesecake Factory without trying their signature dishes? This girl.<br&gt;<br&gt;Even though it&amp;#39;s a chain restaurant, I like it. Food is usually large portions as well so you won&amp;#39;t leave hungry.", "rating": 4, "date": "8/11/2019"}, {"text": "Food was good and we had the best server. Our drinks were kept full. Cheesecake for dessert is always great.", "rating": 5, "date": "10/18/2020"}, {"text": "Cheesecake Factory is notoriously delicious! However, their curbside pick-up is unsatisfactory. We did not receive the food we paid for and the wait is longer than the time given. <br&gt;<br&gt;This was the first restaurant we chose for a great celebration experience. So, it was with great anticipation that we chose this restaurant as our first quarantine take-out in honor of our son&amp;#39; 16th birthday! We ordered food for six people. <br&gt;When  my husband went to pick-up the order, we were told to wait for hot bread. Our initial wait time was 25 minutes. When he arrived, we were told to &amp;#34;wait&amp;#34; another ten minutes for &amp;#34;hot&amp;#34; bread.<br&gt;<br&gt;They eventually brought the food to our curbside pick-up. My husband asked if everything was included. They said, &amp;#34;Yes!&amp;#34;  We drove the ten minute drive back home to eat. <br&gt;<br&gt;We were ready to dine and celebrate! <br&gt;We came home and checked the orders. Much to our dismay, they were not fulfilled. With all the four orders that included fries, none of the fries were not sent with the meals. It was disappointing because were waited with anticipation for this meal the entire day. <br&gt;In fact, we were truly shocked and disappointed! As with any business, when a patron orders the food and pays for it, it is the restaurant responsibility to serve   them what was paid for. <br&gt;<br&gt;I called the restaurant. They offered for us to return to get the fries or send a $20 &amp;#34; gift card&amp;#34; in seven to ten business days. Because we could not afford to waste 30 minutes to get fries, we opted for the gift card. However, what we really needed was full service at the time of the order. <br&gt;I hope that Cheesecake Factory can double check their curbside orders in the future.<br&gt;I would not recommend ordering curbside from this restaurant.", "rating": 2, "date": "5/25/2020"}, {"text": "LET&amp;#39;S EAT CAKE....cheesecake for this review. <br&gt;<br&gt;I came to this casually nice, American restaurant chain since they offer gluten-free food for people that has a gluten allergy such as my mom. You&amp;#39;d expect that she&amp;#39;d get cross- containment food and get sick since she&amp;#39;s extremely sensitive but Cheesecake Factory did an amazing job of no cross-contamination.<br&gt;<br&gt;I came with a group of 12 and it took a while for the restaurant get us seated even though it was just at the beginning/30min prior to the Saturday night dinner rush. The staff was very patient and hospitable when we were at the table and did a pretty good job to this crowd happy. Prior to us getting our food we were given bread and butter to keep us content for the to be served and staff kept us stocked during the wait.<br&gt;<br&gt;I don&amp;#39;t think anyone at the table had anything negative to say about the food which is great since I was with a crowd that could get picky. We ordered several cheesecakes to bring home and eat later. I was surprised that they had a gluten free cheesecake that was a flourless Chocolate godiva cheesecake that my gobbled down and once again she didn&amp;#39;t get sick. <br&gt;<br&gt;I came back a few weeks later to pick up several slices of cheesecake for my sister and her swedish friend who was visiting.", "rating": 4, "date": "8/11/2019"}, {"text": "Using yelp to make a dinner reservation was fantastic and we highly recommend utilizing this feature. The hostess was friendly  and was quick to let us know we wouldn&amp;#39;t be waiting long at all which was nice because we showed up about 15-20 minutes early and it was a packed reception area. Our server Bryan was first-rate and he  did a phenomenal job of making recommendations, paying attention to the water glasses, and everything else that goes into a great dining experience. We started off with cocktails, pineapple Moscow mule  and a pineapple mojito; both were tasty and had the perfect amount of alcohol. We enjoyed the bread and Brussel sprouts to start but the maple glaze wasn&amp;#39;t present, at least not taste wise.  I ordered the pork schnitzel and my wife ordered the chicken parm pizza style. The pork schnitzel was to-die-for and the chicken parm was good but not great.  We finished off the meal with cheesecake to-go. We ordered the dolce de leche and the turtle cheesecake, we definitely love the Dolce De Leche.", "rating": 5, "date": "2/2/2020"}, {"text": "Five stars for the bang bang chicken and shrimp. How have I not had this sooner? Who cares about cheesecake after a dish like this!! So delicious!<br&gt;<br&gt;Service was decent, our waitress was a little on the quiet and slow side. I thought she went shopping with my card when I sent it with the bill because she didn&amp;#39;t return in what seemed like an eternity.<br&gt;<br&gt;Already planning my next visit for the end dish!", "rating": 5, "date": "6/17/2019"}, {"text": "I have a high regard for fairness and communication. With those values in mind, I am giving The Cheesecake Factory one star. <br&gt;<br&gt;On 4/3 I ordered a Cobb salad and a Sheila&amp;#39;s Chicken &amp;amp; Avocado salad to take advantage of a Door Dash promotion. I tipped the driver at full value.  The total for the two salads was $35.48. I am willing to pay higher prices for places like The Cheesecake Factory because I usually get a couple meals out of one entrée. <br&gt;<br&gt;Both salads had plenty of lettuce but not much else.  In my &amp;#34;Sheila&amp;#39;s&amp;#34; salad, I MIGHT have had 2 ounces of chicken, but it was doubtful. Very little avocado. Same situation with the Cobb. <br&gt;<br&gt;I believe in giving businesses the opportunity to make things right so on 4/3 I went to the restaurant around 5:20 pm and asked to speak with the manager. I explained what happened. He said he was surprised this happened as they have the same standards for to-go orders as they do dine in orders.  I told him I understood that training issues exist but knew they couldn&amp;#39;t be corrected unless management was aware of them. He indicated usually &amp;#34;these types&amp;#34; of situations &amp;#34;go thru Door Dash&amp;#34; but that since I had come in, he would take care of making it right. (Did he think the driver ate the ingredients from our salads??) I thanked him as paying $35.48 for two lame salads really didn&amp;#39;t sit well with me.  He asked for my name and address and told me he would ask TCF headquarters in CA to send something to me. He thought I&amp;#39;d get it the next week. <br&gt;<br&gt;Two weeks later I have yet to receive anything.  I gave The Cheesecake Factory the opportunity to recover from a poor service experience. In return, I got an even worse one.", "rating": 1, "date": "4/17/2019"}, {"text": "The worst service ever!  Should have ordered from the Bristol.  Ordered food at 5pm for 7pm pick up.  An hour later still no food!  Another guy waited 2 and 1/2 hours and still no food!  They kept saying, &amp;#34;it&amp;#39;s on the way&amp;#34; then &amp;#34;we are bagging it&amp;#34;.  Then they came back and said it&amp;#39;s not ready and we can not tell you how long it will take.  We said then just cancel our order and refund our card.  They then said it would take 4 weeks for a refund.  An hour and 15 minutes later and we finally just left with NO FOOD and no refund.  Now we have to call tomorrow to make sure we get a refund.  And let&amp;#39;s face it, the foods not that great anyways.", "rating": 1, "date": "5/10/2020"}, {"text": "The staff here was amazing! Loved our waitress, she was fantastic! There is lots of options on the menu to choose from, and of course the cheesecake is just perfect. Loved the cocktail menu and the variety of the other drink specials. I got the pulled pork sliders, and they were just savory little morsels! I loved the Smokey sweetness or the pulled pork mixed with the slaw, and fried pickles! The buns were soft and buttery and paired well with  the meat/toppings without getting soggy. The piña mojitos were great, and the Oreo extreme cheesecake was rich, but a chocolate delight!", "rating": 5, "date": "3/22/2019"}, {"text": "The service was slow and it took 1:30 minutes for food to come out. They also forgot my drink for 30 minutes. Overall very slow", "rating": 1, "date": "10/18/2020"}, {"text": "I was surprised to have to wait on a Monday night, but it was definitely worth it. Kirsten was sweet and attentive as our waitress, despite how busy they were. <br&gt;<br&gt;It was delicious as always. I veered away from my normal pasta order and tried the Shepherds Pie. I was struggling between the two, but I was very glad our waitress convinced my to try something new- it was delicious! My husband tried the Mac and cheeseburger and I was lucky enough to steal a bite- it was absolutely heaven. There is no wrong choice here.", "rating": 5, "date": "3/6/2019"}, {"text": "We&amp;#39;ve always loved Cheesecake. Even during Covid they didn&amp;#39;t disappoint. The same wonderful quality and of course amazing desserts.", "rating": 5, "date": "9/11/2020"}, {"text": "Really disappointed with not only my initial experience but then how it was handled by management. <br&gt;<br&gt;I placed a to go order on April 16 and it said it would be ready in 25 minutes. We headed there and called the phone number posted on the sign for curbside pickup. The line was busy for the first five minutes we waited until we finally got ahold of someone. They answered and said our orders would be right out. We then waited an additional 45 minutes before calling again to check on our order. I was told it would be right out. 10 minutes later and still nothing I called again and asked to speak to a manager and I was on hold for another 7 minutes before hanging up. Our food finally arrived and it was cold. I called to talk to a manager and was put in contact with Kevin, the general manager, who said he couldn&amp;#39;t do anything to refund my meal, which doesn&amp;#39;t quite seem right, but he would mail me gift cards. I gave him all of my contact info including address and he said I should receive them in 5-7 days. It&amp;#39;s now been 14 days and not only have we not received anything, but we called yesterday and a different manager said there was no indication of our complaint ever being filed AND even if it was the gift card max would have been $50 when our meal for our family was $150. He then told me to call back another time to talk to Kevin. Really disappointed and won&amp;#39;t be back to this location and will definitely not be recommending them. Horrible management and customer service.", "rating": 1, "date": "4/30/2020"}, {"text": "We found Cheesecake Factory near our hotel.  Not sure why we go out of town and eat at places we have in STL, but this place was SOOO good we ate here 3 nights LOL.  I love the orange chicken, it&amp;#39;s definitely my favorite.  Cashew chicken was really good.  Oh, and the chicken marsala was AMAZING!!!!  The menu is overwhelming, but every dish is executed so well.  It&amp;#39;s really amazing the chefs are so good to be able to make all of these things and have them be so great every time.  Sadly, I generally eat too much to have cheesecake, but the few I have tried have always been fabulous.", "rating": 5, "date": "8/8/2019"}, {"text": "Long wait, but we&amp;#39;ll worth it. Super fun waiter, very helpful and my kids loved it. The food was alright, a large menu. Definitely will go back for their cheesecake.", "rating": 5, "date": "3/12/2020"}, {"text": "First of all....we found a non-bar in Overland Park, that stays open til midnight?! #stillshocked #butfirst #CHEESECAKE<br&gt;<br&gt;The hubs and I first endulged in our cheesecakes, then we got an entrée and I got an appie. It was totally still popppin&amp;#39; off and the weather was great, so the outside seating was full too. I love seeing people out at nite. (Heart of a city girl.) <br&gt;<br&gt;If we went to a bar, then we only would&amp;#39;ve gotten deep fried something and, forget about dessert (a statement that would never actually come out of my mouth! Hah! Pun intended) <br&gt;<br&gt;Needless to say, it was so great to still have kind and speedy service, despite the crowd and time of nite.", "rating": 5, "date": "8/11/2017"}, {"text": "This was by far our worst visit here. Food once we got all of it was ok. However of the 5 of us ku meal did not show up until everyone else was done with there&amp;#39;s. We were polite and did not complain. Thinking they would take it off the ticket for the inconvenience. But that did not happen. And to top it off once we gave credit card to pay. It took over 10 minutes to get my card back. Not sure why service is so bad at these prices. <br&gt;Very disappointed", "rating": 3, "date": "2/16/2020"}, {"text": "My boyfriend took me here to celebrate our 2nd anniversary. Before picking me up he stopped here with flowers and asked if they could be placed on the table. All of the staff helped him surprise me ! I was so shocked to come to a booth with rose petals and two dozen flowers waiting for me. The staff was amazing and my server Emma was such a delight ! The food was amazing and they even decorated my plate when I ordered dessert. This Cheesecake Factory passes up the plaza location 10 fold with customer service, food, quality and environment! 10/10 stars. I have absolutely no complaints - I even ordered an alcoholic beverage that was not on the menu but the bar tenders were able to make it perfectly ! Thanks again for making my second anniversary worth while !", "rating": 5, "date": "6/18/2019"}, {"text": "The food here was amazing today! I had the turkey avocado club....so fresh and delicious!  Hubby had the Mac n cheese burger..great!  The pineapple upside down cheesecake was beyond great!  He had the tiramasu cheesecake and lived it too!  Would def go back again!", "rating": 5, "date": "2/9/2020"}, {"text": "Been to this location many times, but first time to write a review. This Cheesecake Factory location certainly knows how to honor the company&amp;#39;s demand for excellence and absolute guest satisfaction. I had the shrimp with Angel hair hair; the angel hair was cooked to perfection, the shrimp were scrumptious, and every spice in it was perfectly balanced for a delightful experience. I had a Skinny Mojito and honestly  it was probably the best mojito ever made, thank you Cody (bartender).  Avocado eggrolls and crab and artichoke dip was perfect as well. The service was 4 star which is great for this type of restaurant, so it still gets a 5 star. <br&gt;<br&gt;This last Saturday I had Brunch at The ORIGINAL, Beverly Hills  location, and boy they could learn a thing or two from the Overland Park staff. Keep up the great job CF OP", "rating": 5, "date": "12/5/2018"}, {"text": "Their information on the takeout process needs to be clearer. We sat waiting for a text and it was not until one of the waitress that was running food stopped by and asked if we were here to pick up.", "rating": 3, "date": "5/15/2020"}, {"text": "Ordered lunch for curbside pickup today Mother&amp;#39;s Day with a pickup time at 1pm.  It is now 2:30pm with no idea when order will be ready. If you do not have the staff to handle the orders, then you need to limit the orders you take in as you should have expected a surge in orders today. Now 3:17 and still no order. They said they can&amp;#39;t find it after saying they were making my order a priority. I gave them the confirmation number and they now say that that number was cancelled as they were out of one item and the system canceled it out.  When I check my credit card statement real time it shows I have been charged. Now they are making my order after we had to redo it with other items they had available.", "rating": 1, "date": "5/10/2020"}, {"text": "Good food &amp;amp; great place to take picture. I love the pasta. Had great time w my friend there. The steak also good too", "rating": 5, "date": "8/22/2019"}, {"text": "Hadn&amp;#39;t been here in a while but I must say it was a good experience and the food was good. This is not my favorite spot or high on my lists but I enjoyed my meal and the atmosphere.", "rating": 4, "date": "8/11/2018"}, {"text": "I finally had to contact the ceo to get any results! They sent me a gift card but that wasn&amp;#39;t what I was after! They said they couldn&amp;#39;t find anything wrong? I&amp;#39;ve been a customer for 30 years and this is my first complaint so you know I wasn&amp;#39;t making up being sick! Gave away gift card as I don&amp;#39;t know if I&amp;#39;ll ever go back after such poor response!", "rating": 2, "date": "8/1/2020"}, {"text": "The CBD cheesecake is a delectable piece of work and I will be visiting again soon. Thank you, kindly. Xoxo", "rating": 1, "date": "7/28/2020"}, {"text": "I was happy with my experience today. It was easy to make a reservation and had no issues getting in upon arrival. Everyone had masks on, the tables were socially distanced, and the menus were via QR code. I felt comfortable being there given the circumstances. We placed several orders, both to eat there and to go, and all orders were correct and brought to us quickly. The waitress was friendly and attentive. Most importantly - the food was delicious!", "rating": 5, "date": "7/26/2020"}, {"text": "This service was SO rude, so UNNECESSARY, and SO TERRIBLE that I would NEVER recommend to come here again for a dine in experience. <br&gt;<br&gt;It has taken a lot of time for me to process how TERRIBLE my service that I received on May 22nd with my colleagues. <br&gt;<br&gt;One evening out to celebrate our business success, we decided to go to Cheesecake Factory and share a nice meal and dessert. We pre ordered a cheesecake before our meal; was told to just tell our server, then we were seated by a less than enthused manager just shoving menus into our hostesses hands and we were seated. <br&gt;<br&gt;After 20 minutes we were finally seen by our high ATTITUDE giving waitresss who basically seemed as if we were troubling her by being seated in her area. <br&gt;<br&gt;We asked for water with lemons, she shows up with water - no lemons and we asked for lemons, 15 minutes later we got a bowl. We never saw her to deliver our food, a table adjacent to our booth were served first before us and then we get our food. She refilled drinks once, not even everyone got a refill.<br&gt;<br&gt;We told her that we previously ordered a cheesecake, and it was the only time she ever smiled. <br&gt;<br&gt;She then took 25 minutes to bring us our cheesecake. Brought us small plates and the wrong kind of spatula to serve- which by the way, she didn&amp;#39;t offer to help serve us and just left it. <br&gt;<br&gt;Then we waited another 20 minutes for her to even take the check! We were so tired by the time she even came around, we had to go up and bring the check to the manager to cash us out. When she came to us she looked annoyed and said &amp;#34;and where&amp;#39;s your check?&amp;#34;  We said we brought it up to a manager and she said &amp;#34;oh someone else took it and dropped off our take away containers&amp;#34;<br&gt;<br&gt;If you want to eat here be prepared to waste a few hours for some lackluster service. <br&gt;<br&gt;The food is good but not for the price you pay in terrible &amp;#34;customer&amp;#34; service!!", "rating": 1, "date": "5/29/2019"}, {"text": "I&amp;#39;ve been 2 times. <br&gt;<br&gt;First time was for my birthday with my husband. We were sat in a 2-top in the corner and were forgotten. Server got our drink order  (from the bar) and I requested bread..... and she never came back.  We did not have water or anything for several minutes until I got the attention of another server (other servers did not acknowledge us even though their table is right next to us). Other tables by our server were given food but no plates, napkins or silverware- they had to walk to find another server as well. Eventually we ordered and got our salads at the same time as food and never got bread. Had decided we wouldn&amp;#39;t come back..<br&gt;<br&gt;Second visit- my friend recommended going and I agreed as the menu has variety and should please everyone. (5 of us waited an hour at the bar 7:30 Saturday, when quoted 35-45.) That&amp;#39;s not a big deal.. we got drinks and it was Sat night....EXCEPT  Before we found our friends at the bar, we walked thru the restaurant thinking they were already seated. There were at least 15 open tables.... but the entire lobby was full and quoted an hour to seat. When we tried to check in with the hosts at ~45m they said &amp;#34;we have campers&amp;#34;. What they probably meant was that those guests were probably still stuck at their tables waiting for food or checks. Must have been understaffed.. we were seated in a back room corner (the room filled with completely empty tables) and given waters... then assumed to be forgotten again for at least 15-20m. Once again... we got up to find another server to find our server. He apologized and explained his other table ordered 30 cheesecakes to go. Maybe more team work is needed for servers to help each other out- just my experience when I worked with at restaurants- our managers would write servers up if not greeted within 2 min. Food came out in 15-20m and it was good/ok. Definitely do NOT order the Buffalo Blasts. They were fried wonton wrappers that were Basically EMPTY. So after eating oily fried dough and halfway thru you haven&amp;#39;t had any bites of chicken.. kinda makes you sick from the grease. <br&gt;Finally left at 10:15. Longest dinner ever- we were planning to be somewhere at 9:30. I want to come back to try more of the menu items... but the service isn&amp;#39;t always great and you may have to get up to find people. (Otherwise our server was good the rest of the night).", "rating": 2, "date": "11/23/2019"}, {"text": "Totally a chain, but this one is a pretty good one. My food always comes out great, the service is always good, and they&amp;#39;re always so nice to my kids! I love that. I usually just get the orange chicken, it&amp;#39;s so good, it&amp;#39;s super crispy on the outside and tender on the inside, chunks of chicken! My son loves their cheeseburgers and then we all share a slice of heaven I mean cheesecake!", "rating": 4, "date": "3/3/2018"}, {"text": "Will not be eating here again. Unfortunately I got food poisoning from this location. Other than me getting food poisoning, the service was really good and the food was good but contaminated. My friend and i both threw up from this food. I&amp;#39;d hate to give this place 1 Star though since my experience was still okay.", "rating": 3, "date": "12/21/2019"}, {"text": "I&amp;#39;m not sure what&amp;#39;s going on at this location, but the last several odd-ball times we&amp;#39;ve tried to go here, the wait has been an hour for just 2 people.  The first time was at 3 pm (45 min) and the second was 1:30 pm on a weekday (1.5 hr).  It&amp;#39;s fascinating that people love a chain restaurant that much, but service needs to speed up or CF needs to join the 21st century and take reservations.  I&amp;#39;m giving 3 stars for the last dish I had here.. the chicken parm!", "rating": 3, "date": "10/18/2019"}, {"text": "Their curbside delivery service is terrible.  We ordered our meal at 5:15.  We were told(probably an automatic computer system that spits out responses) that our meal would be ready at 5:45.  We arrived at 5:45, talked to an inside operator who said they would be right out with our food.  Forty five minutes later we received a text that we could either pick up our food inside or bring it out.  We texted to have it brought out, but after 10 minutes I went in to retrieve my food.  Which defeated the whole purpose of social isolation, etc.   we talked to others waiting for food and some had been there for over an hour.  So we were not an isolated case.  No comment on the quality of food by the time we sat down to eat it.", "rating": 1, "date": "6/21/2020"}, {"text": "Mother&amp;#39;s Day FIASCO!!  Placed an online order given a pick up time for 6:00. We arrive on time for our 6:00 curbside pick up.  Was told by multiple employees we would receive a text when order was ready.  2 hours and 30 minutes later we are finally informed our order &amp;#34;NEVER went through&amp;#34;!!! we had a order confirmation number!!  What a total waste of time.  The least The Cheesecake Factory could have done was offered us a couple FREE slices of their cheesecake.  Hope we were not charged for order we never got.", "rating": 1, "date": "5/10/2020"}, {"text": "We went here for my son&amp;#39;s birthday. There were 4 of us. We started with an order of Mac and cheese balls for an appetizer-so good! Then, one of us got the Bang Bang chicken and rice which is a large serving of a mild curry with a choice of white or brown rice. This is a favorite of our family and it never disappoints. Daughter got the steak tacos. She said they were good. Son and I got a specially featured dish...Chicken Parmesan pizza style. Check out my picture! It was a huge crust of chicken with sauce, Parmesan cheese and pasta...so good and so large that I have 1/2 for lunch tomorrow. We love the brown bread best but their sourdough is tangy too. We took cheesecake home so we can&amp;#39;t review that but we know that will be great.", "rating": 5, "date": "2/1/2018"}, {"text": "Yum!!!!!! Got the egg roll sampler and wooooo weeeee!!! So good and unique. Even the free bread was super swoft and yum. More than enough to get you full lol. Luckily the entrees took forever to come out so I was hungry again by that time. I got the jumbalaya. Omg that was so amazing. Green noodles and everything. They make even better leftovers. I&amp;#39;m serious. I feel like the flavor had more time to soak in lol. And of course the cheesecake was grand . Had to get that to go though. There&amp;#39;s a lot of food served here lol.", "rating": 5, "date": "4/17/2018"}, {"text": "Ate here Friday, early afternoon (July 12). My favorite is the avocado club and I love how they toast the bread perfectly. Tex Mex egg rolls were good and you have to try the Georgia Peach cocktail which is really refreshing and tasty. But the best thing was our waitress. She was so great, I wish I could remember her name. Blonde and going to school for her degree in SW.", "rating": 5, "date": "7/14/2019"}, {"text": "Cheesecake Factory is always a consistent choice.  Our experience this time was not that great.  We waited for a table for 45 mins with our 3 young children, during our wait we looked at a menu so we knew what to order the minute we sat down.  Once sat we ordered right away (2 kids Mac n cheese, spaghetti and meatballs, cheesesteak sandwich and a salmon salad pretty simple stuff) We did not get our food for 45 minutes.  When we got our food it was hot which was nice but just ok when it came to flavor.  The manager walked by our table 3 times during our wait and never once stopped and asked how things were or gave us updates on what was going on with our order.  We just didn&amp;#39;t feel like they cared.", "rating": 3, "date": "10/13/2019"}, {"text": "I placed an online order.  It.said our order would be ready at 245pm.  We arrived in time and couldn&amp;#39;t even make it into the parking lot.  I had to park across the street.  I walked up towards the restaurant and there were around 30 people outside waiting, after about 15 minutes an employee finally said I would get a text when the order was ready. About 15minutes later I received a text saying it was ready. When I was walking back to my car accross the street there were cars lined up all the way to metcalf.     When we got home our order was cold. Not a good experience.", "rating": 1, "date": "5/10/2020"}, {"text": "I ordered Avocado Eggrolls after looking at some past reviews. Unfortunately, the flour wrap wasn&amp;#39;t deep fried and was badly chewy. I was able to eat just one of them and threw the rest away. This wasn&amp;#39;t something I expected for the hefty 12$ they charge. <br&gt;I&amp;#39;m a big fan of their Godiva cheesecake though.", "rating": 1, "date": "4/1/2018"}, {"text": "Always excellent food, but I&amp;#39;m sure most of the world knows this since every time we go to one there is at least an hour wait. I wish based on popularity that they would open a 3rd location, maybe Kansas City North? Anyway my go-to dish is the Chicken Pasta Carbonara. It&amp;#39;s so delicious and I don&amp;#39;t come very often due to the sheer price $20.50 a plate, so I can&amp;#39;t say I have a lot of experience with the many endless pages of items to order. I&amp;#39;ve heard the Macaroni and Cheese topped Burger is one of the best in town. My kids always get the Fettuccini Alfredo and rave about it. The cheesecake is delicious and so many choices there as well.", "rating": 5, "date": "2/20/2018"}, {"text": "Another disappointing visit.  <br&gt;<br&gt;We came at around 3:30 PM and fortunately only had about a five minute wait in the lobby. We were seated in one of our favorite areas (we call it the rotunda) of the restaurant. And our waiter was quite exceptional. Unfortunately that&amp;#39;s not the tale of this experience.<br&gt;<br&gt;Our experience started strong.  We always order the Korean Cauliflower and our two orders did not disappoint- hot and delicious.  Our waiter brought us extra sourdough bread at our request and kept our ice teas topped off.<br&gt;<br&gt;The disappointment came when they brought our meals.  My wife ordered the fish and chips.  She had been looking forward to this meal for several days.  The fish was inedible.  The first piece wouldn&amp;#39;t even cut. It was tough.  She tried to tear open a second piece to also find it was tough.  The fries were cold as well.  We complained to our waiter.  He was sympathetic.   He offered for them to cook another order.  She was turned off.  Instead she ordered a flatbread pizza to go.<br&gt;<br&gt;My Caribbean Jerk Chicken and Shrimp was okay.  It lacked flavor.  I didn&amp;#39;t complain and ate my meal while my wife watched.<br&gt;<br&gt;Needless to say my wife didn&amp;#39;t get what she wanted.  She wanted a quality order of Fish and Chips.  We left without ordering cheesecake (a fairly standard thing we do - desert to go).  We would have probably used the entire $100 gift card if the food was consistent with prior vi<br&gt;<br&gt;I saw a previous good post about their experience with consistency.  I wish we had consistency in our food expectations.", "rating": 3, "date": "3/8/2019"}, {"text": "I love this location. The food is always worth the price and the service is always good. Too many great choices, so deciding what to order is hard. The cheese cake is great, but don&amp;#39;t sleep on the other desserts!", "rating": 5, "date": "8/17/2019"}, {"text": "Cheesecake is always sooo good. Godiva is the only one to get though as it&amp;#39;s the best. I never have set down I always only get cheesecake. They are always so busy so it takes awhile but that&amp;#39;s not their fault.", "rating": 5, "date": "7/10/2019"}, {"text": "Cheesecake Factory is a good place to go to if you&amp;#39;re trying to satisfy multiple taste palates, because there&amp;#39;s something for everyone here. Not all of their dishes are super great though, but I would recommend the Louisiana Chicken Pasta, Chicken Bellagio, Crusted Chicken Romano and Fish Tacos. They seem to excel at making pastas (it&amp;#39;s also pretty hard to mess up pasta); all of their other dishes are honestly pretty mediocre. For an appetizer, I would get the Sweet Corn Tamale Cakes. But their dishes come in huge portions so you&amp;#39;re better off skipping the appetizer to save room for dessert.<br&gt;<br&gt;I highly recommend coming here at an off time. Service can be really slow during peak times. Yes, there are plenty of tables and you&amp;#39;ll be seated quickly but it can take up to 30 minutes to get your food.", "rating": 3, "date": "1/28/2018"}, {"text": "Consistency is key, which is why Cheesecake Factory deserves some praise. <br&gt;<br&gt;ATMOSPHERE: One thing I can reliably depend on is every location&amp;#39;s layout. They&amp;#39;re all basically identical, so one can predict what it will look like. This restaurant is usually busy, so don&amp;#39;t expect peace and quiet. One thing which disappointed me about this location was the lack of reservations or even call-ahead seating. <br&gt;<br&gt;SERVICE: I&amp;#39;m usually pleased with the service at any CF location, and this one was no different. Everything was quick and timely.<br&gt;<br&gt;FOOD: in keeping with the consistency theme, the food quality is reliably predictable. The chicken piccata here tasted as I remembered it elsewhere. Finding something delectable here is also not a difficult task as the menu is rather large. When a restaurant offers a myriad of choices while simultaneously delivering the same good quality at any location it&amp;#39;s a positive sign. <br&gt;<br&gt;VALUE: This is CF&amp;#39;s biggest obstacle holding them back from a perfect five stars. Everything here is pricey for the portion size, but I understand why. People flock to this chain in droves, so there isn&amp;#39;t an incentive to price items more competitively, and this makes me curious to see what happens as we enter this bear market. There is also a good reason why everything on their menu except alcohol has listed prices. Typical cocktails here go for $11-12, and they&amp;#39;re not top shelf and/or large either. It&amp;#39;s still kind of baffling to see New York City drink prices in BFE.", "rating": 4, "date": "1/28/2019"}, {"text": "Really great food and service. I had the Parmesan chicken sandwich and salad with vine-gret dressing and both were outstanding. The sand which was on a fluffy yet crispy roll and they gave extra red sauce to dip it in. A couple of different types of bread as appetizers.  The cheesecake - I was told - was outstanding. Three different kinds at my table including red velvet, lime and regular. Just a great place with a pleasing interior.", "rating": 5, "date": "8/22/2017"}, {"text": "Being from a small(er) town, I recall my early experiences with Cheesecake Factory being a BIG DEAL.  When my wife (then-girlfriend) moved to Kansas City from the aforementioned village, nearly every big experience was celebrated with a dinner date out to the Cheesecake Factory on the Country Club Plaza in The Big City.  We gladly suffered through three-hour-and-thirty-minute waits on Saturday night, just to be &amp;#34;on the Plaza&amp;#34; and seemingly more awesome than all the pitiful fools we left behind from our misspent (mis-located?) youth.<br&gt;<br&gt;The basics haven&amp;#39;t changed in 10 years - nice, clean venues, consistent decor, strong service, enormous menu covering cuisine from all seven continents, and, yes, hunger-pain-inducing long waits on the weekends.<br&gt;<br&gt;My last three visits have all been relatively more of the same, with the exception that each one missed a step in one of the above areas.  On the former two occasions, the food quality had seemingly dropped off a tick. For a decade, I would have rated it 4/5 stars, but it&amp;#39;s dropped to 3 - 3.5.  Still strong, especially considering the breadth of menu options the obviously-skilled CF chefs have to be able to create, but down a notch.  Quantity is still enormous, which is to say just fine.<br&gt;<br&gt;On my latest visit, I feel we were slighted on the usual above-average service end of things.  Our waitress was a little more in tune to the pompadour-haired bartender than her waiting duties, both on our table and others&amp;#39;.  You may be thinking, &amp;#34;But, M.O., you yourself pointed out just how crazy-busy the Cheesecake Factory is!&amp;#34;  Yes, Yelp brethren, while this is normally true, on this occasion it was a mid-winter Thursday evening from 9:00 to 11:00 pm in the bar.  We were but one of three spots in the entire bar area taking up space.  So few tables to tend to should have meant better-than-average service, however we received the opposite. <br&gt;<br&gt;Nitpicks aside, Cheesecake Factory remains a strong, albeit predictable, choice for a good meal alongside half the metropolitan area.  <br&gt;<br&gt;TIP: Get the cheesecake. Any of them. Obvious, yes, but almost so much so that you might be tempted to eat that entire 14-pound plate of delicious pasta instead of leaving room for dessert.  There&amp;#39;s a reason the dessert name made the façade, folks!<br&gt;<br&gt;Food = 3/5 <br&gt;Facility = 4/5<br&gt;Service = 2/5<br&gt;Ambiance = 3/5<br&gt;Value = 4/5", "rating": 3, "date": "2/12/2016"}, {"text": "For being the first time to the cheesecake factory. I had a disappointing experience, nothing from the service but the kitchen itself. All of the rumors I&amp;#39;ve heard as a culinarian myself, came true tonight. Not only is the menu OVERWHELMING, but I did settle on the Riesling Chicken. The first plate came out cool and the chicken and sauce were barely warm. Returned the plate to the expo myself, informed the restaurant manager that intercepted the plate that it wasn&amp;#39;t even to minimum service temp(140°). And I asked for a fresh refire. Received the plate back roughly only 5-6 minutes later. When I inspected the plate I found evidence of a reheat not a refire. The inner rim showed signs of crusting from the sauce, instant indicator of being either nuked(microwaved) or just thrown into the oven to bring it up to heat. I refused the plate after the waitress returned with my to go box.", "rating": 2, "date": "3/6/2020"}, {"text": "If this was my only trip to the Cheesecake Factory it would be my last. Our waitress was the worst I&amp;#39;ve ever had, she screwed up my order, forgot my request for extra dressing, failed to show up to our table most of the evening and spent a significant portion of the time talking to the table behind us. We wanted to order another drink for the majority of the evening and she walked by and only asked my partner for what he needed and walked away before I could even respond. She gave him his drink and walked away before I could attempt to get her attention. The meal was disgusting, I ordered my longtime favorite and it came out without two key ingredients and heavily over salted. <br&gt;<br&gt;This was the worst trip I&amp;#39;ve had to a Cheesecake Factory in more than 5 states and it&amp;#39;s the last time I will be returning to this location. Others are generally great, this one is the weird exception to the rule. One thing I will note - I&amp;#39;ve had great service at the bar. <br&gt;<br&gt;After letting the waitress know something was wrong with the meal the manager came out to check and removed it from the bill. That is the one saving grace!", "rating": 2, "date": "11/11/2018"}, {"text": "Made a reservation for 8 got here checked in and ended up just leaving at 830 I thought the whole point of a reservation was to be seated at a decent time apparently not here on top of that the lady working the front acted like she didn&amp;#39;t even care when we told her we where leaving. I&amp;#39;ve been here before and the food is great but if you decide to make a reservation here be prepared to wait as if you didn&amp;#39;t we will not be coming back here.", "rating": 1, "date": "2/21/2020"}, {"text": "This is and has for years been in my top 5 places to eat.  Unfortunately (or fortunately, for my waist line) we don&amp;#39;t have one in Wichita, so I have to wait until we are in KC or Vegas to eat here.  I prefer this location over the Plaza one simply because it&amp;#39;s easier to access and seems to have a quicker turnaround.<br&gt;<br&gt;The problem with the huge menu where everything sounds delicious is that because I so rarely get to eat here, I have to order the meal that put this place in my top 1% in the first place...the Chicken Picatta.  (I just got goosebumps typing that...cue the drool cup).  Yeah...it&amp;#39;s a major cheat meal for this gluten-intolerant gut of mine...but soooo worth it!.  <br&gt;<br&gt;I did one time order something gluten free which has now become my hubby&amp;#39;s go-to after he tried mine.  That&amp;#39;s the Steak Diane...it&amp;#39;s pretty damn drool-worthy itself.  <br&gt;<br&gt;We always get a couple of different cheesecakes as well...one to share and one to take with us.  This time we had one of our trusty regulars, the Banana Cream...it&amp;#39;s not as rich as some, so we can actually finish it in one setting.  Then we took a new choice, Chris&amp;#39;s Outrageous with us...if you like Mounds candy bars or German chocolate cake, this one will tickle your fancy.  Can you really go wrong with any cheesecake that has some combo of chocolate, caramel, peanut butter, or chunks of some candy bar?  Me thinks not.", "rating": 5, "date": "6/24/2017"}, {"text": "Very beautiful place. Was packed but was still worth the wait. For a Saturday it was going to be more then a 50min wait but we lucked out and got open bar seating. Our waiter was super polite and really helpful. Definitely going back.", "rating": 5, "date": "11/11/2018"}, {"text": "You come here for the dessert menu.  The white chocolate raspberry cheesecake is my personal fave.  Lots to choose from, all of it delicious.<br&gt;<br&gt;Everything else is pretty uninspired.  On my last visit, my chicken-mango-avocado salad featured little chunks of rock-hard underripe mango, an overcooked stringy piece of chicken, and a vinaigrette that was so tart it was actually painful to eat.  They also told us that the first part of our party hadn&amp;#39;t arrived, just before we spotted them sitting at a large table.  (They don&amp;#39;t take reservations, so you have to send advance scouts for a large lunch group.)  Service at lunch was painfully slow &amp;amp; disorganized.  Not in a hurry to go back.", "rating": 3, "date": "4/27/2017"}, {"text": "The Drinks are always fenomenal here. <br&gt;I would really recommend there Mojitos - super Refreshing. I also tried there Long Island and it was super strong - great drink.  <br&gt;Am not too crazy about their food it&amp;#39;s a Hit and Miss for me, Sometimes you get Good food others Ok food. <br&gt;Drinks and Desserts are always fantastic only reason why I keep coming back !", "rating": 3, "date": "5/21/2017"}, {"text": "We had a party of 8.  Our server did a great job- he had 2 large parties sat at once. Bread is delicious. Servings are plenty", "rating": 4, "date": "1/18/2019"}, {"text": "Apps were excellent (eggroll sampler), drinks were great (cucumber lemonade) entrees were bad. Way overcooked. Biscuits burnt in chicken and biscuits. Pasta hard...very hard.. in chicken marsala. Manager never came by to apologize after sending meal back. 2nd remakes were better but took over 30 minutes to make. Had to ask for drink refills everytime. Bad service. Just overall not great despite empty restaurant on a Saturday night. :(", "rating": 2, "date": "6/22/2019"}, {"text": "We had a friend get together and picked here on a Saturday night. Not my first choice because it is so big and so busy. But it was so, so good. I was afraid of the menu as well, big portions, lots of calories, then cheesecake. I was happy to see the skinnilicious menu, so shrimp tacos it was. Very good! And I skipped the dessert, although took a couple home for the fam. Ian waited on us and did such a great job. Great experience!!!!", "rating": 5, "date": "7/28/2018"}, {"text": "Once again TCF does not disappoint. The worst process for seating, I mean making people wait in the industry. I was convinced to give it a try again after 3 years and nothing has changed. Plenty of empty tables, servers chatting at the hostess stand, told a 10 to 15 minute wait, left after 25 minutes.  The food is not that good. I will spend my money elsewhere.", "rating": 1, "date": "7/23/2019"}, {"text": "I just feel like it is hard to go wrong with Cheesecake Factory. There are so many options, your whole party will find something to eat. I&amp;#39;ve never had a bad experience with any of the dishes I have ordered at the Cheesecake Factory. <br&gt;<br&gt;My family and I made a weekend trip to Kansas City and we came here. We knew we wanted to come here, since we use to live in CA near a few cheesecake factories and then moved to AR with no cheesecake factories. We were really excited to come eat!<br&gt;<br&gt;WAIT/PARKING:<br&gt;We came on a Saturday evening around 6ish. It was really crowded, but we didn&amp;#39;t have too long of a wait fortunately. About 30 minutes. <br&gt;<br&gt;The restaurant is located in a small shopping center. There is a decent amount of parking, but it is a busy restaurant, so parking can be hard to find. We had to park near Whole Foods, which is in the back of cheesecake - not far.<br&gt;<br&gt;CUSTOMER SERVICE:<br&gt;Our waiter gave us great customer service. Very friendly and helpful.<br&gt;<br&gt;FOOD:<br&gt;I&amp;#39;ve ordered quite a few dishes at Cheesecake Factory. Lately, I&amp;#39;ve mainly been ordering off of the skinnylicious menu. Can&amp;#39;t beat yummy and healthy! I&amp;#39;ve had several items off of this menu and they have all been delicious and filling. This trip I ordered the Asian Chicken Salad. So yummy, ate it all! It was a large portion too. Which, btw, all of cheesecake factory dishes are good size portions. Usually you will have left overs. <br&gt;<br&gt;My husband ordered the Italian Sandwich and loved it. <br&gt;<br&gt;We had our 2 year old daughter with us. At all restaurant locations they bring out a smaller plate of fruit and bread to you if you have a small child. Not sure whicha age is the cut off for that. It is such a nice gesture and I appreciate them taking that extra step to treat the kids good and help the parents out ;).<br&gt;<br&gt;Then we ordered cheesecake... I mean c&amp;#39;mon, how can you pass it up when dining here! I&amp;#39;ve had a good amount of cheesecakes here and they are all yummy. This time I ordered the Hershey&amp;#39;s Cheesecake - oh my yum! My husband had the Reese&amp;#39;s Peanut Buttercup Chocolate Cheesecake- also very delicious. We had leftovers from our cheesecakes. Very delicious, but both rich that we weren&amp;#39;t able to finish them. However, I finished mine later for my &amp;#34;4th&amp;#34; meal haha. <br&gt;<br&gt;Other cheesecakes I love: fresh strawberry, s&amp;#39;more, 30th anniversary, godiva, raspberry, peanut butter cup fudge, and chocolate mousse. I also love the linda&amp;#39;s fudge cake and lemoncello cream torte.", "rating": 5, "date": "4/8/2015"}, {"text": "So I sat at the bar for my food and was not offered bread and butter however when someone came in and sat next to me they offered them bread and butter. I ordered a chocolate martini and the bar tender didn&amp;#39;t know how to make it and ask another worker to do it. The bartenders were so busy making drink that they didn&amp;#39;t acknowledge the people needs at the bar for food. I will not be at this location anytime soon. Plus long wait for my drink", "rating": 1, "date": "11/30/2019"}, {"text": "Food was delicious as usual. Had to wait a bit on a Saturday afternoon, wasn&amp;#39;t expecting that but not a big deal. Server was fast and made sure we had everything we needed. And then the cheesecake. You can&amp;#39;t go wrong with any one you choose!", "rating": 5, "date": "7/15/2019"}, {"text": "Surprisingly impressed, service, food, drinks. Chicken marsala and pineapple mojito were my favs. It was a great meal!", "rating": 5, "date": "7/7/2019"}, {"text": "One the best restaurants ever! The brown bread is to die for and the four cheese pasta has a ton of flavor. The waiters are very good as well! Expect a small wait especially in the evening and weekends. There&amp;#39;s a reason for that! The food and cheese cake is just that good!", "rating": 5, "date": "7/6/2019"}, {"text": "I&amp;#39;m so disappointed. We waited an hour and a half. When we went to check how much longer our wait was we were told very rudely &amp;#34;I told you an hour and a half&amp;#34;. Then when brought to the table the hostess said nothing, she stopped with no signal that this was our table. When we didn&amp;#39;t sit she used her hand to gesture, I said thank you and she just rolled her eyes then started walking away. We then waited 15 minutes for our waiter, he was really nice. We ordered drinks and our food. We ordered the calamari (something I order every time I go to Cheesecake Factory) and it came out a greasy mess the breading wasn&amp;#39;t even on the meat. Then our food came and had the same issue. It looked like crap and mine (bang-bang chicken and shrimp) was cold. Waiter didn&amp;#39;t come back for a while. I ate a little of my food then just asked for a box. The waiter was trying to rush us out. I normally really enjoy this place but I am very unimpressed with this location&amp;#39;s staff and quality of food.", "rating": 1, "date": "6/27/2020"}, {"text": "Honestly, the Cheesecake Factory never disappoints. We always ask for our Cheesecake first that way we can munch on it while we&amp;#39;re eating for our entree so we aren&amp;#39;t too full to eat it after! The free bread is the best, and the menu is endless. Everything I&amp;#39;ve ever tried is phenomenal.", "rating": 5, "date": "5/20/2019"}, {"text": "Check your receipts! Left a $10 tip on a $50 order, but when I checked my bank statement, the waitress had been given a $26 tip. Manager said she will refund the money in 7-10 days, but feel that the problem still exists.", "rating": 1, "date": "6/22/2019"}, {"text": "Sadly the service and the portions have gone down dramatically in te last few years. I decided to order take out from a local delivery service and for the second time in a row they have forgotton the complimentary bread. The first time I was forgiving but twice in a row? I called the resturant and the manager who identified himself as Chris Welch stated it was not their responsibility to make sure the order was complete, it was the delivery services job. Sure that&amp;#39;s why I pay over $18 with tax for their overpriced Cashew Chicken. Give me a break, its the resturants responsibility to make sure the order is correct, its the driversjob to make sure its delivered to the right house. I do not recommend this location, its service and portions are horrible.", "rating": 1, "date": "11/3/2018"}, {"text": "Hits the sweet tooth spot with an endless choice of cheesecakes. <br&gt;<br&gt;Can&amp;#39;t go wrong with a late night piece of cheesecake and coffee. Service is always good, not much they can do but give us dessert! <br&gt;<br&gt;We got the 30 year anniversary piece. It was VERY cold and the fudge layer was completely over powering. Next time I will just get plain ole&amp;#39; cheesecake.", "rating": 3, "date": "1/20/2018"}, {"text": "Burnt or Not......you decide....sure looks like it to me. The waitress stuck with her story that they just crisp it up for you. Hmmmnnnn", "rating": 1, "date": "2/19/2018"}, {"text": "One of our favs has devolved into a no-go for us. We&amp;#39;ve been going since this opened and now everytime we visit, we get the same story: we&amp;#39;ve changed the recipe! Nothing we order tastes as good as it did in the restaurant&amp;#39;s beginnings. We&amp;#39;ve decided we will only visit when we&amp;#39;re in the mood for cheesecake.", "rating": 3, "date": "10/25/2019"}, {"text": "The Tuscan chicken was phenomenal. My wife had the grilled chicken Asian salad and that was good too -- it became truly great after our server suggested the Chinese plum dressing. <br&gt;<br&gt;Great food and service. Good for families with smaller kids too.<br&gt;<br&gt;The server we had (Brad) is one of the best we have had anywhere in the country.", "rating": 5, "date": "1/7/2017"}, {"text": "We love this place! The &amp;#34;chicken and biscuits&amp;#34; is delicious and comfy. The artichoke and crab dip omg soooo good! Hubby got mac n cheese burger he said it was delicious!", "rating": 5, "date": "1/1/2017"}, {"text": "I&amp;#39;ve eaten Cheesecake Factory for years and this is the first one I&amp;#39;ve eaten at that served an undercooked(pink all the way through) burger to my wife. The server was good about getting another burger but it took about ten minutes(which I understand but by the time she got her food I was already done eating). The next burger came out and was still a little red in the middle so my wife just asked for a to go box as we didn&amp;#39;t have time to wait again. It&amp;#39;s a little upsetting to go to such a nice restaurant and spend $80 between two people and not even have a manager come apologize.  I won&amp;#39;t give one star as our waitress seemed like she tried and the orange chicken I ordered was phenomenal, however in the future we won&amp;#39;t be returning to this location.", "rating": 2, "date": "11/30/2018"}, {"text": "Horrible. All staff and management are disorganized. Please don&amp;#39;t use this restaurant. I waited over an hour to receive my food from curbside, no one know what&amp;#39;s going on very unorganized and untrained STAFF. Especially front desk older lady!!!!!!!!Very unprofessional how this matter was handled.", "rating": 1, "date": "4/12/2019"}, {"text": "I prefer this location over the plaza location, especially for weekend dinners (the wait is out the door on the plaza then). <br&gt;<br&gt;I&amp;#39;ve always had a pleasant experience here and the marble interior with high-ceiling and pillars are a nice touch. <br&gt;<br&gt;They have their lunch specials every day until 5 p.m.<br&gt;<br&gt;I will say, the menu reads like a chapter book with ads separating the genres of food they offer. So if you&amp;#39;re indecisive, tell the waiter you&amp;#39;ll need more than a minute. On top of that, they have plenty of awesome dishes to choose from, which doesn&amp;#39;t make the process any easier. <br&gt;<br&gt;I&amp;#39;ve found that all the pastas, have had them all, are fantastic. My favorite pasta is the Carbonara and Da Vinci. <br&gt;<br&gt;If you&amp;#39;re feeling adventurous, you can have your dessert before your meal. As you walk into the place, they have their cheesecake bar on the right side, before you&amp;#39;re greeted by their front-end staff.<br&gt;<br&gt;My favorite cheesecake they offer, currently have 60+ cheesecake flavors and always adding/substituting, is the Banana Cheesecake. It&amp;#39;s a cheesecake with a hint of banana flavor with whip cream and fresh bananas cut on top of the cream. So good. If you don&amp;#39;t see your favorite cheesecake on there anymore, you should ask to see if they still offer it. <br&gt;<br&gt;For the quality of the food and immense choices, the price is very reasonable. I usually spend around $55-60 for a date night, with big meals, dessert and an occasional appetizer + tip.", "rating": 4, "date": "6/10/2016"}, {"text": "Rudest bartender I&amp;#39;ve ever had and I&amp;#39;ve been around a long time! Catty comments and snotty attitudes will not get this presumably young woman very far. Extremely disappointed and we will not recommend this location...ever. By the way, I live locally. I waited tables for 3 years, so I understand your pain. But show up and fake it if you have to, but like it or not, this is corporate America and you better learn quick! I still tipped even though it wasn&amp;#39;t earned!", "rating": 1, "date": "9/21/2019"}, {"text": "I haven&amp;#39;t been here before. My husband and I came to celebrate my birthday/our anniversary and use a gift card I had received. <br&gt;<br&gt;Wait time wasn&amp;#39;t bad for a Friday night - and they got us in much quicker than estimated. The hostess wasn&amp;#39;t super friendly, but also not chilly. I get it, it was super busy and she has a hard job with (probably) no tip-out. <br&gt;<br&gt;Our server was really nice, very attentive, answered all of our questions, and brought us a little hot fudge sundae to celebrate. The food was good, but not fantastic. However, the lettuce wraps were amazing. Giving a three because I just wasn&amp;#39;t wowed, was pretty loud, and felt cramped. It&amp;#39;s a tad pricy, though the serving sizes are big.", "rating": 3, "date": "4/28/2017"}, {"text": "I used to love this place. One of the few chains that really was good.<br&gt;<br&gt;Now the thirty page menu is nothing more then chicken dishes in various forms. They&amp;#39;ve been Houlihan&amp;#39;d. No place overuses chicken like Houlihan&amp;#39;s, now Cheesecake Factory rivals them. You can see how well this strategy has worked for Houlihan&amp;#39;s. The menu is a page after laminated page of soulless beige dishes. Nearly all of their signature dishes are chicken unless you added some shrimp. Portions used to be enough for three meals. Not anymore. This is a one setting dish now. This place isn&amp;#39;t cheap. For the portion size they presently serve it is way overpriced. I know money is the common denominator but I urge Cheesecake management to remember what made them popular because if they don&amp;#39;t I see signs of their inevitable decline. In five years they could easily go the way of Red Lobster or worse.", "rating": 2, "date": "7/25/2017"}, {"text": "Okay I still have a bit of an issue giving it 5 stars because the cheesecake was almost $10, but overall it was a good value. We ordered two pasta dishes that were on special and my ex ordered his spicy. Both were awesome and we had enough for another meal that night. We split the Oreo cheesecake and ate it over two days. It was decadent. The service was professional and pleasant and the establishment was clean. I&amp;#39;d recommend and can&amp;#39;t wait to return", "rating": 5, "date": "11/16/2017"}, {"text": "Doordash orders are never ready!! I have been here 2-3 times to pick up a doordash order and the wait time is 10-15 minutes. They will promise you a pick up time and it won&amp;#39;t be promised!", "rating": 1, "date": "8/31/2019"}, {"text": "Black people be prepared to wait the maximum time possible. Just a trend with this location. Which is why this will be my LAST visit here, which I&amp;#39;m sure was the plan.", "rating": 1, "date": "8/8/2018"}, {"text": "This place continues to be over-rated. At 1:30 on a Sunday afternoon it has taken us almost 1.5 hours to eat a an overpriced burger, grilled cheese and fish &amp;amp; chips. Nothing special ordered. We are still waiting for cheesecake-which is really the only reason we came here. Not to mention lack luster service and a table next to us with a 2 year old little boy who was either screaming or running wild thru the restaurant-while his family pretended nothing was happening.  Definitely not a pleasant dining experience. <br&gt;Next time we will order cheesecake to go. Lesson learned.", "rating": 2, "date": "8/26/2018"}, {"text": "Slooooooooowwwwww. Is the best way to describe this visit. Servers are moving in slow motion. Took 20 minutes to get the bread on the table and an additional 40 minutes to get the food out and on a day that isn&amp;#39;t even busy. Management needs to reevaluate their staff at this location.", "rating": 1, "date": "8/24/2019"}, {"text": "My cousin invited me to the Cheesecake Factory because his little brother took his snack at our school and he was starving from hunger. His mother suggest that we could eat dinner there. I didn&amp;#39;t know that this place was too popular(not saying it&amp;#39;s bad). The atmosphere was fancy and ancient. The waiting line was so long, but the colorful place made me busy looking around the castle-looking restaurant.<br&gt;<br&gt; We finally got our table and talk a little bit of life. The waiter walked to our table and gave out our drinks. He was so kind that he gave us some bread and butter over time. While we wait, I got on my phone, but there&amp;#39;s no internet. I ask the waiter. He said that they don&amp;#39;t have the internet because people will stay here all night. So my cousin and I talked about each other, sometimes we get a restroom break. <br&gt;<br&gt;After a long time of waiting, talking, and seeking any interesting decorations, we got our food. As I started to gobble like my friend (I call my cousin that sometimes), my mom said the pizza was a bit too salty. I ate half of the pizza, a quarter of a salad, and almost all of the noodles. For dessert, the cheesecake was smooth and crispy good with the fresh strawberry and taste fruity. I left home like I had obesity. If you want a restaurant like this place, my top 5 suggest that this place might be your loyal kitchen.", "rating": 4, "date": "3/11/2018"}, {"text": "I have already contacted cheesecake online after my experience for further assistance, and haven&amp;#39;t heard anything for a week...shows how horrible their customer service is on top of the restaurant itself. Don&amp;#39;t write on our reviews on yelp to contact you online if your not going to respond back. People deserve to know the lack of your service. Theres plenty of other restaurants in town that care more about their customers than you.", "rating": 1, "date": "6/20/2019"}, {"text": "Went here recently for take-out dessert only. When you walk in, there is an area where you can order cheesecake and other fresh desserts from their display cases. We ordered two different kinds of cheesecake and after a few minutes, they were given to us with a side of whipped cream. The service was as fast as it could be with an adequate amount of staff taking care of multiple customer orders. The cheesecake itself it well worth the wait and arguably worth the price (which is relatively high). They typically rotate through different flavors but keep majority of their menu the same. I have always loved coming to the Cheesecake Factory primarily for the cheesecake and this is usually the first place I think of when I think of great cheesecake.", "rating": 4, "date": "8/6/2018"}, {"text": "My favorite Cheesecake Factory location. Great food and service. I&amp;#39;ve had Taylor as a waiter several times and he is amazing. This would be a lock 5***** but the hostess is awful! Rude the last three times and I&amp;#39;ve got out of my way to treat her as a customer and it just gets worse. <br&gt;<br&gt;The avocado egg rolls are crazy!<br&gt;<br&gt;Cheers", "rating": 4, "date": "8/17/2016"}, {"text": "Our dinner at 9:00 PM took over an hour and a half to get to us (party of 3). We had to ask to place our order and had to ask for all of our drink refills. One entree was good, one entree was sent back because the pasta was so over cooked that it actually was starting to kind of paste together, then one entree had been sitting out so long a film had settled in on the pasta. A manager never even acknowledged the fact that a dish was sent back and not replaced. We will not be coming back here after this experience. A party of ten came in after us and was able to leave before we did.", "rating": 1, "date": "8/6/2019"}, {"text": "I thought I&amp;#39;d order cheesecake for New Year&amp;#39;s Eve before all the New Years resolutions.  I ordered for pick up and they said it would be ready in 20 min.  When I arrived, several people were waiting for their food, or for their delivery driver was waiting.  While I was still line a couple different people who were waiting asked the people at the register to relook in the food packages that were next to the register.  Before looking the guy at the register said no their name wasn&amp;#39;t there, and then thought better of himself and looked, found three peoples order.  It had been sitting there the whole time they had been waiting 30 min.  I paid and got my cheesecake but my food I was told was being packed up in the kitchen.  They had a lot to do- I was told.  The kitchen was backed up.  So I waited...and waited...about the time I was going to ask for a manager, the girl at the register went back herself to see where the orders were.  She brought out some, but still not mine.  I finally got my order an 70 min after I placed it.  It must have been sitting in the back the whole time because when I got it it was cold.  I feel real bad for the Grubhub/delivery drivers- their people are gonna think they took too long when in fact it was the Cheesecake Factory.", "rating": 1, "date": "12/31/2019"}, {"text": "I usually always have a good experience here! The only thing I would say is that it gets super busy on some days and they don&amp;#39;t take reservations. I ordered the bang bang shrimp and chicken.. It tasted like a curry flavor to me, but still good! Just not what I was expecting what the usual &amp;#34;bang bang shrimp&amp;#34; to taste like. We also ordered Korean cauliflower to eat and it&amp;#39;s a good replacement for meat! I loved how it tasted with ranch. My friend ordered honey truffle chicken and it was delicious! The chicken was very flavorful. And of course we ordered cheesecake togo... The white chocolate rasberry truffle &amp;amp; mango key lime coconut. Very satisfied with how everything tasted!", "rating": 4, "date": "8/17/2017"}, {"text": "Food is always excellent and cheesecake is even better. It&amp;#39;s pretty pricey but you must assume that before eating here anyways!", "rating": 4, "date": "1/6/2019"}, {"text": "It&amp;#39;s a really nice to be if u love cakes especially cheesecakes. It does justice to its name. Lemme first talk about the ambience as it&amp;#39;s the first thing you notice. It&amp;#39;s built over a huge area and it&amp;#39;s Egyptian themed. Very pretty. The staff is well spoken. You will never run out of options as they have a huge menu. But if you are a vegetarian or a vegan better reconsider before going there.<br&gt;I went there with my husband and we ordered avocado egg rolls for starters. They were really really good. For the main course we had a veggie burger and noodles. Finally ending with a delicious tiramisu cheesecake.", "rating": 4, "date": "9/9/2015"}, {"text": "Went in and ask to watch the World Series and sat there thru 2 innings and bartender still didn&amp;#39;t change channel. <br&gt;<br&gt;I left<br&gt;<br&gt;I believe in 2nd chances... in this case 3. My hotel is near by and this is my place of choice due to the selection of menu. That first time was a disappointment however have come back twice now and service and food have been great.  And they had they&amp;#39;ve had the World Series on! :)", "rating": 5, "date": "10/24/2017"}, {"text": "I used to come here a lot. Had a roomie worked here always got brought home a cheesecake slice on evenings he worked. Recent visit I tried the low carb cheesecake although I am not a fan of Splenda I knew I would feel terrible if I ate a whole slice of regular cheesecake (no joke, been Keto almost a year now). So I wasn&amp;#39;t disappointed with the choice. It was really just like cheesecake. If only they would expand the low carb cheesecake menu and use erithritol. I would be by more often.", "rating": 5, "date": "3/23/2018"}, {"text": "ZERO STARS - when the food arrived it smelled like dishwater but despite this we ate a little and it was super bland, the noodles were hard, non of us finished our food because of this and 3 OUT OF 6 OF OUR PARTY GOT FOOD POISONING FROM THE ALFREDO !!! I can&amp;#39;t imagine how much more sick we would have been if we did finish our plates, Be safe than sorry DONT EAT HERE!!!", "rating": 1, "date": "6/7/2019"}, {"text": "Heard good things about this place. Wasn&amp;#39;t what I hoped for saying he least. Coffee was good. Spicy cashew chicken was not all that good chicken was soft like cooked fish fair on the taste. White chocolate raspberry truffle cheese cake had no raspberry taste to it at all not even a hint. Def not worth 16.95 for chicken and 7.95 for cake. Will not be going back again", "rating": 1, "date": "8/16/2018"}, {"text": "Can see why rating is 3 1/2 stars, on a beautiful night management decide not to serve on the patio and staff appropriately? Lobby is packed and patio is full of hungry customers waiting to eat inside plus it&amp;#39;s prom night.  Told our wait is 45 minutes,  I expect it will be an hour and half before we are seated.  No staff to even offer waiting customers on patio a drink.  Use to love this place but not with the current management concern for customer service.", "rating": 2, "date": "9/22/2018"}, {"text": "I have been here once and it was many years ago it was okay but it didn&amp;#39;t appeal to me and I haven&amp;#39;t been back , people like this place and it&amp;#39;s busy too so that must be good, might go in on there cheesecake half price special, it&amp;#39;s easy to get in and out of the place, so I really can&amp;#39;t give u answer if it good or not on this place", "rating": 4, "date": "7/4/2017"}, {"text": "Awsome food like the taste but wait time was bit much .loved the ambience and cocktail", "rating": 4, "date": "9/16/2017"}, {"text": "Had a great experience tonight. Dinner for 5 and when our meal was ready one dish was sent to a different table. Everyone from Manager to wait staff did what they could to make the mistake better. Not a perfect meal but perfectly handled with customer service. Service and doing what is right by your customers is a lost skills but not here.  A great experience in spite of a kitchen mix up.", "rating": 5, "date": "6/27/2019"}, {"text": "First impression: the tile path leading to the door has several broken, missing and loose pieces. I&amp;#39;m surprised someone hasn&amp;#39;t fallen. <br&gt;They were strangely busy for a Thursday night, about a 15 minute wait.<br&gt;Finally the hostess called our name and we get to our table and its still being cleared. Then we sat down to a wet table. Not a good start. <br&gt;The burger I ordered was good and cooked to order. My date got the fish and it was horrible. We put it aside and shared my plate. Service was bare minimum. <br&gt;I love this place but I do NOT recommend this location.", "rating": 1, "date": "4/7/2017"}, {"text": "Decent amount of parking.  Wait was realistic and accurate with the time given.  Excellent service.  Not cheap, but the size of the portions is a value.  Very able to  accommodate special dietary and allergy requirements.  Exceeded expectations.", "rating": 5, "date": "7/24/2019"}, {"text": "Nice decor and food is okay but it doesn&amp;#39;t equal the price they charge. <br&gt;<br&gt;Anyplace that charges $18 for meat loaf ought to be able to get my order right the first time.", "rating": 2, "date": "1/15/2017"}, {"text": "We came here for lunch! We ordered the pasta  which was wonderful. The only issue was that we had ordered the lunch sized pasta and when we received our food, I was thinking this amount of food was large. I asked our waitress what a dinner sized meal looked like if this was lunch amount. She apologized and stated that she made the mistake that she marked the dinner size. We were thinking because it was her mistake she would make the correction on our receipt to lunch. Unfortunately she did not! Please be very clear to what size you are going to order to your waitress or waiter.. Our bill was on the pricey side because of this. I understand that mistakes can happen but fix it for your customer.", "rating": 2, "date": "10/17/2018"}, {"text": "It&amp;#39;s the Cheesecake Factory. If you&amp;#39;ve been to one, you&amp;#39;ve pretty much been to all of them. <br&gt;<br&gt;Food was on par, and service has always been good at this location. <br&gt;<br&gt;They have a large menu so there&amp;#39;s usually always something for everyone. <br&gt;<br&gt;Lets be honest, I don&amp;#39;t go to TCF for the food, it&amp;#39;s for the cheesecake. I will be back.", "rating": 3, "date": "4/4/2017"}, {"text": "Great food all around. Amazing appetizers, entrees, and of course all the cheesecake options. I can see why they are always extremely busy.", "rating": 5, "date": "4/29/2019"}, {"text": "Wanted to enjoy some carry-out and thought this would be my best option, but definitely not! The Avocado Egg Rolls I ordered looked like they&amp;#39;ve been sitting out since this morning, completely brown and the cheese cake I had ordered was smashed.", "rating": 1, "date": "8/14/2018"}, {"text": "The Cheesecake Factory does a lot of business in the Overland Park, KS area. Please be more focused on the Customer coming into your location and acknowledge them , Waiting time is terriable. You hired to many employees and they never respond to the Customers or Drivers that you have contracted with to deliver food to your customers. The drivers provide a service and the owner of the restaurant needs to inform your staff to provide better service for Door Dash, Grub Hub, and Huber. The drivers provide excellent service . They do not get paid to wait on you to bring the food up front. So be more considerate and have better communication to the people coming into to your restaurant. Hiring to many people makes no sense if you have upset customer waiting for long periods of time.", "rating": 1, "date": "4/6/2019"}, {"text": "I&amp;#39;m very easy to please but very disappointed yesterday when we went with a group the booth we sit at was very dirty the sit still have foods crumbs on it and my plate has food stuck on it that is been dry up we ask our waiter for a new one and we have to clean our silverware I&amp;#39;m very disappointed.", "rating": 2, "date": "5/6/2018"}, {"text": "Emotionally unstable and forgetful staff.   One woman had trouble taking a basic order (didn&amp;#39;t seem to be able to add and subtract).  An overload of tension in the environment, and the manager himself wasn&amp;#39;t familiar with the menu.", "rating": 1, "date": "8/1/2017"}, {"text": "I have lived other places and loved cheesecake, but the two cheesecake&amp;#39;s here that I&amp;#39;ve been to (119th and plaza) are repeatedly poor. Food is often way too salty, I&amp;#39;ve had stale hamburger buns, cold fries,etc. repeatedly. I stop going and a couple months later, give it another try (like today) and find nothing has changed.  It is clear that the managers here simply are not interested in any aspect of running a good restaurant. It is a shame as it used to be one of my favorite restaurants before I moved here. This is clearly a local problem and I find the apathy pretty sad. I wish corporate would pay attention and intervene. Maybe time for new managers!!!", "rating": 1, "date": "5/1/2019"}, {"text": "First: we had a great waiter the other day. He was friendly, respectful, and suggested his favorite blend of tea. My mom loves tea more than most people can conceptualize, and she was very impressed. She requested that I add this review. <br&gt;<br&gt;Second: Oh, Cheesecake Factory. If only I could live my dreams and eat your cheesecake for breakfast everyday. There&amp;#39;s nothing like rolling out of bed and enjoying a slice of key lime cheesecake while dancing in your kitchen, preferably at the counter closest to your refrigerator. It&amp;#39;s divine. You&amp;#39;ve been there to celebrate birthdays, births, divorces, and everything in between. You remain a constant. I&amp;#39;m sure this is the new Red Lobster of single 20-30 something females, but you never judge. Keep that brown bread and cheesecake coming, and everything will be just fine.", "rating": 4, "date": "8/13/2016"}, {"text": "Gave CF another try with a gift card I had received. Went during their Happy Hour, which I had never done before. Was seated in a quiet booth with just a short wait. Was pleased to see Mark West Pinot noir as a $5 HH wine option. Had the spring rolls as a HH app, were very good. Had lots of veggies like bean sprouts and mushrooms, liked the soy and peanut sauce for dipping. I once again wanted the tuna tataki salad, but they were out of tuna. (There is a theme here.) Had the Thai salmon instead, very large portion of fish and was well cooked. Hubby had the shepherds pie, and we took a slice of lemon meringue cheesecake to go. As always, their cheesecake is the best. Service was wonderful. I will be back.", "rating": 4, "date": "12/17/2016"}, {"text": "This location never empty, always busy. I love their bread, warm and fresh. Good portion, good price and friendly service. <br&gt;<br&gt;Don&amp;#39;t forget to get the cheesecake!", "rating": 4, "date": "8/13/2017"}, {"text": "Had lunch there today, it was alright.  My husband and I noticed that the knives, a napkin, and one of the appetizer plates on the table were obviously filthy, so we had to ask for clean replacements right off the bat when we sat down.<br&gt;<br&gt;A short note - they have tons of dishes to choose from, so unless you&amp;#39;re a regular or you absolutely love a very specific dish, be prepared to search through a huge (approx. 20 pages) menu.<br&gt;<br&gt;We ordered the (pork?) potsticker dumplings; those were pretty good.  I ordered their &amp;#39;Factory Burger&amp;#39; for my main meal, and quite frankly, I was disappointed with what I got.  The bread was hard and tough to bite through (unlike the appetizer bread), the onions on the bottom were sort of sad-looking, and while the meat was cooked as ordered, the meal itself didn&amp;#39;t come out very hot (unlike the plate).  In hindsight, I should&amp;#39;ve ordered what my husband had, the &amp;#39;Bacon-Bacon&amp;#39; burger.  That looked a lot more satisfactory, to be honest.<br&gt;<br&gt;The portion sizes are pretty big, so if you choose to order dessert afterwards, I suggest you get it to-go.  I ordered the Mango Key Lime cheesecake, which tasted lovely (but I do wish they&amp;#39;d cut back on the coconut a little bit).  However, for what it&amp;#39;s worth, the prices for just about everything on the menu are...too pricey.  An appetizer (some running about $7-$9) here could get you an -entire meal- elsewhere.<br&gt;<br&gt;As far as service goes, it was decent.  Nothing particularly outstanding or terrible.<br&gt;<br&gt;In short, avoid the &amp;#39;Factory Burger&amp;#39;, it&amp;#39;s a total rip-off.  As a whole, the restaurant is a nice treat...once in a while, when you&amp;#39;ve got the -extra money- to splurge.  It&amp;#39;s on the (much?) more expensive end for casual restaurants.", "rating": 3, "date": "8/7/2016"}, {"text": "I have visited this location several times and have never been disappointed.  Great for lunch and, of course, for dinner.  The Miso Salmon is to die for.<br&gt;Interestingly - I have never had their cheesecake... so I defer to others for a review of that.", "rating": 4, "date": "1/15/2017"}, {"text": "Finally I can give The Cheesecake Factory a good review.  I think this is the first CF I&amp;#39;ve been to that didn&amp;#39;t make us wait around an hour or more for a table - no matter what time or day of the week, and no matter which location.  Came here on the Sunday evening before MLK Day.  The restaurant was pretty full, so I was expected to get a long wait time.  But to my great surprise, we were seated in less than 2 minutes!  Our server had great timing, didn&amp;#39;t rush us but was plenty attentive.  The presentation of every dish was nice, and the dishes came out quick but good timing.  I liked that they didn&amp;#39;t use much salt the way so many chain restaurants do so that we could control that.  I ordered the Honey-Truffle Chicken, and it was delicious.  Two big chicken breasts with a tasty coating set on a huge mound of mashed potatoes.  The asparagus with the truffle sauce had such a nice sweet taste.  Strawberry fruit smoothie was huge and very refreshing.  My dining partner had the chicken avocado club sandwich with fries, huge portion, and he really liked it.  We were stuffed but wanted to get the strawberry shortcake.  It&amp;#39;s as good as always and again - huge.  Three people could share that dessert.  It was a great experience.  Thank you CF of Overland Park for finally being a location that is mindful of customers&amp;#39; time!", "rating": 4, "date": "1/16/2018"}, {"text": "My boyfriend and I came in on a Saturday night and of course the wait was an hour. We didn&amp;#39;t mind waiting because we were sat right at the one hour mark. The bartenders were really great with getting us drinks while we waited! The only thing we were disappointed in was the waiting space. There was honestly no place for us to wait without being in the way of the servers without us having to go outside in the cold. But, I do understand that is a corporate issue at most Cheesecake Factory&amp;#39;s, not this location specifically. With that being said, the food was delicious and we left feeling full!", "rating": 4, "date": "2/26/2018"}, {"text": "We made a vist over a week ago on a Thursday evening waited 45 min for a table, my wife orderd a dinner with tuna the waitress came back said out of tuna so my wife ordered salmon the witress turned around and said also out of salmon, we walked out after that as no excuse for having to wait 45 min for  seating to be  told out of fish, waitress offered to get a manger we said no thanks however the waitress was very apologetic and  not her fault , I wrote a complaint to there corporate office on there web site around a week ago with contact info no response.", "rating": 1, "date": "3/16/2019"}, {"text": "Food is just ok. I haven&amp;#39;t been too impressed by it.<br&gt;Cuban bites on the small plate menu tastes like cheeseburger rollups.  <br&gt;Cheesecake is delicious!  (but hella pricey -- 8 bucks for a slice)<br&gt;My personal fave is the Lemon Raspberry.  Not too sweet and the layer of real cake combined with the cheesecake makes it fluffy and dense.  Yeah... I don&amp;#39;t understand that either.  It&amp;#39;s good though.  Promise.<br&gt;I called in my order and they asked me if I needed it delivered to my car.  I figure after consuming about 8 more pieces of cake I will be requiring this service.", "rating": 3, "date": "3/27/2014"}, {"text": "We have ate here several times and have always received great service.  Hubs always has the fish and chips.  I try something different every time.  There must be 200 items on the menu!  Oh course cheese cake is always purchased.  This time I tried the mango-lime cheesecake....oh my!  I believe that will be what I order EVERY time!!!<br&gt;Try and dine around 4pm, no waiting!!", "rating": 4, "date": "10/15/2016"}, {"text": "Came here for lunch during our most recent visit to the area and were impressed at how fast we were seated, as well as with how often our server came by to check on us. While we initially both ordered burgers, I decided to throw a curveball and order the Fettuccine Alfredo, and the server never missed a beat.<br&gt;<br&gt;When we received our order - completely pleased. For a cold, gray and just genuinely dreary day my meal hit the spot and warmed me up. My wife was pleased with her burger, but stopped early because she wanted a slice of cheesecake. She has a better beat on her priorities than I do since... duh, &amp;#34;Cheesecake Factory&amp;#34;. I decided to slow down from that point as well.<br&gt;<br&gt;The desserts, of course, you can&amp;#39;t lose with. She had a Chocolate Tuxedo Cream Cheesecake while I had the Chocolate Mousse Cheesecake. <br&gt;<br&gt;Not the cheapest lunch ever, but you actually get great portion sizes for the dollar. We always seek these places out while on the road, as we don&amp;#39;t have one in Wichita, but yeah. Still coming off the high from the cheesecake almost a week later.", "rating": 4, "date": "12/5/2015"}, {"text": "Maybe I don&amp;#39;t understand the big hype about this place?<br&gt;<br&gt;I was taking my mom to dinner, I had been here once, she had never been. The place is always busy. Let&amp;#39;s face it. Always. This place turns over some insane amount of business. We walked in, and were not at all surprised to find ourselves a 10-15 minute wait. No biggie. We were given a little light up thing, and told to wait.<br&gt;<br&gt;The wait actually was pretty quick before it light up and began vibrating, telling us it was time to sit. We went back to the host stand, they took our light up thing, and then.... We waited. They lost our table (?) - they forgot who we were (?) - we waited almost 10 more minutes, before they finally asked &amp;#34;What was the name? It&amp;#39;ll be a 10-15 minute wait.&amp;#34; Uh... yea, no. I informed them we had waited, and already turned in our light up thing that should have gotten us a coveted seat at the wonderous Factory a la Cheesecake. They did find a table for us. A table, towards a corner of the restaurant, that sat exactly 2 people, and the table left little room for 2 waters, let alone food or bread. But, it was a table.<br&gt;<br&gt;The waitress took about 10 minutes to come to us with waters, another 10 to bring the drinks we ordered.. and the food. Sigh. Mom ordered an omlette - eggs people. 10 minute cook time, max.. I ordered a salad - the tuna tataki salad - RAW... and still, our food took 47 minutes to arrive to our table. I had watched another couple who came in after us, were seated after us, order drinks, an appetizer, their entrees, and 4 slices of cheese cake to go, and they were out.. before we even received our food.<br&gt;<br&gt;The waitress wasn&amp;#39;t necessarily a bad server. She was friendly, and kept a smile on her face, even knowing how frustrated we were with the incredibly long wait, and ticket times. I just don&amp;#39;t understand how a place like this still doesn&amp;#39;t have the kinks worked out to satisfy a busy night? This place is always busy.<br&gt;<br&gt;On the bright side, the food was delicious - I will just definitely be ordering to-go from now on.", "rating": 3, "date": "11/12/2015"}, {"text": "The Godiva Chocolate Cheesecake is amazing!! Very rich in flavor!! <br&gt;<br&gt;Haven&amp;#39;t eaten lunch/dinner at this location, only the plaza but hoping to change that in the near future! :)", "rating": 5, "date": "8/9/2016"}, {"text": "One of the best Restaurants In town<br&gt;Has everything for everyone. <br&gt;On weekends gets busy with wait time", "rating": 5, "date": "2/18/2017"}, {"text": "We had lunch here today and it was amazing. Service was prompt and portions were huge. I had the Thai Chicken Lettuce Wraps as my meal and they were amazing. They veggies were fresh and the sauces had great flavor. My husband had the nachos and he loved them. Our waitress was friendly and made sure we had everything we could possibly need.", "rating": 5, "date": "7/3/2016"}, {"text": "The food is good and variety but a little bit pricy. However, the portion is big that its shareable if you have small appetite. The cheesecake is the main focus here. You should definitely give it a try", "rating": 4, "date": "8/6/2016"}, {"text": "Food was gross. I got the chicken Alfredo and I&amp;#39;m pretty sure they gave me hamburger helper or the great value off brand version of it, either way I&amp;#39;m positive it came from a box. Bread was heat though, I ate so much bread tonight might as well be made of yeast cause I&amp;#39;m 83% bread now. Cheesecake was fire too, I got that fresh banana creme cheesecake and I tore that up. They probably call it the Cheesecake Factory cause that&amp;#39;s the only thing they can actually produce well.", "rating": 2, "date": "1/31/2019"}, {"text": "The worst.  Have ate here in the past and it&amp;#39;s always been decent but this last time was bad enough that we won&amp;#39;t be back. They have changed how they do hamburgers and sandwiches by putting them on ridiculously hard loaf bread.  <br&gt;<br&gt;I ordered the factory burger which consisted of a strip of hamburger, a heap of greasy onions and some barely melted cheese all on some bread that puts you in danger of chipping a tooth.  <br&gt;<br&gt;My husband ordered the Cuban (which he has enjoyed in the past) it also was on hard bread with barely any meat. <br&gt;<br&gt;We both felt the fries tasted like they had been cooked in really old oil.  <br&gt;<br&gt;Waitress came by like once and made no comment about our not remotely finished plates.  <br&gt;<br&gt;Very frustrating to spend that amount of money on food and realize that we probably could have got &amp;#34;better&amp;#34; food at McDonald&amp;#39;s- at least there I&amp;#39;m not in danger of breaking a tooth.", "rating": 1, "date": "10/18/2015"}, {"text": "The food is not that good, I&amp;#39;ll be honest. It&amp;#39;s a waste of money, time, and honestly, raw ingredients. I think they just do it to call themselves a restaurant because you can&amp;#39;t fill a building with cheesecake and hope to get the crowds they do. Having said that, someone somewhere sold either a first born or part or all of their soul to concoct such a cheesecake. It will make you believe in the devil. Don&amp;#39;t try it, or do. I recommend the original straight up, on the rocks. I don&amp;#39;t know what that means, but honestly, their original cheesecake is magnificent. It is better than the definition of what cheesecake should be. It&amp;#39;s about 7 bucks per slice, and honestly worth every cent. All of their other flavors are great, but gimmicky. The original is life changing. Be careful with this much power. Good day.", "rating": 5, "date": "11/11/2015"}, {"text": "Used to be known for huge servings at a fair price.  My wife and I ate there yesterday (9/26) and my Teriyaki chicken was $17.50 for a breast of chicken and a little rice.  My wife ordered a chicken guacamole sandwich and it was $14.50.  Expensive for what you are getting.  Next time we are going to J. Alexanders for lunch - better food, bigger portions, same price.", "rating": 2, "date": "9/27/2017"}, {"text": "I got hung up on!<br&gt;It was my boyfriend and I anniversary called to see the wait and to get a name in ,the lady that picked up- &amp;#34; we seat upon arrival first come first serve &amp;#34; * click* she hung up on me needless to say didn&amp;#39;t go there for dinner.<br&gt;Amazing food in the past but for 20$ plates they need to hire people that don&amp;#39;t hang up on customers", "rating": 2, "date": "3/24/2017"}, {"text": "Every time I come to this location I&amp;#39;m always greeted immediately by their super friendly hostesses.  The place is always clean and has a very welcoming vibe.  <br&gt;<br&gt;For today&amp;#39;s visit.  We weren&amp;#39;t dining in.  I was making a quick stop to pickup a 7 inch cheesecake.  I didn&amp;#39;t order ahead, but yet they were still super quick and able to accommodate my needs.   Love their red velvet cheesecake and regular fresh strawberry cheesecake.", "rating": 4, "date": "1/19/2016"}, {"text": "Watch your bill here!!!!!  Waitress brought me wrong credit card receipt to sign.  When I caught it,  no apology.  It is a scam that is running at this restaurant.  If it had been a mistake, most restaurants offer a free dessert or something.  They have a very smooth scam going here.  Beware!", "rating": 1, "date": "3/12/2017"}, {"text": "As always, flavorful well presented food. Pear entice salad. Nice combination of flavors that include blue cheese, glazed pecans, viegarette. Great service. And of course the cheesecake.", "rating": 5, "date": "7/29/2015"}, {"text": "Has a wide range of food even though I feel the menu is too overwhelming. I have my usual go to&amp;#39;s. My main reason to go here though is the cheesecake, no one can do it as good as them! I&amp;#39;ve had great service at this location.", "rating": 5, "date": "9/25/2017"}, {"text": "Kitchen is so slow. I waited 45 minutes for my kale and salmon salad. I finally flagged down my waiter and he looked confused. I asked him to pack it up so I could head back to my hotel. Of course no napkins and no plastic fork.  The food was good but I was very disappointed with my experience at this location.", "rating": 1, "date": "10/1/2015"}, {"text": "I DO NOT get it?! People love this place! No clue why people love it. It is OK but not great. I guess if you are rating on cheesecake maybe?! Giant menu that is really just chicken done 50 different ways. This may just be me but I am not going out to eat chicken breast I can do that at home. Most people like this place I think its average at best. Priced too high for what it is but that location and building jack the price up lol! People will probably all not agree with me so sorry", "rating": 3, "date": "1/12/2017"}, {"text": "Not much that I can say that the others haven&amp;#39;t said already. It&amp;#39;s hard to go wrong because they have such an enormous selection of menu items to choose from. <br&gt;<br&gt;It&amp;#39;s not terribly inexpensive, but the portions are ginormous and they use quality ingredients. I think you get what you pay for here. <br&gt;<br&gt;Environment is pleasant if not insanely busy but hubby and I did not have trouble having a conversation and we didn&amp;#39;t feel like the table next to us had to listen to it. <br&gt;<br&gt;If you&amp;#39;re watching your calorie intake, I suggest you go elsewhere. The decadent cheesecake options are hard to say not to and often, each slice hovers around 1,000 calories. Wowza.", "rating": 4, "date": "5/31/2015"}, {"text": "The food is usually really good, so I was prepared to give 5 stars. HOWEVER, on Monday, my husband and I were out celebrating our anniversary. I ordered the lemon garlic roast chicken - it tasted neither like lemon nor garlic. Other than that, it was fine. My husband treated me to the 10inch fresh strawberry cheesecake. The strawberries were bad, and by bad I mean starting to mold on the bottoms. If you&amp;#39;re looking to blow $100 on an anniversary celebration, following in our steps will definitely lead to disappointment.", "rating": 2, "date": "7/19/2018"}, {"text": "I will never again dine here during the peak hour of dinner. Both experiences that I had during dinner was absolutely terrible. My most recent trip was to celebrate my birthday. My sister in law never received her water; my partner never received his food. It took the waiter 20 minutes to take our orders for drinks and 90 minutes before our food came out. When all the food did come out, my partner&amp;#39;s veggie burger did not arrive. A manager came to personally apologize, my partner just told him to forget about his dinner--everyone else was already done eating.", "rating": 2, "date": "5/4/2014"}, {"text": "The Cheesecake Factory is always a safe bet when going with a group since the menu is so huge that everyone is sure to find at least one thing to tempt them.  The downside for me has always been twofold: too many things offered with nothing really spectacular and the crazy calorie load of almost every single item.  I decided to give this place a 4th star today in honor of their new &amp;#34;skinnylicious&amp;#34; menu!  Hooray!  It&amp;#39;s about time you could enjoy a nice lunch here for less than 2000 calories. <br&gt;<br&gt;I had the Thai lettuce wraps and enjoyed them.   The veggies and lettuce were very fresh and the chicken was hot and juicy.  Three little sauces gave me lots to play with, and I do like sauces!  <br&gt;<br&gt;One of my lunch companions had the skinnylicious tacos and found them to be the perfect size.  Three soft shell tacos with a small bowl of Spanish rice as a side.  It was almost like they realized that people might like to eat here and actually have a little room left for a slice of cheesecake! <br&gt;<br&gt;Another lunch companion had the meatloaf and said his wife makes one that is tastier.  Nevertheless he gave it a passing grade.  Our 4th person had a cheese pizza... we teased her a little but she insisted.  I had a slice and found that for a basic cheese pizza it actually had quite a lot of flavor.  Surprise!<br&gt;<br&gt;My slice of turtle cheesecake was boxed to go, and this evening when I enjoyed it with my husband (trust me there&amp;#39;s plenty to share!) we both were grinning ear to ear like children on Christmas.  Yum!   It&amp;#39;s a special once-every-now-and-then indulgence.  Do try the Cheesecake, ANY cheesecake, they certainly do it right.  Be cautious on your expectations of the food though...it&amp;#39;s good but not stellar.  Were it not for the fun decor and the great service I might had downgraded this to a 3 star review.", "rating": 4, "date": "5/30/2012"}, {"text": "I&amp;#39;ve only been here two times, and they were both just for the cheesecake. <br&gt;<br&gt;We&amp;#39;ve made this our dessert place after a date night.  We both picked a piece and shared.  Just ate at the high top tables.  The ones we had were the blueberry which is my other halve&amp;#39;s go to.  Very good &amp;#34;cheesecake&amp;#34; flavor with this sweet blueberry makes it a nice pair with one of their chocolate choices.<br&gt;<br&gt;The only reason I can&amp;#39;t give it a 5 star is because of it&amp;#39;s price...I do know when I go there I will be spending more than expected but it&amp;#39;s really good and don&amp;#39;t go that often because of it.", "rating": 4, "date": "7/18/2014"}, {"text": "Really friendly and accommodating service - smiles in every direction! The food is classic CF - ginormous and average. It served the purpose with nothing to complain about!", "rating": 4, "date": "7/11/2016"}, {"text": "Had the Korean fried cauliflower and it was AMAZING!!! Pork belly sliders were good too", "rating": 4, "date": "3/11/2018"}, {"text": "Good food - wife had the chicken Alfredo with butterfly pasta, thought it was good.  I had the chicken and steak medallion combo and the meat was tender but I didn&amp;#39;t particularly Luke the sweet sauce. Oreo cheesecake was quite delicious!", "rating": 5, "date": "1/1/2015"}, {"text": "My girlfriend and I went to go have a nice dinner on Sunday. We&amp;#39;ve never been to this location we usually go to the plaza. The entrance was dirty the rug was torn. We order water and calamari the calamari arrived before are waters did. The calamari was so greasy when you grabbed it would slide out of your hands. Are waitress went Mia so we left before we even ate won&amp;#39;t be back to this location.", "rating": 1, "date": "8/14/2016"}, {"text": "For today, this review is a solid 2 stars.  If/when we go back, and were to have the same experience, it would drop to a 1 star, based on the food.  The food was 1 star, and the service 3 to 4 stars. When I eat at chains, it&amp;#39;s because I have a general idea that the food is going to be decent, and the service will be good. 1 out of 2 this time.<br&gt;<br&gt;My food was &amp;#39;edible&amp;#39;, but nothing that would actually cause you to &amp;#39;enjoy&amp;#39; your meal. I probably could have sent it back, but I had no hope that the next plate would be any better, and I was &amp;#39;over&amp;#39; being at Cheesecake Factory.  I hadn&amp;#39;t eaten at this one in many years, but the other two I had visited (Plaza, and in Columbus OH) were much better than I had expected, so I had expectations that this one would be good. This visit was 80% less than the other recent visits elsewhere.<br&gt;<br&gt;The server was pretty good, and she kept my water filled, which is no small task.  Although she never did check on my meal satisfaction during the meal, when she cleared my plate, which had half my meal left on it, she showed concern, and offered to get me something else.  I declined, told her thanks, and asked for the check. Sometimes it&amp;#39;s just a &amp;#39;miss&amp;#39;.  Shortly thereafter, a nice young man (the manager, apparently....FT) was at my table, politely asking how my meal was.  I wasn&amp;#39;t complaining, but I wasn&amp;#39;t going to lie about it: &amp;#34;Edible&amp;#34;. He asked what was wrong (entree was very tough, might have been overcooked, just....bleh).  He did everything he could to make my experience a good one, although I declined repeatedly.<br&gt;<br&gt;The manager and server were very nice and helpful.", "rating": 2, "date": "2/4/2014"}, {"text": "Cheesecake Factory never fails to satisfy.  You will always find something to suit your craving.  Their Skinnylicious menu is wonderful!  And I&amp;#39;ve never had a dessert that wasn&amp;#39;t fabulous!", "rating": 5, "date": "4/27/2017"}, {"text": "The waitress was very slow to get to our order, she couldn&amp;#39;t hear anything we were saying and asked us to repeat ourselves after everything we said. She seemed offended when asked if I could sub the soup of the day with the white chicken chili on the soup and salad special, she didn&amp;#39;t even go check the kitchen to see if I could. She side salad was awful! It was just greens and dressing. My salad had no cucumbers or tomatos. Our waitress never came by to check on us during our meal. When she finally did come back to collect plates I complained about the salad. She told me I should of told her and she would of subbed it out. Whatever....okay...then the check came and she said she couldn&amp;#39;t take off the salads because they were a part of the meal. She didn&amp;#39;t tell her manager that we had an issue with the food. Bad service, poor food and totally overpriced. They need less wait times for food.", "rating": 1, "date": "9/23/2017"}, {"text": "Both of the KC Cheesecake Factories have great food, amazing cheesecake, and attentive waitstaff. I love their Sunday brunch. If you haven&amp;#39;t been for brunch, you have to check it out. I got the Monte Cristo last time I went, and it was amazing. I could only eat about half of it. For dinner, I highly recommend the orange chicken. <br&gt;<br&gt;I&amp;#39;ve only had one &amp;#34;bad&amp;#34; meal at Cheesecake Factory, and our waiter immediately corrected it. On my last visit, my orange chicken came out really dark and smelled burnt. I took a bite, and it had a smokey flavor. I told our waiter, and he sprang into action. He took it, got another one started, and came back to the table. He said he ate a piece and made the chef eat a piece, and they both agreed it was totally unacceptable. He profusely apologized, and without me even asking, he told me he removed it from the check.", "rating": 5, "date": "8/31/2014"}, {"text": "I had the privilege of eating cheesecake here on half price day. It was tough to choose when all the choices are half price.....so I had Sara D. help me cause, I figured she eats here more than I.<br&gt;<br&gt;I expected a huge long line, but we were seated promptly. I&amp;#39;ve never ordered anything but cheesecake in one of these. Granted, I asked if the cheesecake is actually made there or delivered frozen.  It is delivered frozen, from I don&amp;#39;t know where.<br&gt;<br&gt;I think it&amp;#39;s way too expensive at full price, but have no complaints about half price. I had a raspberry white chocolate truffle cheesecake. It had sprinkles of shaved white chocolate on top of the cheesecake. I was expecting raspberries, but it had some kind of pureed raspberries instead. It had a chocolate crust with 2 huge dollops of whipped cream. <br&gt;<br&gt;The taste was classic Cheesecake Factory. I realize I can get these at Sam&amp;#39;s Club at any time, but something is kind of cool about half price cheesecake day. But if they priced the cheesecake affordably in the first place,  we could enjoy it any time.", "rating": 4, "date": "8/1/2012"}, {"text": "I&amp;#39;ve been going to this Cheesecake Factory for almost 8 years! An oldie but a goodie. I even had my graduation dinner here and it was excellent. Great food, great service.", "rating": 5, "date": "7/30/2014"}, {"text": "After being seated at a table with no utensils. The hostess grabbed some and threw them on the table saying here ya go. I was waiting for the bf to grab a jacket because it was chilly and was asked by the waitress our drink orders. I eat here quite often but it&amp;#39;s usually to go. Which is what I should have stuck with. I ordered a appetizer salad. That came out in a chilled bowl which was probably the highlight of my meal. After placing our order for the main course we sat for roughly 25 min and was then told that my order( ahi tuna) wasn&amp;#39;t in stock. Well that&amp;#39;s great but now his food is up and I have nothing to eat. ON MY BIRTHDAY! Great the one time I decided to eat in the only thing the offer is an apology and the meal on them. Honestly it left the worst taste in my mouth because it was the lack of care. The manager only had a cavalier attitude and a ugh so what approach to fixing the problem. Now it&amp;#39;s 15 min before midnight with nothing else open in the area. My thought is if they was cooking orders together this would have had been figured out well before that steak had time to cook. We came together, to eat together, and drink together. Which the waitress decided to bring my Arnold palmer once his food was done. By that time I had already got to the level of pisstivity that I couldn&amp;#39;t drink it. I AM OFFICIALLY DONE WITH THIS CHAIN TOGETHER. Neither location can seem to get it right and I have spent way to much money, time, and patience in this place. A hour to get ready and left have only eaten a salad and water. Great birthday celebration. Thanks a lot", "rating": 1, "date": "8/12/2017"}, {"text": "The service was very good, the cheesecake was very good. Serving a happy hour marguerita in a small wine glass? Seems like a distasteful way to balance the reduced price due to happy hour in favor of lower cost for restaurant. Spinach &amp;amp; cheese dip from happy hour menu is really spinach dip, tasty but cheese was hard melted Parmesan cheese on top of dip, not mixed in, chicken nachos are very tasty!", "rating": 3, "date": "1/26/2018"}, {"text": "Terribly small chicken enchiladas. The red sauce tasted like burnt barbecue. The beans and rice was good. I left the restaurant hungry. I won&amp;#39;t order that plate again.", "rating": 2, "date": "3/28/2017"}, {"text": "This is my favorite restaurant ever as far as chain restaurants go. My favorite things to get are the green tea and ask for it with mint. Also they had a luao salad with delicious dressing and wontons but for some reason they took it off the menu. Other things that are amazing are their mac &amp;amp; cheese bites, their avocado egg rolls, four cheese pasta, and their eggplant parmesan. They have really great cocktails as well, my favorites are the strawberry martini and the espresso martini. The cheesecake factory is quite expensive though for me to eat there casually, so I usually go about 2-3 times a year.", "rating": 5, "date": "1/20/2018"}, {"text": "They had such an extraordinary variety of items on their menu that I didn&amp;#39;t know if they would be able to perfect any one item that I ordered, largest menu I have ever seen,and they did! Excellent food, service, and of course..cheesecake!", "rating": 5, "date": "3/26/2017"}, {"text": "We eat out a lot. Probably 5-6 times a week. We used to eat here once a week because my spouse loved their kale and quinoa salad w/ salmon. We stopped eating at this location a couple of months ago due to repeated poor service and food preparation over a 7-month period. We just got tired of complaining. If you have a hankering for their food, I&amp;#39;d suggest going to the plaza location. It is much better.", "rating": 2, "date": "4/22/2016"}, {"text": "This has been the worst experience we have ever experienced. The host station has told our large group that we would be seated in less than 2 hours. We were not seated until we had waited for over 3 hours and when we stated that we could be split up they told us &amp;#34;no, we don&amp;#39;t like doing that&amp;#34;. The organization and courtesy is lacking to say the least. Members of our group have been told to stop going to the restroom. And when we asked why we couldn&amp;#39;t be seated at empty tables, we were told that they are waiting for another group to leave before we could be seated. Doesn&amp;#39;t make sense.  Very disappointed. Never will I return.", "rating": 1, "date": "12/9/2017"}, {"text": "One the better cheesecake factory&amp;#39;s we&amp;#39;ve eaten at.  The hibotchi steak was amazing!  We were in town visiting and got it all to go... food was prepared quickly,  even on a busy Saturday night", "rating": 5, "date": "3/29/2014"}, {"text": "The team in charge of the Chesecake factory is doing a great job. All clients are welcomed as guests, the menu is simple but of high quality and the team is open to accommodate special needs or wishes. The price is fair and the ambience is pleasant. Only one suggestion: light candles on the tables, it would add something special to an already special restaurant.", "rating": 5, "date": "12/15/2016"}, {"text": "This place has always been over priced but when I shared a meal with the wife and still spent over $65, I draw the line. We shared the gross Cobb salad, an appetizer, a 6 inch pizza and one slice of cheesecake. Hate to see what we would have spent on this poor quality of food had we ordered separate. Mind you we have several restaurants that we routinely go to where we spend over $100 each time, but they offer something that this place doesn&amp;#39;t...quality....Do not order the Cobb salad. I can take blue cheese in moderation, but there is no other flavor to this salad", "rating": 1, "date": "5/11/2015"}, {"text": "When you crave a big salad and in the mood for some great deserts, you can&amp;#39;t go wrong here.", "rating": 4, "date": "4/14/2016"}, {"text": "Being a fan of the ahi tuna, I ordered the small plate. It was very savory and did not disappoint. I would however be cautious about ordering appetizers. The Firecracker Salmon only cost a little less than an entree, but what I got was a large plate, half of which was covered in red cabbage, the other half with 4 wimpy little spring rolls swimming in sauce. Scarcely more than a bite each for a party of 4. <br&gt;<br&gt;The Bang Bang Chicken and Shrimp was delicious, though the amount of chicken and shrimp seems to be have decreased somewhat. Louisiana Chicken Pasta was ordered from the lunch special, and was also quite good and not overly salty!<br&gt;<br&gt;Definitely don&amp;#39;t come here if you&amp;#39;re calorie conscious. However Cheesecake Factory as a chain has consistent quality to its dishes.", "rating": 4, "date": "11/27/2016"}, {"text": "I&amp;#39;ve been to many Cheesecake Factories and to this location at least 3 times. <br&gt;<br&gt;Everybody loves Cheesecake Factory because they have such a large menu and everything always tastes so amazing! <br&gt;<br&gt;I&amp;#39;ve never experienced a bad waiter or host, and I&amp;#39;ve never had a bad meal or drink from the bar.", "rating": 5, "date": "8/21/2013"}, {"text": "I stopped in here for brunch around 11 AM with a group of people on a Sunday afternoon.  We were promptly seated and our drinks were served quickly.  I glanced over the menu and quickly realized that it was a bit overwhelming.  I also realized that despite the menu being several pages long, it is somewhat lacking when it comes to vegetarian entrees.<br&gt;<br&gt;I ended up ordering the huevos rancheros.  The eggs came served on two corn tortillas, with fresh avocado, black beans, tomatoes, and salsa.  The dish wasn&amp;#39;t exactly up to par in the spice department, so I requested some Tabasco sauce to give it an extra kick.  <br&gt;<br&gt;My girlfriend had the French toast.  I had a few bites of it, and it wasn&amp;#39;t really anything special.  In fact, it pretty much tasted like some of the French toast I&amp;#39;ve prepared at home.  I was really expecting something a little more elaborate.<br&gt;<br&gt;The food I had probably wasn&amp;#39;t worth the price tag, but it was good.  Not great, just good.  I didn&amp;#39;t partake in any cheesecake, so I can&amp;#39;t comment on that aspect of the food experience here.  This is the kind of place I wouldn&amp;#39;t likely return to if I chose a place to dine.  However, I wouldn&amp;#39;t hesitate to go again and try another dish if someone invited me.", "rating": 3, "date": "10/12/2010"}, {"text": "Eh. I mean you know what to expect. The Nashville hot chicken was pretty good. The pasta wasn&amp;#39;t. The cheesecake is good but the whole thing seems more expensive for what you&amp;#39;re really getting. If you&amp;#39;re going to go, might as well go to the Plaza though.", "rating": 3, "date": "6/16/2017"}, {"text": "Went with a group of seven for a b-day party. Called earlier in the day to make a reservation. Well they don&amp;#39;t take reservations in advance and was told that you can make a reservation an hour before. We call an hour before and low and behold we are told &amp;#34;you have to be here to put your name down&amp;#34;. Geeeeezus!!! <br&gt;<br&gt;Our group arrives and we end up waiting over an hour just to get our table. Not off to a good start but this is where the b- day girl wants to eat so we tough it out.<br&gt;<br&gt;The food was ok and I say just ok because you would expect better for something that you eventually learn to be way overpriced. <br&gt;<br&gt;$10 for a Mojito! <br&gt;<br&gt;I would only come here again for dessert. Everything else is overrated and overpriced.", "rating": 1, "date": "11/11/2012"}, {"text": "Short review:<br&gt;<br&gt;The service at this location is great. I attended with a large party and our waitress was always on top of things, my water glass was never empty.<br&gt;<br&gt;Food: Mediocre. I am never really impressed with restaurants that offer a million different dishes and most of them are things that I can cook at home. My burger was mediocre, and I don&amp;#39;t think I was given enough fries.<br&gt;<br&gt;Cheesecake was also mediocre. I&amp;#39;ve had better for cheaper.", "rating": 3, "date": "3/12/2013"}, {"text": "The survive was not great at all our waiter was very very slow. We had to get up and get her come and clear our table and take our dessert order.", "rating": 3, "date": "8/1/2017"}, {"text": "Chain restaurants are never my thing, even when they&amp;#39;re &amp;#34;upscale&amp;#34; like Cheesecake Factory. Most everyone knows what to expect here: a massive restaurant, with an equally massive menu covering everything from pasta to burgers and back. The food, in my experience, is pretty much the same across all the locations I&amp;#39;ve been to between here and Florida. That is to say, it&amp;#39;s average across the board.<br&gt;<br&gt;That being said, the service was speedy and friendly, any issues we had were taken care of promptly. The cheesecake is still the big draw here. While it&amp;#39;s pretty expensive, it&amp;#39;s awesome. Maybe not D&amp;#39;bronx awesome, but it&amp;#39;s close.", "rating": 3, "date": "7/24/2013"}, {"text": "Overland Park, Kansas store has really good reviews, so my family were excited to have dinner, and cheesecake! BIG, BIG mistake! The spaghetti for children was super spicy, so my granddaughter couldn&amp;#39;t eat it, l had Shrimp with angel hair pasta, the pasta wasn&amp;#39;t angel hair, it was overcooked, the shrimp was burnt, and very rubbery in texture, the sauce was super spicy, it burnt my mouth and throat, l was unable to eat my dinner, my daughter ordered the chicken Primavera, there was no chickin in her dish, after telling waitress twice, they still didn&amp;#39;t fix the dinners or receipt.  This restaurant is known for the cheesecake, so why was my cheesecake like watered down fluff with no taste resemblance to cheesecake, the texture was puffy, and the taste was stale, the waiter that put cheese on my granddaughters plate, leaning over table, put his tie in my daughters soda drink, still no one brought her new drink.  We love Mexican food, and used to spicy meals, but this was so overcooked and spicy, it was impossible to eat, charges almost 100.00 dollars for a very bad experience! Oh and next time, a 49 year old woman should never be considered, &amp;#34;that old lady&amp;#34;. Very disgusted and disappointing!!!! And employees should not complain about customers, at ticket stations! Unprofessional!  Spaghetti is not a spicy food, especially in a 3 year old dish! Overpriced, and gross, with terrible customer service!!.!", "rating": 1, "date": "9/10/2017"}, {"text": "Omg! I have always heard good things about this place. The first time I came to KC and was going to go it was so packed the line was outside and it was going to take 45mins to seat 11 people. <br&gt;We had 3 kids under 3 years old and couldn&amp;#39;t wait that long. <br&gt;<br&gt;My boyfriend and I came to KC for fun and we had to try it again. I am so glad we did. I didn&amp;#39;t realize they had all kinds of food. From Italian, pizza, hamburgers, steaks, salads....almost everything. It took us a long time to decide because it all sounded good. <br&gt;The staff was so nice and our waitress helped explain what was a top favorite. <br&gt;<br&gt;Highly recommend. I got the fried shrimp with fries and slaw and a side of Mac and cheese. It was delicious.", "rating": 5, "date": "7/5/2014"}, {"text": "I made the mistake of going to the cheesecake factory on half-price cheesecake day. The food was good the waitress was great but the manager was not. We have been to this location many times and this time we brought friends with us. <br&gt;The waitress told us we needed to order or cheesecake early as there was a 30 minute wait two hours later still no cheesecake. We were told by another waitstaff that the manager had drop the orders and did not put them back in the order they were taken. I caught up with the manager and told him my displeasure with our visit. He said I&amp;#39;m sorry we were just super busy I will make it up to you let me have your address so I gave him my address now two or three weeks later I have seen nothing in the mail I&amp;#39;m not looking for something for nothing but I do expect promises to be followed through. The one star is for the manager only the rest of the staff was very friendly and apologetic. <br&gt;You can contact me at <a href=\"mailto:Fwilson@weigand.com\"&gt;Fwilson@weigand.com</a&gt;", "rating": 1, "date": "8/16/2017"}, {"text": "This was a first for my husband but a 2nd time visit for me and my 14 year old daughter. It was a packed Saturday evening and the wait took over an hour and we had to park across the street at a grocery store since the parking lot was all full. We called a head and they don&amp;#39;t take reservations on the weekends but we were able to enjoy a few drinks at the bar before we were seated. Once we were seated the server was amazing and had a lot of knowledge on the specials and menus. It was a must that we try the cheesecakes!", "rating": 5, "date": "8/1/2015"}, {"text": "Went here on a weeknight for my Anniversary. Horrible service. Food sucked. Cheesecake was good....<br&gt;Won&amp;#39;t ever dine here again.", "rating": 1, "date": "5/30/2012"}, {"text": "The food was excellent but the proportions are ridiculously huge. I got the lunch size and it was still massive; I can&amp;#39;t imagine what the dinner proportion looks like. It was really cold inside as well, I understand it&amp;#39;s cold outside but when the majority of the guests still have their coats on while eating that&amp;#39;s a little ridiculous. The host was very nice did a great greet and the manager was very nice as well when she cleared some plates from the table. However; the server was not so great. She walked past us several times when we had empty plates and empty drinks. We also needed boxes when we pushed our plates to the edge of the table and she had walked past us again. Didn&amp;#39;t really upsale or recommend anything and we basically had to ask her if we could have dessert and hot tea. I&amp;#39;m a server as well and my review might be a little harsh, but there is definitely room for improvement.", "rating": 3, "date": "1/6/2016"}, {"text": "Such subpar food. I give this place three stars for ambience alone. <br&gt;It is frequented by many. Perhaps due to extra take home portions. The bread bought to the table was cold and dried out. My date found his teriyaki meal was just &amp;#34;ok&amp;#34;. My skinnylicious chicken tacos were fresh tasting and light. But, nothing as far as seasoning and overwhelmed with cilantro. <br&gt;This place costs enough where meals should make you leave happy. I have had better at AppleBees", "rating": 3, "date": "5/23/2015"}, {"text": "Service here is slow, inattentive, disorganized. The Food is consistent but staff needs a sense of urgency big time. Forget it if you are hoping for a quick lunch.", "rating": 3, "date": "1/2/2016"}, {"text": "We had dinner Saturday p.m. and ordered the Chicken Alfredo. My niece ordered Chicken Alfredo off of the kids menu and it was really good but the dish we ordered had no garlic in it. Everyone at the table (7 of us) decided to try both dishes and compare the two. We all concluded that there was clearly no garlic in the watery &amp;#34;grown up&amp;#34; dish. We let our server know but there wasn&amp;#39;t much food left on the plate after everyone decided to sample the meal. We didn&amp;#39;t throw a fit or demand not to pay but after leaving and realizing that the server offered nothing has left me with a very bad reflection of the Cheesecake Factory. We paid $20 for a meal that was just simply awful. I find the restaurant to be overpriced and I cannot see myself returning to this business.", "rating": 1, "date": "12/28/2015"}, {"text": "My husband enjoyed the Orange Chicken - his go to. I was a bit disappointed in the size of the Greek salad for the price - but taste was good. Love being able to get a table in bar quickly!", "rating": 4, "date": "8/8/2015"}, {"text": "my husband and I went to cheesecake factory yesterday hadn&amp;#39;t been in years and then I remember why. I am GF so the options are always scarce so I scanned the menu before I went to see what my options were. I get there and the options are less than what the menu says the only option for gluten-free is rotini pasta on any past selection they have. Before I knew this I had ordered a Chinese dish with rice noodles, so the manager comes and I was grateful and he asked several questions to make sure that I knew what I was ordering, in time we came to the conclusion that they didn&amp;#39;t have what I needed, So I asked about another selection every selection that I made was not going to work and they had taken the chicken tortillas off the menu, that I normally order that I know are safe. So after we figured out GF options were none I craved for, husband was not going to eat without me so he say &amp;#34;let&amp;#39;s go&amp;#34;! We had ordered two drinks, Normally when you order two ddrinks and there&amp;#39;s nothing that they can do to accommodate you theres no charge, Not,  I didn&amp;#39;t drink my drink let&amp;#39;s make that clear so we had that removed from the ticket but we were charge for my husband&amp;#39;s which I thought was Crazy, because of the fact that they could not accommodate me you would think that one drink would have been a courtesy. My husband gladly paid for it anyway and proceeded on to another restaurant so FYI Cheesecake Factories GF menu is just rotini pasta subsitute for all entrees (not much of an option) So disappointed had my mouthwatering for it all week, smh, and missed getting cheesecake", "rating": 1, "date": "7/9/2018"}, {"text": "Service was good, but the food is somewhat of a mish mash.     I ordered the classic Miso Salmon.    It was OK --", "rating": 3, "date": "3/25/2015"}, {"text": "When we are in the KC area, my husband and I tend to go for out of the way non-chains but this time we were too hungry to do our research and decided in our haste to grab a late dinner at Cheesecake Factory.  I&amp;#39;d been to the Plaza location before and prefer its atmosphere by far - this is definitely more of a bland restaurant but still perfectly fine.  While the decor is not to my taste and I was disappointed to find they took my beloved Vietnamese tacos off the small plates menu, I still had a very nice meal.  The host and our server were absolutely professional and friendly too.  We had to wait a few moments in the middle of the dining room for our table to be cleared, and the host made it clear that he appreciated our patience and regretted this happening.  We opted for omelets and they did not disappoint.  I had the chorizo and avocado which was a large, well made omelet with quality-tasting ingredients, alongside home fries and an English muffin.  It was roughly the same price I&amp;#39;ve paid for a lesser omelet in breakfast specialty restaurants.  After the huge portions we could not finish, my husband and I were not up for cheesecake but I&amp;#39;m sure all of the delicious sounding options don&amp;#39;t disappoint.", "rating": 4, "date": "11/30/2014"}, {"text": "Absolutely love the Cheesecake Factory. We sat outside to enjoy the fall breeze. I had the Louisiana parmesan crusted chicken pasta.  It was fantastic. My boyfriend is extremely picky and he got the gumbo and he loved it.", "rating": 5, "date": "10/21/2015"}, {"text": "Let me start by saying I have never written a review but had to write this one after our experience. I would have given a 0 out of 5 stars but that is disallowed. I had the mushroom burger which was bland and edible. My wife had the chicken picata which looked good until we found what was either a wire or a bug&amp;#39;s leg. I dont know because the server whisked the plate away to show the manager as soon as we alerted her. Either way, it was disgusting and I will never eat there again. I can not in good faith review any other elements of the Cheese Cake Factory as I am tainted by that experience.", "rating": 1, "date": "10/15/2014"}, {"text": "I came in the other night and ordered a 10in cheesecake for a Chinese new party that happened last night. She told me that it would take a good two hours to let it thaw out. Picked up the cheesecake around 8:30pm, had it set out until we were ready to eat it which was after midnight. Still was completely frozen. Very dissapointed , especially having it cost $50.", "rating": 3, "date": "2/20/2015"}, {"text": "We went on a Saturday around 4pm and there were plenty of open tables, but we still had to wait.  I thought that was strange.  The food came promptly and was great.  Service was also good!  Decent experience overall.", "rating": 4, "date": "8/4/2014"}, {"text": "Great place to get a good meal and unbeatable desert.  Only con is that it is very popular and the wait can be lengthy.  We were fortunate to walk in and get a table for our party size without a wait.  Server was very attentive to our needs and did a great job of taking care of us. Never had a bad meal here.", "rating": 5, "date": "1/23/2017"}, {"text": "I have heard about the Cheese Cake Factory for a while..... finally got to see what all the hype is about.  The location I went to was huge, reminded me of a casino restaurant in Vegas in terms of décor and size.  There was a 15 minute wait, but that wasn&amp;#39;t too bad because they give you a pager thing.  Explored the cheesecake selection at the take away counter while I waited, lots of variety, but they all looked too sweet.  Our waiter Craig was supper nice, professional, and courteous.  I was impressed with the service.  I was also impressed with the food.  They have EVERYTHING on their menu.  In fact, they even have 2 menus, regular and the SkinnyLicious.  I ordered off the skinny menu, a mojito, Farro salad (Farro, Cucumbers, Tomatoes, Beets, Red Onion, Feta Cheese and Tzatziki. Tossed with Vinaigrette), grilled artichoke, and split a flatbread (Garlic, Shallots and Fresh Herbs) with my friend.  Everything was good.  I least enjoyed the faro salad, next time I think I&amp;#39;d order the mediterranean salad  which has the same flavors minus the faro.  The artichoke was boiled to cook it and then grilled, which gave it a nice smokey flavor.  It was served with a balsamic vinaigrette instead of the traditional butter aioli, which was ok.  Loved the flatbread, but even with two other dishes, I do not recommend sharing at as you will want all six incredibly small pieces for yourself.  My total bill was $23 before tip= AWESOME!", "rating": 4, "date": "6/27/2012"}, {"text": "Crab cakes were alright but the &amp;#34;Everything&amp;#34; pizza was awesome.  My wifes chicken and shrimp gumbo was semi-bland but wasn&amp;#39;t horrible.  It was pretty packed when I went, but they still seated my party of 7 pretty quick.  Our waiter was very helpful and super patient with us.  Prices aren&amp;#39;t too steep unless you&amp;#39;re getting steak or seafood.  I would recommend this place for sure.", "rating": 4, "date": "3/8/2015"}, {"text": "Very fast service. Waitress was nice. Food was delicious. I ordered spaghetti and meatballs. I shared with my 3 year old. Took out her portion and it barleu dented mine. I&amp;#39;m still taking leftovers to the hotel. I will be back again next time I&amp;#39;m in Kansas City.", "rating": 5, "date": "2/26/2015"}, {"text": "We decided to sit on the patio. The waitress greeted us in a timely manner. However while greetings us she proceeded to wipe the corners of her eyes.yuck! Then <br&gt;We ordered nachos and cheesecake.  The nachos were hot but burned on edges. Cheesecake was good as usual.", "rating": 3, "date": "6/26/2015"}, {"text": "Went here as a part of a group whose anniversary fall on the same date. There were about 14 of us with a mixed of vegetarians and non-vegetarians.  Our waiter was extremely friendly and told us all about the menu and which had meat products and which did not, even the vegetarian looking entree&amp;#39;s had chicken broth in them. So she clearly steered us in the right direction.  All in our group was extremely impressed with the level of service we received.  The menu offers a wide variety, a little bit of everything for everyone. We ordered the Bang-Bang Chicken and Shrimp and my wife for the Thai Chicken Pasta. Yummy! It was so filling, we have to take half of it home, we also ordered the Tiramisu cake, delicious!  Restaurant was packed on a Friday night as it was expected, they had a pretty good waiting lounge.", "rating": 5, "date": "2/6/2012"}, {"text": "Went here for a birthday with 20 of my closest friends. Called a few days ahead of time to make sure we could all get seated within a reasonable amount of time after my guests arrived. &amp;#34;We don&amp;#39;t take reservations, but come an hour early,&amp;#34; the hostess said, &amp;#34;and if someone if here for your party the whole time, we will have you ready to go come 6:30.&amp;#34; So, I dropped my husband off an hour early and left to run some errands, only to get a phone call from him minutes later saying that our name is on the list but they don&amp;#39;t need us to be there. So I turned around to get him but stayed behind just in case. Long story short - my whole party had arrived by 6:30 but we stood in a poorly lit foyer for another 30 minutes before they would seat us. And not even seat us all - though when we got there the hostess admitted that one of our 5 tables wasn&amp;#39;t ready yet so some of my guests would have to stand while we physically waited for a table of two to get the hint that they had been there too long. My husband finally had the nerve that the staff didn&amp;#39;t and to asked the couple to leave.<br&gt;<br&gt;I love Cheesecake Factory. I LOVE it. However, I was pretty bummed that we were given the short end of the stick considering that we were worth 10 of those tables of two. Next time I have a large group I am going somewhere where I know we will be treated like a priority.", "rating": 4, "date": "1/1/2012"}, {"text": "Ate here today for lunch and the food was divine!! Boyfriend got the barbecue salmon and I had Evelyn&amp;#39;s favorite pasta which was a vegetarian pasta. Had the strawberry cheesecake for desert. Everything was so delicious. Our server was so friendly too, will definitely come back another time.", "rating": 5, "date": "3/17/2014"}, {"text": "We had to wait 40 to 50 minutes, was seated and greeted by our waitress (Sara). I ordered the hibachi steak, unfortunately they were out of it, so I settled for Steak Dianne. Didn&amp;#39;t think I would like the change, but it was very good. My wife ordered for dessert was Kahului cocoa cheesecake, and they were out of it also.  Waitress (Sara) handled the situation very well. We were very pleased with our visit. Only suggestion I would make is that they get an intercom system to backup the already in place the paging systems. Waitress was very attentive to all our requests and kept us very much informed why she may not have been there when we needed her.", "rating": 4, "date": "12/14/2014"}, {"text": "We started off with a bunch of dirty silverware that looked like they just left it from the last people.  A kind of angry look from the waitress when we asked for some clean stuff almost finished it.  We decided to stay and give it a try anyway.<br&gt;Pasta carbonara was pretty good and service was good as well.<br&gt;Everyone liked their food and had a good time and there were no other disturbances.<br&gt;Overall OK.", "rating": 3, "date": "6/27/2012"}, {"text": "Probably the best of the big chain resteraunts in the US. People complain about the prices... If you think its expensive just dont buy it lol. You know what you are spending as soon as you order idiots.", "rating": 4, "date": "1/19/2017"}, {"text": "Came in while my car was at blue valley goodyear. I asked for a suggestion for a lunch salad as I was undecided. Caleb, kim and jeff were super helpful. Caleb suggested the kale and quinoa salad which I never would have ordered, or found because it is an appetizer salad(he didnt try to push me at a higher priced item) He was right about the salad, it was terrific. it was also large for an appetizer so I didn&amp;#39;t need anything considering they also bring you bread.  Ive always been a CCF fan, this trip just reminded me so. The friendliness behind the bar and great salad made for a pleasant prequel to what im sure will be bad news from the auto shop.", "rating": 5, "date": "7/16/2014"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory a few times before and I generally leave satisfied, despite the ludicrous prices, but tonight was a different story. After looking through the 30 page menu for a good ten minutes, I decided upon the ahi tuna tatiki salad. A few minutes after my waiter took my order, he returned to tell me that they had run out of the ingredients and I would have to choose another dish. No biggie, so I restarted the arduous task of searching through the menu.<br&gt;<br&gt;I decided on a separate pasta dish, but the price was upscaled $5 from the salad I was intending on getting, so I asked my waiter if given the mishap he would be able to discount the difference to make up for it. He said he&amp;#39;d take care of it so I went on with my meal satisfied.<br&gt;<br&gt;Lo and behold, when the check rolled around, no discount had been added. I pointed this out to my waiter and he left for what seemed like thirty minutes to go discuss it with his manager. When he came back he regrettably told me they could not discount the dish, but would be willing to offer me half-off a dessert. I told the waiter I was not interested in dessert and he said there was nothing else they could do, so I took my own discount out of the waiter&amp;#39;s tip.<br&gt;<br&gt;It&amp;#39;s a shame because the waiter himself was friendly and accommodating, but the management&amp;#39;s incessant attempts to nickel and dime their customers is appalling and has driven away a consistent diner tonight.", "rating": 2, "date": "5/14/2011"}, {"text": "Came here with my brother and mom for a late lunch.. We got there right at 2 so we asked if my brother was too late for the brunch special (it ended at 2 PM) and the server said no problem... So he was able to order what he wanted. He got a Belgian waffle and it was really good. My mom got the chicken tacos and she liked them. I had the pasta da Vinci and it was great! Pasta with chicken and mushrooms. I recommend it. We all had cheesecake and other than it being amazing there is not much more to say!! Great experience and our server was attentive. Will be back :)", "rating": 5, "date": "9/28/2014"}, {"text": "I think the best time to go to The Cheesecake Factory is around 10 p.m. on a weeknight. NO wait. <br&gt;<br&gt;just grabbed a few late night bites off their small plates menu (and yes, for the record... the small plates here are normal plates elsewhere).<br&gt;<br&gt;the service was also impressive for this time of night. the food was pretty good, but most of the options are either fried or creamy. <br&gt;<br&gt;I think I&amp;#39;ve realized that The Cheesecake Factory is just a great happy hour or late night place because the food isn&amp;#39;t worth an hour wait otherwise.", "rating": 3, "date": "5/5/2009"}, {"text": "I prefer this location over the one on the plaza. This one is much nicer and the food is much better. The service has always been great, regardless of how busy they are.", "rating": 4, "date": "2/1/2014"}, {"text": "You&amp;#39;ll never hear me say, &amp;#34;Let&amp;#39;s go to The Cheesecake Factory!&amp;#34;  However, at a girlfriend&amp;#39;s suggestion, we made a visit.  <br&gt;<br&gt;I always dread looking through their menu - a hundred pages of boring eats that they dress up with exotic names or fancy descriptions to entice those that are looking for an &amp;#34;upscale&amp;#34; [eye roll] experience.<br&gt;<br&gt;I ordered Miso Salmon.  To my surprise, it was a decent dish.  The fish wasn&amp;#39;t over-powered by the glaze and I quite enjoyed the white sauce that surrounded my bed of rice.  I believe the description said it was a miso sauce, but I didn&amp;#39;t taste a hint of miso in it.  It really tasted like a beurre blanc.  The snow peas were nice and crisp, though I&amp;#39;d wished there were more than five.  I will say that the salmon was slightly overcooked in one area, which was a turn-off, but I let it slide since they aren&amp;#39;t exactly known for their seafood.  Also, there was a disproportionately large amount of rice compared to the size of the fish atop it, and it was some cheap, sad variety of poorly-cooked sogginess.  My friend had a chicken salad sandwich.  She said it was good, but I didn&amp;#39;t sample it, as I don&amp;#39;t see the appeal in any such entree.<br&gt;<br&gt;Our service was extremely slow, but the server was friendly enough.  Besides, we were there to chatter away and we overstayed our welcome by an hour (not during peak hours, it was after the lunch rush...I&amp;#39;m not rude).  This place is really overpriced for what they have to offer, but at least they have a variety of options.  And the entree I had last week makes me feel better about my inevitable next visit.", "rating": 3, "date": "1/30/2011"}, {"text": "First thing, I am NOT a fan of Cheesecake Factory.  Way, way, way overrated.  But, one of our friends loves this place and this is where she wanted to eat for her birthday.  I had the Bang Bang Chicken and Shrimp.  I must admit that the flavors in this dish are delicious.  But what gets me about the Cheesecake factory is the portions are obscenely huge and what is obscene about it is the HUGE portions of carbohydrates, whether it be rice, noodles or some other starchy base.  Way too much starch/carbs.  I&amp;#39;m not a health nut either but it&amp;#39;s like this is being done to make the dish look larger.  Why such gigongo portions?  I did take it home and ate it later after barhopping that night.  At least the carbs came in handy for that.  Anyway, I never have room for desert because of these monstrous portions of over-carbed dishes.  The place is always crowded so we know that people love the idea of the Cheesecake Factory.  The seating was comfortable and pleasant.  The server was pleasant and attentive.  I just don&amp;#39;t really care for this place and would never come here voluntarily.  It&amp;#39;s just me.  I know it&amp;#39;s popular but seriously, the flavors are tame, mediocre at best.", "rating": 2, "date": "5/7/2013"}, {"text": "Went to Cheesecake with a bad attitude because Figlio was so close to closing the hostess acted like she didn&amp;#39;t want to seat us.<br&gt;<br&gt;So with our foul mood, Cheesecake managed to turn our night around.<br&gt;<br&gt;I was anti- Cheesecake because it&amp;#39;s a huge chain.  Shame on me they did a great job.<br&gt;<br&gt;Every single person that dealt with us was professional friendly and upbeat.  The hostess, the bartender, our server and a  manager  that stopped by table during the meal, all great.   (And it&amp;#39;s not like we complained or told anyone there we were ticked off at another restaurant.) <br&gt;<br&gt;We showed up, put on waiting list,  Friday night 9pm. <br&gt;Had drinks at bar, seated in 25 minutes.  Server was friendly and helpful.  <br&gt;<br&gt;Menu is not my cup of tea-too much over flavored salty things BUT I got a simple pasta dish and it was good.  Dining partner had a chicken lemon dish that he practically licked the plate clean.<br&gt;<br&gt;Cheesecake factory not cheap: but the wonderful service and good food make it a very nice evening.", "rating": 4, "date": "7/23/2011"}, {"text": "This place is great to go if you don&amp;#39;t mind spending an ok amount of money. Waiters and waitresses are polite and food usually comes pretty fast.<br&gt;Complimentary bread and butter and a wide variety of entrees to choose from their menu at all times.", "rating": 4, "date": "7/9/2012"}, {"text": "We love the Cheesecake Factory.  Even though I probably get the same thing every time!  Their bread is fantastic and I always get the fettucine alfredo with chicken.  The lunch portion is huge in my opinion and the dinner portion they might as well roll in a vessel the size of the Titanic.  But I always make sure I leave enough room for cheesecake.  My favorite would have to be the Red Velvet Cheesecake.  The service is usually decent.  Even if we don&amp;#39;t have time to eat (because the wait is so long), we always go in to get cheesecake to go!", "rating": 5, "date": "9/5/2013"}, {"text": "Best eggs benedict in town...? The quest continues!", "rating": 4, "date": "6/16/2013"}, {"text": "This one is closer to me so I have come here multiple times. I love the food and the desserts however they can be a bit pricey. I recommend this one, but I haven&amp;#39;t been to the one in the Plaza.", "rating": 4, "date": "9/15/2013"}, {"text": "I enjoy this particular Cheesecake Factory.  The food here is pretty good and I know my wife prefers it here because of the way they cut the chicken on the Santa Fe Chicken salad (which I highly recommend) as opposed to the one on the Plaza.  The Plaza one thin slices the meat and it just doesn&amp;#39;t taste the same.  The one out on 119th is oh so yummy in my tummy.  I&amp;#39;ve had the Jambalaya and the Crusted Chicken Romano and those are both good too.  <br&gt;<br&gt;I am not really big on their steaks and would never go there for steak.  There are too many other great restaurants for that, but I will say that everything else is pretty good.  <br&gt;<br&gt;The only thing I don&amp;#39;t like is the how they have the seating arrangement.  If you want to have more private conversations, make sure you request a booth.  The tables are so close together that you can hear everyone else&amp;#39;s conversation and no doubt they can hear yours.  Plus, the waiter&amp;#39;s butt usually ends up in your face when the other tables are being served.  Not a good situation if the waiter farts while serving.", "rating": 4, "date": "8/5/2009"}, {"text": "Just came back from the Cheesecake Factory in Overland Park as party of 8. The young male Maitre&amp;#39;D seemed more interested in doodling on his little scrap of paper than warmly greeting our party, even though it was a very UN-busy  Monday night.<br&gt;<br&gt;The place looks great inside and its a super cool looking restaurant, but we were seated in a back area where even though we are all young people, it was almost impossible to make out the words on the menu, because the lighting was so dim. <br&gt; <br&gt;The female server was pleasant. But the team around her did little to add to the dining. The food took a lifeime to come. That is always our feeling at Cheesecake Factory, but my wife and I have always put that down to the fact that the place is always mobbed. But this was a basically empty restaurant. There was no excuse for it. <br&gt;<br&gt;While the portions are always massive and our server was pleasing, it was not enough to make up for the shortcomings exhibited elsewhere in this Overland Park branch of the Cheesecake Factory. No warmth, or attentiveness made it a very  lackluster experience. And one I won&amp;#39;t be looking to repeat with so many other restaurants to spend money in in the same vicinity.", "rating": 2, "date": "2/20/2012"}, {"text": "Excellent service- we had 12 in our party and the food was served promptly without delay- we had a birthday cake sent to the table and desserts after were huge- food was super- the grand burrito is big enough for three people. The service made the difference for me on this review- it was at a high level.", "rating": 5, "date": "11/21/2015"}, {"text": "I went in on a busy day, I can understand that, but waiting thirty-five minutes for two slices of cheesecake on any day of the week is unacceptable. The staff was rude, indifferent, or just plain unprofessional and I left seething with irritation (As I am pretty zen, that is actually an impressive feat.). In the event that the experience was not enough to earn them a negative review, when I did get to taste my cheesecake the outer frosting had the distinct taste of butter that has been left unprotected in the refrigerator for too long. I, personally, will never step foot in this restaurant again. Yuck.", "rating": 1, "date": "5/14/2012"}, {"text": "I have to say that the quality of food and the people are what you would expect of a high class chain restaurant. The thing that gets the low stars on this review is the lack of efficiency! We frequently travel as a large group and some places do well with the task, others don&amp;#39;t! In this case we called and made a reservation for 20+ at 5:30pm. We were told that 7pm we will be seated. At 7:40 we were finally seated. The servers were great and did what was expected. For some reason the time of service was terrible! I could assume that it was the size of our group but we were not the only ones with issues. It took almost an hour after ordering to get our food and once we were finished they asked for our desert order when he we gave. After ordering desert we were swiftly given our checks and about 30 minutes later were given our desert, ALL in To go bags. On my way out I asked to speak to the manager which took about 10 minutes, the reason I was given for the delay is that &amp;#34;he was putting out a lot of fires&amp;#34;. At that point I let him know that although there was nothing he could do at that point, I would be leaving this review. Again the servers were attentive, food quality was great but the overall experience was not good. Probably improved by the amount of alcohol that was consumed by our group! If you decide to go here don&amp;#39;t be on any kind of schedule", "rating": 1, "date": "6/15/2017"}, {"text": "Long wait, they said 30 minutes and it was 1 hour 15 minutes.  Felt sorry for our waiter he was waiting on the entire section...poor management at this franchise.  Food was cold when it finally arrived an hour later.  Horrible experience!", "rating": 3, "date": "9/2/2012"}, {"text": "Awesome cheesecake; good coffee; attentive waitress remembered our order from 3 months ago!!", "rating": 5, "date": "10/3/2012"}, {"text": "Usually both food and service are good. But last time we were there, we got a new server (she told us she was new) and we had a not-so good experience. Sure, she was still a new server there, but couldn&amp;#39;t they put someone a little bit more trained for our table since we had a young son who is not so patient. We waited for our drinks for 15 mins. Alcohol drink came out before water or my sons juice. My sons food came out next, but didn&amp;#39;t get his juice yet. so my son had to eat most of his meal without any drinks. Finally I had to get up and asked another server for our water and juice. Waited another 20mins for our food. My husband ordered his burger medium rare but came out well done. But since my son already finished eating by the time our food came out, we did not ask to remake the burger again. (Didn&amp;#39;t want to wait 30 more minutes for another one) I didn&amp;#39;t give 1 or 2 stars because I know usually they are good. I wish our server could have some help from other experienced server. Very stressful experience.", "rating": 3, "date": "12/9/2014"}, {"text": "Ate here tonight and was greatly disappointed with the service. Server had no people skills. Actually had no server skills either. She left dirty plates on our table, acted like she was doing us a favor. Bill was over $100 and the service was less than fast food.", "rating": 1, "date": "8/23/2015"}, {"text": "My family just left this location, we ate dinner this evening on the patio. We have eaten here many times and always been fairly satisfied, however this evening was an awful experience. We were there to celebrate a birthday, and I feel bad for my sister in law that she had to endure that as her birthday dinner. <br&gt;Let me say that the food was fine, other than a very room temperature and soggy salad for my husband. Our waitress, Tanya, was so unfriendly that it was strange. She had to be asked several times for water, kids menus, and drink refills, which we had to flag her down to get. She never checked on us unless someone was waving their arms. She left salad plates and bread plates on the table that was small to begin with, so that my husband finally moved them to a bussing station himself so as not to elbow one to the floor. <br&gt;What should have been a decent experience was just plain uncomfortable. We were all very frustrated, by the end of dinner, and she took so long to come back, that we left without dessert, which was kind of the part some of us were most looking forward to. <br&gt;I won&amp;#39;t not go back, simply because we probably won&amp;#39;t be seated in her section in all likelihood, but if we are I&amp;#39;ll ask for a different server.", "rating": 3, "date": "8/22/2015"}, {"text": "We went here as a large group of 14-15. We had called ahead of time and asked for a reservation and when we got there at the time they told us, they said it was going to be another 45-60 minute wait. We were starving and decided to wait in the lobby. The floor manager wasn&amp;#39;t very polite, I understand we were a bunch of students waiting, and we did crowd the lobby a little but she did not have to treat us with such disgust. We didn&amp;#39;t mind though, what really set me off was when an elderly man had walked in with his wife, he had made a reservation too,  and she said &amp;#34;you will have to wait, we accidentally have given your table to someone else&amp;#34;. What is the point of making reservations if you won&amp;#39;t even get the table?  To pass the time, some of us went to the whole foods and explored the area. When we came back, we were finally seated but it was so crowded! We were seated in next to the booths. For drinks we had Ordered &amp;#34;house made lemonade&amp;#34;. The rims of the glasses were coated with sugar and it was very sweet. It tasted like all the flavoring was at the bottom of the glass and the top was water. I had ordered the chicken farfalle pasta. Now originally it comes with pacetta and mushrooms, but I do not eat pork or beef and I hate mushrooms, so I asked if I could have it without them. It took about 20-30 minutes before the food came, we had bread and butter at our table. When we finally got our food, I dug straight in. I first noticed that there were mushrooms in it, i disregarded it. But then as I took and bite, I tasted something strange. They had put pork in my pasta. I immediately started crying and freaking out, considering its against my religion to eat pork, I had gotten the manager, I was teary eyed ,and she brushed me off and called the waitress. I do not think they understood how upset I was. The waitress sent it back. In 10 minutes I had gotten the replacement, however it did not have the same saucy texture and it was piping hot. The food looked okay but my appetite was gone. My friend said however, it was not the best. Considering how over priced it is, the service and the food, we should have went to Olive Garden. However, the cheesecake was DELICIOUS! The one positive. The restaurant itself was Egyptian themed which was interesting. The bathroom was fim and it smelled good, which is weird.", "rating": 3, "date": "12/19/2014"}, {"text": "My overall experiences here are typically pretty good. The servers are very friendly, the food always tasty and the nice variety of the menu is also great. Everyone can find something if you have a big group. This is an incredibly nice location as well.", "rating": 3, "date": "1/20/2012"}, {"text": "The Cheesecake Factory, king of the chain restaurants. The one thing I like about chain restaurants is that I can rely on items being available (I honestly think that&amp;#39;s what their high points are, you know what the expect). <br&gt;<br&gt;With that said, I went to The Cheesecake Factory Saturday afternoon because it was National Cheesecake Day. I am not one to ignore such a day so I decided to stop by and pick up a slice of cheesecake (the deal they had going was half off a slice of cheesecake/1 per customer). <br&gt;<br&gt;I decided to go to the bakery counter and get my cheesecake to-go. The girl taking my order was extremely sweet and patient as I decided exactly which cheesecake I wanted to try. I went for the chocolate coconut cream cheesecake....let me tell you it was the most divine piece of cheesecake I have had in a long time. It has a macaroon type crust, tons of coconut and chocolate chunks throughout the cake. I of course could only eat half of it and left the other half for later (I can never finish a slice of cheesecake). So if you&amp;#39;re a fan of coconut cream I highly recommend this cheesecake and for those that are rolling their eyes saying &amp;#34;why don&amp;#39;t you just make your own cheesecake instead of supporting a chain&amp;#34; my answer to you is, if you&amp;#39;d like to spend the $50+ for the ingredients for the cheesecake I make (real honest to goodness NY cheesecake) then by all means please send me a check or money order :)", "rating": 3, "date": "8/1/2011"}, {"text": "I love the décor and the atmosphere.  Their drink menu is fabulous!  The food, fantastic!", "rating": 4, "date": "1/23/2015"}, {"text": "We went for Christmas Eve Dinner 12-2011.  We had a party of 5 and the seated us in the booth tables by the bar.  The chairs were uncomfortable.  It was rather loud, but the surroudings quite attractive.    The food was up to par, as always, and they would have only gotten a 3 star for the food but the Server got them this extra 4th star.  He was wonderful.  He anticipated our needs and was full of laughter.  He could have pulled up a chair and sat down.  We absolutely loved him.  This isn&amp;#39;t a normal destination for us as it is always crowded but we will now think of going here more often.", "rating": 4, "date": "1/3/2012"}, {"text": "A waste of time. The food is pretty expensive already but the quality here is worse than the other locations which makes it feel like you&amp;#39;ve been slapped when you walk out of there. You already know you&amp;#39;re going to overpay, but then they give you crappy food too. I have given it a few tries and it is consistently bad even on the weekend. The food is just not prepared well at all. Crunchy rice, dry meat, chewy shrimp, cold bread- all at the same meal.", "rating": 1, "date": "8/6/2011"}, {"text": "Ordered a couple of Seared Tuna dishes to go.  Tuna was just sliced too thick. Thicker than any of the other 30 Cheesecake Factories I&amp;#39;ve been to across the nation.  I don&amp;#39;t like my fish gummy.", "rating": 2, "date": "7/28/2011"}, {"text": "The menu here is extensive, and the representation of various ethnicities, diverse, but, alas, today I am here to experience cheesecake in all it&amp;#39;s glory.  For those of you that would mock this establishment as merely a common restaurant chain, I say...don&amp;#39;t mock it until you&amp;#39;ve tried it!  They didn&amp;#39;t become a chain for nothin&amp;#39;.  Cheesecake Factory, as the name implies, does cheesecake, and does it well, I might add.  The list of delicious options, just like the entrees, is no less extensive.  Today, my mouth is watering for the Adams chocolate peanut butter cheesecake.  If you, as I, am a peanut butter and chocolate aficionado, then this is the cake for you .  Rich and luscious cheesecake with an in your face peanut butter punch.  This my friend, is not for the faint of heart.  This is dense, soul satisfying, and delicious.  Come, be a believer, and sacrifice your waistline to the cheesecake gods.  Your belly will be glad you did, even if your calorie count will cringe.  I say conquer, pillage, and plunder.", "rating": 5, "date": "7/20/2010"}, {"text": "Great Place! The atmosphere is great for a date, love the lighting! The menu is like 7 pages and there is so much to choose from! The portions are huge! My husband and I always split a meal and most of the time there is still some left from that!! My favorite desserts there are the red velvet cake, the lemoncello, and the peanut butter fudge cake!!! It&amp;#39;s always so hard to decide! My husband is not a cheesecake fan so he always gets the black out cake and eats it within minutes!", "rating": 5, "date": "2/28/2011"}, {"text": "allright,  Cheesecake factory has added things to thier menu including small plate appetizers and small salads. if anybody every had thier regular salads i deem the &amp;#34;vat of salad&amp;#34; enough to serve 6 people as a salad.. could the small plate be perfect size. YES!   this afternoon i lunched on the patio and ordered the balsamic house salad. WOW was it good and i&amp;#39;m really not a dressing fan. i had my standard tex mex eggrolls which were excellent and also a banana cream cheesecake to go.  it was a gorgeous afternoon and i couldnt really think of a better lunch out reading on thier patio.  they have a ton of new dishes through the new menu.", "rating": 4, "date": "5/3/2010"}, {"text": "I don&amp;#39;t venture to The Cheesecake Factory often and each time I do actually go, I remind myself why.  The service is fair to poor.  I hate to generalize their wait staff in that way, but the last waiter I had confirmed my feelings about that.  We had several people waiting on our medium sized party (7) and I never truly knew who our waiter was.  We were left to view our menu&amp;#39;s for WAY too long.  You would think that they woud get the hint when the conversation at the table turned to, &amp;#34;Where did our waiter go? and He has been gone so long I have forgotten what he/she looked like.&amp;#34;  Despite the service, the food was good.  I had the lunch salad and pizza.  The salad was big enough to eat by itself, so at least I got another meal out of the pizza.  If you like Starbucks iced green tea, their Sweetened Green Tea is great here too!", "rating": 3, "date": "11/29/2008"}, {"text": "This has been my favorite restaurant since 10 years. Yes, drinks are expensive so I just get coffee or tea, but the food is outstanding. I had California sandwich for breakfast and it was huge! Crab dip is to die for, mushroom flatbread, pastas, Kobe beef burger, Salomon, just everything we had was always delicious and tasty.", "rating": 4, "date": "5/4/2013"}, {"text": "This applies to TCF restaurants in general.  The food is OK.  The food prices are not cheap.  The dessert prices are outrageous.  The menu reads like a boring novel that doesn&amp;#39;t end soon enough.  There&amp;#39;s not enough private seating available; I&amp;#39;m not into having lunch or dinner bumping elbows with my fellow masticators (get your mind out of the gutter, masticate means to chew).", "rating": 2, "date": "1/27/2011"}, {"text": "The Cheesecake Factory is very much a love/hate type of restaurant.  I think it lies somewhere in between a VERY upscale Applebee&amp;#39;s and the type of mega-sized gourmet restaurant you would see in a Vegas casino.<br&gt;<br&gt;They get points for their diverse menu selection (the menu is a 10+ page book!) and that their food usually tastes fresh.  None of their entrees has ever really &amp;#34;wowed&amp;#34; me... except for their cheesecake.  If you go there, you can expect a good meal (but not great) served in a gigantic portion that will almost ensure you will be leaving with leftovers.<br&gt;<br&gt;I will come back and edit this review when I realize exactly why I&amp;#39;ve never really liked The Cheesecake Factory.  Could be the lack of originality, could be the fact that almost everything on their menu is between 1000 and 2000 calories, or it could just be the fake-feeling atmosphere.", "rating": 3, "date": "9/12/2010"}, {"text": "My husband and I decided to go to Cheesecake Factory to celebrate our 4th anniversary. We are very picky on where we choose to eat. I have ate at Cheesecake Factory a few different times and have always enjoyed the food. I was very impressed with dinner and the service was great. I really enjoyed my time and did not feel rushed. We ordered cheesecake to go and that was also wonderful. I would recommend Cheesecake Factory to anyone.", "rating": 5, "date": "4/11/2011"}, {"text": "Worse call in experience.  I was on hold for over 30 minutes. Staff did not care, no effort was made to expedite my order or compensate the cost. I have been to chain location&amp;#39;s all over the country and have never had such an experience.", "rating": 1, "date": "10/25/2013"}, {"text": "Don&amp;#39;t get the Skinnylicious Asian Chicken Salad, it was awful. Barely any chicken, the flavor wasn&amp;#39;t good and it was pricey ($14.50) for basically just lettuce and carrots.  My friends ordered the lettuce wraps ($5.95) and really liked them.  I think they had as much food as I did at half the price.  Speaking of prices, they are a little higher than I expected.  The staff was nice but service was slow.  It was so noisy I could barely hear the person sitting directly across from me.  Too many negatives - I won&amp;#39;t be returning.", "rating": 2, "date": "7/18/2012"}, {"text": "So good, love the flavored ice tea.  It&amp;#39;s always a favorite and brings the same satisfaction each time.  Chicken Madiera is a favorite.", "rating": 4, "date": "7/9/2013"}, {"text": "We love visiting KC, and one of my fav restaurants to revisit is the Cheesecake Factory. But it seems like every revisit, the place seems to have gone downhill on service. Maybe there&amp;#39;s better competition based on new experiences elsewhere. We had a birthday in the family, and was eager to have a great enjoyable dinner. We waited about 1 hr for our table, reason was big party of 8. Hence, we see parties of 9-10s that came after us that got seated before us. Then finally, we get a table and the server tells us all the fresh fish is out, even not your frozen cod or whatever fish they use for fish n chips is out. Then after talking to the manager, all of a sudden the delivery truck just delivered fresh fish on a Sunday evening, after we already ordered. Needless to say the food was okay, wasn&amp;#39;t worth it all that wait and scarce menu options. Dissappointing to say the least, maybe they should just stick to desserts.", "rating": 2, "date": "5/24/2014"}, {"text": "Called to place my order in advance, was put on hold twice. Told it would be ready in 20 minutes, I arrived 25 minutes later. Had to wait 10 minutes to pick up the order that was there waiting for me. Only one worker who was taking orders on the phone, taking orders for cheesecakes and supposedly checking out the to go orders. The manager was talking to a co-worker about the cheesecake container for to go orders. Took 10 minutes for someone to come and help take care of the customers. Don&amp;#39;t do to go orders there unless you are willing to wait a long time.", "rating": 1, "date": "3/21/2013"}, {"text": "If I were to review based only on deserts this place would get 5 stars hands down, no question. Though the menu is huge the vegetarian options are disappointing. They have quite a few dinner salads yet all of them have meat. Though I can order it without the chicken, it bothers me to pay $13 for a salad when I am not getting the meat. The salads should have two prices a price without meat, then an option to add meat for an additional charge. By doing this the vegetarians won&amp;#39;t feel &amp;#39;ripped off&amp;#39;. <br&gt;I tried the portabella mushroom sandwich. The portabella had a tough skin and wasn&amp;#39;t enjoyable at all. The grilled cheese is very good but with a menu like their I shouldn&amp;#39;t have to order a grilled cheese. I usually order the Chicken Thai lettuce wraps and sub avocado for the chicken. They are wonderful that way. My main suggestion for the Cheesecake factory is to add tofu to their options. That way, vegetarians can sub the tofu for meat. That would open up the menu greatly.", "rating": 3, "date": "8/12/2010"}]}