{"address": ["10120 California St", "Omaha, NE 68114"], "monthly_reviews": {"2019": [[0, 2.0], [1, 3.0], [2, 3.5], [3, 3.5], [4, 2.5], [5, 3.0], [6, 3.5], [7, 3.5], [8, 3.0], [9, 2.5], [10, 2.5], [11, 2.5]], "2017": [[0, 2.5], [1, 2.5], [2, 2.5], [3, 3.0], [4, 3.0], [5, 2.5], [6, 2.5], [7, 3.0], [8, 3.0], [9, 3.5], [10, 3.5], [11, 3.5]], "2020": [[0, 2.5], [1, 2.0], [2, 2.0], [3, 2.0], [4, 2.0], [5, 2.0], [6, 2.0], [7, 2.5], [8, 2.5], [9, 2.5], [10, 2.5], [11, 2.5]], "2018": [[0, 4.0], [1, 4.0], [2, 3.5], [3, 3.5], [4, 2.5], [5, 2.5], [6, 2.0], [7, 2.0], [8, 2.0], [9, 2.0], [10, 2.0], [11, 2.0]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "Awful.  Ordered a mushroom burger which came out with 3 leathery mushrooms and the burger was burnt.<br&gt;Also ordered a skinny chicken pot pie. It was lukewarm and not good at all.<br&gt;First time, we have been there, and we will never go back. The food was bad and also took 40 plus minutes to come out after we ordered.<br&gt;For the amount of money we spent, the food should have been phenomenal.<br&gt;Just bleech.", "rating": 1, "date": "10/16/2019"}, {"text": "I travel a lot for work and appreciate Cheesecake Factory simply for the fact that I always know it&amp;#39;s a safe bet. I can get the same meal and service here as I can in Buffalo, Seattle, OKC.... The service at this specific location was lovely, fast and attentive. I have no complaints!", "rating": 5, "date": "12/12/2019"}, {"text": "I made arrangements to have brunch at the Westroads Mall location. We were promptly seated and the server took the drink orders and allowed us amenities time to peruse the menu. Bread was brought after the order was taken. Food was served quickly even though the restaurant was getting filled to capacity. Getting the check and take out containers took longer than it should from the server who was getting bombarded with requests from other nearby tables. The greeters did thank us upon leaving the restaurant which was unexpected. Overall, I had a pleasant experience at this location and will be back soon.", "rating": 5, "date": "12/16/2018"}, {"text": "I would not recommend this restaurant if you want to make a reservation! I called this restaurant several times within 2 weeks of my birthday to reserve a table for 16 people. I was not allowed to make a reservation and they told me I was not guaranteed a table for a party of that size. They do however offer reservations for up to 6 people through the yelp app. I was turned away from coming to this restaurant for my birthday dinner even after offering to pay a percentage in advance to the server for tip. They refused my business and after this experience I will not come to this restaurant in the future. Luckily a smaller restaurant named &amp;#34;Jams&amp;#34; allowed me to reserve a table last minute and we ended up with 24 people, but the Cheesecake Factory made it clear they didn&amp;#39;t want our business. No adult birthday parties allowed here!", "rating": 1, "date": "2/12/2020"}, {"text": "So me and my friends visited the place. Had to wait long to get a seat but it was worth the wait.  We got a perfect table with a view outside and the weather that day added to the ambience. I ordered the Louisiana chicken pasta and along with that chicken samosas. Both were excellent and to add with it the Cabernet Sauvignon was just perfect. My friend ordered a veggie burger and margarita. He was also happy with the order. To end it all we ordered the classic cheesecake and a tiramisu cheesecake. I have always loved the cheesecake here. So in all a great experience. Nice ambience and good food.", "rating": 5, "date": "5/20/2019"}, {"text": "We had a really kind server and the food was excellent as always!  We ordered several slices of cheesecake to go and when they were out of the white chocolate raspberry the server offered me several other options. I declined and when he brought our cheesecakes to us he let me know he&amp;#39;d selected one of his favorites as an apology for not having the one we wanted!  We go here each time we are in Omaha and I highly recommend you do too!", "rating": 5, "date": "3/1/2020"}, {"text": "Always great food and our waitress was awesome!  Will definitely be back again to enjoy the drinks and cuisine!", "rating": 5, "date": "7/5/2019"}, {"text": "Went for Sunday brunch at 11am place was not busy at all. Waited 10 minutes before server came to our table we ordered ,then she came back with our drinks and some bread.  Waited 27 minutes before they brought out our food. Mine was Ice cold and mu husbands omelet was hot but his potatoes ice cold. Had to go find server to have her take food back never did get my food back so had manager take my meal off of bill. NEVER AGAIN will I go there.", "rating": 1, "date": "2/23/2020"}, {"text": "Let me start by saying that I appreciate what this restaurant (as well as many others in the community) is doing to remain open and safe for dining in during these tough times. That said, we had a pretty disappointing experience last night when normally I&amp;#39;ve had nothing but good experiences here in the past. First, many of the customers were not wearing masks when walking around the restaurant. In fact, they didn&amp;#39;t even have masks at all. I understand this may be beyond the control of the restaurant and management staff, but I just want other potential customers to be aware as many other restaurants and businesses in the community are being very strict with not allowing those without masks in. We waited patiently for a table and when we were sat, the seats of the table were not cleaned well. There was grease and crumbs on the booth seat. This is disappointing considering the importance of proper sanitization with COVID. Second, we weren&amp;#39;t given bread before our meal and had to ask our server for it. Then when our food came out, much of it was cold. At that point, we didn&amp;#39;t bother sending it back because it was close to closing and we were just pretty hungry. Our server was not super attentive either and we had to get her attention for several things we needed throughout our meal. I&amp;#39;ve worked in restaurants before so I am very empathetic and understanding of what this business and others are going through right now with the pandemic. However, I really think many of our issues with our visit were a bit disappointing.", "rating": 2, "date": "8/8/2020"}, {"text": "Great brunch items. Great price. Super laid back atmosphere. Was a good time. Get cheesecake to go.", "rating": 5, "date": "8/19/2020"}, {"text": "If you&amp;#39;re placing a to go order make sure you have an extra 30-40 minutes to wait for it after the scheduled pick up time. Scheduled pick up was for 4:20 on a Wednesday and we finally got our order 35 minutes later! Food was tasteless but the cheesecake was good. If we go back it will only be for the cheesecake but then what&amp;#39;s the point bc you can get it at Walmart/Costco now.", "rating": 1, "date": "2/12/2020"}, {"text": "I&amp;#39;m giving 4 stars as long as you know what you expect when going , this is a chain restaurant that does stuff ok. We got cheesecake to go this time. Peanut butter one was ok Oreo on was way to sweet", "rating": 4, "date": "4/1/2019"}, {"text": "I did have some problems with picking my food order up at the Cheesecake Factory yesterday afternoon  In these times with the CV19 virus, many restaurants are trying to reconfigure how they serve their customer.  In this case, I selected curbside, which means a time is selected for the food to be ready, I show up, park in a designated area, let the restaurant know I&amp;#39;m there with either a text, or phone call and the restaurant delivers the food to my car.  Minimal contact.  The Cheesecake Factory hasn&amp;#39;t accomplished this procedure very well.  I was early.  I called the number to let them know I was there.  I told them what number stall I was parked, my type of car &amp;amp; color, and I waited, and I waited, and I waited.  A car pulled up in the curbside delivery spot next to me.  They immediately got out of their car, went in and picked up their order and left.  I then got out of my car, went in and asked if I had the wrong interpretation of curbside food delivery.  They asked if I had called them to tell them I had arrived.  I said yes, in fact I was a few minutes early of the designated time.   They commented they were busy and had not been able to get to it (there was only 1 person sitting on the waiting bench as this was before 4 pm, I&amp;#39;ve been to Cheesecake Factory&amp;#39;s all over the USA, they were not busy).  My 3 bags of food were on their bottom shelf, now just slightly warm and I had a 20 minute drive ahead of me.  I give the Cheesecake Factory only 1 out 5 stars for their process control and adherence to it.  The food was still good, but only lukewarm by the time we sat down to eat.  Bottom line?  There are equally good restaurants closer to me in Northwest Omaha.  They will always get the nod now before the Cheesecake Factory for curbside, take out and delivery.", "rating": 1, "date": "6/20/2020"}, {"text": "This experience was awful.  Ordered scampi and pasta eas SO   I couldn&amp;#39;t eat it. Complained to waitress and she offered mashed potatoes or other pasta. I chose pasta which was s dry sticky mess.  The customer next go me also ordered the same dish 20 minutes later and complained about the same thing. I spoke to the manager and she was not hellful. She looKed like she was going to challenge my complaint. No offer of any compensation.  Awful. Awful mgnt. Uneducated chef.   Never again at that location.  Too salty. Sorry.", "rating": 1, "date": "2/1/2020"}, {"text": "We went on National Cheesecake Day and got there early so we didn&amp;#39;t have to wait.  My husband ordered the Pasta Napoletana and I ordered the Louisiana Chicken Pasta.  Both were great. I like that you can order off the lunch menu until 5:00 so that&amp;#39;s what I did. Even the lunch portion was big enough for a couple of meals.  The Cajun Jambalaya Pasta is my favorite pasta but I decided to try something new.  <br&gt; <br&gt;I had planned on ordering the Snickers Cheesecake or Chris Outrageous Cheesecake but was told that neither one was available because they change flavors.  I was pretty surprised they would remove the Snickers Cheesecake as it is the #1 selling candy bar.  I ordered the Reeses Peanut Butter Chocolate Cake Cheesecake and my husband ordered the  Hershey&amp;#39;s Chocolate Bar Cheesecake.  We asked that it be put in a to go box like we always do but she said because it&amp;#39;s a special they have to serve it on a plate and then she will put it into a box.  Seems like more dishes to wash and more work for our waitress to me. Our waitress did a great job of keeping our drink glasses filled and boxing up our food. <br&gt;<br&gt;I didn&amp;#39;t care for my cheesecake.  The description said layers of caramel (which I love) but it was more like layers of peanut butter and it was too much for me. My husband enjoyed his.  Before our next visit I will be calling ahead to make sure they have my favorite cheesecake Snickers back into the rotation. I have a feeling I&amp;#39;m not only complaint they have had about that.", "rating": 4, "date": "8/2/2019"}, {"text": "I ordered a cheesecake online for my mother-in-law&amp;#39;s birthday and as I was checking out, there was an option to add a dark chocolate &amp;#34;Happy Birthday&amp;#34; plaque, so I went ahead and added that to the order. BIG MISTAKE!!!! <br&gt;Not only was my order not ready 45 minutes AFTER the pickup time assigned to me, the plaque looked like a kindergartener made it. <br&gt;I am HIGHLY disappointed in what I received for $3.00.<br&gt;Disappointing experience to say the least.", "rating": 1, "date": "5/7/2019"}, {"text": "Food was delicious, drinks was served quickly but they forgot to serve my spouses wine. Their service does not reflect their price. I also order 3 cheesecakes to go and got no disposable forks.", "rating": 1, "date": "10/11/2019"}, {"text": "Gosh. Me and my boyfriend came in last night. They &amp;#34;didn&amp;#39;t have any bread left&amp;#34; so we received no bread. I thought they would give us something complimentary because that happened but no, it&amp;#39;s just that&amp;#39;s how it was. I order a shrimp bistro pasta and the shrimp is was not even breaded like how they would normally prepare it and I asked for parmesan and they said they were out for the night. I&amp;#39;m not coming here again.", "rating": 1, "date": "9/28/2019"}, {"text": "The only reason I&amp;#39;m even giving 2 stars is because our waitress (Ashley G) handled our situation very well. <br&gt;My boyfriend and I came in for a lunch date and were expecting to spend around $60 with a good tip. I had been boycotting CF for about 2 years after I spent $25 on one drink and slice of still frozen cheese cake. <br&gt;Today I let my BF choose where he wanted to go for lunch, CF or cheddars and he wanted CF. <br&gt;We were seated in a very cramped corner which wouldn&amp;#39;t have been a problem but the women next to us had staring problems and we had no where to look other than at the wall or them.<br&gt;There was also SO many flies. Everywhere, the ground, on the windows all over food. That comes to the ground as well, freakin crumbs, food, just nasty like they hadn&amp;#39;t swept in days. <br&gt;Like I said our waitress did amazing, we had ordered Crab Artichoke dip and it was horrendous. Smelled like cleaning supplies and the dipping bread it came with was harder than concrete. My BF said to our waitress it wasn&amp;#39;t very good and she took it away and took it off the bill no questions asked. She said the manager would be coming to speak with us after he got out of a meeting but we watched him walk around and avoid our seating area. <br&gt;When the bill came it was $35 for one nacho appetizer and 2 slices of mainly frosting cheese cake. <br&gt;Overall the server was a 10/10 thank you Ashley G <br&gt;The food was a 2/10 <br&gt;And the prices were a 0/10", "rating": 2, "date": "6/20/2019"}, {"text": "If you are worried about safety and exposure to Corona virus, do not eat at The Cheesecake Factory. They are not organized enough to provide a safe and healthy environment. We had a reservation through Yelp but waited in a crowded entrance for over 30minutes before being seated. There was no way to socially distance. Even if you waited in your car until table was ready you&amp;#39;d still have to walk through the crowded waiting area. The bar area was not open and every other table was blocked but what&amp;#39;s the use if everyone risks exposure while waiting? I won&amp;#39;t be back. Other local restaurants have better standards figured out and I will choose those establishments.", "rating": 1, "date": "6/7/2020"}, {"text": "I was very disappointed with my lunch to go at the Cheesecake Factory. I&amp;#39;ve been several times in various cities and have always been disappointed with my entree. But because their cheesecake is so scrumptious, I really wanted to give them another chance after years of no patronage. Unfortunately, it was the same old story. <br&gt;<br&gt;When I ordered on the website, they had the choice between pick up and curbside. I selected curbside, thinking it would be like any other curbside service. When I arrived, no such thing existed, so I went in to pick up my order. I paid, and the worker asked me if I wanted silverware. I said yes, and she give me a spoon. I asked for a fork but was told they were out. How does a restaurant with a to-go service have no forks?? <br&gt;<br&gt;I ordered the bang bang chicken and shrimp for $19.99. The picture online looked delicious. I also requested that there be no onions or zucchini. When I opened my lunch to eat, I immediately noticed that both were in abundant supply in the dish. This was frustrating because not only was I given the option to modify to my dish online, when I picked it up the worker confirmed out loud the modifications that apparently got missed. I was able to eat parts of the dish very carefully picking around the veg I didn&amp;#39;t want, but it drastically affected my eating experience. I was also disappointed in the sauce. It was described online as a Thai, coconut, curry type sauce which sounded right up my alley but it didn&amp;#39;t have much depth of flavor nor was it particularly Thai inspired. I expected a lot more for $20. <br&gt;<br&gt;I did order a piece of cheesecake as well, which was fabulous. I guess this is just the last nail in the coffin for their savory menu. Just not their thing.", "rating": 2, "date": "6/8/2018"}, {"text": "So my family and I decided to have dinner here before going to the Orpheum to see the last performance of Hamilton. Walked in at about 4:00 PM and it was really busy but we&amp;#39;re seated pretty quickly. Our waitress was very friendly and it took a while for us to decide what to eat but we were not disappointed in anything at all. We started with the egg roll sampler and every one of those eggrolls were delicious my favorite was avocado and my son really loved the cheeseburger egg rolls. How we got the shrimp scampi with pasta and wow those shrimp were huge!! It sure filled him up. I opted for the lunch special which was a chicken almond sandwich with soup and a salad. The vinaigrette on the salad was absolutely delicious I wish I had asked what it was and also the soup had big chunks of chicken in it and it was totally out of this world. My son not being too adventurous opted for the cheeseburger sliders with fries which he said he loved. By the time we&amp;#39;re done we had no room for dessert but we did get a slice of the Dulce De Leche cheese cake to go. I would highly suggest visiting this restaurant it was my first time but I would definitely be back they&amp;#39;ve got a very vast menu of items I would love to try the next time we go there!!", "rating": 5, "date": "9/30/2019"}, {"text": "The word that comes to mind when I think of The Cheesecake Factory is decadence.  This location does not disappoint.  I&amp;#39;ve never had a disappointing meal here.  Some of my favorite items are the Tex Mex egg-rolls,  Steak Diane, and grilled salmon.  The last time we went we had Linda&amp;#39;s Fudge Cake, which was so good. If you like chocolate cake more than cheesecake, try this one.  The service here is also really good and very accommodating.", "rating": 5, "date": "2/8/2019"}, {"text": "Everything is yummy except the pastas- huge dish not so great on flavor. We went about 4 or 5 times so far. The service always outstanding and the food is above delicious. The salads, starters, steak, my last try was chicken and was to die for. Mouth watering cheesecake display - you can&amp;#39;t go wrong. Great place! Try the lemon raspberry cheesecake, also the mousse chocolate or the Oreo... the red velvet is amazing too... well can&amp;#39;t pass the cheesecake!<br&gt;<br&gt;*Still Amazing!! (Jan/2018) <br&gt;Food tasty incredible delicious", "rating": 5, "date": "2/15/2018"}, {"text": "I love Cheesecake Factory! However, this location is all around disappointing. I visited on a Tuesday afternoon. The entire restaurant was very quiet, yet it was a 10 minute wait for us to be seated, even though almost every table was open. The hosts and manager alike all seemed very flustered and were not welcoming. Once we were seated, it took a long time for our waiter to come over. The waiter was very short with us, slow to bring us anything, and seemed upset when we asked for basic things. Though the service was bad, the food is still great! I highly recommend the fried calamari and Crispy Chicken Costelletta. Overall, the food was tasty but the staff were disappointing.", "rating": 2, "date": "5/21/2019"}, {"text": "My bill was $68 and I did not tip due to slow, terrible service. My friend and I were there for almost two hours! I check my card the next day and I find a completed transaction for $76. This is fraud! I am not happy and taking money off someone&amp;#39;s debit card without permission is illegal!", "rating": 1, "date": "11/8/2018"}, {"text": "Cheesecake Factory is always on point with food. I had the shrimp appetizer. Really, really good.<br&gt;A large group after a graduation. Could not accommodate all for sitting together(possible 2 hour wait). We chose to sit anywhere great choice, was already late in the evening.", "rating": 3, "date": "5/15/2018"}, {"text": "Not really worth the money. My first issue was the seating, it was my son and I and they gave us a small table to sit at which we couldn&amp;#39;t even eat comfortably. I don&amp;#39;t know if they just assumed things, but when my son and I go out, we&amp;#39;re not known for ordering just 1 dish. We like to try different things so we were limited on that but I didn&amp;#39;t say anything about it. I was too tired from work to go through the motions. But anyways we get our food it was bland and not even hot. My son ordered ribbon pasta with sauce and it was dry as ever. I ordered fish in a light butter sauce with loaded potatoes and veggies. Fish was not seasoned or hot and the only thing that had flavor was the loaded potatoes. If i ever do eat there again Ill only be ordering cheesecake and appetizers.", "rating": 2, "date": "1/4/2020"}, {"text": "Very good food. Our service was excellent. Only reason for 4 instead of 5 is for price.", "rating": 4, "date": "3/12/2019"}, {"text": "We got seated right away and waiter was plesent. He made sure that my tea glass was full. He also gave us enough time with their menu as is a good sized menu.<br&gt;<br&gt;He brought us bread as we looked at the menu.<br&gt;<br&gt;The food came out as ordered and was fair amount of food to eat. I had enough spaghetti for two of us. The meatballs were tasty as well.<br&gt;<br&gt;The only drawback was the price. The price for two was about thirty.dollars.", "rating": 4, "date": "3/14/2019"}, {"text": "This is a fun place to grab a meal. It can be bit noisy and crowded, but that&amp;#39;s just a result of its popularity.<br&gt;<br&gt;They have a huge menu. It&amp;#39;s sort of an ongoing punchline actually. It&amp;#39;s essentially a book. On the plus side, they have something for just about every taste. That makes this a pretty agreeable place to dine as you can have a half dozen people in your party craving a half dozen different kinds of cuisine and they can all find something to eat here.<br&gt;<br&gt;I tend to stick to either the Shepherds Pie or the Orange Chicken. I&amp;#39;m not sure why. Both are excellent. I&amp;#39;ve tried one or two other entrées on their menu as well, but I always come back to those two. The Avocado Egg Rolls are pretty tasty too, but incredibly rich. <br&gt;<br&gt;Prices are a bit more than what it seems most non-regulars are expecting to pay. It&amp;#39;s not so much because it&amp;#39;s upscale or fine dining (though it is a nice place to dine) but a matter of supply and demand. This place does not hurt for business and so they&amp;#39;re priced accordingly.<br&gt;<br&gt;I&amp;#39;ve heard from a lady that works as a trainer at a Cheesecake Factory in another city that a shockingly large amount of their food is indeed prepared from scratch each day. This is in contrast to most chain restaurants where everything seems to arrive already prepared in plastic bags.<br&gt;<br&gt;I detest the seating. Ask for a booth and pray you get one. If you get a table you will be sitting close enough to other dining parties to literally rub elbows and when their waitperson shows up and stands between the tables to hand out food or drinks you&amp;#39;ll have a waitperson butt in your face. At this price point I really shouldn&amp;#39;t have to feel like a sardine in a can.<br&gt;<br&gt;Service is usually pretty good.  I&amp;#39;ve had great service and I&amp;#39;ve had marginal service, but I&amp;#39;ve never had terrible service here.<br&gt;<br&gt;Restaurant is always very clean.", "rating": 4, "date": "1/28/2016"}, {"text": "There is definitely a draw to Cheesecake Factory than every American feels. It might be the large dining space, or the expansive menu that has something for all. If not the first 2, well, it&amp;#39;s the cheesecake! There are so many flavors it&amp;#39;s really hard to go wrong with any of them. My personal favorite is the classic with the strawberries on top or the white chocolate raspberry. <br&gt;<br&gt;CF suits families, casual diners, first dates/date night, pre-prom, etc. It&amp;#39;s all American! This is the only location in Omaha/Lincoln, and I know people from Lincoln who drive to Omaha just to eat here. <br&gt;<br&gt;Service is always pretty good as they have 1 million servers. The only negative here is that it&amp;#39;s such a busy location that sometimes there&amp;#39;s a wait to eat if you don&amp;#39;t come at a good hour. Overall this is a very popular chain that has done well for many many years. It&amp;#39;s a staple at malls across America, and we just can&amp;#39;t seem to get enough!", "rating": 4, "date": "4/15/2016"}, {"text": "Friendly staff. We were quickly seated and enjoyed prompt service by a young man named Tre. <br&gt;Lemon Drop Martini- delicious with a sugared rim and lemon garnish. <br&gt;Orange Chicken-generous portion size; crisp chicken and the perfect amount of orange sauce with snow peas and shredded carrot. Had to take half of it to go. <br&gt;Fried Shrimp Platter- came with fries, tartar sauce and cocktail sauce. Good portion size. Shrimp were crisp, served hot. <br&gt;Key Lime Cheesecake- refreshing and delicious. The Cheesecake Factory does their name justice!<br&gt;Salted Caramel Cheesecake-rich, creamy. Perfect for caramel lovers. <br&gt;Wonderful atmosphere, great service, and food arrived quickly and well-made. The biggest challenge is walking by the cheesecake case and having to choose!", "rating": 5, "date": "2/15/2019"}, {"text": "The place is so fancy, very clean and cozy.. their foods are great though we only got appetizer and cheesecake, it&amp;#39;s great! The price are good. The staff are very welcoming and accommodating . The location is really great too since it&amp;#39;s next to the big mall with a huge parking space.", "rating": 4, "date": "11/30/2018"}, {"text": "I can see why the &amp;#34;Chicken Madeira&amp;#34; is one of their specialties, because the chicken breast was the most tender and flavorful I have EVER had!  And that it was topped with mushrooms, asparagus and sauce just made this entire mouthwatering entree absolutely exceptional!!  Love, love, love!!  By the way, they also make the BEST Mojito!", "rating": 5, "date": "6/26/2019"}, {"text": "The cheesecake here is AMAZING. It might be a little pricey but it is worth it. You will not regret ordering a slice, it is a humongous piece that will fill you up. The food here is good, and the servers are always joyful. It&amp;#39;s a go to place to eat, and enjoy the atmosphere.", "rating": 5, "date": "7/30/2019"}, {"text": "I went a little before 6pm and they weren&amp;#39;t crazy busy, but they were so slow! People were even walking out because they were tired of being forgotten about. The food is great though. I got the turkey and avocado sandwich with no bacon, fries and ranch, and the Oreo  dream extreme cheesecake. It was all SO GOOD. The ranch wasn&amp;#39;t your normal ranch, but it was delicious. And I&amp;#39;m not a huge fan of cheesecake and loved the Oreo one. I highly recommend this restaurant if you don&amp;#39;t mind potentially waiting awhile.", "rating": 4, "date": "7/31/2018"}, {"text": "Terrible service, the food took forever to get and then tasted like it had been under the warming lights for the past half hour.<br&gt;Dinner for 7 took 2 hours and then the waitress wanted me to pay the bill before she even brought us our dessert.<br&gt;Complaining to the manager did nothing.<br&gt;Needless to say we will not be going back there anytime soon!", "rating": 1, "date": "3/23/2019"}, {"text": "I had the chicken mandarin.  Chicken was just right and and had the perfect flavour.<br&gt;I have been there several times and my brother worked there for 7 years.<br&gt;It is a great company and they have always tried to make Sure that you leave there happy if there are any issues with your experience. Make sure you share them because they will correct any error!", "rating": 5, "date": "12/5/2017"}, {"text": "I have always loved The Cheesecake Factory as a franchise, visiting ones in Florida, Georgia, and a I think Missouri. All of them were superb. However, the franchise in Omaha is just lacking. I have seen other people send their food back. I usually will not send my food back but I had them mangle my orange chicken so much so that the batter was just falling off in chunks. I have gotten the chicken bellagio a couple of times, one time I could tell they turned the heat up too high while cooking and the sauce became super liquidy, my noodles looked like they were sitting in soup. My daughter got the kid&amp;#39;s pizza once and it was over baked, a little burned underneath. My potstickers have come out over cooked, a little hard from frying too long (and I usually LOVE those potstickers). My most recent experience, we called from the mall parking lot nearby to see if there was a wait. They said there wasn&amp;#39;t, we drive over and there is a 20+ minute wait, not a huge problem but if your toddlers are hangry I would rather have just hit the food court. There was really no need to embellish the truth on the wait, The Cheesecake Factory will always get business.. anyway, I got the chicken bellagio again, this time it was really dry with no sauce and the prosciutto tasted like it had been left out too long. Very unfortunate, I love The Cheesecake Factory anywhere else.", "rating": 3, "date": "5/26/2019"}, {"text": "This is probably the saddest I have ever been at this place. I get here expecting to get my usual.. ( the snickers cheesecake)... and it&amp;#39;s not on display. I ask the waiter if they still have the snickers cheesecake and she tells me no. I am mad and very frustrated that I&amp;#39;m not getting my favorite cheesecake. I advise anyone that likes snicker in cheesecake form not to come here. PLEASE BRING BACK SNICKERS CHEESECAKE!!!! <br&gt;<br&gt;Otherwise come if you like any other cheesecake. Great service thoooooo", "rating": 1, "date": "8/5/2019"}, {"text": "By far the worst service I&amp;#39;ve ever experienced. Our server, Ayla never came around to refill our drinks and we waited over 40 minutes for our slices of cheesecake to come. While we were waiting, the manager of the restaurant came by and didn&amp;#39;t bother to apologize for the wait but instead said, &amp;#34;At least you guys look like you&amp;#39;re having fun.&amp;#34; I&amp;#39;ve gone to other Cheesecake Factory restaurants before and never experienced service this bad. I do not recommend the one at this location and will not be going back.", "rating": 1, "date": "4/8/2019"}, {"text": "This used to be our favorite restaurant but honestly we are done going there. Upon entering and putting our name in the girl at front was less then friendly. Then she was rude to another couple that walked out because of her. Then my son ordered an Asian chicken dish that not only came Luke warm but halfway through eating it discovered that the chicken was raw in the middle! We Complained to our very nice server who got the manger who was apologetic and of course didn&amp;#39;t charge for that meal. Maybe a piece of free cheesecake would have been nice as well. But the whole thing ruined our dinner. And the chicken in my salad was actually overcooked. Don&amp;#39;t think we will be coming back which is a shame but we have repeatedly bad experiences at this location.Praying my son makes it through the night without food poisoning.", "rating": 1, "date": "12/28/2019"}, {"text": "Three words...Chocolate Tower Cake absolutely delicious a bit on the rich side but delicious. The chicken samosas are so good. I also love the Kale and Quinoa Salad .", "rating": 5, "date": "3/10/2019"}, {"text": "My wife and I went to the Cheesecake Factory for the first time and we were very disappointed. <br&gt;<br&gt;We both ordered the Rennet&amp;#39;s lunch special (I think that was the name?) she got the turkey sandwich with the default salad and I got the almond chicken salad sandwich with the Caesar Salad and we each had the soup of the day. <br&gt;<br&gt;My almond chicken salad sandwich tasted like tuna/ranch on buttered toast- not bad tasting, but not even close to what I expected. <br&gt;<br&gt;Her default salad had very little (watered down?) ranch and neither of us wanted it - it sucked. My Caesar salad was good, except my croutons may have been a little stale. <br&gt;<br&gt;Our soup of the day - apparently they only have 1 soup that changes each day? Anyways, it was a mushroom based soup that tasted sweet.. some people might be into that, but I hated it (wife thought it was alright). I hate throwing away food, but I couldn&amp;#39;t stomach it past 3 spoon fools. <br&gt;<br&gt;I thought the food was fairly expensive for what we got, let alone the fact the food sucked.. <br&gt;<br&gt;The ONE thing we both really enjoyed was the Cheesecake. The cheese cake lived up to the hype we heard, but even then it wasn&amp;#39;t without issue- we got two cheese cakes with Lunch and requested 2 to go. The two brought out to the table were great and large, the two we got to go were already packed up and significantly smaller- not sure if that is their protocol or not, or if certain cheesecakes are larger than others and the two we had dinning in were two of the &amp;#39;larger&amp;#39; cakes and the two we got to go were &amp;#39;smaller&amp;#39; cakes.<br&gt;<br&gt;Despite the cheesecake being good, we don&amp;#39;t plan on going back, ever. <br&gt;<br&gt;I&amp;#39;d recommend just going for the cheesecake/desert if you go at all, but this was our only time here, so we obviously can&amp;#39;t spell for the other menus items. <br&gt;<br&gt;One last closing note- we had a good server.", "rating": 2, "date": "3/22/2017"}, {"text": "So with limited expectations, I actually was impressed with CF. We came here for a business lunch and as went with the Cobbs Salad, I will say the chicken that was a part of it was very juicy as opposed to the usual diced cold chicken. The server also brought out a bread basket and the Diet Coke must&amp;#39;ve been in a 32 oz cup because that thing was huge! It wasn&amp;#39;t super busy but the hostess seemed disheveled when we asked to be moved to a different area. Regardless CF isn&amp;#39;t my bag but for lunch, it&amp;#39;s suitable.", "rating": 3, "date": "2/9/2018"}, {"text": "We love Cheesecake Factory and visit them all over, when I travel. After 10 years away, I was delighted that Omaha now has a CF. However...<br&gt;The table was dirty. The menus were dirty. The salt and pepper shakers were dirty. The utensils were dirty. When we asked to have our table cleaned, the hostess acted as if we were crazy. A young woman appeared and &amp;#34;cleaned&amp;#34; the table with a filthy rag, pushing the crumbs onto the top of the table onto the booth seats. It does no good to clean anything with a dirty rag.<br&gt;We should have walked out, but we didn&amp;#39;t. We were hungry and tired, so we stayed. As we left, we noticed that the front door was dirty.<br&gt;There are too many other restaurants that ARE clean that would be happy to have our money. We will not return to Cheesecake Factory Omaha. Very disappointed.", "rating": 2, "date": "5/9/2019"}, {"text": "Best part about Cheesecake Factory is the quality they maintain at every location and you can always expect to get what you are craving out of their large menu.<br&gt;We, the business travelers, turned up here for an easy evening dinner. I had the herb roasted Lemony salmon with mashed potatoes and grilled asparagus and it was yummy and creamy rich. My two other colleagues went for chicken pasta and chipotle salad and were happy. The service was quick and the server was nice and fast. We wanted to get a fast dinner and we were done in an hour which was nice.", "rating": 4, "date": "2/14/2017"}, {"text": "One of our &amp;#34;go to&amp;#34; places!  Lots of selections for the picky eater and great atmosphere. <br&gt;<br&gt;Bang bang chicken and shrimp is my favorite as well as Dulce de Leche cheesecake for dessert--which I highly recommend!", "rating": 5, "date": "7/25/2015"}, {"text": "I Lv the food ....and service <br&gt;<br&gt;Dejanae is the best service !!! We Lv her !!!! So kind<br&gt;<br&gt;We gonna come back here for sure", "rating": 5, "date": "5/4/2018"}, {"text": "Had the salmon salad...they give SO MUCH food and it was cooked and seasoned really well.<br&gt;BUT the avocado rolls are OUT OF THIS WORLD!! They are SOOO DELISH!!!<br&gt;So fresh. They give you a good helping of avocado in each roll.<br&gt;The dipping sauce was outstanding!<br&gt;<br&gt;I use to love this place and then it went down hill... and I gave up on chain restaurants. A friend wanted to go here... so we did. And I am glad I gave them another try... it has been about 3 or 4 years since my previous visit! They have improved. It was outstanding.<br&gt;<br&gt;The bartender was very nice as well...", "rating": 4, "date": "7/29/2014"}, {"text": "Had a celebration dinner set for Sunday night 10/28/18 with 11 people. We were aware they would not take a reservation on a Sunday so 1 of the people showed up early, they would not seat till 1/2 the party was present, when 1/2 the party was there, we were the told there was not a table for 11, they would have to seat us in 2 booths for 6. Not what we asked for or  it was a work team celebration  not separated  booths celebration. We were then told it would be a hour &amp;amp; half wait till we could be seated for 11. Unacceptable, hostess was rude, snotty. Unbelievable. So we called across to PH Chang&amp;#39;s who could have a table together for 11 in 10 mins. When the pager was turned in and said we would be going else where. The snotty little hostess just said ok.  So they let a $370 food table and a $100 tip walk out the door.  Bad experiences lol the way around.", "rating": 1, "date": "10/28/2018"}, {"text": "Cleanliness 4<br&gt;Service 5<br&gt;Food 4<br&gt;Likelihood 5<br&gt;1-5 (5 Best!) 4.5<br&gt;<br&gt;We we greeted by the front desk employee quickly, and seated within minutes.  Our server stopped by to greet us and get our drink order, also within minutes.  Our appitizer arrived and througout the meal our server never let either of our drinks go empty, great work!  <br&gt;<br&gt;She was quick to help, and always a glance away.  VERY good!  Jonny does not get along with seeded buns, and the staff responded without fail to get it replaced quickly.  Thank you.  The restrooms were spotless.<br&gt;<br&gt;She cleared our dishes and tried hard to get us dessert, we were too full.  Manager was in dining room but was not stopping by tables.  Great meal expereince.", "rating": 4, "date": "9/13/2016"}, {"text": "i came to the cheesecake factory for a nice meal, which did not happen. I ordered the fettuccine alfredo, and it had a hint of fish in it. i am not pleased by the flavor. I would NOT recommend if you do not like fish.", "rating": 1, "date": "9/29/2019"}, {"text": "For someplace called The Cheesecake Factory I would expect the best cheesecake I have ever had, blow your mind. It was good. But expensive!! Red velvet was a little squishy.<br&gt;Service was decent. Stopped in for just desert. Water was brought out fairly quick. But service was not over the top either! <br&gt;The restaurant was  clean and well kept. <br&gt;Overall decent experience. But not what I expected!! Cheesecake was good but not the best ever!! But very good!", "rating": 4, "date": "1/11/2015"}, {"text": "It is the Cheesecake Factory. What more can be said? Huge menus, huge portions, strong drinks. I recommend the pot stickers because of that wonderful sauce. They do have some lighter fare menu options for those watching calories. If you get creative, you can stick to your macros.<br&gt;<br&gt;They even have low carb cheesecake but seriously, if you are going to fall off the wagon let it be face first into a slice of their full fat, full calorie laden, mouth watering cheesecake. Be smart, share it with a friend or two.", "rating": 4, "date": "9/23/2017"}, {"text": "This place has gotten way too corporate. There are literally flat screen televisions above their cheesecake counter advertising their food and drink options. Nothing charming about that. In regards to their menu, while I appreciate  variety, their menu is just too large. It is literally 21 pages. Every time I go here I don&amp;#39;t have the patience to go through it. Portions are massive which I am sure some people appreciate but it just isn&amp;#39;t necessary and just perpetuates the cycle of overeating.<br&gt;The other night I got 2 cocktails and just those drinks were $24...way too high for a restaurant chain. <br&gt;The food is good and I always enjoy their cheesecakes  but I think they should scale it back a bit.", "rating": 3, "date": "3/8/2016"}, {"text": "Always a win! I just wish it was so pricy. Why are apps the same price as a dish. Come on..but I still can&amp;#39;t resist those firecracker salmon spring rolls. I got a curry dish was so good...minus the nuts. I don&amp;#39;t like nuts in my meals. My daughter got her go to Cajun chicken pasta. Service was prompt and friendly", "rating": 5, "date": "11/24/2017"}, {"text": "Despite preferring local restaurants, there are some chains that I really love. Unfortunately the Cheesecake Factory doesn&amp;#39;t do much for me. I usually find myself here once a year or so, and the food is good, but it isn&amp;#39;t great, and is a little pricey for what you get. Their cheesecake is very good, though. As a lot of other reviewers mentioned, the menu is huge. It is basically a giant book with any kind of food you could want (burgers, salads, wraps, pizza, Thai food, Mexican food, etc.). On the plus side, you shouldn&amp;#39;t have any trouble finding something on the menu that you will like. It is a little overwhelming having to flip through a giant book (with excessive advertisements and photos in the middle) to look over the entire menu, though. <br&gt;<br&gt;My husband and I went here for dinner on a weeknight. For an appetizer we ordered the Loaded Baked Potato Tots, which were served with ranch. Other than being a little too salty, these were awesome. The flavor was incredible and they were perfect dipped in the ranch. <br&gt;<br&gt;For my entrée I went with the Barbecue Ranch Chicken Salad. The salad was huge and loaded with a large variety of toppings. The dressing was (per the name) a basic BBQ sauce and ranch dressing. The salad was good, but nothing amazing. My husband ordered the Thai Chicken Lettuce Wraps, which were served on a pretty impressive and large tray, and he was very satisfied with his meal. <br&gt;<br&gt;Despite the restaurant being over half empty, we were seated at one of those long booth/table combos in which the tables are RIGHT next to each other, and there was a couple at the next table. The tables are so close that we were awkwardly close to the other people (I accidentally knocked them when I was trying to scoot in). I wouldn&amp;#39;t have minded if the restaurant was even a little crowded, but it was really weird since it was almost empty (and the next 4 tables were completely empty). That couple left and another couple were sat at the same table (more awkwardness). Our server was friendly, but would disappear for long periods of time. We had to chase her down when we wanted to pay after we had waited 20 minutes for her to come back and she never showed. <br&gt;<br&gt;I am sure I will end up here again in a year or so, and the food will probably be good, but it isn&amp;#39;t someplace at which I would go out of my way to eat. I would totally go out of my way to stop in and get cheesecake from here if I was in the area (and they have a convenient counter at the front that makes it easy to do just that).", "rating": 2, "date": "9/24/2015"}, {"text": "This company/management needs to learn how to manage the requests of people who want to come in for Cheesecake to go.  Being told it would take 5-10 minutes to box a slice of cheesecake when there&amp;#39;s no line at the counter is unacceptable.", "rating": 2, "date": "10/15/2017"}, {"text": "Went for Christmas lunch in omaha ,I flew in from arizona with my daughter her chicken pot pie wasCOLD,then my mushroom burger was hot but fell apart in my hands it was so greasy then my d as ughters hot pie came,which was tastless,waiter just laughed, no reduction in bill or offered complementary dessert,gone downhill even dr n in arizona", "rating": 1, "date": "12/24/2018"}, {"text": "The Original style cheesecake was the main reason I came here. And have to say as a staple cheesecake it was pretty ordinary and not what I was expecting. It was good but not good enough. I found the consistency to be much more thicken than others. My favorite part was the crust of course!<br&gt;<br&gt;Our server Doris was very nice and definitely provided quality customer service and made our dining an enjoyable experience.<br&gt;<br&gt;Will be coming back try other cheesecakes!", "rating": 4, "date": "8/19/2016"}, {"text": "Cheesecake Factory never disappoints. Their complimentary bread is always enjoyable. I like going during lunch so I can get the smaller portions for a lower cost. The pastas have never failed to disappoint. I got the Cajun jambalaya and my friend got the spicy chicken chipotle pasta. Both looked amazing! Lastly the atmosphere is pretty nice however it can be a bit odd when they sit you in the row of tables that seat two each. You are sitting close enough to have a convo with the next table.", "rating": 4, "date": "12/20/2015"}, {"text": "Every time I come here I enjoy myself for the most part. The food is good and the cocktails are made to perfection. This past weekend I ordered the Cajun jambalaya pasta which tasted amazing!!! For drinks I ordered a Mimosa which was just ok, and a Typhoon Punch which was the order WINNER! Now every time I come to The Cheesecake Factory, I will have to make sure that the Typhoon Punch is part of my order!", "rating": 5, "date": "1/17/2018"}, {"text": "So far been sitting a while waiting for our host...place isn&amp;#39;t too busy must not communicate well.  Now they are bussing a table ... three more walked by all talking to each other and Im still sitting here oh she finally stopped couldn&amp;#39;t hear a word she said ... &amp;#34;blah blah blah&amp;#34; this place needs an adult around to manage all these kids. <br&gt;<br&gt;We sat where there were 6 spots only needed three they took the extra silverware after I touched it then she touched it and put it back in with the clean silverware and I just witnessed another waiter grabbing said silverware and putting it on table next to us.... and I just had my hand down my pants<br&gt;<br&gt;Im 37 years old and never tasted tea that tasted like sweat tea that wasn&amp;#39;t... then my tea sat there empty my girls half way empty they filled hers and left mine.... not sure am I jinxing myself because I yelp  <br&gt;<br&gt;not impressed", "rating": 2, "date": "6/22/2015"}, {"text": "For the longest time, I resisted going to the Cheesecake Factory even though my wife had been after me to take her there. I thought it was going to be one of those &amp;#34;chick places&amp;#34; that serves soups, salads, small sandwiches, and desserts (emphasis on the latter). I finally gave in and took her there. Boy was I wrong about this place! The food is incredible, reasonably priced, and the portions are definitely man-sized. The service was actually pretty good considering that it was a Saturday evening and the place was packed. <br&gt;<br&gt;If I had any complaint at all about the Cheesecake Factory, it would be that the business it gets would easily support the opening of another location in Omaha. And while we&amp;#39;re at it, let&amp;#39;s put one in Lincoln too. You&amp;#39;d never get me out of the place!", "rating": 5, "date": "4/12/2017"}, {"text": "Amazing service! The hostesses sat us right away. We ordered and not ten minutes passed by before we were served. It&amp;#39;s a clean, fast moving restaurant. My wife and I had a great time.", "rating": 5, "date": "12/21/2018"}, {"text": "If you love a huge variety of cheesecake this is definitely the place for you. If you get overwhelmed by large menus, stick the the cheesecake. Their menu is so absolutely huge it&amp;#39;s ridiculous and almost impossible to pick any one thing from it. <br&gt;<br&gt;On our visit today, we were seated almost as soon as we walked in the door(on a Saturday) and our waitress came shortly after we sat down. She was extremely pleasant and courteous and we got our cheesecakes fairly quickly, considering the bakery had just seen a huge rush. <br&gt;<br&gt;Overall, I was satisfied with the food as well as the service!", "rating": 4, "date": "6/27/2015"}, {"text": "Upon entering establishment, the lady at the front had to lower her nose to ask us how many people. After being seated, we noticed the majority of our silverware was dirty! Disgusting! Waitress promptly brought us &amp;#34;cleaner&amp;#34; silverware. Food was sub par for the price.", "rating": 2, "date": "6/27/2019"}, {"text": "I went to the Cheesecake Factory a few nights ago with my mother and girlfriend. So here is how this went down. We only had to wait about 15 minutes before the buzzer went off and we were seated. No complaints there. The waiter then took our order and disappeared into the kitchen. About 15 minutes went by and no food came; however the waiter came back twice to let us know it was a busy night and to thank us for being patient. Cool. After another 5 minutes or so the manager came by to appologize and thank us for our patience and let us know our food was on our way. Usually I would have an issue with the length of time it took to get our food; however the manager and his staff were rather engaged with us about it so I did not take issue. <br&gt;<br&gt;Next, My and my gf&amp;#39;s dinner was fine. Mac-n-Cheese burger was absolutely delicious. Properly cooked and fantastic. My gf&amp;#39;s Chicken Bellagio was also fantastic. Properly cooked and the noodles were done just right. However, my mother&amp;#39;s Mushroom burger was a disaster. The saute&amp;#39;d mushrooms were so crispy you would have thought they were fried. The burger was so over done, you would have thought you were at a military &amp;#34;burger burn&amp;#34; fundraiser. She choked through half of it before I told her she needed to bring it to the waiter&amp;#39;s attention. Once the waiter came back; she spoke to him about it. He immediately apologized and said that he would go get the manager for us.  Once the manager came, he looked at what was on my mother&amp;#39;s plate and said he would get a new one out for her immediately and apologized profusely. The manager was very professional. Now, we are not the type of people that get &amp;#34;screamy&amp;#34; and &amp;#34;yelly&amp;#34; when things go wrong. Mistakes happen. So goes life. So, the manager asked us what he could do to fix the issue, my mother said she just wanted a properly cooked meal and would leave that decision up to the manager. The manager stated he would get her a properly cooked meal ASAP and he would also comp the meal for the inconvenience. About 8 minutes later, a properly cooked Mushroom burger arrived and it was &amp;#34;excellent&amp;#34; according to my mother. Cool. 3 out of 3 great meals. Cool. <br&gt;<br&gt;Then came dessert. Plain Cheesecake and Pumpkin Pecan Cheesecake. &amp;#34;Oh Em Gee&amp;#34; was it delicious. The Pumpkin Pecan is definitely dangerous. Not overly sweet; but very addictive. Sadly it is &amp;#34;seasonal&amp;#34;. <br&gt;<br&gt;So all in all; the food was good, and management did great in correcting a poorly cooked meal. All things said and done; I have no qualms about going back. I can definitely say that if I a mistake happens in the kitchen-I know it will be corrected promptly. Mistakes happen; and the manager knows how to fix them. A definite recommend.", "rating": 4, "date": "12/29/2016"}, {"text": "Service on a Saturday afternoon was horrible, it took almost 10 minutes before we met our waitress. Nice gal, just slow. The food was ok, my wife ordered the lettuce tacos with chicken,  only 2 of the three had chicken in them. I of course ordered the margarita pizza which was surprisingly good. It had the right flavor and look, but the crust was more of a cracker crust rather than the pizza crust I&amp;#39;d expect. We didn&amp;#39;t want to spend the whole afternoon there so we paid for our food, then grabbed a cheesecake to go. Which of course was amazing. Would I go again for meal, maybe.", "rating": 2, "date": "10/22/2018"}, {"text": "Yum yum in my tum tum!! Shared a nice Oreo cheesecake slice with my husband paired with a glass of white wine. Would like to go back and see what other foods they offer.", "rating": 5, "date": "6/8/2019"}, {"text": "We were seated immediately about 1 foot away from other customers on each side which was an uncomfortable start especially considering the restaurant was not very busy. The food was good but our server was AWOL most of the time.", "rating": 3, "date": "7/18/2017"}, {"text": "Boy oh boy do we need another location in town. We decided to get carry out last night and the Bakery/carry out counter was completely overwhelmed. We were told 30 mins for food, in actuality it was 45 minutes. It would have been longer but we spotted our food being shuffled onto a shelf and ignored, had we not asked about it we would&amp;#39;ve ended up like the guy before us who was ignored for ten minutes while his food got cold. The carry out window forgot our dessert and had us stand and wait for it as they shuffled through piles of tickets looking to see if we had actually paid for it. When they finally bagged it we were told they were out of napkins and silverware.<br&gt;<br&gt;The other issue is the food quality which has been steadily declining as of late. On our last visit we received burned carbonara and the waitress balked at replacing it, the visit before that I received chicken that was undercooked. Last night the asparagus side was inedible, overcooked, and an off color. They also seem to have changed their once delicious carrot cake to a flavorless slice of mediocrity that is 2/3 the size it was previously. <br&gt;<br&gt;I recommend visiting a place that values their customers a little more highly to satisfy your sweet tooth at least until they sort out their management and food quality issues.", "rating": 1, "date": "1/29/2017"}, {"text": "It was the third time today to try Cheesecake Factory since we moved to Omaha.<br&gt;Service: Servers are always smiling and welcoming, good listeners and decisive when asked for recommendations, although specifically as for tonight, the side dish of appetizer was forgotten.<br&gt;Food: Highly recommend the Crispy Crab Bites and Fish Taco, of course, the Mousse Chocolate Cheesecake -- foogasm-awesome, everybody should eat it~! Buffalo Chicken Strips were too salty... I mean, salty-my-ass-off kinda salty, yet the Shrimp Angel Hair was a little bit too bland.", "rating": 4, "date": "1/4/2015"}, {"text": "cheesecake factory used to have some great quality but not sure what has happened. <br&gt;<br&gt;someone please fix the curb side pick-up. on multiple occasions we have not gotten our complete order. when I called mgmt, I was told a gift card would be sent for inconvenience, but I never received. <br&gt;<br&gt;most recently we had side dishes missing with horribly charred salmon. where is the quality control? <br&gt;<br&gt;I feel like the corporate vibe now is get people in and out. the hell with quality control. <br&gt;<br&gt;well, I&amp;#39;ll just go elsewhere local!", "rating": 2, "date": "5/9/2018"}, {"text": "Great food &amp;amp; drinks. Servers are very nice. Would have given 5 stars, the wait on a Saturday is very - very long!  The friendly staff make it tolerable. Highly recommend. Be ready for a very long wait for food if they are busy!", "rating": 4, "date": "9/2/2018"}, {"text": "After wanting to come to the Cheesecake Factory for a while now and just reading lots of reviews, I have changed my mind. First of all your Menu is way to big for everything to be exceptional. I always wonder how everything stays fresh with so many options. I&amp;#39;ve read lots of these reviews and replies seem so generic and not very sincere. With quality cheesecakes, which to you from outside sources, your food should be held to higher standards as well. Sorry I will not be patronizing your restaurant. Sad.", "rating": 2, "date": "8/4/2018"}, {"text": "Only the service and interior gets the star but was not for the silver wears, food nor drinks.<br&gt;<br&gt;Wild mushroom soup tasted really wild!<br&gt;<br&gt;It tasted like they use the mushrooms that&amp;#39;s been in the fridge for longer than 3 days and they just picked the mushrooms out there and use it for the soup I ordered without washing them at all.<br&gt;<br&gt;Pizza tasted like nothing but salami. (Why!?lol)<br&gt;<br&gt;Pasta was blunt... Disappointing event for my birthday...", "rating": 2, "date": "3/18/2015"}, {"text": "Probably shouldn&amp;#39;t sign up with a delivery service unless your staff can handle it. I mean, at the least, don&amp;#39;t lie to the poor delivery dude that you called regarding being out of an ordered item when no such call was made. Passing the buck to another underpaid service worker instead of letting your customer know is weak. I&amp;#39;ll be sure to enjoy the third of the meal that was actually delivered.", "rating": 1, "date": "7/26/2018"}, {"text": "If I could give this experience negative stars I would.  What horrible service and rude responses from a restaurant that is suppose to be known for just the opposite.  I placed a curbside order here today for a full cheesecake and an appetizer with curbside pickup.  They asked my vehicle type and color.  I had a choice of pickup or curbside.  Curbside means they bring it to your car, correct?  Not here.  I pulled up and waited for anyone to come to the car or acknowledge my presence.  I looked around at the sign.  Was there a phone number to call or some other way I was suppose to let them know I was here?  Nothing on the sign said so.  I had to assume that the service of a place like this would have a system worked out such as Outback Steakhouse does where they watch for people who pull up, come out and verify your name and bring the food to you.  Or perhaps their service would at the minimum match a Walmart pick up where they know you are coming and if they don&amp;#39;t know you are there through their app, they have a phone number on the sign that tells you who to call.  But no, not cheesecake factory.  I wait assuming that curbside meant curbside.  If I had wanted to get out and go inside I would have chosen pickup.  So, after about 8 minutes I go inside and ask about my order.  They say I had to go over and stand in the Pick up area which is the same place people pick up cheesecakes.  There is always a line there, that is what I was trying to avoid.  When I asked what I should have done to get them to have brought my food out, they said I should have called.  Called who?  There was no number posted anywhere.  I said that and as I walked away the person who seats customers whispered under her breath &amp;#34;God all she had to do was call the cheesecake factory&amp;#34;.  Are you kidding?  No service and rude behavior! So, over to stand in a line I shouldn&amp;#39;t have had to stand in and, 20 minutes later than when I pulled up, I was back in my car.  I left and went up eat the appetizer I had bought for my lunch.  Cold crab cake bites.  They obviously had made no effort to keep them warm as they were room temperature at best.  I had already left the parking lot, that is in the middle of construction, so I had to go all the way around, park and go back inside.  Talked to the front person who said she couldn&amp;#39;t do anything, got back into the cheesecake line.  Not a separate like- just an area where people are usually buying cheesecake.  After waiting for the 4 parties ahead of me get their cheesecake, I got to a very frazzled girl who was running that area alone, even through there were 3-4 waitresses standing at the end taking.  She took the cold crab bites telling me a manager would be over.  After another 5-8 minutes I got what must have been a new manager as he said it was his first time doing a refund and he didn&amp;#39;t know how.  Most restaurants would try to apologize and do something to make up for my almost 30 minutes of messing with this at this point but no - not here.  I actually had to say is that all you&amp;#39;re going to do about this?  Refund the $8 I paid for cold food?  In any other restaurant they would have tried to do something to save my business but that was obviously not the case here.  After ASKING if that was all they were doing the manager said I guess I could give you a piece of cheesecake.  Wow - what horrible service on every level.", "rating": 1, "date": "4/5/2019"}, {"text": "This was my worst experience at a Cheesecake Factory. The hostess told us our wait would only be 5 minutes but we ended up waiting over 25 minutes. She said this is because some of the waiters showed up late. Our food took forever to get and once we got it, there were several mistakes with our orders. In total, we were at the restaurant for over 2 hours because of the slow service. The only reason I gave this review one star was because the cheesecake tasted good at the end. I will not return.", "rating": 1, "date": "3/3/2018"}, {"text": "I love the Cheesecake Factory and up until a few weeks ago I had nothing but great experiences there. However, the last time I went we had a terrible waitress. She was rude, sarcastic, and inconsiderate. I ended up calling and telling the manager - something I never do. The manager was great. She apologized and made it right. She was so nice and didn&amp;#39;t make me feel like *that* annoying, whiny customer. I really appreciated her response. Five stars.", "rating": 5, "date": "3/30/2019"}, {"text": "Our waiter Matt was a slow as snail. The food was ok but had to be delivered by a food runner that generally means its sat there long enough because Matt the snail never made it back to the kitchen so someone else had to do his job. Our drinks and waters were empty when the food arrived and since Matt never checked on us they sat empty until dinner was almost over. My wife ordered a glass of wine that never showed up so I decided to ask for a manager when he picked up our plates and asked if we needed anything else. We waited for the manager she didnt show, so we tracked down matt at the bar and asked him to make it right... he didnt and handed us the bill....he did remove the glass of wine we never recieved.....nice guy!!<br&gt;On my way up to find a manager she finally showed with little to no apology and was less than accommodating. Never even got to order cheese cake didnt want our hour and a half dinner to take any longer.", "rating": 1, "date": "3/1/2018"}, {"text": "I&amp;#39;ve been to a lot of Cheesecake Factory locations across the US and normally come here because of the chain&amp;#39;s consistency. I came here rather than Granite City because normally everything you order on the menu is good and the service is excellent. While the service was as expected, the Santa Fe Salad I normally order at lunch wasn&amp;#39;t at par with normalcy. Locating any chicken in the salad was a chore. Normally, there&amp;#39;s so much you can&amp;#39;t eat it all. This time I felt like I was on a quest to find it. The same went for the black beans.<br&gt;<br&gt;Meanwhile, every meal that passed by me to other tables looked great and I saw dozens of them. Unfortunately, mine was that fell short. Still, this is a great place for lunch or dinner and of course dessert. Wonderful service and a menu that gives you so many great choices it&amp;#39;ll be a challenge to choose something.", "rating": 3, "date": "9/19/2014"}, {"text": "What can go wrong at the cheesecake factory?  Other than the fact that they discontinued my ultimate favorite cheesecake, the Kahlua cocoa coffee cheesecake, everything else they make is pretty darn good.  Service is also great, waiters and waitresses come by often to check on you and make sure everything tastes great and waters are filled.  I love coming to their happy hour and enjoying their avocado egg rolls.  The menu is enormous so it&amp;#39;s usually hard for me to decide what I want.  What I do love is the Godiva chocolate brownie sundae.  The presentation is gorgeous you almost don&amp;#39;t want to eat it.  But once you do it&amp;#39;s over!  You&amp;#39;ve got dollops of ice cream with whipped cream on top, three pieces of warm brownie lined in between the ice cream and godiva chocolates nestled in the whipped cream to top it off!  It&amp;#39;s pretty amazing I wish I could be eating one right now!  Other than their amazing desserts they also have great alcoholic drinks and I&amp;#39;ve always loved their garlic pasta with chicken dish too.  Like I said, what can go wrong here other than taking away an amazing cheesecake?", "rating": 4, "date": "9/19/2017"}, {"text": "$20 for fettuccine alfredo and it wasnt worth it. It was good, but too expensive. Service was great and we were in and out in an hour. I&amp;#39;ll still come back, but will probably order something thats worth $20.", "rating": 4, "date": "5/4/2018"}, {"text": "I am always hearing how good their food is, and how big their slices of cheesecake are, but honestly? I can make a cheesecake myself for far less. My husband and I received a gift card for Christmas and decided to do car side to go, I was on hold for 15 min and then waited another 15 min for my 3 slices of cheesecake to be ready. I went inside just to get it done with, it was so full in there and the employees looked frantic and run down. <br&gt;If you like loud, over-crowded, over-expensive, chain restaurants, then this is the place for you. I prefer local places.", "rating": 1, "date": "1/16/2016"}, {"text": "Came here a few days ago on a date night with hubby, we dont plan on coming back, except maybe for some cheesecake for carry out. <br&gt;<br&gt;We walked in and were seated right away but we were sat at a half booth half table that barely fit anything on the table it was so tiny! We were practically touching elbows with the people at the table next to us. I&amp;#39;m talking so close we would get wiffs of their breath. It made me nauseous. <br&gt;<br&gt;The server came and got our drink order. When she came back with our drinks we ordered the &amp;#34;fried cheese&amp;#34; for an appetizer. It took quite a while for our appetizer to come out but we are pretty patient so we brushed it off and placed our dinner order when she brought it out. I was not a fan at all. It was fried mozzarella and asiago (I think?) but it tasted really weird, kind of like a loaded baked potato or something. The cheese could have been melted a bit more too.<br&gt;<br&gt;We sat and talked, waiting for probably a good 30 to 45 minutes for our food to come out. I noticed a chunk of food on our silverware that we hadn&amp;#39;t yet used. Hubby said how his silverware felt greasy and his menu was too. <br&gt;<br&gt;Finally the food came out. I got fish and chips like the last time we came here, but it didn&amp;#39;t look very tasty like I had remembered. They also raised the price to $17.99. I tried the fries, they were good. What you would expect. I didn&amp;#39;t even try the slaw, just not my thing. Then there&amp;#39;s the fish. The star, what I was so excited for. It was bland, and WAY overbattered! I couldn&amp;#39;t get a good picture because of the dark lighting but honestly it was like 25% fish and 75% batter. I&amp;#39;m not even kidding. I had to pull off most of the breading to even see or taste fish. The fish was extremely small and thin and over cooked. Some pieces were hard to chew. Tartar sauce was good though.. This meal was not worth the price at all. I felt completely ripped off.<br&gt;Hubby got a burger of some sort that he thought was pretty good, nothing special though. He said they barely put any mushrooms on it and they charged us $2 for a slice of cheese.<br&gt;<br&gt;We were frustrated with the whole situation and just wanted to leave. We waited for a good 10 minutes before our server came and took our food to be boxed up and give us our check. I only ate a few fries and a single torn up piece of fish. Hubby only had about half of his burger. I really wanted to get a slice of cheesecake but I had just witnessed the table next to us wait for 15 or 20 minutes for some, so no thanks. I didn&amp;#39;t think about it until writing this review but with so little food eaten on our plates you would think they would ask if we didn&amp;#39;t like our food but they didn&amp;#39;t. We arent ones to complain and we had things we had to go do. I was so excited to come back but left disappointed. The service was fine but scarce, and the food was extremely unpleasant in my case. I left just as hungry as when I showed up and even went to the gas station on the way to run errands to get a slushie and a snack just to not feel famished! I think it&amp;#39;s safe to say we wont be returning or at least to this location.", "rating": 2, "date": "12/8/2016"}, {"text": "I usually avoid chain restaurants, but today was my Mother&amp;#39;s 80th Birthday and she chose to go here this evening. The first observation is the 80&amp;#39;s Eclectic Hollywood, Miami Vice Don Johnson, interior décor, with a wall of Mordor&amp;#39;s evil eyes staring at you. Quaint. Next observation was our great server Mandi. She answered all our questions, gave advice, told to get this instead of that, a very nice<br&gt; personality. I was going to get the Cajun Jambalaya Pasta, but she suggested the Chicken and Shrimp Gumbo instead (she was from NOLA area, yet a-third Italian) It was very well presented and not too overwhelming seasoning that I have had in other restaurants who try to make Cajun foods. My mother liked her Angel Hair Shrimp (she is pretty picky). My brother and mother split the Original Cheesecake for dessert and they said it was the best they have ever had. While others got a Sunday which was the real thing. I might even go back for some other dishes. Maybe. I was good though for a chain.", "rating": 4, "date": "4/1/2014"}, {"text": "Really wish I could give no stars. We have eaten at cheesecake factory in Omaha Des Moines to Kansas City. It&amp;#39;s one of our favorite places to eat. I always have the same thing. I have the lemon chicken and mashed potatoes. Tonight we were at the cheesecake factory in Omaha and the food was disgusting. My chicken was barely cooked and my mashed potatoes were cold. The server was overzealous in our face most of the evening. It was an unusually poor dinner. Doubt will go back to eat there again.", "rating": 1, "date": "2/4/2019"}, {"text": "Although, I usually like to support small local businesses, I&amp;#39;ve always been a fan of the Cheesecake Factory. I love that they&amp;#39;ve revamped their menu and have a separate &amp;#34;Skinnylicuous&amp;#34; menu; an easier way to control your portion sizes, all salads and entrees are under 600 calories. I ordered the Skinnylicuous Grilled Steak Medallions which were excellent! The meal was more than substantial and absolutely delicious! I also ordered the Red Sangria, which is listed at just 150 calories per glass. I love that I was able to eat out with a friend without feeling guilty after. The regular menu is hugely extensive and a little overwhelming. Sticking to the Skinnylicuous menu helped make my decisions much easier. <br&gt;<br&gt;I noticed on my way in that they have happy hour Monday-Friday 4-6pm, so I will definitely be coming back to check that out!", "rating": 4, "date": "3/15/2016"}, {"text": "Who doesn&amp;#39;t love cheesecake and good food? My favorite restaurant in Omaha. Peanut butter cup cheesecake is my favorite.", "rating": 5, "date": "3/19/2018"}, {"text": "The Cheesecake Factory, the place we usually go after dinner somewhere else to get a wonderful slice of cheesecake.  Never had I actually eaten a meal at a Cheesecake Factory until recently, when my son chose this as his birthday dinner spot.  We rolled in fairly early on a Friday evening and were greeted and seated right away.  <br&gt;<br&gt;To start off, we went with a couple of appetizers: a cheese garlic bread and the chicken pot stickers.  The kids enjoyed the pot stickers but the appetizer only came with five pot stickers.  This is actually a pet peeve of mine (kinda, mostly just an observation).  I cannot for the life of me figure out why restaurants serve five items on an appetizer.  Why five?  It&amp;#39;s an odd number and the only way it really works is if you have five people in your party and really, how often does that happen? If it&amp;#39;s a couple, the fifth one sits there until someone decides they want to be the selfish one to eat the last one.  If you have a party of three, someone loses out!  Party of four, again, one extra sitting there until whomever takes it.  Let&amp;#39;s go with six next time, a nice round number!  It works much better.  Party of two, three a piece.  Party of three, two a piece.  Party of four, one a piece and evenly split the last two.  See how nice that works for most parties?  <br&gt;<br&gt;Anyway, sorry, back on track. The garlic cheese bread was very good.  The star of the meal, as it turns out.  For meals, my youngest son went with the kids sliders, which he took one bite of and wouldn&amp;#39;t eat anymore.  This kid LOVES burgers, so it tells you how these tasted.  I tried it and agreed.  Not good.  The birthday boy went with the bacon cheeseburger, which was pretty good.  My wife ordered chicken fettuccine alfredo and was OK with it.  I did the catfish dinner, which came with mashed potatoes and green beans.  It was all fine but nothing stood out honestly.  <br&gt;<br&gt;The service was good.  Our server brought my son a little dessert for his birthday without doing the whole singing thing.  He just turned into a teenager, so we appreciated her discretion on the singing thing because well, he&amp;#39;s 13 and who knows how that would have gone down.  <br&gt;<br&gt;I am torn between two and three stars overall.  The service was good (a 4 star experience) but the food left a lot to be desired.  When you spend a good chunk of money, you&amp;#39;d like to feel like it was a treat, you know?  Something that was memorable and worth the money.  We didn&amp;#39;t feel that here.  It just was an overpriced, underwhelming food experience.  I&amp;#39;m not one of those crazy anti-chain Yelpers who detests all things chain but in this case, I can honestly say that Cheesecake Factory is a place to which I won&amp;#39;t return for a meal.  Look for me ordering some cheesecake to go.", "rating": 2, "date": "8/24/2015"}, {"text": "Back in August I was visiting Omaha and was in the mood for some good food. Stopped here for lunch and tried the shrimp scampi. Huge portion, lots of flavor and plenty of shrimp. This is one of my favorite dishes and the Cheesecake Factory did a great job. Took home the tiramisu cheesecake and it was heaven.", "rating": 4, "date": "10/7/2016"}, {"text": "Obviously the cheesecake is bomb...(at $7.95 a slice it should be) but honestly, I won&amp;#39;t be back. The food is OK, nothing to boast about and the prices are higher than any other comparable restaurant. The service is sooooo slow. It took us 2 hours for lunch. The only stand out part of this review and I wish I had her name, was the server who cared my son was getting upset because he was starving and our food was taking forever after we waited 20 min to get seated. She wasn&amp;#39;t even my server and saw him starting to fuss and brought over a &amp;#34;baby plate&amp;#34; which was bananas and bread. It did the trick, so thank you for caring!", "rating": 3, "date": "2/27/2016"}, {"text": "So my kids come in 1 hour before our meeting because they don&amp;#39;t do reservations of any kind ?? Really wow it is supposed to be high end restaurant.  No there are 9 of us so big party , they gave away our table to somebody else and guess what they could not accommodate our party so now it&amp;#39;s almost 8pm and we are still standing waiting for management to apologize. I am not coming back to this place again!! Bye", "rating": 1, "date": "12/30/2018"}, {"text": "This has been one of our favorite restaurants and had been there multiple times in the past. But our last dinner about a week ago (on a Friday evening) was not a very pleasant experience. We went early knowing its gonna be crowded and were there before most people came. We were told to wait for about 15 mins and so we did. 30 mins after with 4-5 families of the same # of people seated already that came after us, we were still waiting.. So finally I went and ask and &amp;#34;SURPRISE!!!!&amp;#34;, we werent even on the list! Whats worse was they seemed irritated by me trying to get us a table. Those people working at the reception area shouldnt be doing it if they cant handle the job well and let alone made the customers feel unwelcomed. A simple sorry would have made it up already but nope. Luckily our server was very pleasant and made the whole dinner bearable.", "rating": 3, "date": "2/1/2019"}, {"text": "Had the cheesecake factory for the very first time. I will have to say the food is okay.... they give u a lot food but not what I expected as in price. I&amp;#39;m not a cheap person but it&amp;#39;s a very pricey restaurant.", "rating": 4, "date": "9/28/2016"}, {"text": "Date night last Saturday! No matter what time you go, expect to wait at least 30 minutes. We got there between 4:30-5 pm and it was still a full dinner rush. It&amp;#39;s worth the wait, though! Our server, Brandon P., provided excellent service!! The guacamole appetizer (made spicy) is the BEST GUACOMOLE! I have said before it is the best guacamole in the world ;-) Not necessary what you think of at the Cheesecake Factory, but it is absolutely delicious.  Oddly enough, I&amp;#39;m giving it only 4 stars because I haven&amp;#39;t found a cheesecake I like yet. I generally love cheesecake at any other restaurant, but I haven&amp;#39;t found one here that I have enjoyed enough to finish or take home. I realize I&amp;#39;m probably the odd one out by saying that... I&amp;#39;ll keep trying!", "rating": 4, "date": "2/12/2016"}, {"text": "Love this place. As others stated a little on the expensive side but the portions you get are massive. <br&gt;<br&gt;The have the best chicken strips and ranch dressing around.  I would definitely recommend you save room for dessert because their cheesecake is divine!", "rating": 5, "date": "9/13/2013"}, {"text": "I&amp;#39;d take a pic to show you what they think fettuccine Alfredo looks like,  butter on pasta.  My phones storage is full so I can&amp;#39;t.  That is NOT fettuccine. That&amp;#39;s not fettuccine  at all. Fettuccine isn&amp;#39;t butter sauce it&amp;#39;s a cheese sauce.  It&amp;#39;s white and thick not thin and yellow.  I don&amp;#39;t like having to repeat myself to a snot nosed server.  I shouldn&amp;#39;t have to even ask to talk to manager they should know to come when I&amp;#39;m distraught.  I don&amp;#39;t dress like a pauper.  I definitely dress to impress and I certainly wasn&amp;#39;t impressed.  I expect a little consistency when I go out.  I can go to the mall and get half priced kids meals at the Flagship commons and it&amp;#39;s more than enough food and I don&amp;#39;t have to TIP some kid who has no pride in his work.  That&amp;#39;s what I recommend.  This place is lame.  The only reason I tried it out is because they make it look so yummy on the Big Bang Theory.  FALSE ADVERTISING!  GERMS ON THE SILVERWARE.  Here&amp;#39;s a pro tip,  just give the dessert when you mess up.  I shouldn&amp;#39;t have to ask.  Your fettuccine isn&amp;#39;t even cheese it&amp;#39;s butter I thought you were the cheese cake factory.  RECOGNIZE public officials as well.  We aren&amp;#39;t paid enough to be ignored.  Dave and Busters keeps us swimming in fringe benefits.  You don&amp;#39;t.", "rating": 1, "date": "2/10/2019"}, {"text": "This was my first time here at cheesecake factory in Omaha, and I have to say it was great! Although I didn&amp;#39;t have any room for dessert, I&amp;#39;d have to come back on empty stomach so I can fill up and try their cheesecakes. The ambiance and atmosphere was nice and calm but it gets a little hectic with the waiting list after 7 pm which is normal but all in all it was good experience. Friendly waitresses and staff.", "rating": 5, "date": "8/29/2017"}, {"text": "We were on vacation in Omaha and had just come back from the zoo. There is no Cheesecake Factory where we live, and we were skeptical going due to some of the reviews, but we decided to give it a shot. It was a busy Saturday night, and I knew they&amp;#39;d be busy and I wasn&amp;#39;t expecting 5 star service. But I was expecting better than what we got. First off, the server forgot our sons drink but brought ours out. We had to ask him twice to bring our sons juice out. Biggest rule when there&amp;#39;s kids at the table...take care of the kids first. We as adults can wait, but my 3 year old luckily had just taken a nap and didn&amp;#39;t freak out too much. We waited about 10-15 mins from the time we sat down to the time we finally got our sons drink. He was drinking my water while we waited. But our server seemed busy so I cut him some slack. Then my son said he wanted pizza. He was hungry, so this is where he started losing patience. We asked the server to get our sons order in right away while we looked at the menu. We also ordered our appetizer at the same time. We had some questions about the menu that our server had no answer to. Granted it is a big menu, and I think he must have been new-ish. But I feel like he kind of just made up answers to our questions because he wasn&amp;#39;t willing to find out the correct answer. I couldn&amp;#39;t decide between the shrimp scampi or the Jamaican blackened shrimp. Server recommended the Jamaican shrimp so I ordered that. My husband got the Cajun pasta. Our app finally came out...no kids pizza with the app like we had asked. Our son was asking about his pizza because we had our appetizer. I thought maybe the pizza took longer than our app, but surely thought it&amp;#39;d be out before our food. 15 mins later, our food comes. No pizza. At this point our son looks confused because we have our food and he doesn&amp;#39;t have his. We thought the server forgot, but 2 mins later the server brought his pizza out. Luckily our food came out pretty quickly for how busy they were (15-18 mins I&amp;#39;d say) so we didn&amp;#39;t even mention it. Our son was just happy to have his food. Now I try my food...not impressed. The dish I got wasn&amp;#39;t terrible, but it just wasn&amp;#39;t what I was hoping for. Maybe it&amp;#39;s my fault for going out of my comfort zone, but I wouldn&amp;#39;t recommend it. It just didn&amp;#39;t leave me satisfied. It was OK. Should have gone with the shrimp scampi!! Husband said his was okay too but he wished he had gone for the steak like he originally wanted. But we thought a 10oz ribeye was going to be a bit too small. It actually seemed like a decent size from what we saw. Then dessert. Server brought us the wrong cheesecake. Fixed it right away tho. Bill came, 100$. Now we were fully expecting to spend 100$ at least! But the service we received (and the food somewhat) was NOT up to par for a 100$ meal. Maybe if we had a more experienced server this review would&amp;#39;ve been much different. Maybe they could have recommended a better dish, and had all the answers to our questions. Maybe they would&amp;#39;ve remembered our sons drink and maybe his food would have been correctly rung in so it came out first. Either way, would I go back? Probably. I&amp;#39;d like to try something else on their menu. And I&amp;#39;m all about second chances. But don&amp;#39;t expect top notch service or food here based on my experience. I feel like it&amp;#39;s probably hit or miss here and a lot of it depends on who your server is. That&amp;#39;s how it is at a lot of places and that&amp;#39;s why I still gave it 3 stars. The 2 stars knocked off are for the mistake with my sons food and drink (kids should always be a priority) and the other star is for the food and the fact that I left feeling completely unsatisfied. Edit to add: our server also did not bring us bread. We didn&amp;#39;t know we were able to get bread until we saw tables around us with it. Halfway thru our visit we asked for bread and received some. Also, he was not on top of refills.", "rating": 3, "date": "7/6/2019"}, {"text": "Well here&amp;#39;s my breakdown 1st...<br&gt;Our Waitress...5<br&gt;Food...............2<br&gt;Cleanliness.....3.5 (My arm found some sticky who knows what jiz it was and the Salt &amp;amp; Pepper shakers were sticky and the pepper had the salt top on it. Couldn&amp;#39;t shake pepper out with a jackhammer!)<br&gt;Seating..........3.5 (Tried to sit us in one of those &amp;#34;I can&amp;#39;t move my arms because the table next to me is against me&amp;#34; tables. What idiot thought up that kind of seating? Who wants somebody you don&amp;#39;t know with their snot dripping kid sitting next to them trying to play with stuff from the other table while the worthless parents pay no attention to them! Seriously people...SPREAD OUT!!! If I wanted to eat with stinky people next to, I would have joined a COMMUNE!<br&gt;<br&gt;But seriously, our waitress was spot on! Always kept checking on us. Kept the drinks flowing and was most helpful on the menu after we had to sort through the AD&amp;#39;S! What the....AD&amp;#39;s in the menu? What is wrong with you GOOFBALLS? I was ready to jerk each page out with an ad for some other company. What a shill! But the back of the house dropped the ball.<br&gt;<br&gt;Overall experience was probably a 3.5 or so, but the food quickly brought that number crashing down, hence the 2 star!<br&gt;<br&gt;If it was all based solely on our Waitress, then I would have given the place a 5 star!", "rating": 2, "date": "8/21/2015"}, {"text": "I have tried to eat out on the patio the last two weeks but it was close both times. Today the temperature was 90. When asked the receptionist said patio will be closed the rest of the year. Does not make any sense the season to eat out is limited in Nebraska. The only good thing is I do have options from competitors.", "rating": 1, "date": "9/15/2018"}, {"text": "Arrived and was seated almost immediately. There were ten tables seated upon arrival. We waited 15 minutes with no greeting until we finally went to the hostess stand and was told, &amp;#34;I have no idea who your server is, I have to look.&amp;#34;<br&gt;We watched the waitress next to us argue that she wasn&amp;#39;t taking our table of nine even though it was hers. We watched two other servers close to the bar pass is by and not greet us. 22 minutes later and no bread, no water, no greeting. The manager was slinking along the bar pointing at us and finally found someone to come over. This waitress came over and immediately said, &amp;#34;I&amp;#39;m<br&gt;Not your server but no one knows who is, so I&amp;#39;m going to take your drinks.&amp;#34;<br&gt;We asked for bread and kids meals and then she was gone. When our drinks were ready, the waitress that&amp;#39;s wasn&amp;#39;t our waitress sat them on a table nearby and left. We got up and helped ourselves to our tray of drinks. When we needed refills, we got up ourselves and ordered at the bar. <br&gt;No manager came over to apologize for lack of service or failure of anyone to take responsibility for the table. Nine people that were treated like they were not wanted. We finally were served by the waitress that had been arguing that she didn&amp;#39;t want our table. Terrible! It took us almost two hours for appetizers and lunch specials!", "rating": 1, "date": "11/21/2018"}, {"text": "the cheesecake is amazing. And we are still trying to make it as good back in Croatia. But I don&amp;#39;t see that happening anytime soon. I had the most amazing server at this restaurant and this at is the only reason I keep coming back and of course the Cheesacake. I am not from Omaha but I am sure this location is not in the ghetto and I believe the prices are reasonable.", "rating": 5, "date": "11/14/2017"}, {"text": "First visit here and it was great. Friday night and the place was packed. We were seated right away on the patio. I started off with a pineapple Moscow mule. Very tasty indeed! Got the fried mac and cheese burger. Cooked exactly as I requested. It was an awesome burger. Finished off with the tiramisu. I will be back for another run at that dessert menu.", "rating": 4, "date": "5/8/2015"}, {"text": "This place really needs an update. While I still enjoy the food and service the atmosphere has not changed since 2004. This place use to be the go to for my family but it no longer is because the place needs an update.", "rating": 3, "date": "10/29/2017"}, {"text": "We was very excited to try out Cheesecake Factory, everyone has always told us how great it was.  So after we walked to our table at snail speed because the floor was so greasy I was afraid my wife would slip and fall. I say greasy because I have experienced that slick feeling before in a restaurant and it was a KFC and an employee accidentally mopped the floor with water they had cleaned around the fryer. Very dangerous. Then we met a very nice waitress who handed us a menu with massive amount of choices to choose from. After discussing options with our waitress we had made our selections. I chose the chicken parm  pizza style with angel hair pasta in anAlfredo cream sauce. Very excited one of my most favorite meals at many other eateries. My wife chose the orange chicken and rice. When our meal arrived it looked like a flattened out piece of chicken smothered in microwaved mozzarella cheese and on top was a pile of pasta with no sauce on it. The chicken was not with a crisp crust but soggy and I had to add salt to the dish to eat my 5 bites.  Not good. My wife&amp;#39;s orange chicken looked delicious so I tried a piece because she wasn&amp;#39;t eating anything but the rice (how can you mess up white rice) the chicken flavor was that of a piece of chicken covered in what tasted like a sweet donut batter . So know I know why she only ate the rice. I have a few suggestions for what seemed to be very nice restaurant, chill on the selections of food and focus on making less choices delicious and please clean your floors before someone slips and hurts themselves. The waitress was very very nice. This place needs some leadership that will focus on quality and absolutely needs to put an end to whoever cleans the floors it was bad.", "rating": 1, "date": "8/5/2018"}, {"text": "Honestly I just do not get the Cheesecake Factory.  I have been to a few over the years and the food is just mediocre at best and the menu is so big it is overwhelming.  This particular experience was a Friday during Lent so no meat.  My daughter and I ordered a pasta dish that was supposed to have lightly breaded shrimp.  Well the shrimp had no breading and was extremely over cooked and tough.  Then we found the breading, little balls of gooey breading in the pasta (but not on the shrimp!)  YUCK.  My other daughter ordered fish and chips -- GREASY!!!", "rating": 1, "date": "4/1/2015"}, {"text": "Next time maybe the manager could stop by during the 1:20 minutes we spend there. Clearly a future visit is highly important to this location", "rating": 2, "date": "4/17/2017"}, {"text": "My food was delicious (chicken and biscuits) and I tried the Tex Mex egg rolls for the first time. My usual favorite is the avocado egg roll appetizer which are wonderful for any avocado lover. This restaurant is a place I frequent. I usually don&amp;#39;t have any problems, but most recently one of our orders was not entered into the system. He was served late but the manager compensated that meal-- which made everyone happy. I would recommend this place to anyone!", "rating": 4, "date": "4/7/2017"}, {"text": "Arrived 6:45pm. Left at 9:10pm. Never got seated nor fed. The manager never came by to apologize the hostess was extremely rude. The bartenders were the only thing good about the night. They apologized and allowed me to at least order for my kids. They need to be the managers. We also called in advanced to let them know we were coming since we did have a party of twelve. Never offered for us to split up to be seated faster or anything. Very disappointed. I don&amp;#39;t know if I could ever bring myself to go back. My friends stayed but I had children so I had to leave. I guess you can say this is not a kid friendly place at all.", "rating": 1, "date": "3/23/2018"}, {"text": "I love this restaurant. The food is always great and the service is good. My favorite dish is the stuffed chicken tortillas and key lime cheesecake. <br&gt;I really wanted to write in because I ate there again today and it reminded me of the last time there and I watched the manager apologize to a table for like 20 minutes to a table of 12 some people and they were so rude. So I remembered and wanted to say thank you and remember not everyone is as rude as some of these people I&amp;#39;m sure you have to deal with. <br&gt;Keep up the good work!", "rating": 5, "date": "3/28/2017"}, {"text": "Service could of been a little bit faster...and our waitress took forever to bring our bread..water..and mixed drinks! But after she was quite attentive..food was delicious..I had the Farfalle with chicken and roasted garlic..it was amazing! Smoky..sharp..rich..mmm good! Oh! And don&amp;#39;t order drinks! 12bucks for a margarita! Ridiculous..they have lost their damn minds lol..other than that id go back lol", "rating": 3, "date": "8/8/2015"}, {"text": "Super disappointed. Service was crappy and so was my $23 plate of chicken alfredo. Was probably be most bland pasta I have ever had. Wont be back.", "rating": 1, "date": "9/1/2018"}, {"text": "Slow, terrible service. Good food but pricey.  We took my mother here for her birthday for a late lunch. We arrived at the restaurant around 2 pm-not busy, many empty tables.  Our waitress was slow to take orders &amp;amp; we didn&amp;#39;t receive our meals until 3 pm! A 45 min wait after ordering!  Our waitress was less than interested in actually waiting on us-so it was ironic there was a suggested tip amount printed on each of our bills.  No-&amp;#34; thank you for coming...hope you enjoyed your meal.&amp;#34; I don&amp;#39;t think she even told us her name-she certainly wasn&amp;#39;t wearing a name tag.  The overall experience was less than inviting.  It will be a long time before we will consider returning.", "rating": 2, "date": "8/27/2018"}, {"text": "Cleanliness 5<br&gt;Service 5<br&gt;Food 4<br&gt;Overall 3<br&gt;<br&gt;So your first might wonder why my overall grading is a 3 when the rest were 4/5. The thing that brought down the overall grade was the price. The food is great, service is great, but I felt I could have gotten something just as good somewhere else for considerable cheaper. <br&gt;<br&gt;The Cheesecake Factory is a great place to go for special occasions, but I feel it is just simply expensive for what you get. They have a huge menu and lots of options! They have amazing service and really take care of their guests. But I guess you pay for it all in the end with the bill. <br&gt;<br&gt;For the price that i received one slice of cheesecake I could have made one myself with just a few more dollars and received at least 8 times more. $7-$8 for one slice is alot IMO. Don&amp;#39;t get me wrong, the cheesecake is amazing and tastes great.", "rating": 3, "date": "5/15/2015"}, {"text": "I came here for my birthday. I was blown away with how busy and packed they were for 1 o&amp;#39;clock. I was expecting quiet and not many people. They seated us quickly. I liked how the pager fit in my pocket. The restroom was cute but too small to accommodate that large of a volume of people. I was frustrated and disappointed that they seated people on either side of us, so we had no where to put our coats because we had booth seating on my side of the table and my other friends had the chairs. And being so scrunched together, I felt like my butt was on their table. Luckily the people on either side of us were friendly because privacy was definitely invaded. The food was the bomb. They forgot my friend&amp;#39;s salad dressing and it took a while to flag down the waiter. Oh, my! My s&amp;#39;mores cheesecake was delicious (and beautiful)! Our waiter gave us the wrong checks. He didn&amp;#39;t seem very organized but then again, none of the staff seemed too enthused to be there. It was nice to visit with my friends but I felt claustrophobic. If it wasn&amp;#39;t a special occasion, I wouldn&amp;#39;t spend $8 for a slice of cheesecake.", "rating": 3, "date": "1/28/2017"}, {"text": "The service here is always friendly and helpful. Cheesecake is always always busy and you can&amp;#39;t make a reservation after five but the wait is reasonable. Unless you go in on a holiday or weekend that&amp;#39;s expected to be busy, the wait is worth it. I always get a pasta or rice dish every time that I&amp;#39;ve been. The staff is always helpful with choosing what is good and giving excellent recommendations. The drinks are awesome too.", "rating": 4, "date": "2/18/2016"}, {"text": "I have been to a few locations in various states and had great service and delicious meals. The Westroads location is probably the worst one I have been to. I ordered the shrimp scampi and received the smallest portion I have ever received in any restaurant, almost a kid&amp;#39;s size meal. The shrimp were fried instead of sautéed and the pasta was not thoroughly cooked. The sauce was too tart. The meal had no flavor except it was spiked with too much lemon juice. It was $20 for 1/2 a plate of nothingness. The description on the menu was not even close to what I received. I had 2 bites and was done. They didn&amp;#39;t even charge me for this horrible meal, I guess as a courtesy. And the service was extremely slow. Never again.", "rating": 1, "date": "7/29/2018"}, {"text": "$11.95 for a chocolate martini that was not good at all...no thank you! Last time for me. I&amp;#39;ll stick to ordering their Chipotle chicken pasta on the curve and skip the drinks. It&amp;#39;s the only dish I enjoy from there anyway.", "rating": 1, "date": "10/15/2016"}, {"text": "Super disappointed as I&amp;#39;ve enjoyed eating in here. Tonight decided that we wanted to try the take out. Called for curbside pick up. After 25 minutes called again to see what was taking so long and they couldn&amp;#39;t find my order. Girl comes out with &amp;#34;our order&amp;#34; which was the wrong order. So we waited 25 more minutes for them to bring out the right order. Offered no discounts or even an apology for that matter. Get home and the food was cold so turns out it was probably ready the whole time and they just forgot about it. It will take a lot to get me to come back and eat here. Customer service was just awful.", "rating": 1, "date": "2/14/2017"}, {"text": "Good food! But it takes 15 min to get a slice of cheesecake to go with no line at 8:30 on a Sunday night", "rating": 3, "date": "2/12/2017"}, {"text": "Let me paint y&amp;#39;all a picture. It&amp;#39;s my 23rd birthday. I&amp;#39;m in Omaha and my friends came all the way out from Wisconsin to see and be with me. I decide we should go to Cheesecake Factory for a nice dinner . Now let me tell you about my visit to this establishment. The Manhattan we ordered was watered down and the Arnold Palmer was purely just sweet tea and no lemonade. I ordered shrimp scampi and steak. The steak was covered in a mesquite barbecue sauce that should have been advertised because if I had know I would not have ordered it. The shrimp scampi came out cold and was the size was below average for what it cost. The shrimp scampi also had no noodles and a terrible flavor! I told the server that I did not like it and she said &amp;#34;okay, love&amp;#34; and walked away. I thought she was going to get a manager, but no manager ever came. The rest of our meal she did not make eye contact with me nor did she talk to me. We were charged full price for our terrible service and food. It made for a horrific birthday dinner experience.", "rating": 1, "date": "9/9/2018"}, {"text": "As a party of four before peak dinner hours, we showed up expecting a limited wait time for seating. Instead, we waited over 10 minutes for a table seated uncomfortably close to another party, despite numerous other, more comfortable options. Upon viewing the menu, we were graced with too many choices, so this is not the place for the indecisive. I ordered the turkey burger with sweet potato fries in search of a lighter option. It did not meet my expectations for a $13 burger. One other member of my party got a pasta dish that she was unable to eat due to excess garlic. Throughout our entire experience, we had moody and inconsistent waitresses that did not treat us like seriously paying customers. Overall, The Cheesecake Factory is overpriced, underwhelming, and over-hyped. Will not be returning.", "rating": 1, "date": "7/19/2018"}, {"text": "This place is horrible. Everything we ordered was not all that great. Only the cheesecake was good. I ordered the guacamole and it was tasteless. I told the waitress we were done eating it because it was very bland and not very good. She responded with oh ok and took the plate. Didn&amp;#39;t ask to have something different or even a refund. And the salmon kale salad was a waste of money also. I think this places problem is the menu. Had way too many options to choose from. The smaller the menu the better quality food. I&amp;#39;ll give it one star because the cheesecake is bomb.", "rating": 1, "date": "2/2/2017"}, {"text": "Good place to eat!<br&gt;We had spicy cashew chicken (good), nachos( good), mac &amp;amp; cheese (good), the omelet(ok), kale salad( very good), tomato basil flat bread(ok) &amp;amp; of course the desert.<br&gt;Mango key lime ( excellent)  &amp;amp; peppermint bark ( good). Overall the food &amp;amp; service were good! We will come back again!", "rating": 3, "date": "12/18/2014"}, {"text": "Stopped in today for lunch with my daughter. It was busy, no big deal, we weren&amp;#39;t in a hurry, put our name in &amp;amp; received the pager. There were 20+ people waiting in entry. Waited, waited &amp;amp; waited some more- 25 minutes worth of waiting. Then there were two other parties of 2 (both of whom walked in AFTER us) &amp;amp; my daughter and I. The other two parties who walked in AFTER us were seated. Then a name was called that sounded similar to mine. I stepped up to inquire about the name called. The girl rudely restated the name called and said&amp;#34; it&amp;#39;s not you!&amp;#34;. Set the pager down &amp;amp; walked out. Absolutely inexcusable to treat customers that way!", "rating": 1, "date": "5/26/2018"}, {"text": "Had a gift certificate to cheese cake factory so stopped for lunch. Hubby had cheeseburger -- not much flavor,  saved most for our dog.  I had the French onion soup -- took one bite and stopped eating it.  It tasted like the greasy broth on the bottom of the pan a roast cooked in, and had some shredded cheese on top...horrible! Had the Chinese chicken salad. Half of the bagged lettuce was slimy and black.  Did find 6 thin pieces of chicken.  Probably the worst lunch I&amp;#39;ve had! Will not be going back there again!", "rating": 2, "date": "5/21/2018"}, {"text": "Feeling very disappointed! Our family of 10 started early thinking we could avoid the crowd. We got there at 4:55 and were told we would have a table ready in 15 minutes. 45 minutes later we were seated. It was very crowded and very noisy! Waitress tried her best but service was slow and some food was cold. The sautéed onions were not done and inedible. I ordered a French salad which was supposed to have asparagus spears and nuts. I found maybe two Asparugus ends rarely a nut. It had mounds of lettuce on top with no dressing. Very very dissaponted...........and we will not return.", "rating": 2, "date": "2/7/2016"}, {"text": "I don&amp;#39;t understand why this place is so popular.<br&gt;What it is - is overpriced, that&amp;#39;s for sure, even for lunch!<br&gt;I&amp;#39;ve ordered vegetarian pizza, which was hard and plain.<br&gt;I&amp;#39;ve also had salmon stake, it was better, but you could certainly cook such a stake yourself and save a lot of money.<br&gt;I&amp;#39;ve had 3 sorts of cheesecakes, wasn&amp;#39;t overly impressed but quite like the one with mango.", "rating": 2, "date": "11/21/2014"}, {"text": "Wow, is this place overpriced. I had a bowl of the white chicken chili and it barely covered the bottom of the bowl. It also came with a tiny scoop of white rice. I took one look at it and called the manager over...for 14 bucks the amount was ridiculous. He took a small amount off our bill and explained to me that the portions are weighed and consistent with all locations. Well, that maybe true but then corporate should really then look at what is being served because this is a total ripoff. I literally had the entree done with about six bites. The taste was good but not worth the price. The prices of other items way overpriced as well. I will not be eating here again. And, for crying out loud, get the entrance way fixed. Chunks of loose concrete by the front door does not make for a good first impression.<br&gt;Darn shame because this was a decent place to eat at one time....", "rating": 1, "date": "2/22/2016"}, {"text": "Ok, when this place first opened, I was excited because this was our go to place in Dallas. My initial visit was disappointing because they had discontinued what was arguably the absolute best salad anywhere...The Thai Steak Salad. After that, I would go if my wife begged me to go. They had other things I liked. So last night, after not going for a while, we went. What happened? The place was pretty empty, the poor desk hostess was working alone seating people best she could.<br&gt;<br&gt;We ordered Fried zucchini, Factory Nachos, Factory Meatloaf and tea. The zucchini has gone from being cut into quarters to being this tiny stack of steak fry size pieces. The Factory Nachos looked like they must have been shipped on the plate, covered with this cheese sauce, that I couldn&amp;#39;t eat. The pico on top was still in the shape of the container it came in and the guacamole had no taste at all. The Factory Meatloaf, which my wife and I both used to like, was terrible. <br&gt;<br&gt;You guys do know that &amp;#34;Factory&amp;#34; is just a metaphor...don&amp;#39;t you? Factories have line workers, restaurants have chefs. I ate some of the nacho chips...they were all toasted to the point of being burned. My wife moved the meatloaf around on the plate. I tasted it...it was awful. Nothing like it used to be. There is an expectation of restaurants...it comes from their legacy. She ordered the meatloaf because it was a safe bet. The whole experience felt like, some corporate guy decided that &amp;#34;taste&amp;#34; was an unwarranted expense and cut it out of the budget. <br&gt;<br&gt;It&amp;#39;s a shame really. The Cheesecake Factory used to be a decent place to eat.  <br&gt;<br&gt;I suggested that next time we should order a sandwich....my wife said...there will be no next time.", "rating": 1, "date": "8/9/2016"}, {"text": "We visit here frequently because its usual a decent chain in Omaha however today are visit was horrible! Service was horrible!!! No bread was served, menus left on the table, drinks left untitled and quite frankly she forgot about us !  We waited a hour to finally get our food (keep in mind place was empty) when we finally got our food they had forgotten things, food was cold and not good!! So we waited a hour for this! Brought it to the mangers attention and it seemed he could care less! Not a good way to run a business! We will not be back better service at chick fil a !!", "rating": 1, "date": "11/25/2016"}, {"text": "I&amp;#39;ve never had a bad experience at the Cheesecake Factory. I came here yesterday for my sisters birthday. My favorite dish is the Factory Burrito, but yesterday I had the four cheese pasta with chicken and got a slice of pumpkin cheese cake to go. The food, service, cleanliness and decor has always been great. This is definitely a place I&amp;#39;ll keep returning to.", "rating": 5, "date": "11/21/2016"}, {"text": "If you like hair in your food, then this is definitely the place to go. Happened to us 6 times in the last 2 years.", "rating": 1, "date": "3/8/2016"}, {"text": "Great food , extensive menu , serves the absolute best cheesecake with courteous service and an atmosphere that&amp;#39;s hard to beat within budget ...", "rating": 5, "date": "1/11/2017"}, {"text": "I saw a fried bug on my food. This is very disappointing. This is unsanitary!! I almost threw up!!! And felt very disgusted! Cheese Cake Factory you have failed.", "rating": 1, "date": "8/23/2016"}, {"text": "Service: okay at best <br&gt;Food: the fried mac and cheese is to DIE FOR to be honest haven&amp;#39;t had much else there so sorry<br&gt;Cheesecake: delightful the only bad part is I always have to take it home cause I&amp;#39;m so full... Maybe I&amp;#39;ll start with the cheesecake best time lol<br&gt;<br&gt;Not bad not bad", "rating": 3, "date": "11/8/2014"}, {"text": "First off, I like the cheesecake factory. They have good food, and they have options for every possible picky eater. I mean picky eater to the max! Their menu is a small book, and that isn&amp;#39;t an exaggeration. The down fall is it can take a while to decide if you aren&amp;#39;t sure what you are in the mood for. You get warm bread while you are waiting, which is nice. You really don&amp;#39;t need a whole appetizer its so much food. They have a good sized drink menu, but a bit pricey. Last time I was there my glass of wine was $9. A bit much for half a glass. Their portions are ridiculous. Everything I have ever ordered there comes with enough food to feed at least two people if not three. All servings are doubled if not tripled. I go home with a few meals from the left overs, which I can&amp;#39;t complain about to much. The food is good, but honestly, its nothing special. It&amp;#39;s average food. The cheesecake is on a whole new level, that&amp;#39;s why I gave it 4 stars. I have never had bad cheese cake there. It is so good and there are so many choices! I usually get it to go because I&amp;#39;m so full from the other food! It is quite pricey for a meal, but with the serving sizes so big you do get what you pay for. The cheesecake slices aren&amp;#39;t cheap, but oh so worth it! This isn&amp;#39;t a place I go often at all, but when I do I splurge on the cheesecake. If you are looking for a place with a menu of choices for everyone, this is the place to go. Just don&amp;#39;t expect to walk out wowed by the food and expect your waist line to be pushing the seams a bit! and make sure to splurge on a piece of cheesecake :)", "rating": 4, "date": "10/6/2015"}, {"text": "Two weeks in the USA and this place wins the award for worst service. An hour and 10 minute wait for a seat is acceptable even though a 45 minute estimate was given. However waiting over an hour for the food to arrive was unacceptable with no apology  for such an extended delay. The food was average at best.", "rating": 1, "date": "3/13/2016"}, {"text": "Menu meant for all is the nickname that I like to give the Cheesecake Factory. I really enjoy the skinny menu and the gluten free menu. I had the skinny girl Mexican salad with a light dressing drizzle. The salad was an extremely large portion like normal salads at cheesecake but made for perfect leftovers for lunch the next day.", "rating": 4, "date": "3/18/2016"}, {"text": "I have eaten @ this restaurant all over the country and I go because they have above average food and I know what I can order and it is the same everywhere. This time the service was ok. Speed was pretty slow and the food was below average. Disappointed by this location.", "rating": 3, "date": "2/26/2018"}, {"text": "I would give it no stars if I could, we went there 1-31 for my daughters 16th birthday, per her request. Her pasta was lumpy, and apps were not very good flavor wise and my daughter really wanted to have the staff sing her happy Birthday just like she saw at all the other tables, our waitress put her price of cheese cake down stuck a candle unit and left. I can&amp;#39;t say it ruined her birthday but I can say she was very disappointed", "rating": 1, "date": "3/31/2017"}, {"text": "I will keep this short and sweet. Our food came out in 3 parts . 2 plates, 2 plates, then 1. It took 10 min for this, so by the time my food arrived everyone elses was cold. Burger was overcooked, when I asked for rare. The server barely waited on us. That&amp;#39;s the short...cheesecake was good, there is your sweet.", "rating": 1, "date": "10/18/2015"}, {"text": "I am celiac and I specifically explained this to the waitress when ordering my food, but according to my stomach, my meal was clearly full of gluten. I am so disappointed especially since their gf menu is very basic and marked gf. This should not have been an issue.", "rating": 1, "date": "9/16/2017"}, {"text": "Amazing food, decent prices and great service. I love the menu size and the portions were great! Having so many options were fantastic but it was hard to choose. I loved it!", "rating": 4, "date": "10/29/2016"}, {"text": "Food is always good &amp;amp; service is always good. Definitely my boyfriend and I&amp;#39;s go to restaurant! Although, as a hostess myself, I have noticed the hostesses lack friendliness.", "rating": 4, "date": "11/15/2015"}, {"text": "I have only ever gotten cheesecake here, so I can&amp;#39;t speak to their dine in menu. However, if you&amp;#39;re ever in the mood for a giant, most of your calories for the day, slice of cheesecake, this is the place. They have a ton of different flavors and all are just as naughty. The staff vary in politeness though and sometimes they try to get skimpy on the whipped topping. I need my whipped topping dang you!", "rating": 4, "date": "9/26/2015"}, {"text": "I honestly have no idea why I come back every so often..went there yesterday for National Cheesecake day, it was busy but no busier than another time we&amp;#39;ve been there.  <br&gt;It was about a 15 minute wait to be seated, once seated it took about 5 minutes to get any water and a total of 10 minutes to get our drinks.  Server immediately asked if we were getting cheesecake (we were planning on getting food too), we hesitated for a moment and said yes.  Ordered our cheese cakes, they literally took 20-30 minutes to receive; only after them giving it to the table next to us, so they noticed the mistake and took it from the other table and then gave it to me..but had my guests order wrong..there wee tables around us who ordered after us and got their order before us.  The service was hands down the worst ever.<br&gt;Thank goodness the cheesecakes were half off but they sure bent us over on our drinks at $11 each, will never be getting anything but water in the future if there is one.", "rating": 1, "date": "7/30/2015"}, {"text": "I have been here a couple times the service  is always good my daughter who is 11 got her food and like any other time started to eat half way through it she bit into something hard she pulled out a piece of plastic I told the waitress and she new exactly what it was it was some sort of cap from the kitchen she got the manager involved he came by and asked if everything was alright I said no he apologized and said my daughter&amp;#39;s meal will be free and a piece of cheese cake but when the bill came only the meal was subtracted not the cheese cake we ordered we are not there to get a free meal but if you as a manager say something to a customer keep your word will think about going back", "rating": 2, "date": "9/30/2017"}, {"text": "I&amp;#39;m waffling between giving two or three stars.  Typically I don&amp;#39;t like to review chain restaurants at all because they&amp;#39;re all pretty consistent and you know what you&amp;#39;re getting (or at least you should) when you go there.  But last night at the cheesecake factory I remembered a couple of reasons why I don&amp;#39;t typically eat there.<br&gt;<br&gt;The cheesecake is obviously 3 or 4 stars in quality, but it costs $9.  I&amp;#39;m pretty sure I could buy the ingredients to make a whole cheesecake at home for that price.  <br&gt;<br&gt;The dirty martini I ordered (which our server said the bartender described as &amp;#39;extra dirty) was also $9.  The blue cheese stuffed olives that are listed as part of the drink on the menu... I had to ask for after it showed up without them.  Plus, &amp;#39;extra dirty&amp;#39;?  Really?  The irony here is that it may sound cute, but the &amp;#39;dirty&amp;#39; is the olive juice... so you put extra olive juice in my martini?  Thanks, but no thanks.  You can just make it extra-ginny instead.<br&gt;<br&gt;The food is always good, nothing to write home about.  And the portions lend themselves to excessive eating.  I&amp;#39;ve never been absolutely disappointed with a meal here, until I get the check.<br&gt;<br&gt;I probably would have gone with the three stars if I didn&amp;#39;t feel like they were holding me by my ankles to shake out all the loose change in my pockets.  All told, one martini, one dinner and one piece of cheesecake to go set me back $37.  I can think of far more fabulous places to spend that money in town.", "rating": 2, "date": "4/24/2009"}, {"text": "I took my sons.  We had a good time.  The place was packed but it was Sunday evening. We all had plenty to eat.  The menu has a lot to choose from. We had to take desert home with us because we were so full.  The portions are pretty sizable.  The service was pretty good considering it was packed.", "rating": 5, "date": "8/22/2017"}, {"text": "My mother and I have came from Sioux City and when I heard that Omaha had a Cheesecake Factory near by, I was excited. The food was delicious, don&amp;#39;t get me wrong. The filet mignon was just right. However, I was bothered by the customer service. We were seated down before the table besides us and they have gotten served first and the waitress didn&amp;#39;t seem to care much about serving our table. We didn&amp;#39;t even get our bread, I didn&amp;#39;t even know about the bread until we looked around and every table had a loaf besides ours. Then when I paid, I went to get a slice of Tiramisu cheesecake and here is a group of employees who were too busy talking to one another, I kept calling out, &amp;#34; Excuse me? Excuse me...&amp;#34; and they were still ignoring me until I was about to turn and leave and that&amp;#39;s when one of the girl took her time to approach me and had the sloppiest attitude. Smh.", "rating": 2, "date": "5/18/2015"}, {"text": "We have eaten at Cheesesteak Factory several times and everything is usually good. <br&gt;Tonight, five people went for my daughter&amp;#39;s birthday.  4 of the 5 entrees arrived after a lengthy period, but a burger came at least another 10 minutes after the four other entrees. The burger that was ordered well done came rare.  I had to go seek out the waitress but never found her, so told the hostess.  She said the manager would come over.  Another five minutes passed and still no manager...went back to the hostess to say &amp;#34;we just want the burger cooked longer, can someone just come pick up the burger ?&amp;#34;.  More time went by before someone came to get the burger. The manager apologized and basically said she would comp the burger.  I told her this really wrecked my daugher&amp;#39;s birthday dinner.  She offered free cheesecake.  Ok, we&amp;#39;ll take it. <br&gt; I am not kidding that another 15-20 minutes went by before the burger finally came.  The free cheesecake had to be requested two times before it came.  <br&gt;I don&amp;#39;t know what happened tonight, but it was very awfully frustrating.", "rating": 2, "date": "10/8/2017"}, {"text": "I have been to Cheesecake Factories all over the country and this was by far the worst service. Seating experience wasn&amp;#39;t good and it took over an hour to get our food after we ordered.", "rating": 1, "date": "8/11/2017"}, {"text": "Me and a buddy went to The cheesecake factory. Well, we have been here multiple times before but never left reviews. <br&gt;<br&gt;We got there and it was somewhat busy, but that is to be expected. I got the menu and it was like getting a miniature phone book. Way too many items on the list...but even though the menu was large...the food was decent. <br&gt;<br&gt;I ordered the Avocado egg rolls for an appetizer and the Bang Bang Chicken and Shrimp. Both were really good...just a little pricey.", "rating": 4, "date": "5/24/2016"}, {"text": "Ate at the bar.  Drinks were good but the food is mediocre at best.  Whoever cooked the Steak Diane needs to be retrained.", "rating": 2, "date": "7/21/2017"}, {"text": "Words can&amp;#39;t even begin to describe the awesomeness that was this meal...Never having been to a CF yet hearing good things I was still pretty stunned with the quality...Our server Sarah was great and friendly and a real credit to the CF...Snow and I started off with Chicken fried sliders, and chicken pot-stickers in this indescribably tasty sauce...the sliders were perfect, not too hard/crunchy and just really tasty...the pot-stickers themselves were pretty damn good, but the sauce was next level awesomeness...and it made for an excellent dipping sauce for the bread...Snow ordered a ginormous salad, which she ended up taking home to make room for cheesecake...Sound decision...I ordered the chicken and biscuits with mashed taters and veggies...now, I&amp;#39;m not normally a big vegetable person...to be honest, I hate the damn things...but CF actually made them tasty and delicious...the chicken was perfectly cooked, the biscuits were also as good as they could possibly get, and even the mashed taters I loved...even with the peelings inside, which normally drives me insane, but CF even made that taste good lol...I couldn&amp;#39;t even eat it all since naturally I had to leave room for cheesecake...Snow ordered the lemon meringue cheesecake and I ordered the Reese&amp;#39;s peanut butter cheesecake...Now is where words may fail me because upon taking that first bite I blacked out from sheer orgasmic joy at the tastiness that I had just put into my mouth...Never have I had something so yummy and out of this world excellent...I will be using this memory as my permanent happy place when I&amp;#39;m down, that&amp;#39;s how good it was...Snow&amp;#39;s choice was also just as awesome...I honestly have no complaints which is why CF gets an immediate 5 stars even after only one visit...yes they&amp;#39;re expensive, but this isn&amp;#39;t Denny&amp;#39;s or the Village Inn...do yourself a favor and come here as soon as possible because it&amp;#39;s just that damn good...", "rating": 5, "date": "10/20/2014"}, {"text": "Terrible birthday for me.  This was the worst dining experience I have had in over a decade.  The food was awful, had a Steak Dianne- it was cold and greasy.  I&amp;#39;m now sick to my stomach (yes I vommitted)<br&gt;<br&gt;The service was even worse, she was rude and didn&amp;#39;t care.  The manager in the purple shirt wouldn&amp;#39;t talk to me or the other table that also wanted to complain.<br&gt;<br&gt;Unfortunately the place was packed so they don&amp;#39;t care that they are terrible.", "rating": 1, "date": "4/2/2016"}, {"text": "We used the gift card that we got for Christmas. The interior was very high class very comfortable. The food was pretty good but I had a hard baguette for my sandwich so my meal was not very good. Naturally this place does great cheesecake as the sign says however not really sure I would go back unless I had a good reason to go. The other people seem to like it and they thought the food was very good. The service was exceptional and overall I thought it was a good experience.", "rating": 4, "date": "9/23/2015"}, {"text": "Cheesecake Factory is one of my favorite places to dine however last night the wait 45 minutes just to be seated, we waited an hour for our food, and when we asked our waitress, Della did they offer a military discount, well, unfortunately they didn&amp;#39;t offer that as well. Very disappointed!!", "rating": 1, "date": "3/17/2017"}, {"text": "Came here for dinner with 3 other people  on a Saturday night at 6:30 pm with no reservations - 1 hour wait.  Line was out the door.  Against my better judgement, we decided to stay.  Finally seated.  Server was very good, but he was slammed!  He asked us to be patient - kitchen and bakery were backed up.  2 of us had Spicy Cashew Chicken, another had garlic noodles w/chicken and one had avocado/zucchini fries and another appetizer.  Food quality was fine; it was hot.  Service was good.  Dessert service was VERY slow, as the server told us it would be.  (We all ordered cheesecake, of course.)  I was not terribly impressed by the cheesecake.  I&amp;#39;ve had much better.  It was just OK.    For the prices, the food should be much better than it is.  It seems exactly like a factory, where they just shove people in, and shove people out.  Really hard to enjoy a meal there.  So noisy!  Holds 365 people, and I think they had that many there!! Just not my cup of tea for a Saturday night dinner, but it wasn&amp;#39;t my choice that night.  I won&amp;#39;t go back.", "rating": 3, "date": "1/29/2017"}, {"text": "Started with 2 cokes, got the fish tacos which I received 4, I did 2 fried and 2 grilled fish. They were good but need extra tortilla on each soaked right through and made mess. Gf had the chicken Alfredo tasted really good, recommend small portion. Got cheese cake white chocolate raspberry truffle not as good as dutch apple last time. she got cookies and cream not as good as peanut butter cup. water was OK, didn&amp;#39;t check back many times. bill was $58 plus tip. food from $9.99-$25.99 cheesecake $7.50 a slice. many things $9.99-$14.99.", "rating": 3, "date": "4/24/2014"}, {"text": "Nice night.  Food was good.  Service was prompt and friendly.   Cheesecake was very good.  Went on a Wednesday night before rush hour.  We&amp;#39;ll be back in the future.", "rating": 4, "date": "6/18/2015"}, {"text": "I&amp;#39;ve always been a fan of the cheesecake factory.  You know going in that you are gonna get a huge meal that is totally unhealthy, but delicious.  Some of my personal favorites are the barbeque ranch chicken salad, any of the burgers and the cuban sandwich.  The salad is actually big enough to share and loaded with enough toppings to the last bite, but they could go a little easier on the dressing amount.  Probably my new favorite is the cuban, just fantastic and perfectly prepared with great taste, tender meat and just the right amount of sauce.<br&gt;<br&gt;Everything on the menu tends to be worth the money, but then again you are paying a little more for the portion sizes and experience.  The wait staff was friendly, but a little slow.  They never offered extra bread and actually could have come by more often, especially at the end of the meal.", "rating": 3, "date": "5/22/2011"}, {"text": "Why I like it:  HUGE menu, lots of variety on cheesecakes, and good drinks.  That&amp;#39;s it in a nutshell.  Let me expand a bit.  Cheesecake Factory is a chain, so they automatically loose a star for that, but they are a upscale chain restaurant with very nice décor and better then average food.  Not everything at the cheesecake factory is good, I have eaten at a number of them and can tell you first hand things like shepherds pie and some of the salads are fairly blah.  However that said, they do have a few dishes I like.  <br&gt;<br&gt;1st, for appetizer I enjoy the firecracker salmon.  It is salmon wrapped in wontons wrappers and deep fried, served on a huge pile of red cabbage and drizzled with a nice teriyaki sauce.  Very tasty but not enough food for more then 2 people.  Heck, I have eaten it by myself as an app myself. Vietnamese Shrimp Summer Rolls are also excellent as an App.<br&gt;<br&gt;2nd.  They used to have an excellent Thai Chicken Pasta that I enjoyed but for some reason they got rid of it.  They still have some nice pasta options like spicy chipotle chicken and the pasta carbonara.  Other things I really enjoy include Herb Crusted Filet of Salmon, Fish Tacos, and the chicken and biscuits are excellent. It reminds me of a deconstructed chicken pot pie with peppery white gravy.<br&gt;<br&gt;And now for the cheesecakes.  Yes I have tried nearly every flavor at one point or another over the last 20+ years visiting a cheesecake factory someplace in the country.  In fact I visited my first one in Newport Beach, CA back in 1990.  I&amp;#39;m not even sure if its still there!  But, over the years I have developed a taste for a few of them, and can rank them in what I believe is their worst, to their best. <br&gt;<br&gt;Here we go:<br&gt;<br&gt;32. Low Carb Cheesecake with Strawberries<br&gt; - Yuck<br&gt;31. White Chocolate Caramel Macadamia Nut<br&gt; - Not a fan of white chocolate with caramel.<br&gt;30. Kahlua Cocoa Coffee Cheesecake<br&gt; Coffee in dessert is not my thing<br&gt;29. Tiramisu<br&gt; I&amp;#39;ll stick with the original, and I don&amp;#39;t really like coffee in my desserts.<br&gt;28. Pineapple Upside-Down Cheesecake<br&gt; Not very good<br&gt;27. The Original<br&gt; Boring<br&gt;26. Chocolate Mousse<br&gt; Not a fan of mousse. I want a better chocolate.<br&gt;25. White Chocolate Raspberry Truffle<br&gt; This one is ok, but again, not a fan of white chocolate<br&gt;24. Adam&amp;#39;s Peanut Butter Cup Fudge Ripple<br&gt; Not bad, but they have better<br&gt;23. The Original with Cherry Preserves<br&gt; The original is good, and cherry makes it a little better<br&gt;22. Craig&amp;#39;s Crazy Carrot Cake Cheesecake<br&gt; I like carrot cake, but this one is a miss<br&gt;21. Key Lime<br&gt; I like it, but it&amp;#39;s a weee bit tart<br&gt;20. Ultimate Red Velvet Cake<br&gt; Getting better on the chocolate front but they have better<br&gt;19. Mango Key Lime<br&gt; This is a good option for tart and sweet.<br&gt;18. Dulce de Leche Caramel Cheesecake<br&gt; This is a good one, worth trying.<br&gt;17. Fresh Banana Cream Cheesecake<br&gt; Reminds me of banana cream pie, but better<br&gt;16. Pina Colada Cake<br&gt; Different take. I feel like I&amp;#39;m in the islands<br&gt;15. Caramel Pecan Turtle Cheesecake<br&gt; Love me a turtle in any way. This is a good option<br&gt;14. Vanilla Bean Cheesecake<br&gt; For something so simple, it works.  Tastes like rich vanilla ice cream.<br&gt;13. Dutch Apple Caramel Streusel<br&gt; Apple Pie Cheesecake.  It is good<br&gt;12. Wild Blueberry White Chocolate Cheesecake<br&gt; This is the only white chocolate cheesecake I actually like<br&gt;11. Chocolate Tuxedo Cream<br&gt; Vanilla and Chocolate twist.  Very good<br&gt;10. Toasted Marshmallow S&amp;#39;mores Galore<br&gt; This is one of my favorites.  Worth getting for sure.<br&gt;9. Godiva Chocolate Cheesecake<br&gt; If you want chocolate, this one is great, but almost TOO much chocolate. it&amp;#39;s fairly dark chocolate.<br&gt;8. The Original with Fresh Strawberries<br&gt; A classic, and very very good.<br&gt;7. Reese&amp;#39;s Peanut Butter Chocolate Cake.<br&gt; The best peanut butter cake I have had in some time.  Great if you don&amp;#39;t want a cheesecake<br&gt;6. 30th Anniversary Chocolate Cake<br&gt; Probably the best chocolate item they have.  perfect flavors<br&gt;5. Chocolate Chip Cookie Dough<br&gt; I am so partial to chocolate chip cookie dough anything, and this cheesecake is excellent.<br&gt;4. OREO Dream Extreme<br&gt; If you like Oreo&amp;#39;s, you will love this cheesecake.  I do.<br&gt;3. Lemon Raspberry Cream<br&gt; When you are sick of chocolate, this sweet and tart cheesecake is perfect.  My favorite fruit cheesecake they have. <br&gt;2. Hershey&amp;#39;s Chocolate Bar Cheesecake<br&gt; This is also probably the best chocolate item they have. Honestly, this and the 30th aniv chocolate cake are both fantastic, but this one is readily available everywhere.<br&gt;1. Chris&amp;#39; Outrageous Cheesecake<br&gt; This is the best of the best.  German Chocolate, coconut, pecan frosting, omg, this thing is the bomb.", "rating": 3, "date": "3/20/2015"}, {"text": "This place has some serious service issues. I met my friend here at 1 pm on a Wednesday, and the restaurant was packed. (Great for them!)  My friend&amp;#39;s in-laws were in the bar area at a table so we decided to take their table as they were just leaving. Once the table had been bused, the server brought us water and bread and butter. I asked her for silverware, assuming this would prompt her to bring us the normal table place setting (napkin, silverware, plates, salt &amp;amp; pepper) but she only brought silverware. We asked for napkins and plates, she only brought napkins, so she had to go back a third time for plates. My friend ordered coffee and I ordered a beer. She brought the coffee, then brought us both beer. We told her we wanted to order soup and share a couple of appetizers. She said something like &amp;#34;since you are sharing soup, would you like the bowl versus the cup since it&amp;#39;s larger?&amp;#34; I had to actually explain to her that we would like our own cup of soup and we&amp;#39;d share the appetizers.  After a long wait, the soup came out and it was cold. It took us more than 5 minutes to flag someone down to send it back. 10 minutes later they re-served the soup which was only slightly warmer than previously. A full hour and 10 minutes after we placed our order we had still not received the two appetizers. No one had checked on us since re-serving the soup. Once again we flagged down our server and told her to cancel the order and bring us the check. She asked us to wait while she spoke to her manager. She came back with one of the two appetizers and said that her manager will waive the charge for them if we&amp;#39;d still like them, or they could box them up. Neither one of us planned to have an all afternoon lunch, but we decided just to stay and have some. She brought the 2nd appetizer, but no plates, we just used our tiny bread plates. It was a small table and they hadn&amp;#39;t cleared away any of our dirty plates, glasses or the soup bowls, so I tried to stack them and get them out of our way. Eventually our server walked by and stopped, grabbed some of our dirty dishes and put them on the same tray with food she was taking to another table. I almost stopped her, but I was too shocked by what I was seeing happen! Oh, and the food? We had the eggroll sampler and the Thai chicken lettuce wraps. They were just okay. I finally got out of there at 3:25. Ridiculous!", "rating": 2, "date": "12/28/2016"}, {"text": "Tried to go there on a Saturday night after 9. We had a large party and were told that it would be a 45 minute wait unless we wanted to split up our group. Hostess was not pleasant. Can&amp;#39;t speak to the food but based on that experience there&amp;#39;s not much reason to go back.", "rating": 1, "date": "6/10/2017"}, {"text": "Omaha&amp;#39;s Cheese Cake Factory is awful. There three days ago place was empty. Food was cold and the service was awful!  Our waitress couldn&amp;#39;t get  salad dressing any sooner than 10 min. Lots of other places to eat in Omaha. Take this one off you list.", "rating": 1, "date": "1/7/2017"}, {"text": "1 star due to being food poisoned. I went with my fiance, sister, and brother in law. I got the mushroom burger. The next day I was nauseous,but that night was the worst night of my life. I thought maybe I was getting that nasty bug that&amp;#39;s going around. Oh no...my fiance ate my other half of my burger leftovers the next night and is now sick just like I was. Lasted about 8 hours of pure DEATH! It was everyone&amp;#39;s first time except for me...thought it would be a nice night out to celebrate the holidays...", "rating": 1, "date": "12/31/2016"}, {"text": "It&amp;#39;s Cheesecake Factory you should know what you&amp;#39;re getting, over priced mediocre food.", "rating": 2, "date": "6/23/2015"}, {"text": "So I got a message from the Cheese Cake Factory&amp;#39;s manager saying I should have brought it up to them about my food being cold. Well I did to your server and all she said was, &amp;#34;Oh, I&amp;#39;m sorry&amp;#34;. Your place was packed when we left. Maybe the manager should go around and ask their guest how every thing is going. Trust and believe I will Never eat at your place again. I only went since my daughter came out of town to visit me. She wanted to eat there. I don&amp;#39;t like eating in Omaha. Only in Sarpy CO, or CB.", "rating": 1, "date": "10/24/2016"}, {"text": "My Friends and I went there, as a diebetic I will admit it was a bad place for me to go... could have easily killed myself there ;0)<br&gt;<br&gt;Ordered a nice pasta dish that came out in a huge plate admittedly it was like $17, but we all ordered something we wanted and then we got several plates and shared the portions were large enough to make that a great way to try lots of stuff. The food all of it was good I&amp;#39;ll admit to having better else where, but it was still good.<br&gt;<br&gt;Then came the deserts!<br&gt;<br&gt;Again we all order what we wanted and they were large enough to share with 4 people.... white chocolate musse cheesecake.... chocolate mint cheesecake.... white chocolate macodamia nut cookie cheesecake?..... and the BOMB Red Velvet Cack Cheesecake!!!!!!  <br&gt;<br&gt;If for no other reason go there for the desert!!!!!!! I could have put myself in a coma and been happy to be there!", "rating": 4, "date": "9/12/2012"}, {"text": "The host should not have that work position as a employee.  She was there like a mute not even smile.  I know that&amp;#39;s rude for any client and bad for the company because I have a business too", "rating": 3, "date": "10/1/2014"}, {"text": "I&amp;#39;ve never been here before but my bf said it was a good place and he wasn&amp;#39;t joking! They have everything!! I have never seen a place with so many diverse food choices. The only thing is that it is a little pricey for my liking. The food was, however amazing. I had the little crab cake bites and a house salad and I tried my bf&amp;#39;s pretzel chicken and it was great. (Wish I had ordered that instead of my salad though lol) The dipping sauces where also very good and the service was great! Even with them being super busy we got our food and drinks in a timely manner. The waiter was also very pleasant and helpful.   I will definitely go back.", "rating": 4, "date": "2/27/2015"}, {"text": "We were there around 3 mos. ago and the service took foreverrr. It looked like our server had 2 entire sections to contend with. All told, I think we were there for a late lunch for about 2 hrs. Totally ridiculous. I&amp;#39;m sure some of it was due to a delay in the kitchen.   The club sandwich is good, but huge, so if you are not going home right away, then what do you do with all the leftovers? You can&amp;#39;t leave turkey sit in a warm car while you go out and about.<br&gt;<br&gt;Tried again today, having the Fish &amp;amp; Chips. The breading was barely crisp on the outside, all soggy in the middle and seriously, there was barely any fish inside the 4 pieces for lunch sized portion. Fries were average, coleslaw a little waxy tasting. Ordered a bowl of clam chowder soup, an extra $4.98. For the quality of my meal, I could have gone to Arthur Treachers or Village Inn for much less money. Strike that, just pick up some frozen fish sticks from Walmart and you&amp;#39;d have the same quality.<br&gt;<br&gt;Server seemed more preoccupied with chatting with staff elsewhere at the front counters. I wish I could have whistled loud enough to get his attention to call him over. Took forever to get the soup to the table (brought by a different employee finally), and then our server brought my meal out a minute later. He only had two tables to attend to, so not sure why he couldn&amp;#39;t have checked back at the proper times. He also seemed to really not care about if my meal was okay or not, he seemed to rush past (to do what, I have no clue). His tip reflected his attitude.<br&gt;<br&gt;I think Cheesecake Factory needs to do better to get my business. We are not going to go out of our way to eat here and spend $50 on lunch again.<br&gt;<br&gt;Red Velvet Cheesecake is quite good, but was a bit on the dry side, so wonder if it was fresh or what.<br&gt;<br&gt;Avoid the fish &amp;amp; chips and as far as service, just hope for the best.<br&gt;<br&gt;Update: upon emailing corporate and giving feedback, they kindly passed my remarks along and I did receive a gift card in the mail. I&amp;#39;m pleased that corporate does care about the feedback they are receiving in regard to the menu.", "rating": 2, "date": "1/13/2012"}, {"text": "Poor service.  Waiting for an hour + with a family and children is unacceptable. We checked in and moved to bar area and was switched waiters twice.", "rating": 2, "date": "1/18/2016"}, {"text": "Nothing to see here, folks. <br&gt;<br&gt;I&amp;#39;ve come here with friends and/or family three times, and on all three occasions I left disappointed. The corny yet elegant atmosphere, association with cheese-cake, and high prices lead you to believe that your meal here will be decadent and bursting with flavor. Unfortunately, everything I&amp;#39;ve eaten here has been just the opposite. Bland, flavorless, forgettable... <br&gt;<br&gt;The cheesecake is alright, but nothing extravagant, and definitely nothing to write home about. <br&gt;<br&gt;If I was just rating on the basis of the quality of the meals I&amp;#39;ve had, I&amp;#39;d give this place one star. However, many of the meals come in massive portions, the design of the dining room is pretty neat (though childish), and most of my friends and family have been satisfied with their food, so they limp into a second star.<br&gt;<br&gt;My suggestion to Cheesecake Factory would be to focus less on offering a hundred bad meals and more on offering a dozen or two good ones.", "rating": 2, "date": "10/10/2011"}, {"text": "I just have to say the management and staff here were awesome!  I wanted to surprise my boyfriend for his birthday last night and they completely helped me do that.  Miguel, supervisor, had my table ready to go at 7 with a bottle of wine and the balloons I brought in and the service was fantastic!  The food was spot on and the night was amazing.  I couldn&amp;#39;t have thanked them anymore for accommodating what I wanted.", "rating": 5, "date": "12/18/2014"}, {"text": "I love the cheesecake factory... but this one sucks.  Poor service, and food seemed off!  How do you mess up SHRIMP?!  <br&gt;<br&gt;It wasnt peak time - there was no wait to be seated... plenty of empty tables.  Yet it took me about 10 minutes to get a menu, another 15 to get water and bread.  WTF<br&gt;<br&gt;Its a shame - because normally I love this place to eat; I guess not in Omaha is the lesson I learned.", "rating": 1, "date": "7/10/2011"}, {"text": "A review from one of my eighth grade students...<br&gt;<br&gt;Pros<br&gt;Great food<br&gt;Clean <br&gt;Amazing desert<br&gt;Reasonable hours<br&gt;<br&gt;Cons<br&gt;Service takes a while<br&gt;Waiting for a table<br&gt;Busy <br&gt;<br&gt;        I have had many great experiences at The Cheesecake Factory. The Food is high quality and it has great prices. I would definitely recommend if you are looking for a place to grab lunch or dinner and  dessert. They are open at reasonable hours Monday through Thursday they are open at 11:00 am- 11:00 pm, Friday and Saturday they are open from 11:00 am- 12:00 am. On Sunday they are open from 10:00 am- 10:00 pm. The prices range from $11.00 to $30.00 for most of the food items on the menu. They take reservations and its family friendly. <br&gt;<br&gt;        The longest I have ever waited for a table at the Cheesecake Factory is about fifteen to twenty minutes. The servers are nice and friendly but they can take a while to get to your table because it is always so busy. They allow reservation and they have carry out so it is great if you&amp;#39;re lazy and you want to stop by after work and get something to eat. I would recommend the Chicken Picatta it is full of flavor and it&amp;#39;s good if you like lemons.<br&gt;<br&gt;        Overall my experiences have always been great here the food is delicious and the environment is clean. Although it is very busy I think the food is worth the wait. The restaurant is family friendly but it is not overwhelmingly loud. The Cheesecake factory has a vast menu so there will always be something new to try. This restaurant is a great choice for any occasion.<br&gt;<br&gt;Another review from one of my 8th-grade students...<br&gt;<br&gt;Pros,<br&gt; the food was good,<br&gt; the building&amp;#39;s design was realty cool<br&gt; the people who worked there were really nice.  <br&gt;<br&gt;Cons, <br&gt;there wasn&amp;#39;t a lot of lighting,<br&gt; confusion with the employees,  <br&gt;<br&gt; The Cheesecake Factory at Westroads mall is known for their cheesecake, hence the name. Just because it is all about cheesecake it doesn&amp;#39;t mean that is all they serve. They have a variety of lunch and dinner items. The building is a dimly lit place with cool artwork decorating the walls. I think the restaurant is Egyptian themed but I am not sure. <br&gt;<br&gt; When I went to The Cheesecake Factory for the first time I didn&amp;#39;t have the best experience. I got there on a Sunday at about 3:30. It was surprisingly busy at this time. I have not gone on a different day other than a Sunday so I don&amp;#39;t know if it is that busy every day. The time I arrived was the period in which they were switching shifts. So our waiter got confused. Even Though they were having some problems finding who was supposed to serve us, the employees were very kind and tried their hardest to fix the mess.<br&gt; unfortunately, it was just a lot of waiting. When I came I was just there for the cheesecake. Let&amp;#39;s just say I was very impressed. My family and I all ordered cheesecake to share with each other. The only other thing I ordered was a smoothy. The cheesecake tasted really good. It was rich and was everything cheesecake should be. My favorite was the white chocolate raspberry. On the other hand, my smoothy was not that great. It lost its flavor and tasted like ice with some mango. Even Though I didn&amp;#39;t have a fantastic time, I think it is still a good place to go for a treat. <br&gt; <br&gt;This is definitely not a restaurant for people on a diet. It is nearly impossible to resist such good looking food. Obviously, cheesecake isn&amp;#39;t very healthy, but it can&amp;#39;t hurt to have some every once and awhile. The only thing that really bothered me was that they didn&amp;#39;t have much for lighting. It was hard to adjust after coming from a sunny day. I would not recommend you go there if you have trouble seeing in low light. Also, I recommend not going on the weekend.", "rating": 5, "date": "2/13/2017"}, {"text": "Although I prefer to support locally owned restaurants, we were given a gift card for Christmas.  The service was excellent and our entrees were delicious.  Not a fan of the side salad I ordered and will forego it in the future.  My fiancé&amp;#39;s Chicken Costoletta was delicious and enough for two meals.  I had the best Fish and Chips I have ever had in Nebraska...again enough for two meals!", "rating": 4, "date": "1/22/2014"}, {"text": "Not really impressed overall.  Stopped in on a Sunday evening and the place was packed, so it is definitely popular with a lot of people.  I am always immediately skeptical when a restaurants menu is the size of a children&amp;#39;s book.  Usually when you try to be everything to everyone, you end up being mediocre at best.  That pretty much sums up my experience.  As the place was packed, our server seemed a bit overwhelmed.  She was friendly, but it took quite a while to grab our drink orders and ask if we wanted to put in any appetizers.  Not a big deal, but to wait then a bit longer for our drinks, only she forgot mine.  After a second reminder, my single Moscow Mule showed up 25 minutes after I ordered it.  I ordered the Rib Eye, and it was fair at best.  It was prepared just fine, but was somewhat tough and lacked flavor.  Our server managed one water refill during dinner, and pretty much all 9 of our water glasses were empty for the last 25+ minutes we were there.  While overall this place doesn&amp;#39;t merit a 2 star review, it barely makes 3 in my book.  There simply was nothing that was a stand out, and our server simply had way too many tables to contend with to provide decent service to any of them.", "rating": 3, "date": "7/25/2015"}, {"text": "What can you say about Cheesecake Factory? If you&amp;#39;ve been to one, you&amp;#39;ve been to them all. There was no wait for a table and the food arrived quickly. This location was a lot less busy than the one on Michigan Ave. in Chicago. I ordered the Baja Tacos with the black beans and rice. The fish was a llittle bland, but the beans and rice were tasty. My grandmother ordered the fried shrimp and they were really good. The keylime cheesecake is yummy, even though I did not taste any cream cheese, it was more like keylime pudding. We had two different waitresses and they were both pleasant and friendly.", "rating": 3, "date": "4/15/2011"}, {"text": "This review pertains to the To Go service.  I have now been waiting 45 minutes for ONE order.  The server just informed me that she has &amp;#34;talked to the kitchen manager&amp;#34; and they are &amp;#34;working on it&amp;#34;.  It is 7:30 on a Tuesday night.  The restaurant is not busy.  I called in a To Go order because I wanted To Go home with it.  They should probably rename this process To Wait.", "rating": 1, "date": "10/18/2016"}, {"text": "The menu is huge.  Almost too many choices.  I ordered spaghetti and meatballs and it was delicious.  We ordered garlic cheese bread and it also was very good.  What I didn&amp;#39;t like was the cheesecake.  It was mediocre and at $8 a slice I expected much more.  This is my first time eating here and because the food was so good I would eat there again but I would skip the cheesecake.", "rating": 4, "date": "10/17/2015"}, {"text": "Okay, do not get me wrong...I am a BIG Cheesecake Factory fan!  I love the West Des Moines, Iowa location with all my heart.  I know what I like and I do not care what people who think they&amp;#39;re &amp;#34;foodies&amp;#34; who rely on only local restaurants think.  If you&amp;#39;re so cross that you think you too good to eat at huge, clean, beautiful Cheesecake Factory, and would rather eat at some rat trap local restaurant instead (not all local restaurants are like that, but I&amp;#39;m just giving an example if you went there and it was run down and dirty), be my guest (actually, don&amp;#39;t be).<br&gt;<br&gt;THAT said, I&amp;#39;ve been to several Cheesecake Factory locations, and this one was clean and nice looking like the others, but for Omaha&amp;#39;s size, it was WAY too small.  The waiting area and the bakery area were consolidated into one area, making it very difficult for employees to wafer through the crowds with cheesecake for the bakery.  The waiting area itself is extremely small, and not enough seating was available for our wait (it didn&amp;#39;t matter to me, but to someone who is disabled or can&amp;#39;t stand for long periods of time, it would be).  <br&gt;<br&gt;Just on a side note: This was the first Cheesecake Factory that I&amp;#39;ve been to that is freestanding, and not connected to a plaza or major super regional mall.<br&gt;<br&gt;Once we were seated (we were quoted 15, and it ended up being 45...minus one star), the waiter promptly brung us bread (wheat is the best!) and took our order.  Me and the boyfriend&amp;#39;s meals were perfect!  Had my usual Pasta Da Vinci with extra extra shrimp (overpriced, but awesome) and extra mushrooms, and had key lime cheesecake for dessert.  <br&gt;<br&gt;Customer service great...one star.  Decor...very nice...one star.  Food...awesome as always...one star.  No fourth or fifth star because of the small waiting area and the extensive waiting time to be seated.<br&gt;<br&gt;We arrived at 5PM on a Saturday evening, and boy was it busy!  Please plan ahead when deciding to come here during peak times.  <br&gt;<br&gt;Personally, I think The Cheesecake Factory would have been more appropriate to be built out by Village Pointe (or Regency Court), where upscale shopping is key.  Westroads Mall is the largest mall in Omaha (and all of Nebraska, for that matter), but not the nicest.  But I can&amp;#39;t help that...thank you!", "rating": 3, "date": "2/22/2012"}, {"text": "Pros: Dessert is good<br&gt;<br&gt;Cons: Everything else<br&gt;<br&gt;I remember my parents calling me all excited when they found out Cheesecake Factory was finally opening a location in Omaha. &amp;#34;We&amp;#39;re finally on the map!&amp;#34; Okay, maybe it isn&amp;#39;t THAT spectacular, but people in my hometown took the news as if the second coming of Christ arrived. I&amp;#39;ve eaten at Cheesecake Factories everywhere, and have always had one question: Why do so many people love this place?<br&gt;<br&gt;I can&amp;#39;t stand it. Every location is way too busy (even in cities with strong restaurant scenes like Seattle, Dallas and Chicago), it&amp;#39;s too loud, there&amp;#39;s nowhere to sit, you feel rushed, it&amp;#39;s overpriced, the menu is expansive, which is always a warning flag for me as they make many things but specialize in none, they give you way too much to eat and it had a bland, boring atmosphere to it.<br&gt;<br&gt;The Omaha location isn&amp;#39;t any different.<br&gt;<br&gt;Omahans LOVE chains, which disturbs me as more chains are taking over from the charming local restaurants that I used to love in my hometown. Do yourself a favor: skip this place and give your money to one of the local restaurants out there.", "rating": 1, "date": "10/15/2009"}, {"text": "My first experience with Cheesecake Factory was back in Seattle, and I could never understand how in a city with such fantastic restaurant options, people would wait more than an hour for marginal food.  The popularity in Omaha is completely out of whack with the food and experience, and I wish I had an explanation as to why people flock here in droves.  I have the following theories:<br&gt;<br&gt;1) Good Housekeeping had an article that eating at this place cures female fertility problems.<br&gt;2) They have a secret menu for Republicans that&amp;#39;s a massive improvement over their menu for everyone else.<br&gt;3) People with children eat for free.<br&gt;<br&gt;Otherwise, I can&amp;#39;t explain why this place is so popular and also so mediocre and overpriced.", "rating": 2, "date": "1/19/2008"}, {"text": "Food is average at best. Dessert was good, but as usual, expensive. <br&gt;<br&gt;Our waitress was Angela. She had to be hyped up on 3-4 cups of coffee.<br&gt;<br&gt;One of the pushiest people I&amp;#39;ve ever met. She:<br&gt;- spilled my drink twice.<br&gt;- never brought anything to clean up these drinks.  I had to use napkins. I never got a new one.   <br&gt;- never let us finish what we were saying when answering one of her questions, or making a request. <br&gt;- took my dinner plate away without asking, and I wasn&amp;#39;t anywhere close to done. <br&gt;<br&gt;It got to the point where it was laughable. However, it gives me all the more reason not to go back to this chain.  Should have stuck with my instincts. <br&gt;<br&gt;Good luck", "rating": 2, "date": "10/23/2010"}, {"text": "Not impressed with this location. Slow service. Took server a long time to return to the table after each request. Salty and greasy food. Had to send back my appetizer because it was burned. Manager did come out to apologize so that was good. Please re-visit your recipes. The lettuce wraps were too saucy, skimpy on the meat, and very salty.", "rating": 2, "date": "11/21/2013"}, {"text": "Like Daniel said, the menu here is expansive.  I think the waitron told us there was something like over 100 menu items.  I will admit, I have stayed away from this place.  Generally, I am against large chainstyle restaurants.  When I have traveled to Chicago or KC, I remember friends saying, &amp;#34;you&amp;#39;ve got to eat at Cheesecake Factory&amp;#34; and me thinking, right, I&amp;#39;m not going to that place. <br&gt;<br&gt;We went simply because my husband had received a gift card.  I wasn&amp;#39;t excited but Ifigured it was a free meal.  It took me forever to decide what to get.   I finally decided on CHICKEN MADEIRA, their  Most Popular Chicken Dish (Sauteed Chicken Breast Topped with Fresh Asparagus and Melted Mozzarella Cheese, Covered with Fresh Mushroom Madeira Sauce.  Served with Mashed Potatoes).  THe portion size was huge. THe taste was wonderful.  I loved it.  Very much comfort food.  We also had the Spicy Ahi Tempura Rolls, which sounded really different and we really like them.  I think I could go there and get just appetizers, there are so many that sound good.  <br&gt;<br&gt;My husband had the Navajo sandwich which comes on fry bread.  I had a taste and it was good.  <br&gt;<br&gt;We were SOOOO full by the huge portions (and I took half of mine home) that we were too full for dessert.  We&amp;#39;ll have to go back for cheesecake sometime.", "rating": 4, "date": "1/19/2008"}, {"text": "Food was great.  Service was far from good, waiter was talking to his friends instead of doing his job, mentioned this to management and they made no attempt whatsoever to correct the situation.", "rating": 3, "date": "9/4/2016"}, {"text": "Okay, so first let me say the cheesecake was amazing. I&amp;#39;d go back for that, but my word was the rest of my experience abysmal. I ordered the veggie burger. 30-40 minutes later some man who didn&amp;#39;t identify himself (maybe the manager? I have no idea because he just showed up at our table) comes over to tell me they are out of the veggie burger. Bummer, especially since it&amp;#39;s one of the cheaper vegetarian entrees. So then I order a pasta dish that is about $5 more because he asks what else I want without giving me a menu and it&amp;#39;s the only thing I can remember. And I get charged full price for the more expensive item that I didn&amp;#39;t really want in the first place. You would think they would at least offer to let me pay for the cheaper veggie burger, but no. Ouch. And everything is so expensive to start with. The server was fine, the kind that would only stay at the table long enough to ask if you&amp;#39;re enjoying everything okay but not stay for the answer. The food was alright, not worth the prices I&amp;#39;m afraid. Or at least their pasta isn&amp;#39;t worth $15 when it&amp;#39;s identical to something you can get at Applebee&amp;#39;s for half the price. I may try something different at a different Cheesecake Factory in the future, but really I&amp;#39;m put off by the fact I got charged $15 for an entree I got stuck with because they were out of the $10 entree I wanted and they literally did nothing about the situation. I&amp;#39;d be willing to bet there were veggie burgers in the back, they just wanted some extra $$$.<br&gt;So in review: cheesecake is always good, they don&amp;#39;t keep veggie burgers, and if you order something and they don&amp;#39;t have it you&amp;#39;re SOL because they will expect you to pay for something more expensive.", "rating": 1, "date": "8/31/2014"}, {"text": "The thing about the Cheesecake Factory is its expansive menu.  They have a menu that reads like an encyclopedia of food.  When coupled with a nice new building and a good staff this is a great place to go when you do not know what you want to eat, but want something good.<br&gt;<br&gt;Imagine Leonardo Da Vinci as a chef, he would work at the Cheesecake Factory.", "rating": 5, "date": "2/17/2007"}, {"text": "We went here to eat this afternoon &amp;amp; was surprised to get seated rather quickly, being told our server would soon be with us. Quite some time went by and a wonderful young waitress approached our table asking if we&amp;#39;d been helped yet. We said no &amp;amp; she immediately told us she tried to find who had our booth but wasn&amp;#39;t going to leave us sit any longer. Took our order &amp;amp; said she&amp;#39;d tell them to put a rush in it as we&amp;#39;d waited a long time and need to leave shortly. 15 minutes later my husband was served, 10 minutes later my daughter &amp;amp; myself with an explanation that my fries were being cooked and they&amp;#39;d bring them right out. No one ever came back until we were finished &amp;amp; needed to leave. I was stuffed anyway as the portions were huge &amp;amp; asked that they please just take them off my bill. She was mortified that we had such poor service &amp;amp; took it upon herself to send the manager ( I assume ) over. He asked us what our experience was like &amp;amp; we told him.... Not complaining... Because, STUFF HAPPENS. He said that&amp;#39;s NOT the way they like to handle business ... They took our drinks off of our bill &amp;amp; sent us home with 3 slices of DELICIOUS CHEESECAKE. All of our food was wonderful, a bit pricey but we knew that going in. We were very impressed with their insistence to apologize &amp;amp; attempt to make it right....", "rating": 4, "date": "4/23/2016"}, {"text": "After about a half hour wait, we were finally seated...on the first floor that had been closed when we walked in! Then after our timer/sensor went off, we still waited! When we finally asked, we were told that we belonged seated on the first floor....well, when were the gonna tell us? As for the food and service, delicious and great! Only 1 issue....my beans could&amp;#39;ve been served hot!", "rating": 4, "date": "8/6/2016"}, {"text": "I am shocked to see so many people having poor experiences at the Cheesecake Factory.  Wow, this place has good food &amp;amp; a huge menu!  In fact, of the two times we&amp;#39;ve been, I have been shocked at the fantastic food.  I usually go before prime hours and not on weekends and even then, service sometimes lags a bit but never to the point of being mad.  The prices are a bit high but I have no problem with it based on the huge portions and fantastic food.  I have to believe that the poor ratings were for dining during peak periods when service was stretched and maybe food was prepared through shortcuts.<br&gt;Overall: HUGE menu, really good food, interesting atmosphere, slow service, long waits during peak times.", "rating": 4, "date": "12/10/2009"}, {"text": "I was not impressed with this place.  It was busy and it was beautiful but my impressions dropped off from there.<br&gt;<br&gt;I ordered a house salad but never actually tasted any salad dressing (thousand isaland) on it...it was bland... My son had a pizza...it was dry..I didn&amp;#39;t see any sauce, we had to order marinara sauce so that he could choke it down...The burger my daughter ordered was unimpressive...<br&gt;<br&gt;My waitress while friendly and efficient was almost stepford like...I got the impression it was the &amp;#34;cheesecake way&amp;#34;.. she was suppposed to act...I would have preferred casual and friendly...<br&gt;<br&gt;I don&amp;#39;t think this is one of those &amp;#34;one time bad expreriences&amp;#34; I think it was business as usual for this place..", "rating": 1, "date": "9/26/2011"}, {"text": "I have always loved the cheese cake factory! Great food for a decent price. Awesome wait staff. And unique decor throughout.", "rating": 5, "date": "6/23/2016"}, {"text": "I love everything I get from any Cheesecake Factory.  This location has good service and designed for families with children.", "rating": 4, "date": "11/6/2013"}, {"text": "Katia our server was amazing, super friendly and very fast service. The food was excellent our whole experience was great! This was at the Green Valley Pkwy Henderson NV 89052.", "rating": 5, "date": "3/31/2016"}, {"text": "amazing ranch. unique recipe, lots of garlic. <br&gt;don&amp;#39;t buy it in the bottle though, it doesn&amp;#39;t keep well.", "rating": 4, "date": "9/19/2012"}, {"text": "We recently moved to Nebraska and were hanging out in Omaha for the day and decided on The Cheesecake Factory for lunch. The menu was huge but we decided on the Renee&amp;#39; lunchspecial or something like that. The food was good and we ordered 2 pieces of cheesecake to go because they looked good. The ones served in the restaurant to people around us were huge and seemingly worth the $8. BUT when we got home we were incredibly disappointed because the size of the slice was probably half the size of the ones served in the restaurant but they were still $8!!!! Totally ridiculous! Probably won&amp;#39;t be coming back.", "rating": 2, "date": "10/20/2013"}, {"text": "Terrible, terrible and terrible. The only reason I would except this one to have one star is that the server was nice. The tables were losing there varnish and the copper at the end of the table had never been polished. The interior was pretty lovely. My wife and I ordered two cocktails that tasted like the juice was really old. The Ahi Tartare was frozen tuna, don&amp;#39;t eat AHI hear if you like AHI!  The Da Vinci pasta was made with really cheap penne. The chicken was bland. The Calabrian pizza slices fell downwards after grabbing a slice to take a bite. What really stood out was the wild mushroom soup. I couldn&amp;#39;t help but have this taste in my mouth of uncleaned mushrooms. I could not taste anything else even when I tried to wash it out of my mouth. Looking around I did notice that other customers were leaving food almost untouched on there plates. There will be no reason to come back here again.", "rating": 1, "date": "3/18/2015"}, {"text": "I ordered the lemon chicken with mushrooms. I forget the name, but it was really good. The sauce went great with the noodles. However, my wife had the other chicken special and it was extremely bland. No taste at all and was cold. We sent it back and the manager came over and apologized. Then we got the billed and noticed the waiter ordered me the huge $17 diner plate vs the $11 lunch special, which was the main purpose we went in for lunch. But it was too late, and didn&amp;#39;t even feel like talking to them about it. The cheesecake was exceptionally well though, highly recommend that even if your full. This place upset our visit here.", "rating": 2, "date": "5/27/2012"}, {"text": "I just don&amp;#39;t even care if this is a corporation. I love it. Orange chicken, yes. Avocado roles, yes. Just all of it, yes. Maybe one thing could change: the prices. If I am going to die without it, I usually go when its the brunch menu.", "rating": 5, "date": "12/12/2012"}, {"text": "Bland..bland...bland. Cheesecake Factory...where has your quality gone???!! From the salad to the entree, I was highly unimpressed. We actually sent my entree back because it was very bland, cold, and left a disgusting taste in my mouth. I think I had the same entree (chicken romano) a few years ago and it was very good. Very disappointed. Will not come back here again to pay $40 for a very bland, cold lunch. It appears chains are really starting to get worse. I hope this gives our small, family owned resturants a chance to break from the overpowering shadows of the massive amounts of chain resturants.", "rating": 1, "date": "5/28/2012"}, {"text": "Went to the Cheesecake Factory over the weekend. It was busy probably because of the College World Series. It took 45 minutes to get our food. The manager stopped by our table and apologized for the delay and only offered us more bread!!! I felt we should have been offered a discount on the meal or on some cheesecake. I wasn&amp;#39;t overly impressed with the food for the price. I mostly like won&amp;#39;t go back.", "rating": 2, "date": "6/16/2015"}, {"text": "The Cheesecake Factory use to be one of my favorite restaurants. The problem is that the menu is so huge that many items are dumped and replaced with new entrees. I have had so many favorite dishes in the past, but most are now gone! I was currently unimpressed with my last two trips because the new entrees only left me wanting some of my old favorites. Maybe, the Cheesecake Factory should sell the retired recipes in a cookbook because they are going to need the revenue growth someday soon! I can remember when people waited in line for almost an hour to be seated at this restaurant. Days gone by...... I would be interested in hearing other people mention a recipe that has been retired and is missed! In addition, do not even try to order the Strawberry Shortcake desert. The item is on the menu, but never available any longer. Strawberries are apparently now being reserved for the Cheesecake!", "rating": 2, "date": "2/23/2014"}, {"text": "We had lunch there on Friday October 9th about 12:30 and there were 13 of us.  We were there for a a pre-wedding lunch with family.  They seated us right away at hightops by the bar area which was FANTASTIC!  Our waiter came over to us right away and took our drink orders (Everyone just ordered water, pop, or tea). We ordered 2 appetizers and were waiting for our bread but the bread never came.  Finally, after our appetizers came we asked for some bread - which usually bread comes as soon as you sit down.  We then all ordered.  My husband and I were the first to order and he got the pit beef sandwhich and I got the cajun chicken littles.  Everyone got their food except for my husband and I and one other person.  After about 10 minutes they brought the other persons food but still not ours.  We had to ask twice about our food and finally after everyone was 3/4 of the way done eating we got ours.  I think he had forgotten to put ours in or something.  It took quite awhile to get our checks and then he had messed up a couple of our checks - additional charges and he also gave someone the wrong credit card slip.  We were really running behind and it was taking forever to get our bill fixed and to get our food boxed up.  This waiter was very nice but either had never had a large group before or needed help.  It was not a good experience at all.  Our food was very good but the rest of the experience was very bad.", "rating": 2, "date": "10/12/2015"}, {"text": "Really, how can they take so many delightful ingredients and beat all the flavor out of them?  It&amp;#39;s not terrible, I admit.  It just doesn&amp;#39;t seem to be much of anything at all.  I&amp;#39;ve eaten there twice, and that was once too many.  My family shares bites all around, so we get to taste what everyone&amp;#39;s having.  The verdict was unanimous: bland, uninspiring food, not worth the time or the money.  And you can get better-tasting cheesecake over at Whole Foods.", "rating": 2, "date": "8/25/2011"}, {"text": "I don&amp;#39;t know what everyone else on here is ordering, but I have never gotten bland food at The Cheesecake Factory in Omaha or anywhere else. I have tried several salads, a burger, club sandwich, meat sauce spaghetti, and the alfredo; none of them were bland although I wasn&amp;#39;t super impressed with the alfredo. It is expensive but you get massive portions. My family likes to try everyone else&amp;#39;s food when we eat out so this is a plus for us. The cheesecake is amazing if you have room for it. <br&gt;<br&gt;My only complaint about the place is their ridiculous alcoholic drink prices. I went there by myself after shopping one afternoon and spent close to $30 on 3 drinks......wtf. They don&amp;#39;t list the prices in the drink menu and they really aren&amp;#39;t that great. I had their red sangria and it was decent, but not worth $9 a glass. Also the service seems to be either amazing or leaving you wonder if they are hiring randoms leaving the mall.", "rating": 4, "date": "12/13/2011"}, {"text": "great service. &amp;nbsp;great dessert.", "rating": 4, "date": "10/16/2011"}, {"text": "Made my once a year trip to Cheesecake Factory to see if they have returned the Thai Steak Salad to their menu.  No such luck. This was the best salad ever in any restaurant and was my reason for eating there. It was great...on an expansive menu, for some reason ....probably because it was really good...they dropped it. So today, no Thai steak Salad. The service was so sloooow. I&amp;#39;ve seen tree sloths with more raw speed. Mediocre nachos with weird chicken and the jalapeños were just the ends of the peppers...the part you are supposed to throw away. Took an hour to get nachos and meatloaf. The tea was good. Took home two very small slices of cheesecake. Bring back the Thai Steak Salad...best thing that used to be on your menu.", "rating": 2, "date": "1/18/2014"}, {"text": "The Kmart of food.  As chains go, I&amp;#39;ve had worse, but this place is grossly overpriced.  The fact that anyone would spend that kind of money in there instead of patronizing any number of very good local restaurants for half the price boggles my mind.", "rating": 2, "date": "7/19/2008"}, {"text": "I can&amp;#39;t believe the masses go to this joke.  1 hour wait and overpriced food.", "rating": 1, "date": "1/19/2008"}, {"text": "I know the reputation of this place (especially on this board) but I don&amp;#39;t care.  I like it.  Now I&amp;#39;ve never had a great meal here but I&amp;#39;ve never had a bad one either.  For the most part, the food is somewhere between average and good and they&amp;#39;re consistent.  This is a great place if you&amp;#39;re with a large group and you can&amp;#39;t agree on where to go.  There&amp;#39;s tons of choices and something to satisfy just about anyone.  Recently, I tried the Morning Quesadilla and it was enjoyable.  It was huge and full of scrambled eggs, cheese, black beans, peppers, cilantro, bacon in a tortilla served with a side of pico de gallo, sour cream, and guacamole.  It is the perfect meal for the morning after a late night at the bar.  It&amp;#39;s even better when sitting outside when the weather is nice.  And while I enjoy the ambiance, it can be loud, and hurried.  Personally, I can&amp;#39;t speak for the cheesecakes because I don&amp;#39;t like &amp;#39;em but the Carrot Cake is darn good.", "rating": 4, "date": "7/25/2010"}, {"text": "Good cheesecake, but twice I&amp;#39;ve gone there just to pick up a cheesecake to go and it took about 20 minutes each time. Not sure why it takes so long.  Another time a few friends and I ordered appetizers to share. I ordered the potstickets. We got 5 potstickers that were not much bigger or thicker than a quarter and it cost$9.95! Ridiculous! Large selection, but a bit on the expensive side fir what you get.", "rating": 1, "date": "12/23/2010"}, {"text": "I&amp;#39;ve been a few times now, the service has been good usually very busy. Good food love the cheesecake!! Great portion sizes for the money.", "rating": 4, "date": "5/18/2012"}, {"text": "I fail to see the allure of this place- the food is ok, but not great. I suppose if you were traveling and wanted something familiar, this &amp;#34;upscale chain&amp;#34; would fill the bill, but I certainly can&amp;#39;t see this as a destination restaurant.", "rating": 2, "date": "6/25/2007"}, {"text": "I thought I would try it out. One of my girl friends was just bragging about it. Personally I thought the food was ok and the service the same. The price for the quality of food seemed high to me. At least the dessert was good.", "rating": 3, "date": "9/3/2011"}, {"text": "Worst 12.95 chicken sandwich i have ever had...my husband ordered a burger and it was small...portions horrible...and we did not choose to order a 7.95 piece of any desert(outrageous price)...the service was below below belowwwwwwwww average...no refills on water and the server asked as he was walking bye how is everything(serious were you addressing me) or the person next to me...but then who would know the two top tables are so close together. He left the bread plates on the table...poor very poor service....will I return to this establishment not even with a gift certificate.", "rating": 1, "date": "3/8/2014"}, {"text": "lets just start off by saying I loved the Overland Park KS Cheesecake Factory, when I lived nearby I was there often. over the span of ten years well.. I loved them. the servers knew me. I know people think Kansas City is a food town and they are, they have too much processed food for me now that I went organic and I had to be careful of my places I went.  Cheesecake Factory was fresh enough and I just wasn&amp;#39;t going to give them or my cheesecake- up.  since the Omaha one i haven&amp;#39;t tried yet,  I decided to try them and sit at the bar for lunch today. first.. the Omaha Factory looks exactly like Overland Park so I was immediately at home. the bartender was sweet yet efficient and didn&amp;#39;t tarry getting me my check/order/food.. I respect that they honor people at lunch like that..  second.. they won my approval by giving me a dish not a tiny cup for my tex mex eggrolls avocado crème. it gets tiring having to ask all the time for a second one to dip. I had plenty.   the eggrolls were delicious. I can&amp;#39;t wait to come back and test out some of the menu items I&amp;#39;ve been wanting to try..  awesome!", "rating": 4, "date": "3/31/2015"}, {"text": "It&amp;#39;s cheesecake factory. Huge menu, from orange chicken, to pasta, to steaks to burgers, it&amp;#39;s here. Everything is a big portion and tasty. And of course the cheesecake is 5 stars.", "rating": 4, "date": "5/13/2010"}, {"text": "Although we have not had a meal here, this is an excellent place to go have dessert.  We had the tiramisu cheesecake, and it was excellent, and everyone in our party thoroughly enjoyed their dessert.  The cost for my wife and I to have coffee and cheesecake was about 25.00, so a little pricey for dessert, but I feel as though it was worth it.", "rating": 5, "date": "4/28/2007"}, {"text": "Every dish I have tried has been excellent. By far my favorite restaurant. If you go request a booth otherwise you will be banging elbows with strangers... Unless you are into that type of thing.", "rating": 5, "date": "9/19/2012"}, {"text": "The Cheesecake Factory is decent chain restaurant that offers both extensive dinner and dessert menus. The price is right (on most items) and the atmosphere is reminiscent of Disney World. There&amp;#39;s something here for everybody. Service is mediocre, expect to be here a good hour or more.", "rating": 3, "date": "3/19/2012"}, {"text": "this place used to a lot more budget and quality friendly. my girlfriend and i thought we&amp;#39;d go there to split some fish and chips. we were disappointed. they serve less fish now and they cook it differently, plus i think the price went up. fish didn&amp;#39;t taste as good, but we still like the atmosphere, next time I&amp;#39;ll drink more so i don&amp;#39;t have to think about the lower food quality", "rating": 2, "date": "2/2/2011"}]}