{"address": ["5600 N Penn Ave", "Oklahoma City, OK 73112"], "monthly_reviews": {"2019": [[0, 4.0], [1, 4.0], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.0], [7, 3.5], [8, 4.0], [9, 4.5], [10, 4.5], [11, 3.5]], "2017": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.0], [7, 4.0], [8, 3.5], [9, 4.0], [10, 3.5], [11, 3.5]], "2020": [[0, 3.5], [1, 3.5], [2, 3.0], [3, 3.0], [4, 2.5], [5, 3.0], [6, 3.5], [7, 3.5], [8, 3.5], [9, 3.0], [10, 2.5], [11, 3.0]], "2018": [[0, 3.0], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.5], [7, 4.0], [8, 4.0], [9, 4.5], [10, 4.0], [11, 4.0]], "2021": [[0, 4.0], [1, 4.0]]}, "reviews": [{"text": "During a pandemic you would think CF would have a working outdoor patio.  Nope!  It was a pleasant 61 outside and no wind--and both outdoor patios were closed.  Very frustrating.", "rating": 2, "date": "11/1/2020"}, {"text": "*****UPDATE: We ended up being asked to come back and ask for the manager to make sure they redeem themselves after our initial visit. But, even before our server found out that we were a unique table, she was already going above and beyond to make our visit a good one! This time, our food was prompt, delicious, and fresh! The service was pleasant, attentive, and perfect! Glad we decided to go back because they tried to make it right and provide us a gift card to fix the issues. We will be back! Thanks for making it right! <br&gt;<br&gt;******Previous visit: I really wanted to love my visit especially because it was where my coworkers took me for my birthday lunch. Although some of the food was great, most did not meet the mark. Our biggest complaint would have to be time. It took two hours from being seated to finally getting our food and only being able to eat half of it because we wanted cheesecake and could not spend the entire day there. Two hour lunch. It was ridiculous. The wait for every little thing was just soooooooo loooooong. I cannot stress how long we had to wait for everything. Our drinks went all the way down and sat empty for 20 min+ before getting refilled. It was like that between every time our server checked on us. It took forever to even get cheesecake. It&amp;#39;s already plated in a fridge, idk why it took so long. Then they mixed up our checks and it took another 20 min to get that sorted. Yeah I&amp;#39;ll probably come here if I want cheesecake but definitely don&amp;#39;t need to waste so much time of my life on dining in here. Also my food was super greasy it gave me acid reflux and didn&amp;#39;t even have much sauce. They need to work on a lot of things for me to go", "rating": 5, "date": "9/11/2019"}, {"text": "I went with a few friends for belated birthday celebrations. It took no time to be seated. Our waiter introduced himself, we ordered drinks, then started looking at the menu. I appreciated the QR Code menu &amp;amp; the actual menu availability as well. There were so many items on the menu! There were 25 pages to look through on my phone &amp;amp; we were all very overwhelmed. I ordered a Pineapple Moscow Mule, which was delightful! Then I ordered a Georgia Peach. It was okay; not the best drink &amp;amp; definitely did not compare to the mule. I ordered Avocado Egg Rolls for an appetizer &amp;amp; the Tomato Basil Pasta. The egg rolls were amazing, but the tomato basil was very heavy on the basil; I could barely eat it. I ordered a Salted Caramel Cheesecake &amp;amp; it was phenomenal. Overall it was a good restaurant; might go again but definitely would need to research the food beforehand.", "rating": 3, "date": "10/2/2020"}, {"text": "Service was outstanding.  Drinks refilled without asking.  Our server was Clint and he was phenomenally superb!  Food was good with huge portions.  My granddaughter&amp;#39;s chicken sandwich was the biggest I have ever seen.  She struggled as she inhaled the sandwich and finally finished it.  My husband said his fettuccine was perfect, and our grandson had spaghetti and meatballs.  He didn&amp;#39;t come up for air until he ate everything!  Amazing how much this 10 year old ate....more than I could.  This was a first for me to not continually look for our server to top off our drinks.  Clint was there filling our drinks w/o being asked.  Such a rarity!  I had a club sandwich and a small salad.  Bacon was crispy and the bread was toasted with a nice crunch.  I ended up taking half the sandwich home.", "rating": 4, "date": "8/1/2019"}, {"text": "Had an amazing time eating there on my anniversary, best Chicken Alfredo EVER! Best Bacon Bacon cheeseburger of all time, splendid bacon, and to top it all off ended the night with an amazing red velvet cheesecake, wallauh best restaurant ever!", "rating": 5, "date": "12/31/2020"}, {"text": "Wow!! I walk 30 ft from the door to the hostess stand after waiting an hour and a half and then you inform me I need a face mask to walk 20 ft to my table or you won&amp;#39;t seat me unless I have one. Your rules are pointless and asinine. It makes zero sense to require a mask to my table but not sitting at the table or to the restroom or to exit the restaurant.", "rating": 1, "date": "8/22/2020"}, {"text": "We reserved a table using the Yelp app and were able to be seated as soon as we arrived. While I have gone to The Cheesecake Factory many times, this was the first time I ordered the Ribeye. The Ribeye was very tender and was perfect with their mashed potatoes. I ordered a meal to go and it was ready as soon as I was ready to leave.", "rating": 5, "date": "12/20/2020"}, {"text": "In town for one night and hotel restaurant was closed. Thought I would play it safe and get Cheesecake Factory! Ordered Bang Bang Shrimp and Orange chicken. Bang bang had NO sauce- so basically got tempura shrimp. Shrimp was ok- but it&amp;#39;s all about the sauce! <br&gt;Orange chicken- also no sauce! So basically chicken tempura! Again- all the flavor is in the sauce!<br&gt;Thing to remember- check ur food before you leave!", "rating": 1, "date": "9/28/2020"}, {"text": "Food: 4/5<br&gt;Service: 4/5<br&gt;Cleanliness: 4/5<br&gt;Decor &amp;amp; Style: 5/5<br&gt;<br&gt;I still really like the Chicken Bellagio here after all these years. It&amp;#39;s not an amazing 5/5, but good enough to where it makes me crave it once every 1-2 years. I love the mixture of pesto and arugula. The hazelnut cheesecake is great!<br&gt;Definitely will come back here next year for the same exact item!", "rating": 4, "date": "7/24/2019"}, {"text": "After reading a review about the long wait for food we were hesitant to come here but we had a gift card we wanted to use. We got to the restaurant at 11am on a Sunday. They were not at all busy. There were 2 young ladies at the hostess station. They asked how many were going to be eating. It was just me and my husband  they told us to &amp;#34;wait over there&amp;#34;. We could see lots of people working and also that most of the tables were empty. We waited about 5 minutes and were considering leaving. Generally a 5 minute wait is fine but when the restaurant was almost empty we thought we could have been seated immediately.  There were no others waiting to be seated. I also think having read that the service is not good we were biased. Once we were seated our waitress came by immediately and got our drink orders. She brought our drinks and fresh warm bread and butter quickly.  The bread was amazing. Warm and fresh and very good. We had rye and white bread. Both were awesome. <br&gt;She took our order and brought out the food very quickly. My husband had an omelette that was stuffed with all kinds of goodies. He said it was really good. He also had a bowl of fresh fruit which we shared. It was really fresh and tasty. I had the lunch portion of Chicken Romono. It was pretty much chicken Parmesan with spaghetti. The red sauce that was on the spaghetti was really tasty. The portion of noodles was huge. The chicken was more of a lunch sized portion.  We were really happy with the food and the service we received once were were seated. <br&gt;As we were leaving, there was a line of probably 15 people standing and sitting around waiting to be seated. The restaurant was still over half empty.  This seems to be a problem for them. If they were understaffed I would maybe understand but there were lots of servers working.  Other then this issue I would have given them a 5.", "rating": 4, "date": "9/30/2019"}, {"text": "I am surprised at how wonderful the beet and avocado salad is. So much so that I failed to notice that there were no avocados on my salad. The other things, radishes, oranges, arugula, beets and toasted quinoa are enough. <br&gt;<br&gt;I ordered the passion mint fizz which is good and could be wonderful if they&amp;#39;d muddle the mint. <br&gt;<br&gt;The Very Cherry Ghirardelli Chocolate Cheesecake is really good. <br&gt;<br&gt;The staff is wonderful. My friend wanted a Frappuccino which they don&amp;#39;t have, but I told them to make a chocolate milkshake with two shots of espresso and it was a score.", "rating": 4, "date": "6/30/2019"}, {"text": "Love this place, waiter even brought out our cheesecake plate with mom and dad on it after asking us if we were celebrating anything. Yes it is expensive but food has always been solid.", "rating": 5, "date": "12/9/2020"}, {"text": "We went for my parents 40th anniversary dinner, and had a fairly good time. It was by no means our first trip, but it is not normally a place that I enjoy. It is fun for a group though. There was no wait, which is  always a plus. And while it is loud, the booths are private enough to provide some privacy. However, service was a bit below par tonight. Our server just didn&amp;#39;t seem all that interested in being there. <br&gt;<br&gt;One of the great things about The Cheesecake Factory are the cocktails, which are always great. The food has always been the turnoff for me. Not that it tastes bad, just that there are so many hidden calories that you can eat 3,000 in one meal and believe that you were eating &amp;#34;healthy.&amp;#34; Especially when the salads have more calories than the steaks. The good news is, and the reason for the 4 stars instead 3, is that they have increased the size of their &amp;#34;Skinnylicious&amp;#34; - low calorie - menu. Lots of great choices for under 600 calories. That&amp;#39;s better than almost anywhere. I&amp;#39;ll be back for that alone. <br&gt;<br&gt;Overall, it was a good night. Glad we came back", "rating": 4, "date": "11/17/2018"}, {"text": "Best Belgian Waffle E.V.E.R. <br&gt;<br&gt;Idk what they put in that batter, but Lord Jesus it&amp;#39;s good. The powder sugar just sweetens (literally) the deal. <br&gt;<br&gt;The fruit bowl...a miss. They add something funky and it makes the entire thing not so good. <br&gt;<br&gt;Their customer service is also a miss for me sometimes. It will be crappy hostess staff, but good waiters/waitresses. It&amp;#39;s never consistent though. <br&gt;<br&gt;But that waffle....always on point. I go for that and that only, cause the other menu items are also a miss for me.", "rating": 4, "date": "10/19/2018"}, {"text": "Came with a large group of 20 for company holiday party. Always impressed with the service, but especially impressed given how many of us there were. Food is always hot and fresh, well seasoned. Good cheesecake of course. I know people like to talk trash cause it&amp;#39;s a chain, but it&amp;#39;s a good chain - and I&amp;#39;ve never had a bad experience here.", "rating": 4, "date": "12/29/2019"}, {"text": "Consistently good! You can depend on being able to split an entree and their salads are huge!<br&gt;We are only a few blocks away and you can order &amp;#34;to go&amp;#34; and it&amp;#39;s ready when you get there!", "rating": 4, "date": "6/25/2019"}, {"text": "Even during the covid 19 pandemic they still produce great food great service and excellent cheesecakes. We had good waiters and waitresses here before but Brandon P. Goes babove and beyond even with the little details he does as a waiter.", "rating": 5, "date": "5/27/2020"}, {"text": "I mean come on???? Who doesn&amp;#39;t love this place? Huge menu, great food, friendly staff and of course, the CHEESECAKE!!! <br&gt;<br&gt;This place is great for big groups or a nice night for a date night. It can be a bit pricey when you order and appetizer, main course, cheesecake and drinks so bring your wallet. I asked to was dishes I. The back but they don&amp;#39;t allow that I guess. Smh. Haha. <br&gt;<br&gt;My favorites are the Sweet Corn Tamale Cakes, Chicken Marsala and every one of their cheesecakes. The menu is huge so you cant go wrong there! <br&gt;<br&gt;Enjoy!", "rating": 5, "date": "6/18/2019"}, {"text": "Went here for our 5th wedding anniversary (being a special place for us) and they wouldn&amp;#39;t sit us inside cause my husband forgot his mask, EVEN THOUGH I had mine. Who wants to sit outside when it&amp;#39;s gonna be chilly?", "rating": 1, "date": "11/6/2020"}, {"text": "For my birthday back in March I chose The Cheesecake Factory. I&amp;#39;m so glad I did because they did not disappoint.<br&gt;<br&gt;Arrived on a Sunday morning just as they opened for the day. We were pleasantly surprised to be able to choose from brunch or lunch menus. The only problem was there are so many options on the menu we had a hard time deciding what to get. Our server Aubrey was very helpful in making our decisions. She knew the menu quite well! We finally decided on chicken pot stickers as a starter, chicken and waffles for my boyfriend and I had the Chicken Riesling dish. Everything was brought our quickly, hot and delicious! For dessert we of course had a slice of the Mango Lime Cheesecake and I was treated with a FREE birthday mini sundae! They offered to sing to me as well... We passed on that extra! Lol<br&gt;<br&gt;Aubrey&amp;#39;s service was above and beyond. She treated me like a Queen on my birthday. You can tell she enjoys what she does! I honestly had a most enjoyable time on this Sunday morning! <br&gt;<br&gt;Thank you Cheesecake Factory for the impeccable service!! Especially your wonderful server Aubrey for making me feel so special on my day!", "rating": 5, "date": "4/12/2018"}, {"text": "Our visit this time was a mixed bag. We have had many birthdays at various locations throughout the country (Madison,Wi - SFO - Oklahoma - Kansas City) but this by far unfortunately was our worst. While a worst at CF still warrants a decent review it is likely to give us serious pause as to if it is worth returning, or if our high end check is better place sampling a local cheesecake venue.<br&gt;<br&gt;The pros: <br&gt;Great Cheesecake <br&gt;Professional apology and service from the manager<br&gt;Friendly, upbeat server who did her level best<br&gt;Smiling happy daughter eating cheesecake for her b-day<br&gt;These buffered the Venues rating considerably and shouldn&amp;#39;t be dismissed. It takes a lot to come to<br&gt;The table and say hey our artichokes aren&amp;#39;t right and get something else out to the table before everyone finishes Deseret particularly on a busy evening.<br&gt;<br&gt;The cons:<br&gt;Under cooked artichoke which was then burnt in an attempt to cook through on the grill, served with the heart removed. Most likely because it didn&amp;#39;t survive the charring. (Conflict was resolved acceptably by sending back the artichoke  and aforementioned apology provided, they removed the cost of the artichoke and charged me for my veggie burger).<br&gt;<br&gt;Incorrect item served to birthday girl, it happens (should have been Asian and was Mexican tacos) we sent back simultaneously w artichoke, again item was replaced with correct item and we paid for the consumer item.<br&gt;<br&gt;Food, even prior to the errors was staged poorly and delivered at various times - acceptable in various cultures, however we&amp;#39;re in the Midwest celebrating a birthday and would have preferred to eat together, and that is the typically the standard of service anticipated based on our location.<br&gt;<br&gt;Over all, if this was the sum of our experience with CF we would never go again, still we know some days in food service suck, and hence will likely try again, and when we do I know we&amp;#39;ll likely have a better overall review. <br&gt;<br&gt;It happens.", "rating": 2, "date": "7/16/2019"}, {"text": "I came here with a group for lunch on New Years Eve Day. It was pretty crowded, but we only had to wait about 20 minutes. The parking lot was kind of crazy and took a while to find some parking. The Cheesecake Factory has a parking lot by it, but the larger parking area is for the mall just across the lot. <br&gt;<br&gt;I&amp;#39;ve been to many Cheesecake Factory&amp;#39;s and they are all pretty consistent with quality and service. Their menu is all the same, we knew what to expect. I ordered my favorite &amp;#34;skinny&amp;#34; asian chicken salad. They have their normal menu and then a &amp;#34;skinny menu&amp;#34;. I usually just order off the skinny menu because they are so many delicious options that are healthier. The items on this menu are not too different from the ones off the regular menu, so why not eat something yummy and healthier?! Everyone enjoyed their food.<br&gt;<br&gt;Our waiter was good, but kind of awkward, it was weird. Not weird bad or weird good, just ... hmm ok that was awkward, but the service was satisfactory. I&amp;#39;d come again!", "rating": 4, "date": "2/1/2019"}, {"text": "The Cheesecake Factory never lets me down with the food. Slightly expensive, but large portions and tasty dishes compensate for it. I always recommend out of peak hours.", "rating": 5, "date": "7/28/2020"}, {"text": "I love the Cheesecake Factory ! Great atmosphere usually have an amazing waitress or waiter ! <br&gt;Went there today for a lunch date with my better half no wait at 2pm. That was shocking but loved that we were seated immediately ! <br&gt;Husband got the Cajun littles which is chicken tenders it&amp;#39;s his favorite not spicy at all ! Very fresh you can tell it was t sitting around ! I got the Pasta Cabanaro with Chicken which is really good ! I can never finish it but hey score guess I don&amp;#39;t need to cook ( lol ). We also got the Chocolate Tuxedo Cheesecake to split and to go !! <br&gt;Waitress was great , &amp;amp; friendly .. She was a little slower than usual but it was busy so I just believe she was at other tables .", "rating": 5, "date": "4/22/2018"}, {"text": "Went in today for lunch &amp;amp; got the Louisiana Chicken Pasta. It was very tasty. And my server... he was phenomenal, wish I remembered his name so that I could give him his props.", "rating": 5, "date": "10/1/2020"}, {"text": "The food is sub par. Especially for the prices. The waitress was friendly. One person in our party got food that was so bad it was inedible and that was after they told us they&amp;#39;d served the first plate they fixed to to wring table meaning we had to wait an additional ten minutes. I doubt I&amp;#39;ll be back. Per usual the cheesecake was about the only thing worth the trip.", "rating": 2, "date": "3/8/2020"}, {"text": "Classic Cheesecake Factory experience here: everything and the kitchen sink is on their menu. It&amp;#39;s all served family style (one order is enough for a family of three-across the board). <br&gt;<br&gt;My staple is the Louisiana chicken pasta. It&amp;#39;s so subtly spicy and flavorful and a HUGE portion. One time at this location we found a hair (an obvious &amp;#34;there&amp;#39;s no way it&amp;#39;s mine&amp;#34; hair) in this dish. Staff was apologetic. They removed it from our check and replaced the dish with another one, which was the acceptable way to handle the situation. <br&gt;<br&gt;Recently tried the Nashville chicken appetizer and it was good. I like the flavor-there could have been more pickles and a lot less grease. <br&gt;<br&gt;Recently tried the Tuscan chicken from the Skinny-licious menu. There was enough meal there for 3 people; completely shareable for dinner for two with leftovers. The farro was skimpy, but I guess that&amp;#39;s where the Skinny-licious part comes in. It was served with tons of tomatoes and had great flavor. <br&gt;<br&gt;Cheesecake Factory cheesecake is universal at all locations, which I appreciate. Love the white chocolate raspberry. Recently learned a piece of cheesecake is somewhere in the neighborhood of 1,000-ish calories. Plan ahead and bring a cheesecake buddy (or several) who have similar tastes to you, or plan to take a week to eat it.", "rating": 3, "date": "12/8/2017"}, {"text": "I recommend just going for the cheesecake. The service is not very good and the food is subpar. The cheesecake is worth the price and is super delicious. <br&gt;<br&gt;However, after they reopened after COVID we placed an online order and it was a DISASTER. There was a line out the door to place a to go order. The line was so busy we couldn&amp;#39;t call to even tell them we were here to pick up our order. There were 17 different pickup spots in the parking lot for curbside pickup, and those were all full along with every regular parking spot filled with people waiting to be helped. The people running the food out were so sweet, however there was not enough help at all. The place was busy. Me and my boyfriend called probably 20 times trying to catch the line when it wasn&amp;#39;t busy. The lady next to us said she sat in her car waiting an HOUR on cheesecake. <br&gt;In conclusion, I&amp;#39;m not blaming Cheesecake Factory because they were extremely busy, however if you&amp;#39;re considering ordering take out from here, I would recommend skipping it until the inside opens back up.", "rating": 2, "date": "5/10/2020"}, {"text": "Disclaimer - I&amp;#39;m usually not a big chain eater. I try to eat local. That being said, I&amp;#39;m always a huge fan of cheesecake and my boss got me a gift card for the Cheesecake Factory. So, after a long morning of Black Friday shopping, we were starving and a little on the broke side. Cheesecake Factory, here we come. I&amp;#39;ve eaten at this particular location before and the one thing I don&amp;#39;t much care for is the seating. If you&amp;#39;re unlucky enough to get crammed into the long row of tables that has you eating in the lap of the patron next to you - I feel your pain because I&amp;#39;ve eaten in that exact way before. However, this time, we were seated in a booth next to a window and had plenty of room. Our server was a sweet girl who immediately took our order and brought us our drinks. We ordered the fried zucchini and the cheeseburger Wong tongs. Delicious. Those hamburger Wong tongs were dangerous, with their crispy outside shell and ooey gooey cheeseburger inside. I had to push them toward my husband or I would have eaten the whole plate. The zucchini were also amazing - but I justify demolishing that plate because, after all, zucchini is a vegetable and therefore the fried part is cancelled out by the veggie component.<br&gt;I had the Cobb salad. Even with the shortage of Romaine lettuce, the iceberg was fresh and crisp and piled high with crispy bacon, egg, avocado, and blue cheese crumbles.  While I initially thought I would get ranch dressing, it came with the CF&amp;#39;s house vinaigrette and was actually very good.<br&gt;My husband ordered the club sandwich. It was HUGE. The only criticism is that the bread was this beautiful crusty baguette that was just too crunchy and hurt the roof of his mouth. It was a little off putting because the description says &amp;#34;white bread&amp;#34; and while this technically WAS white bread, it was white baguette bread. I would have eaten the entire thing regardless, but some of us are more willing to sacrifice our pallets than others. <br&gt;This visit we were too full for dessert, but, we will be back. Cheesecake Factory treated us right and fed us good. I see you Cheesecake Factory and even with your big chain name, you took the time to make me feel welcomed and allowed me to relax and unwind with my favorite person over delicious apps and lunch.", "rating": 4, "date": "11/25/2018"}, {"text": "We came in on the WRONG Saturday...tax free weekend near the mall. Neither here nor there, we got seated in about 6 minutes, really not bad for a Saturday evening.<br&gt;It took about 5 minutes for our drink order to be taken, then another 5 to order our apps. We then ordered our main meal, and waited...and waited...and waited.<br&gt;After around 15 mins the apps came out, and were outstanding. My wife had the Asian Style Chicken Lettuce Wraps, I had the Cheeseburger Egg Rolls (don&amp;#39;t judge, lol). As we were wrapping up with the apps, the main meal came, like on cue. My wife had the combo of Steak Diane/Herb-crusted Salmon with steamed spinach. I had the Factory Burrito Grande, again, don&amp;#39;t judge.<br&gt;The Steak Diane was OMG good, the salmon could have been less cooked, but was good nonetheless. The spinach had a good taste, was cooked quite well, not overcooked. The burrito was also very good, much better than I expected. For dessert, we both had cheesecake...of course. It took an exorbitant amount of time to get it, other than that, no review needed, as it was superb.<br&gt;The food was a 4/5, service 3/5, ambience 4/5.", "rating": 4, "date": "8/3/2019"}, {"text": "This place is one of the most consistent great restaurants in okc!! Best dessert for sure. Highly recommended", "rating": 5, "date": "8/29/2020"}, {"text": "I&amp;#39;ve said it before, and I&amp;#39;ll say it again: The Cheesecake Factory (TCF) is where willpower and waistlines go to die. And my goodness, it&amp;#39;s so easy to fail at any healthy eating attempts if this place becomes a frequent stop for you.<br&gt;<br&gt;Supposedly, their 250 menu items are made from scratch daily, which makes me want to know what their definition of &amp;#34;from scratch&amp;#34; is more than anything. Prices have gone up though, so really, this is increasingly becoming a great place to get your dessert fix only, since there are definitely better options for dining out, even by chain restaurant standards. Our meal with family ended up being just slightly shy of $140. That&amp;#39;s Cheever&amp;#39;s money at that point. Speaking of increased prices... This happened yesterday:<br&gt;<br&gt;[] Update at the bottom of this essay [] I ordered something called the &amp;#34;Crispy Chicken Costoletta&amp;#34; listed on the menu at $17.95. &amp;#34;Whatever&amp;#34; I thought, since most everything on the menu is in that range. I figured the portions were going to be massive, so yay. Then the bill arrived, and I noticed that I was charged $19.45 for the CCC. <br&gt;<br&gt;So I ask my server for clarification. I even had to point it out on the menu because he didn&amp;#39;t seem like he believed me. A few minutes later, he comes back and tells me that his manager said that the prices had gone up on a number of the menu items by &amp;#34;just a dollar&amp;#34; (it&amp;#39;s more than a dollar, but who&amp;#39;s counting? Besides me...). And then he asked if it would be okay for me to go ahead and pay the $19.45. lolwut? <br&gt;<br&gt;There were a number of options on how to deal with the price change(s):<br&gt;        (a) Take the low-effort Asian restaurant route, and cover the old price with a sticker.<br&gt;        (b) Eat the cost of your mistake, and fix the price when requested by the customer.<br&gt;        (c) Ask the customer politely to accept your bait &amp;amp; switch.<br&gt;<br&gt;He actually chose (c) and with manager approval too, it seems. I mean, yes, it&amp;#39;s only $1.50, but I was like &amp;#34;WTH?&amp;#34; to even being told: <br&gt;<br&gt;- Yeah, our prices changed... <br&gt;- Yeah, we didn&amp;#39;t note it anywhere... <br&gt;- Yeah, could you go ahead and just pay the new price?<br&gt;<br&gt;No, guy. No. I mean, thanks for asking so nicely, but this was like the easiest customer-service resolution ever, and you botched it. And this weak-sauce customer service thing is the one thing (other than the delicious cheesecake) that seems to be oddly consistent about this TCF in particular.<br&gt;<br&gt;Man, this review got long... <br&gt;<br&gt;P. S. I had someone from &amp;#34;Guest Services&amp;#34; reach out to me, to explain that you cannot do any substitutions. At all. The server had told me that I could swap out the mashed potatoes for the corn succotash, and it turns out that... You can&amp;#39;t... So, yeah... Crispy Chicken Costoletta ($17.95) + Corn Succotash ($1.50) = $19.45. Okay, fair enough...", "rating": 3, "date": "8/21/2017"}, {"text": "It turns out that the best day to go is Tuesday at 11 AM. My group was about 25 to 30 people; all on separate checks, everyone ordering different meals and drinks. We were seated right away at a prepared table. Two wait staff introduced themselves and told us what group they would be responsible for. They took our orders and left. They brought the drinks and bread to munch on. It was a work related function and a presentation of gifts and a speech took place. All of the waitstaff waited prior to refilling drinks, instead of interrupting. I thought that was thoughtful. I had a sandwich from the guilt free menu which came with a salad. I was fairly full after the sandwich so, I didn&amp;#39;t have the salad. I did get the wrong soft drink once and a while, but I thought that was minor. <br&gt;<br&gt;Based on my last experience at the Cheesecake Factory, I would have never returned (2-Star) rating for service and excessive wait times). It was only because work had this thing there that I went back and I am glad I did. I was pleasantly surprised. I wonder, was that a management issue or was it a weekend issue. Either way, pleasant experience. A little pricey, but I couldn&amp;#39;t leave without a coffee and carrot cake in a to go container.", "rating": 3, "date": "1/31/2018"}, {"text": "You know what to expect when you go to the cheesecake factory and for that I am satisfied even if everything is overpriced when compared to the quality! Cucumber martinis are a must if you&amp;#39;re looking to spend a buck on top of your food and dessert purchases.", "rating": 3, "date": "1/17/2019"}, {"text": "Love this place. Large menu always allows me to order something new and switch it up. Never disappointed. Come here at least once a month. Good sandwiches, good chicken, good pasta, and most importantly great cheesecake.", "rating": 5, "date": "9/7/2019"}, {"text": "If you want a restaurant with a lot of everything this is your place! I&amp;#39;m not a fan of cheesecake but I will forever return for Linda&amp;#39;s fudge cake. This is a great spot for picky eaters because you can basically customize everything on the menu. Some items on the menu seem pricey but the portions are huge so you can split meals with friends or save leftovers for an additional meal. Unfortunately, the last time I was at this location, the entry area (where they keep the cheesecake) smelled a bit funky with a mixture of bleach, which isn&amp;#39;t very inviting.", "rating": 4, "date": "10/31/2018"}, {"text": "Just your typical every day Cheesecake Factory with their gigantic book of a menu. Good thing about it is, you can literally substitute anything for anything. Want the salmon pasta but love rice? Swap it out! Want a side of guacamole with your steak? Easy. You could have Mexican, Italian, Asian, and American, all on one plate. Then finish it off with tons of cheesecake! Our waitress was super helpful for us and our specific food needs, staff here are so friendly so that was awesome. Overall great experience!", "rating": 5, "date": "9/9/2018"}, {"text": "I would give it a 4 star if the price was worth it. The food look good &amp;amp; tasted good but the price is just to high specially for a slice of cheese cake for $7.95 it should be more like $5.95 in my opinion. The meal averaging $15.95 &amp;amp; up adding a side salad to the meal then maybe worth it. I will go back but only for dessert then I wouldn&amp;#39;t mind paying $8 bucks maybe. Service was good you end up having like 3 different people coming to your table from one taken your order on your drinks to another ordering your meal to another delivering your food that must be why the prices are so high got so many employees.", "rating": 3, "date": "8/5/2018"}, {"text": "We had the pizza lunch we had the strip scampi we had the spaghetti and meatballs everything was excellent Amanda was our server and she did a wonderful job to definitely a go back to place.", "rating": 4, "date": "7/16/2019"}, {"text": "Food was good, nothing spectacular and a little overpriced but the Hershey&amp;#39;s Cheesecake was so so good! I would go back for the dessert for sure!", "rating": 3, "date": "7/4/2019"}, {"text": "We like the Cheesecake Factory, always have. But, since moving to OKC, this location just does not give off that special vibe. The food is still tasty. The kids menu has a lot of selections. We enjoy the options for both healthy and well tasty, totally worth the calories selections. Ha! We have been to this location about 3 times. Today we were sat near the bathroom and well that is not a desired location. The waiter was not as attentive, but he tried. The appetizer came out 5 minutes before the main meal. The wait for the food in general was a little too slow, especially for a lunch hour. The slices of cheesecake and flavor options are wonderful! We will still return, we just can not figure out why we do not get the warm fuzzy from this location yet.", "rating": 4, "date": "10/19/2018"}, {"text": "My family drove an hour because grandchildren wanting to eat there. We were told they wouldn&amp;#39;t seat us at the same table because there were 7 of us. We informed them that we were family and came in the same vehicle. We were 3 adults and 4 children. Needless to say we left and went elsewhere. Also, we won&amp;#39;t go back. One star only to post.", "rating": 1, "date": "8/16/2020"}, {"text": "Decided to Come in for lunch on a Tuesday since I didn&amp;#39;t have my baby and enjoy lunch by myself. If you want a restaurant that has a ton of variety, this is your perfect spot! The menu is literally like a book.<br&gt;<br&gt;If you want a meal that is healthy and you are watching calories stick to the skinny licious menu only!! All of their dishes are not known to be the healthiest. Plus they give you delicious warm bread and butter while you wait for your food. I love their butter here it&amp;#39;s so fresh. <br&gt;<br&gt;I got the Renee special which is a half a turkey sandwich, House salad, and a cup of the soup of the day. My soup I got was chicken tortilla which was so cold and just not good at all. It was thicker than tomato soup almost and not a single tortilla chip in it! <br&gt;<br&gt;The sandwich was fresh and hearty! salad was delicious but they drowned it in salad dressing and I hate when that happens.<br&gt;<br&gt;My waitress was good just slow she definitely wasn&amp;#39;t in any hurry.. which is nice opposed to feeling rushed I guess. I just don&amp;#39;t like it when you give change or place your order then they walk off and talk to two other tables making small talk. <br&gt;<br&gt;All in all there are definitely other local favorites I have but if you&amp;#39;re craving bread and of course cheesecake this is the place!", "rating": 3, "date": "8/10/2017"}, {"text": "This is a great place for dinner if you have a family or group because their menu is extensive! <br&gt;<br&gt;We had the fried macaroni and cheese to start and it was amazing! You get 4 balls and can easily share each one with someone. I had the skinnylicious (under 600 calories) burger and green salad. It was good, but nothing to write home about. The green salad was just lettuce. No other veggies were on the salad. I thought that was odd and the dressing they poured on it made the greens a little soggy. <br&gt;<br&gt;Our service was okay, a little slow at times. The weather was perfect, which made for an excellent meal on their patio.", "rating": 3, "date": "9/30/2017"}, {"text": "Very good service and cheesecake is beyond amazing!! Our party of 12 was seated quickly and the waitress was so nice. We normally just order desserts to go for parties or special occasions but eating in we were not disappointed. Can&amp;#39;t wait to visit again.", "rating": 5, "date": "4/23/2019"}, {"text": "I came here for a nice dinner with family. The lady&amp;#39;s room was not clean. I spotted that someone had a kit boy accident on the floor and it had dried. (Indicating the bathroom has not been cleaned in a few hours) as my party was being seated we found something stuck to the back of our booth. No idea what it was but the staff did not move us to a different booth / table. Needless to say the service was also terrible. I was incredibly shocked because I have never been to a bad Cheesecake Factory but I guess there&amp;#39;s a first time for everything", "rating": 1, "date": "12/30/2019"}, {"text": "My family and I used to love coming here. The food was always so good and fresh. The last few times we&amp;#39;ve gone it&amp;#39;s been the opposite. The service has suffered and the food is not the quality it once was. Our teas were sour. The bread wasn&amp;#39;t fresh. Our Mac n cheese balls were cold in the middle and couldn&amp;#39;t eat the Alfredo because the noodles were too chewy. Won&amp;#39;t be back.", "rating": 2, "date": "7/8/2020"}, {"text": "Our waitress was awesome!  Good food! Social distancing and lots of protective measures while keeping a great atmosphere!  Thank you for the meal out!", "rating": 4, "date": "7/25/2020"}, {"text": "Charlie was my server and he IS AMAZZZZING!!! The calamari was great. The steak was delicious. The drinks were perfect. But the 5 star service from Charlie tied it all together. Will DEFINITELY return.", "rating": 5, "date": "6/25/2020"}, {"text": "This used to be such a great place to go. It really does have a nice atmosphere, but the food is a-changing. Portions are smaller...prices still on the high side..and overall just doesn&amp;#39;t taste as good as it once did. I ordered the carrot cake cheesecake because it has always been one of my favorites, but texturally it was not the same. A little on the &amp;#34;gritty&amp;#34; side. I just don&amp;#39;t know. Still love the sweet corn tamale cakes, though!", "rating": 3, "date": "4/2/2018"}, {"text": "So I usually like this place but today was very disappointing. We had gnats flying around our booth and when I asked where they were coming from the servers immediate reply was &amp;#34;I don&amp;#39;t see one&amp;#34; and this was directly in front of a manager. The manager asked if we wanted to move but we declined because if you can&amp;#39;t even acknowledge the gnats the problem isn&amp;#39;t going to be solved regardless of where we sit.<br&gt;When my boyfriends dish was dropped off he was missing a side of rice and the sever who dropped it acted like we were wrong and the dish only came with one side stating our sever subbed it out. My boyfriend corrected him and he said he would let our sever know. She came for the rice and apologized explaining that it was suppose to come with the rice. <br&gt;We tried to eat but the gnats kept buzzing around and trying to land on our food. They were also crawling on the window. We immediately packed our food paid and left. For paying over $60 it was an extremely dissatisfying meal, service, and experience.", "rating": 2, "date": "4/26/2019"}, {"text": "My husband and I came with the intent of a spontaneous date night dinner. This happens to be one of his favorite spots. Who knew this place would also be great for hiding out with great food, drinks, and fun people while avoiding tornadic weather <br&gt;The bread is a godsend while waiting for orders, especially when they are busy, and lets be honest, when are they NOT busy?! <br&gt;I have to take a moment to sing praises about the crab cake bites! These little morsels of deliciousness melt in your mouth! They are like a satisfying little puff of crab! I was almost depressed when they were gone, and they went quickly! <br&gt;We had the chicken reisling which was AMAZING! I will totally order this again! <br&gt;We finished up the meal with the Reece&amp;#39;s pnut butter cup and chocolate cake cheese cake. You REALLY need a HUGE glass of milk with this one! Or in my case, wine . Milk and I dont get along these days . This was so rich, I could only get 3 bites in before throwing in the towel. But, those were an amazing 3 bites! Of course, we took the rest home! <br&gt;<br&gt;The restauraunt is clean, as a whole. Although management may want to stay on top of their busboys....saw one, in particular reset tables without wiping them off. Scary thing is, how many times was this done on the same table with who knows how many people&amp;#39;s leftovers still hanging around. I&amp;#39;m not a germiphobe, but I do appreciate cleanliness. We appropriately and kindly alerted management who immediately rectified the issue of the table. #JustSayin", "rating": 5, "date": "3/24/2019"}, {"text": "For a chain restaurant, The Cheesecake Factory has pretty good food.<br&gt;<br&gt;The menu is a book with everything you could possibly think of. I&amp;#39;ve tried several of their dishes, but the only category that I found quite disappointing in taste and texture was the pasta.<br&gt;<br&gt;The wheat bread and butter is delicious. I&amp;#39;m not a fan of sourdough, so I am biased with my opinion on that.<br&gt;<br&gt;With our 20 minute wait, it gave my party plenty of time to look at the menu and pick our entrees. When we were seated, we ordered our drinks and went ahead and ordered our entrees to make things easier on our server (including a bowl of lemons for our water, straws, and extra bread).<br&gt;<br&gt;Service took a while. And we had to wait an additional 15 minutes for the items listed above.<br&gt;<br&gt;Food was good. I got the steak with salmon with a side of mashed potatoes and corn succotash. The asparagus were wilted and the size of match sticks. My family&amp;#39;s entrees were also satisfying in taste. The server clearly forgot to put in an order and said under her breath as she was thinking, &amp;#34;I&amp;#39;ll get that out as soon as possible.&amp;#34; Not recognizing that she was at fault for this... (We&amp;#39;re usually understanding and nice when we dine out, but I&amp;#39;ll judge if you play it off like we forgot to tell you!!!)... so that kind of left a bad taste in my mouth. <br&gt;<br&gt;Anywho, we finished out entrees, already had our meals boxed up and bagged. The server comes back with the missed order and told us it was actually taken to another table and they had to make a new one. Thanks?? We&amp;#39;re clearly full. I was hoping it would get comped since we ordered this from the beginning, she had forgotten, and it came out when we were about to leave. We obviously paid it and took it togo... Tonight, it wasn&amp;#39;t worth the hassle to even mention it. Justified that bad taste in my mouth, but.... whatevs. I noticed there&amp;#39;s never a manager that walks around asking how things are going whenever I&amp;#39;ve visited.<br&gt;<br&gt;Cheesecake has always been divine. I recommend the Kahlua or the lemon raspberry. <br&gt;<br&gt;Overall, the price is expensive so, expect to easily rack up your bill. I would come back only to order cheesecake or if invited in a group without say.", "rating": 3, "date": "1/7/2018"}, {"text": "I had a terrible experience for Mother&amp;#39;s Day. First, I placed an online order at 4 for 7 p.m. pick up. At 6:30 I received an email saying online ordering system had failed to send my order through and that I needed to call the location and place an order. After calling for 10 or 15 minutes, I was finally able to get through and place an telephone order. I was told to park in a numbered spot call in let them know what number and they would bring out my order. When I got there I tried calling for 20 minutes but no one ever answered. I finally had to go inside and stand in the pickup line waiting for my order. When I finally got my order and got home, I discovered that they had left out one of the four cheese cakes and one of the entrees. I know they were busy today, but it was an unacceptable experience.", "rating": 1, "date": "5/10/2020"}, {"text": "The Cheesecake Factory is one of those destinations that has everything.  There is no way you could go with a large group and everyone not be satisfied.  Typically, with large menus I am judgmental because I think every must be mediocre because you specialize in nothing.  But, as critical as I want to be most of the menu items are above average.  They have added the calorie count to the menu.  Holy Batman, you have to make a conscious decision to intake the calories.  There is a skinnylicious menu that is helpful for those calorie counting patrons.  Weirdest move on CF, they put the dessert choices in the main menu and you have to request to keep it just to review your dessert choices.  The dessert menu should be separate and a staple at each table.  I would normally review specific items on the menu, but I don&amp;#39;t think you can go wrong and most items are what you expect.  Just like the cheesecake, you pick what you typically like and it will be pretty darn good.  The ambience is loud.  The bill adds up quick.  You can get cheesecake to go.", "rating": 4, "date": "11/5/2018"}, {"text": "We recently had food delivered. My wife&amp;#39;s Cobb salad was good. My Bang Bang was not. It was cold and flavorless. Never bothered calling to complain because I have no desire to have my time wasted with excuses. Expensive too.", "rating": 2, "date": "5/2/2020"}, {"text": "L&amp;#39;Shawn was our server and he did a great job. <br&gt;<br&gt;We started with the Cuban Spring rolls. So delicious! They come with a wonderful sauce to dip in as well.<br&gt;<br&gt;Our entrees were an extremely large Caesar salad and the combo. We chose steak Diane (cooked medium rare) and the herb crusted salmon. <br&gt;<br&gt;These dishes were fantastic as well. But you can&amp;#39;t go to The Cheesecake Factory and not get dessert! <br&gt;<br&gt;We had the White Chocolate Raspberry Truffle, a creamy cheesecake swirled with white chocolate and raspberry and the Lemon Raspberry Cream Cheesecake, a raspberry-vanilla cake, creamy lemon cheesecake, raspberry lady fingers and lemon mousse. <br&gt;<br&gt;Both were great, but the lemon one was divine.<br&gt;<br&gt;Casual dining at fine dining prices. A treat every once in a while.", "rating": 5, "date": "6/7/2016"}, {"text": "This will go on my list of crowdpleaser restaurants: places I go not because I&amp;#39;m seeking culinary enlightenment, but because I am with my entire office and we need a restaurant that we can all agree upon. This isn&amp;#39;t even to say I didn&amp;#39;t like the food - I thought it was pretty good! I had a thai chicken curry dish that I found to be a little too sweet, but the gargantuan portions guaranteed I wouldn&amp;#39;t go hungry for the next couple days. The service was quick and polite, even though we were pretty demanding and asked for individual checks at the end. Altogether a solid experience!", "rating": 3, "date": "1/2/2019"}, {"text": "First time at The Cheesecake Factory and the food was simply delicious! We enjoyed a wonderful evening on their patio. It was a busy Saturday night and our waiter, Brandon P., was very attentive and friendly. Great service overall.", "rating": 5, "date": "3/26/2019"}, {"text": "Took wife to Cheesecake Factory for her bday. I ordered Marsala chicken. For your information, it is not a little Marsala wine poured over sautéed chicken and a very few mushrooms and placed on top of a huge amount of bow tie pasta! I am not a gourmet chef but mine is way better than yours. No cream, butter or seasonings. Tasteless and very expensive.", "rating": 1, "date": "2/24/2020"}, {"text": "Every cheesecake factory is usually the same everywhere I go but this one in OKC is a little different, I ordered the Fried chicken Waffles Benedict and my husband ordered a non brunch item/ kung pao chicken lol .. I had very high expectations since I haven&amp;#39;t ever had time to eat during Sunday Brunch hours so I was very excited. My food however was very, Blah. I didn&amp;#39;t care for it. I honestly think I like their dinner menu is 100X better. We ordered cheesecake as usual but Probably wont be back for the brunch menu.", "rating": 4, "date": "5/30/2018"}, {"text": "My boyfriend and I always come here after a shit day and we&amp;#39;ve never been disappointed. The bar always takes great care of us, we&amp;#39;ve been going there for over a year now and only had one average experience as far as service goes, but we also came in really late so there&amp;#39;s nobody to blame. Wish the food was a little bit cheaper bc I want to try to much and a lot of the food doesn&amp;#39;t complete my pallet easily but the food that does I&amp;#39;m OBSESSED with. If you haven&amp;#39;t yet TRY THEIR FRIED EGG ROLLS and thank me later :)", "rating": 5, "date": "8/25/2019"}, {"text": "This place is crowded and overpriced but the food is still good. The cheesecake is about $8 slice which to me is crazy but it is really good. I was here for the half price cheesecake day and $4.97 was more in line...", "rating": 3, "date": "8/3/2017"}, {"text": "Never ever ever have we received such horrible service.  The waitress was not the best and perhaps the worst I have ever had.  <br&gt;<br&gt;I have been to several cheesecake factory&amp;#39;s around the US. This is by far the worst. <br&gt;<br&gt;I can&amp;#39;t wait to get back to Texas and go to a cheese cake factory and have some good food and service.", "rating": 1, "date": "5/22/2017"}, {"text": "Date night last Friday was super awesome and our server was legit! Our server was very attentive and our drinks never got low. She refilled our bread as I couldn&amp;#39;t resist eating it. The garlic bread if you have never had it is a must try. You can thank me later!! Oh my it&amp;#39;s decadent! Our Louisiana chicken pasta was simply heavenly.  We got cheesecake to go and we&amp;#39;re very pleased with our visit. We definitely will return to this Cheesecake Factory! Thank you again!", "rating": 5, "date": "5/19/2017"}, {"text": "Quick / excellent service, even on busy days. The Shepherd&amp;#39;s Pie is definitely worth trying &amp;amp; a favorite is the Chicken Bellagio. And of course there&amp;#39;s the famous cheesecake selection. So good that you have try them all.", "rating": 4, "date": "7/15/2018"}, {"text": "I had Vegan Cobb Salad! This was one of the best salads i have had in a very long time. Our server was a little slow but could have just been having a busy day. I also got the mango key lime cheesecake which was super delightful and not super heavy filling!", "rating": 4, "date": "1/27/2019"}, {"text": "I came here after having gross hotel food.  I wanted something good and familiar and that&amp;#39;s what I got.  <br&gt;<br&gt;The service was slow, my waiter was covering a lot of tables.<br&gt;<br&gt;My food was piping hot and tasted good but there were some foreign ingredients that made it into my food.  Since I don&amp;#39;t have food allergies it wasn&amp;#39;t a big deal but something to consider for those with special diets.<br&gt;<br&gt;I lost patience waiting on my check so I skipped the cheesecake because I was concerned about how long I&amp;#39;d have to wait...", "rating": 4, "date": "9/25/2017"}, {"text": "Met with a friend here and haven&amp;#39;t actually eaten in one of these in over 6 years. I also get the cheese cake and head out.<br&gt;<br&gt;Pros:<br&gt;* Decor is nice, updated and it was clean. <br&gt;* Had many cheese cake options, I ended up leaving with an ultimate red velvet and strawberry cheese slice. <br&gt;* My food was good but the red wine sauce was sweet on my meat (not a fan) and if I knew that prior I would have placed it on the side <br&gt;* The kids spaghetti and meatball was a good amount. The meatballs was massive for my kid.<br&gt;<br&gt;Cons: <br&gt;* The meal options are a bit much, Gordon Ramsey would definitely get rid of half there menu lol.<br&gt;* I know I was in Oklahoma but the biggest steak they had was 10 oz. If you get a steak and shrimp,chicken or salmon combination the steak is only 5 oz and the fish is only 4 or 5 for about $23.00. My food was good but the wine sauce was not to my liking and the portions were little but the plate was long. <br&gt;*When I initially asked the waitress how many ounces is the meats, since it&amp;#39;s not on the menu she answered with &amp;#34;its a lot on the plate&amp;#34; : - /<br&gt;*The drinks are over $3.00 for tea or soda<br&gt;*Cheesecake is about $8-10 a slice<br&gt;* The waitress said you have to order the cheesecake from the table or you have to pay individually. This is after I already had the bill on my table. <br&gt;* Our waitress was new, didn&amp;#39;t know much about the menu and took Forrrrrevvvveerrrr to bring me my check even though she was walking back and forth past me. <br&gt;* The bill shows you the gratuity if 15% plus. For a kids meal, my food and two pieces of cheese cake it was over $65<br&gt;<br&gt;Overall I think if I am going to spend $65 for me and a kid again it will be in Texas where the prices and portions compliment one another. I can feed my husband to and I won&amp;#39;t have to wonder what I am getting. I&amp;#39;ll stick to just picking up the cheese cake in this place.", "rating": 3, "date": "6/30/2018"}, {"text": "I went here last night for a going away party. I had called that morning and see if I could RSVP some seats, but the lady on the phone said they don&amp;#39;t do that at night - which I totally understand. I said that was fine and we would arrive 30 minutes early to try and retrieve a table.<br&gt;<br&gt;My party was arriving early and we were able to snag a table outside but 80% of our party had to be there - which is reasonable. We then saw some open seating and I ask the front workers if we could go ahead and take 3 tables over there. She said &amp;#34;hold on, let me check.&amp;#34; After a few seconds, the manager comes over and asks me about my question. I was shocked that the manager came up to me, which is fine, but I would like to be told something like &amp;#34;let me get my manager to discuss this further.&amp;#34;<br&gt;<br&gt;I told the manager the situation: if we could give up our seating outdoors for the open seating indoors. She asked if I was the host of the party and I said I was. She said that area is for open seating only and not big parties, but that they will go ahead and seat us outside. (It was nice of them to go ahead and take down the 80% threshold, but I felt like they didn&amp;#39;t want us to sit at the area inside and I still felt like she wasn&amp;#39;t really answering my questions because I just wanted to understand the situation, which is why I was asking questions and I wanted to be cooperative).<br&gt;<br&gt;The service was kind of slow. Our waiter was nice, but would have been nice to be checked on more often since our party had different requests. When they brought out our food, it was different people that kept asking our group who had what. Shouldn&amp;#39;t the waiter be doing that? I understand that restaurants get busy and other people can bring out the food, but shouldn&amp;#39;t you be partnering with the waiter or waitress since they know what everybody ordered?<br&gt;<br&gt;I have always loved Cheesecake Factory, but I think this will be the last time I will go to this location. The state/city that I&amp;#39;m moving to has a lot of Cheesecake Factories so I will definitely be going to those. I hope everybody else had a pleasant time at this location. Like I said, I&amp;#39;m a very understanding person - just work and talk with me and I will have no issues. Thanks!", "rating": 3, "date": "7/27/2019"}, {"text": "I called in an order for the curb side pick up, they said it would be complete at a certain time. I pulled up to the slot assigned for pick up and called the number listed. I was told they would pass it on that I was waiting for my order. 10 minutes later nothing, so I went inside to see what had happened, to which I was told they thought I said Dillion for my name, so I&amp;#39;m thinking we did this on line, they took down the make and model of my car, did you even go out and look for my car? Pure incompetence. Don&amp;#39;t offer a service if you cannot provide that service.", "rating": 1, "date": "5/31/2019"}, {"text": "The food is so-so even though the variety is phenomenal. <br&gt;<br&gt;They are REALLY strict about promos-we went for half off Cheesecake day and they would only give us one slice half off <br&gt;<br&gt;The staff seems overwhelmed and there is always a wait!<br&gt;<br&gt;The ambience is dressy but there are always people there in flip flops.", "rating": 2, "date": "7/31/2017"}, {"text": "We haven&amp;#39;t been in a while , food was good. The prices are kind of on the higher side for what they serve.  The cheesecake selection was really good. Staff was nice. <br&gt;We honestly won&amp;#39;t go again for a while. <br&gt;I can get the same foods at other restaurants for about the same to slightly cheaper and those restaurants be specialized in certain foods and maybe a tad bit better tasting.", "rating": 4, "date": "3/22/2018"}, {"text": "Kind of pricey but the food is good and portions are huuuuge. Had a really nice server. My favorite food here was the complimentary bread.", "rating": 4, "date": "7/11/2018"}, {"text": "Our experience here goes down hill every time we go.. it&amp;#39;s honestly not even worth going when we get a gift card anymore (when we receive a gift card is the ONLY time we go and quite frankly I&amp;#39;d rather just give the gift card away instead of eat here). Food is always wrong, old and/ or not the right temp (hot salad/ cold entree) and service is almost non existent which is most times not the servers fault because the sections are broken up so terribly. Will NOT be back", "rating": 1, "date": "5/22/2019"}, {"text": "Not worth the money whatsoever. The menu is so big that they can&amp;#39;t execute anything... taste like it came out of the freezer. Dated decor and slow staff.", "rating": 1, "date": "7/3/2019"}, {"text": "You can&amp;#39;t go wrong with TCF, and this location never disappoints. The menu never changes, but why should it since it is about 8 pages.<br&gt;<br&gt;My wife always gets the Tea, it has a unique flavor with hints of fruit. It gives me the willies so I pass. But go for it if it&amp;#39;s your bag.<br&gt;<br&gt;The absolute always order, no questions asked, is the chicken pot stickers as an appetizer. The sauce is spectacular, I never let any go to waste by sponging it up with the delicate stickers or delicious fresh bread.<br&gt;<br&gt;Tonight I was feeling adventurous. So I exchanged my usual, Bang Bang Chicken and Shrimp (I&amp;#39;m a curry junkie) for the Miso Salmon. And let me tell you, it changed my life. Who knew salmon could taste so great in Oklahoma? The fish was fresh, flaked properly, and was covered in a Miso sauce that was oh so creamy fantastic. <br&gt;<br&gt;I passed on cheesecake tonight. But recommend the Red Velvet. It has the most  calories of them all. Enough said.", "rating": 4, "date": "8/26/2017"}, {"text": "This was not the greatest Cheesecake Factory experience. The service was okay. It seemed like other tables waiters were helping us more than our own. <br&gt;<br&gt;My food was excellent. I had the Spicy Chicken Chipotle Pasta. Everything about it was great, but it wasn&amp;#39;t as spicy as I wanted it to be. My father had the Chicken Riesling. The taste was meh. It was also really oily. When you took a bite you could just taste the oil coat your mouth. My mom had the Chicken Parmesan Pizza Style. For the most part it was good. It was pretty average, nothing that was really surprising or great about it. My sister had the Santa Fe Chicken Salad. Her food was amazing as always. One of the best salads at any restaurant. My Grandma had the Southwest Chicken Sandwich. This was really good. Because the bread was so fresh, it made the sandwich absolutely amazing.", "rating": 3, "date": "5/30/2017"}, {"text": "Extremely over priced for the quality of food. Could find much tastier food else where for a way cheaper price. Have 3 stars only because the Cheesecake was amazing. However I Wouldn&amp;#39;t recommend the food.", "rating": 3, "date": "12/12/2019"}, {"text": "Everything was great except when I addressed the manager on the floor(5&amp;#39;4&amp;#34; brunette with highlights and curly hair) about my concerns about our wine that was NOT presented tableside and arrived 15 minutes AFTER it was ordered. I understand new staff arrangements, but also understand a price point and it&amp;#39;s standards and expectations. I&amp;#39;ll definitely be back based on the food quality, however I hope to have a more satisfactory night out when I arrive.", "rating": 3, "date": "12/11/2019"}, {"text": "This was terrible. Terrible terrible terrible. (Sounds better if you pretend Charles Barkley is saying it) I wanted to grab a quick bite with the family before I headed out town for work. I let my daughter pick and she picked here. This place always sounds better than it is. <br&gt;<br&gt;From the beginning it was terrible. They asked if I had any children in the party. (I get this. I was single and childless once but. Come on. Let&amp;#39;s not be so obvious). I said yes and they sat me in the worst table by the kitchen. I sure hope the waiter I had was new because he was terrible. About 10 minutes from being seated to him coming to the table. Then. He dropped off the menus  and I had to stop him from leaving to give him a drink order. It got worse from there. Like I said. I hope he was new. <br&gt;<br&gt;The food was gross. My daughter got garlic noodles. Obvious garlic salt and I think they spilled it in there. It was saltier than anything I have ever had. I probably should check my blood pressure. <br&gt;<br&gt;I had sausage and shrimp. Sauce was terrible and the sausage had about as much a presence as you will see in a women&amp;#39;s locker room. <br&gt;<br&gt;Children&amp;#39;s menu was typical of a place that really doesn&amp;#39;t want children. <br&gt;<br&gt;Dessert. Couple pieces of cheese cake. I really do not see what the hype is.  There was obviously no real baker back there. Frozen????<br&gt;<br&gt;The bill was $129. Not cheap. I could have gone to one of the new fun restaurants in OKC for that price. <br&gt;<br&gt;Stay away.", "rating": 1, "date": "2/8/2017"}, {"text": "This place is soooooooo awesome every time I&amp;#39;m in a state that has a Cheesecake Factory I have to hit it up and try all kinds...Honey Truffle Chicken and Strawberry shortcake is my favorite...", "rating": 5, "date": "9/20/2018"}, {"text": "Do not know who decided their lasagne recipe, but it was one gooey cheesy mess and I could not taste one ingredient that is specific to this dish.  It was literally flavorless.  It was layered in stringy cheese.", "rating": 2, "date": "5/22/2019"}, {"text": "This is the only cheesecake factory in okc that&amp;#39;s the reason for the 25min wait time any time in the weekend. This is my God knows how many times visit as I love this place. I ordered raspberry lemonade to drink and some tex Mex appetizer which was great as usual and salmon with mashed potatoes, the salmon today was not that great but everything else was exceptional good. I will be back", "rating": 4, "date": "9/3/2018"}, {"text": "Came here with my parents and i ordered the chicken strips with fries and raspberry lemonade. I loved my food but tried a piece or ribeye from my dad&amp;#39;s plate and it was horrible, also tried one buffalo chicken from my brother and it wasn&amp;#39;t tasting good either. We had tex mex egg roll as appetizer and ot was awesome.", "rating": 3, "date": "9/2/2018"}, {"text": "Came here during the labor day weekend and got seated after a 20min wait because it was really busy. We had an amazing and attentive waitress which is the only reason why I did not drop this to 2 stars. I had the rib eye with mashed potatoes and green beans, really really worse piece of steak I&amp;#39;ve ever had. No taste and full of fat, the mashed potatoes was ok and the beans were fine too. Our waitress kept our raspberry lemonade full all the time :)", "rating": 3, "date": "9/2/2018"}, {"text": "Four stars because the atmosphere was great on a date night with my husband. He had the steak tacos-he liked them. I had the steak medallions-they were ok: I was expecting it to taste like steak slices and they tasted more like Salisbury steak.I enjoyed the asparagus,mushrooms, and tomatoes the most on the dish! Nice place", "rating": 4, "date": "3/25/2017"}, {"text": "Completely unremarkable experience. We were looking for a place with diverse options and ended up here, just to give it a try and see how it is...<br&gt;My burger was totally average (medium cold fries) and the shrimp pasta plate was bland, the plate arrived with a bunch of pasta sauce at the bottom of the plate with a bunch of boiled pasta on top, not mixed, not combined... TERRIBLE.", "rating": 2, "date": "4/7/2018"}, {"text": "My boss gave me a gift card for my birthday, so we came here (hadn&amp;#39;t been in a while). My husband got steak Diane and I got a chicken parm sandwich.  He loved his (me too). I completely disliked mine (the marinara seemed like ketchup). Per usual, we got Adams PB cup. <br&gt;<br&gt;The total bill was $60, thankfully the gift card covered 25 because the meal was worth about 30.  I&amp;#39;d go back, just to grab a cheesecake to go.", "rating": 2, "date": "3/16/2017"}, {"text": "Ummmmm.... it&amp;#39;s amazing! And it has cheesecake. And did I mention it&amp;#39;s amazing!  Had the fried Mac and cheese balls and the lasagna verde. Both were excellent choices. Then grab a cheesecake to go because the meal will definitely fill you up.", "rating": 5, "date": "5/1/2019"}, {"text": "The cheesecake is always excellent!   I&amp;#39;m sad that my favorite dish (Stuffed Chicken Tortillas) has been discontinued.  However, the menu is vast and satisfying.", "rating": 5, "date": "9/28/2019"}, {"text": "Although the broad menu can be a little overwhelming, you can&amp;#39;t go wrong with any choice.  The portions are large, the presentation is eye-pleasing, and the wait service is outstanding.  You will leave with a full tummy and a happy palate.  I totally recommend this long-time favorite of mine!", "rating": 4, "date": "9/26/2019"}, {"text": "We came here after an event, and as expected, it looked packed. We walked in, and the hosts were very hospitable, patient and kind. Our waitress, Amanda, was patient as well (some in our party require it lol). We never had an empty cup the entire time we sat. She diligently checked on us every chance she got, without being annoying. <br&gt;<br&gt;Our table ordered the chicken Madeira, the gumbo, the Evelyn&amp;#39;s with angel hair and the Cajun nuggets. Everyone was absolutely astounded. It was great. Four of the six of us had never been here, but all were greatly impressed. I don&amp;#39;t understand why this location only has 3 stars. <br&gt;<br&gt;Thanks, Amanda!", "rating": 5, "date": "11/11/2017"}, {"text": "Cheesecake Factory is awesome! My boyfriend and I love coming here. The service is phenomenal and the food is always delicious and well-made. Wanted to give a shout out to our waiter Charlie! He was phenomenal. So kind and extremely helpful. You can&amp;#39;t go wrong with any of the waitstaff at Cheesecake Factory though. We love it there!", "rating": 5, "date": "10/14/2019"}, {"text": "Love love love this place for a nice reasonably priced meal. They have a great atmosphere that accommodates the casual family dinner or a less than formal date night. Their menu is pretty extensive so be prepared to be overwhelmed with dozens of choices. Regardless of what you have, I assure you that the portions will be more than enough for most. This is one of my wife&amp;#39;s favorite chain restaurants here in the 405. We have eaten there several times and I have yet to order anything that disappointed. Oh... wait - did I mention the cheesecake? Well it&amp;#39;s quite decadent. We share a different piece every visit and each time we claim it as our new favorite.  The one thing I wish they took was reservations since it is always a wait, but if you have the time it will be worth it. Good  Luck and Dare to Dine.", "rating": 4, "date": "1/2/2019"}, {"text": "I&amp;#39;ve been to The Cheesecake Factory several times but this time I tried the Steak Medallions and it was delicious! I would definitely order it again. I also tasted the White Chicken Chili which was pretty good too!", "rating": 4, "date": "2/27/2019"}, {"text": "So first off, I&amp;#39;ve been eating at Cheesecake Factory since 1997, first in downtown Denver, Jacksonville FL, and OKC. Tonight was probably the worst experience yet. The complaint isn&amp;#39;t on service, or waiting over an hour for a table but the food, and really I can&amp;#39;t believe it. We had the spicy Caesar salad which was the only thing that was tasty besides the bread. Kids food was bland, the fettuccine kid bow tie was dry and flavorless, the kid chicken fingers were ok, our other kiddo had the americano burger and he said it was good. I ate the Mac and cheese burger which came with this tiny fried Mac and cheese ball. My wife on the other hand suffered a dry and flavorless Louisiana chicken and then went with calamari which couldn&amp;#39;t have been more greasy and only like two rings and the rest were tentacles. (The server took the Louisiana chicken off but we paid for the grease trap of calamari)All in all, over priced drinks ($11 for a well whiskey and lemonade) flavorless food and greasy. We only chose the Cheesecake Factory tonight do to the expansive menu and our picky kids, however rest assured we won&amp;#39;t be back. i just wish I had taken more pics.", "rating": 3, "date": "2/23/2019"}, {"text": "I&amp;#39;m a huge fan of the Cheesecake Factory primarily for their vast selection of scrumptious cheesecakes. One of my cheesecake missions in life is to try ALL of their cheesecake flavors and still have all of my teeth and no diabetes. With that in mind, I can only try a new flavor or two every year because my sweet tooth craves different things. I&amp;#39;ve tried a lot of the flavors on the menu. I&amp;#39;m a huge fan of the raspberry white chocolate truffle, the red velvet, lemon meringue, dulce de leche, salted caramel, celebration cheesecake, and the Adam&amp;#39;s peanut butter (in no particular order). The food here is pretty good, but there are places locally in Oklahoma that has better foods, so I don&amp;#39;t come here for dinner unless there was a friend&amp;#39;s birthday or work event. This is the only Cheesecake Factory in Oklahoma City metro areas and they get very busy all the time. I&amp;#39;m definitely a fan and I LOVE their cheesecakes.", "rating": 4, "date": "8/21/2017"}, {"text": "Horrible experience! Family of 4. Asked the waiter to keep the menu after we ordered. He snatched them out of my hands! He brought the wrong for for my son! The food was not that great, was hoping the to try the cheesecake but we were ready to leave at this point.", "rating": 1, "date": "2/20/2019"}, {"text": "Was out first time there.. food was really good, it&amp;#39;s a bit high priced.. but I think most of there food is to high prices.. service was just ok.. and the pet peeve I had there was so many flys .. but I don&amp;#39;t think we will go there again..", "rating": 3, "date": "7/28/2019"}, {"text": "We were seated in the nicest area and we were early for lunch so we did not have to wait. Our server was fun and the food was very good. The cheese cake dessert was boxed for us to take home. A fun time for our family.", "rating": 5, "date": "1/22/2019"}, {"text": "I went with my co-workers in a group of six. Apparently, this restaurant has difficulty accommodating more than a few large groups, because all the big tables were taken and we were crammed into a booth. Although decor is nice, the restaurant seems to be clean, and our waitress was attentive, I was unimpressed with the Louisiana Chicken Pasta. The chicken itself was tasty, but the pasta was bland; I didn&amp;#39;t eat half of it and it wasn&amp;#39;t worth the price. Members of our group request this restaurant due to the desserts and I&amp;#39;m sure that is where they excel.", "rating": 3, "date": "4/4/2018"}, {"text": "The food was hot when it arrived to our table. That&amp;#39;s always a good thing for the wife! It was worth the 20 minute wait though. Our waiter, Andrew, was on his game, despite also serving a large party next to us. I tried something different from the updated menu and had the Thai Curry Chicken, w/brown rice and mangos. As usual, my eyes were bigger than my stomach, so that meant I had to get a to go box. Cheesecake to go also!", "rating": 4, "date": "12/9/2017"}, {"text": "No matter which city or state, Cheesecake is always consistent for sure!<br&gt;<br&gt;Dining solo at the bar, Andrew my server was amazzzing!  Such a nice guy with an awesome attitude and he was very pleasant.  He was very patient while I was conducting some business on my smart phone =)<br&gt;<br&gt;My favorite appetizer is the avocado eggroll and it was spot on delicious.  I don&amp;#39;t know why I like it so much - it&amp;#39;s just fried avocados, but it&amp;#39;s just a staple everytime I eat at CF.<br&gt;<br&gt;The burger was delicious.  No complaints!<br&gt;<br&gt;I think CF is one of the best chain restaurants in the US.  The extensive menu has something for everyone, the portions are huge, prices affordable, and always has a nice ambience.<br&gt;It&amp;#39;s always a nice option when traveling.", "rating": 4, "date": "12/11/2015"}, {"text": "I had a pretty good experience here. Went there for a birthday. They don&amp;#39;t take reservations and you have to be sure that pretty much all of your party is there before they will seat you. <br&gt;<br&gt;For the drinks, I got the bloody mary which was decent. Not the best bloody mary I&amp;#39;ve had, but it comes with a celery and it was good to go with the meal. <br&gt;<br&gt;I like that they give you complimentary bread and better. Just the plain small packaged butter. But I really enjoyed the pumpernickel bread!<br&gt;<br&gt;For my main meal, I got the almond crusted salmon salad. They definitely give you a good amount for the price. I was surprised about that. My salmon came on a bed of kale, quinoa, and avacado. It was good, filling, and not heavy on the stomach which is nice! <br&gt;<br&gt;I also tried the crab hash. It was okay. Again, the portion sizes are decent. But, I didn&amp;#39;t really enjoy the potatoes that came along with the dish. It had a weird taste to them. <br&gt;<br&gt;Overall, the service was good and attentive. Very accommodating to my party of 10, and they even gave the birthday girl a complimentary dessert! <br&gt;<br&gt;I still have yet to try the cheesecake. Too full. (I know, it&amp;#39;s called cheesecake factory and I didn&amp;#39;t try the cheesecake..) But, I&amp;#39;ll be back to try that because they looked delicious!", "rating": 4, "date": "9/11/2016"}, {"text": "Here for the National Cheesecake day! <br&gt;<br&gt;It&amp;#39;s my second time on this location and I always get great food and service!", "rating": 5, "date": "8/2/2017"}, {"text": "Cheesecake Factory is known for a good time with exquisite food. However, tonight I experienced something far from that. I ordered the Parmesan chicken &amp;#34;pizza style&amp;#34; and that&amp;#39;s EXACTLY what it turned out to be. On the menu, it does not tell you the chicken is going to be SMASHED &amp;amp; FLATTENED into a sloppy disc that covers the ENTIRE plate. The bread crust was melting off of the chicken and the chicken was revealed to be grey (in attached photo) In my opinion and my two friends that joined me for dinner agreed that the chicken tasted like cat nip (not the way chicken is supposed to taste). The marina sauce that covered my chicken frisbee tasted like tomato juice. However, our service was great and we were very well taken care of, and the desert is the only thing I would recommend on the menu.", "rating": 2, "date": "12/16/2018"}, {"text": "Excellent food with enough portions. A little bit pricey but c&amp;#39;mon the atmosphere and service. It has to be a little bit on the pricier side. My husband always order the same Grilled ribeye and mashed potatoes, I don&amp;#39;t eat meat outside my house so I order any dish that have dish or chicken. We will always be back", "rating": 4, "date": "2/11/2018"}, {"text": "I haven&amp;#39;t gone to the Cheesecake factory in a while, I will be going again soon. Ask for Marvin, the waiter was very attentive, and nice, not to much on the up selling. I like the atmosphere, and how it seemed clean as well the bathroom was well kept, nice to see a worker wash his hands too. The food comes out timely and very tasty too. I am a carrotcake critic so I ordered the crazy carrot cake Cheesecake and they nailed it. The clam chowder soup of day was amazing. Grab up the family and go there soon before its too late.", "rating": 5, "date": "1/18/2019"}, {"text": "Absolutely loved this place, delicious food, on point service! The bread served on the table was a little hard but that&amp;#39;s my only qualm and that was free so I can&amp;#39;t really complain!", "rating": 4, "date": "11/13/2018"}, {"text": "I love this place! I love the small items part of the menu, as I can never eat a full plate! I also love the cheeseburger rolls! Best thing on the menu!", "rating": 5, "date": "1/8/2019"}, {"text": "Cheesecake Factory is the perfect place in OKC to hang and dine outside.  I always enjoy what I choose from their menu options, which I should add, is the grandest option filled menu around.  My fav is the White Bean Chicken Chili but I try to explore and tday I had the Pasta Napoletana.  It was delicious and just the right size to not make me feel over full afterwards.", "rating": 5, "date": "8/13/2017"}, {"text": "EDIT: I&amp;#39;ve been told that the food doesn&amp;#39;t come frozen. Fine and dandy, but it certainly tastes it at this location. There are restaurants in the city where you can taste the freshness of the food for a fraction of the price. And how &amp;#34;none of the food is frozen&amp;#34; when they have a menu the size of a Harry Potter book is beyond me. <br&gt;<br&gt;The food is outrageously overpriced. I&amp;#39;m no fool - this is a chain restaurant. The $20 plates of food come frozen in bags. Tastes good, but not worth the price. I can spend less on a plate at a restaurant that uses fresh ingredients and makes things from scratch. <br&gt;<br&gt;However, there are two things to come here for: the cheesecake and the appetizers. We all know their cheesecake slays the game. Their appetizers are some of the best I&amp;#39;ve had at any restaurant and they are large in portion size. The avocado egg rolls and the sauce that comes with them are to die for. And who doesn&amp;#39;t love the mac and cheese balls? Ditch the regular menu. You can easily pick an appetizer and just order that as your entree; you&amp;#39;ll walk out just as full and you&amp;#39;ll probably have spent $10 less per person. <br&gt;<br&gt;As far as service goes, it&amp;#39;s always been decent at this location. This isn&amp;#39;t a place I frequent just because of the price outweighing the quality of the food, but I had a gift card and, well, I&amp;#39;m a sucker for a slice of cheesecake the size of my head.", "rating": 3, "date": "6/15/2017"}, {"text": "I ate here recently. Good food. Good service. Phenomenal cheesecake. Vanilla Bean is my favorite type of cheesecake. I will probably visit there again...just for the cheesecake.", "rating": 5, "date": "9/17/2018"}, {"text": "My first visit to a cheesecake factory was a cloudy fall evening.  I ordered The Bacon Bacon Cheeseburger. It came with fries. <br&gt;<br&gt;I nibbled on the bread they brought to the table while I waited. <br&gt;<br&gt;The dark wheat bread had a soft but chewy texture with caramel notes that left a smoky after taste.  It seemed a shame to relegate it to pre-dinner munching.  it is worth a starring role. <br&gt;<br&gt;The white bread was far chewier and crunchy with a glutinous texture that spoke of peasant roots and hinted at a missed calling to the status of crouton makings.<br&gt;<br&gt;The atmosphere was upscale but noisy with dim lighting that went for intimate but achieved an open crowded vibe.<br&gt;<br&gt;The burger arrived. I opted for mayo in lieu of the tartar sauce like not so &amp;#34;special sauce.&amp;#34;<br&gt;<br&gt;The bun was soft but we&amp;#39;ll toasted. it was high class enough to hang out in a joint like this but down to earth enough to be a proper hamburger bun.<br&gt;<br&gt;The beef was soft but pallid. Light on beefy flavor The patty left most of the flavor to the bacon.<br&gt;<br&gt;The Bacon itself was charred past the point of crispy and tasted only a moment from being burned.<br&gt;<br&gt;The cheese was delightfully creamy and gave quiet support to the rest of the burger<br&gt;<br&gt;The fries were lightly golden brown and delicious... They were right out of a dictionary definition of American French fries.<br&gt;<br&gt;My overall opinion is tentative worth ordering again if you&amp;#34;&amp;#39;re comming here with friends and want a burger instead of something else. <br&gt;<br&gt;If I ever come back I will explore the menu for something else.<br&gt;<br&gt;I took home a piece of Strawberry Cheesecake (It didn&amp;#39;t seem right not to try the cheesecake at a place called The Cheesecake Factory.<br&gt;<br&gt;The filling was mildly tangy with a modified creamy taste. The crust was slightly soggy with a grainy texture and pleasant molasses undertone to the graham cracker crust. It was a rather good commercial version of the Italian inspired desert.", "rating": 3, "date": "11/4/2015"}, {"text": "Ordered to go. I&amp;#39;ve eaten here many times, always ordering the Louisiana pasta. Been satisfied. Well ordering To go today, it was a hot, greasy mess. Actually a warm greasy mess, as it was not temperature hot when they finally brought it. Please drain the grease next time.", "rating": 2, "date": "12/5/2018"}, {"text": "Always great! Had the Vietnamese summer rolls and they were delicious! Although our waitress was a bit rude but what can you do /-:", "rating": 4, "date": "8/31/2017"}, {"text": "Just had dessert to go. I went in on a weekday at 4:30pm and it wasn&amp;#39;t packed. The cashier was kind and patient and gave me great advice. Their chocolate cake in the display fridge is definitely worth trying. It&amp;#39;s rich, but it&amp;#39;ll definitely satisfy that craving. Can&amp;#39;t speak for the rest of the food and service though (hence the lack of a star)", "rating": 4, "date": "6/14/2017"}, {"text": "Here is a restaurant that cares little for guest satisfaction and even less for how they treat their employee. As long as the General manager, Rick is piling in people he could care less how your food tastes or how long it takes to get to you. However the biggest issue here, is Steve the Executive Kitchen Manager, a man who truly loves to hide a good sexual harassment ordeal, or an underpaid employee having to miss work because they cannot pay to wash their uniform until the next day. But don&amp;#39;t worry even if the uniform is covered in cat urine, this man will say it&amp;#39;s &amp;#34;cool just come to work&amp;#34;. <br&gt;<br&gt;I could list a million reasons why not to eat here at this particular restaurant but the biggest of all is the unsanitary practice of cooks in the back, from going to the bathroom, and right back to cooking missing the sink. To dropping food on the floor and throwing back up on your plate. <br&gt;<br&gt;Do not support this restaurant or the horrible people who run it. There is plenty food in Oklahoma City with class, playing style, affordability and of course, taste that isn&amp;#39;t chain oriented.", "rating": 1, "date": "6/27/2015"}, {"text": "So sad to say that after waiting for couple hours for seating and foods. They also mess up our order, one of my friend has to wait till everybody about to finish for his food.<br&gt;<br&gt;30 minutes for them to split the ticket :(. OMG, this&amp;#39;s the first time in my life that I have to wait and deal with such many troubles at a American restaurant.", "rating": 2, "date": "1/25/2015"}, {"text": "The food was great. We ate there to celebrate my birthday and we had a wonderful time. Our  waiter and the rest of the staff were great and very attentive! The Mac N Cheese balls were delicious and so was the Snickers Cheese Cake. We will definitely eat there again!", "rating": 5, "date": "11/15/2017"}, {"text": "Food is always great here, I love there menu. The service is always great from the servers. The wait for a table isn&amp;#39;t that long, but food does take longer then most places. I know they get busy and I would hate for the quality of food to drop because they rush your food out so I will stop complaining lol. Try the Nashville Nuggets they are delicious and they will get you full. Only 5.50 for ten of them.", "rating": 5, "date": "7/14/2018"}, {"text": "Brunch was disappointing last weekend. <br&gt;Seating was immediate. <br&gt;Bread was never brought. <br&gt;The menu is too big (it actually has page numbers). <br&gt;Overpriced food took forever. <br&gt;Drinks were warm and food (omelet and potatoes) cold. <br&gt;Waitress never returned after food was dropped off and neither will I.", "rating": 1, "date": "11/8/2017"}, {"text": "First time at this location in OKC but every time I go to a Cheesecake Factory it&amp;#39;s always a great experience. I had great service and food. The waitress was on point and paid attention to details. The Cesar salad was good and the chicken and seafood gumbo was off the chain. Man I&amp;#39;m telling you. If you haven&amp;#39;t tried the gumbo try it with white rice. Mmmmmmmmm", "rating": 5, "date": "7/14/2018"}, {"text": "We come here regularly every 2-3 weeks. I always order the Grilled Ribeye steak, never disappointed. Kids also love their chicken straps but my wife is not that big of a fan. I took one star off because I always run out of my Raspberry lemonade and seems like they try not to refill more than 3 times :(", "rating": 4, "date": "5/15/2017"}, {"text": "Great service! Had a party of 8 they sat us within 10 minutes of arrival durning lunch time. We were celebrating a recent birthday and a family vacation. The food was all wonderful as was the cheesecake. We will definitely be back next time we are in town. Highly recommend the crispy crab cakes!", "rating": 5, "date": "8/20/2017"}, {"text": "Out of all the generic chain restaurants, Cheesecake Factory is on point and I don&amp;#39;t even get dessert!<br&gt;<br&gt;The menu is enormous and serves all types of food ranging from American, Italian, Chinese, and Mediterranean. I&amp;#39;m pretty sure you can get almost any type of mainstream food here.<br&gt;<br&gt;The food is consistent, if overpriced, but you don&amp;#39;t go to this restaurant for value. Anyone can find something appealing on the menu here. It&amp;#39;s probably the most robust and varied menu I&amp;#39;ve seen in OKC.<br&gt;<br&gt;Its steep prices are somewhat made up for in huge portion size.", "rating": 4, "date": "4/29/2015"}, {"text": "I love Cheesecake Factory. I also appreciate that they are all pretty consistent. If you&amp;#39;ve been to one Cheesecake Factory, you&amp;#39;ve pretty much been to them all. Huge menu, huge portions, huge gap in your wallet... but the same delicious food, strong drinks, and good service that you know and love.<br&gt;<br&gt;This is the first one I&amp;#39;ve been to where our party of 5 was immediately seated on a Friday night. I was totally expecting to wait at least an hour. I&amp;#39;m not sure if that&amp;#39;s normal, but I&amp;#39;m not complaining!", "rating": 4, "date": "9/5/2015"}, {"text": "Came for brunch. Food was good, but definitely not in proportion to the prices. Service was alright, server seemed a little overwhelmed.", "rating": 4, "date": "8/12/2018"}, {"text": "Had a terrible experience. Service was not good. Had a philly cheese steak sandwich. Something from the first did not seem right. However thinking it would get better I kept eating. Meat was very tough and full of gristle.  Ate most of it and immediately did not feel good. Told server and then manager that sandwich was not good. I wanted them to take off the bill. Manager was rude and would not take it off.  Will not be back. Was sick when I got home. Does not normally happen as I have an &amp;#34;iron&amp;#34; stomach.", "rating": 1, "date": "6/9/2019"}, {"text": "I&amp;#39;ve always enjoyed The Cheesecake Factory.  The menu is extensive and the portions are large.  I&amp;#39;ve been to several locations around the country and the food is usually pretty good with the exception of the pizza I had at the location in San Francisco.  That pizza was some of the worst I&amp;#39;ve ever tasted, in fact, so bad that I actually sent it back and requested another entree.<br&gt;<br&gt;Here are my two issues with this restaurant:<br&gt;<br&gt;1.   They do not have a traditional New York cheesecake with a firm, dense texture as opposed to more of a pudding like texture.  Very strange indeed.<br&gt;<br&gt;2.  And, most important to me.  Why do they put the silverware directly on the tables?  That is simply gross.  Interestingly enough, they wrap the eating utensils in a cloth napkin for the outside tables, but do not do so for indoor dining and it just sits on the table itself.  Even IHOP or Denny&amp;#39;s will place the eating utensils on paper placemats.<br&gt;<br&gt;I have mentioned this issue to my servers and have even written a comment on their website.  They all say they wipe the tables down, but have you noticed that they use the same wet rag at each table?  I&amp;#39;ve seen way too many kids and adults putting their hands and arms all over the tables after they cough and sneeze and then, after the table is cleared with this soiled, wet rag, down go the eating utensils for the next party.  It&amp;#39;s just not very appetizing.  <br&gt;<br&gt;I can&amp;#39;t believe I&amp;#39;m the only patron that has noticed this disgusting practice.  I always request they bring me the &amp;#34;wrapped&amp;#34; set of utensils which they do without any protest.  Nevertheless, the practice is a black eye on a mostly decent restaurant if not for this one issue.  <br&gt;<br&gt;To me, until the management resolves this issue, the restaurant only deserves two stars.", "rating": 2, "date": "11/1/2016"}, {"text": "The lunch we had today was excellent as was the  service.  They have a skinny menu which was interesting.  I had the skinny beef medallions with mashed potatoes, asparagus, and tomatoes.  It was excellent.  My wife had the skinny asian salad which she sail was excellent.", "rating": 5, "date": "5/4/2017"}, {"text": "This review is for lunch. Had a great Cobb salad and my date had a very fresh grilled salmon. Service was good and attentive. The deep chocolate cake we split had very fresh whipped cream on the side and was way more than the two of us could eat. Price was a little higher than average but not overwhelming. No iceberg lettuce in my salad and plenty of grilled chicken and bacon.", "rating": 4, "date": "11/30/2016"}, {"text": "So I went to eat here st cheesecake and the service was ok but I waited 2hrs for my food and it&amp;#39;s bugs in the bathroom plus my marinara sauce taste like ketchup and the calamari was cold don&amp;#39;t go", "rating": 1, "date": "4/7/2019"}, {"text": "I&amp;#39;ve always loved the cheesecake factory. This was my first time at this location and I loved it. I had no wait time, and was given awesome service. I ordered the tomato basil pasta and it was so good! Plenty for leftovers the next day. My boyfriend got the bacon-bacon burger and finished it all! Will definitely return sometime.", "rating": 4, "date": "6/28/2018"}, {"text": "This place has never let me down. I&amp;#39;ve been dining here at Cheesecake Factory since they opened in Beverly Hills, California. This is my go to place whenever I get out of church late and don&amp;#39;t want to deal with the &amp;#34;CHURCH RUSH&amp;#34;. I only wait about 10-15mins. They have the best drinks (Strawberry or Raspberry Lemonade). With a menu that is over 10 pages long you won&amp;#39;t have a problem finding something you like or want to try for the first time.  <br&gt;<br&gt;My Favorite Things:<br&gt;Meatloaf<br&gt;Cashew Chicken (hold cashews w/Mashed potatoes)<br&gt;Miso Salmon<br&gt;Chinese Chicken Salad<br&gt;Kobe Burger<br&gt;Grilled Chicken Avocado Bacon Sandwich<br&gt;Bang Bang Chicken<br&gt;White Bean Chili<br&gt;Avocado Eggrolls<br&gt;Buffalo Blasts<br&gt;Cobb Salad <br&gt;       -----------------------Let me stop there cause I could keep going-------------------------<br&gt;<br&gt;The staff are extremely nice from the greeters to the bussers. We always have GREAT times here!!!!", "rating": 5, "date": "8/16/2016"}, {"text": "Today we had Kane help us today. He was a great worker and he answered all our questions in a professional and genuine way! Because the weather beautiful out, we sat outside and we def enjoyed the few. With both had some mojitos for lunch: pineapple and passion fruit mojitos! Both is a must! I actually enjoy the passion fruit mojito a bit more then the pineapple bit both are delicious. For appetizers, we had calamari which is WORTH IT! best calamari I&amp;#39;ve tried (although cheevers, sushi Neko, and red rock are amazing). For our main, my boyfriend had the shrimp and chicken stir fry with brown rice and I had the chicken and mushroom pasta. Both was a specialty dish and both were delicious! The menu was HUGE so we will have to come back and try the rest of the menu. I was not disappointed at all about today! It was amazing! Thank you Kane for your service today!! I hope I spelled ur name right lol", "rating": 5, "date": "3/20/2017"}, {"text": "Place really gone downhill as to both service and cost. Sat at bar. Inordinate time to be served. Also big upcharge on food for a simple substitution. Food quality still good. Just not the experience I&amp;#39;m used to from this chain. And very, very expensive for just two people. Almost $80. =(", "rating": 3, "date": "3/21/2018"}, {"text": "Wish I could rate this place as good as their Red Velvet Cheesecake tastes. We ordered Chicken Marsala and Quesadillas, both were just okay. The service was very slow, very long time too get drinks and food.", "rating": 3, "date": "3/30/2019"}, {"text": "Not a big cheesecake fan, but they have some awesome cheesecakes and a great selection to choose from. Their food is good a well. The flavor is good and big portion size.  We ordered the crispy chicken and shrimp with pineapple and the hibachi steak, both were great. There are many Asian dishes, but not authentic if that&amp;#39;s what you&amp;#39;re looking for.", "rating": 4, "date": "3/16/2018"}, {"text": "Great service, great food! We usually get the salmon and it&amp;#39;s amazing here...the mashed potatoes really good too. The bread is always warm and makes my carb loving soul happy. If you choose to end your dinner with cheesecake you won&amp;#39;t be disappointed!", "rating": 4, "date": "9/10/2016"}, {"text": "A very novelty restaurant. I think this place might have been the bomb dot com back when I was in middle school. I didn&amp;#39;t visit until I was an adult and figured out cuisine. The menu is lengthy, but in my opinion the food is sub-par and expensive. The desserts are adventurous, but just loaded with sugar and frou-frou instead of depth. I feel like I&amp;#39;m describing a bad first date.", "rating": 3, "date": "6/12/2018"}, {"text": "Normally we love Cheesecake Factory but today was sub-par. They lost our order, the fries tasted about 3 hours old, and they had several parties all crammed into one small place. It was rather disappointing and not up to standard.", "rating": 2, "date": "6/4/2018"}, {"text": "Food is going downhill this is the third bad for you to let them last time I&amp;#39;m going to go there our waitress was really good we never asked for anything she took her time getting our change so we are ready to go she put the check down and walked off waited like a full 10 minutes seem like ever she came back and got it and it took like 10 minutes to get our change she was good", "rating": 2, "date": "6/4/2018"}, {"text": "I always am delighted to get to choose this establishment for a nice casual dinner setting. My server Flor was elegant and efficient while my party was there and the Parmesan chicken pizza style is quite delightful. Make sure to go early before they run out of the dish when you go. My only complaint is with the slim choices for beers on the menu.", "rating": 4, "date": "6/4/2018"}, {"text": "Having lots if fun eating good food with the best little hillbilly I know. Good family time.", "rating": 5, "date": "5/28/2017"}, {"text": "Firecracker salmon for an appetizer was da bomb! Daughter ordered grilled salmon..bland tasting. She didnt finish. I ordered from skinnyliousious menu of shrimp pasta. I finished my plate. Angel pasta was a tad undercooked..but edible. Got the strawberry cheesecake. Service was good and attentive.", "rating": 4, "date": "12/23/2016"}, {"text": "Had a great experience. The waiter was excellent! He was professional and very timely even though they were extremely busy. I had the Thai Wraps, shrimp scampi, and chicken marsala. Everything we put in our mouths was good!", "rating": 5, "date": "2/16/2019"}, {"text": "My visit here today was OK for a pretty established place as the cheesecake factory. I went this afternoon at 4 for an early dinner with my fiance and we were surprised at the lack of parking spot and how busy it was at this time. <br&gt;<br&gt;The reason? I believe it was because of their great lunch special which lasts till 5 pm!! I got the spicy Chipotle chicken. They say lunch portion but I couldn&amp;#39;t even eat half of it.<br&gt;<br&gt;I saw a sign in the front door and it said there is happy hour from Monday to Friday from 4-6pm on select appetizer being 5$. Considering their appetizers are usually 10 dollars this is a great deal to go with friends for an early dinner and try their wonderful small dishes. <br&gt;<br&gt;One thing I always am sad about is that I eat so much I never have room for dessert!! I have tried the majority of their cheesecake but my favorite is the Hershey chocolate one! !! It&amp;#39;s rich enough to satisfy your chocolate craving without being too overwhelming!", "rating": 4, "date": "5/24/2014"}, {"text": "I honestly was pleasantly surprised by the food here. <br&gt;<br&gt;We got Lettuce wraps to start. They were really good, and the presentation was really nice as well. <br&gt;<br&gt;For my main course, I ordered the ribeye. To my surprise they cooked it properly and it was actually really juicy.<br&gt;<br&gt;The dessert I got it what was the most memorable. We got this mango lime cake that I could not get enough of. I could honestly eat a whole cake of these bad boys.<br&gt;<br&gt;The service was also really good! <br&gt;<br&gt;I definitely recommend checking this place out.", "rating": 5, "date": "6/13/2016"}, {"text": "Decent food at decent prices. Staff are friendly. Few hiccups include takeout staff team could use a little coaching in managing their station. They were a little overwhelmed with dinner rush. However all in all the food here is good, plentiful and reasonably priced. Order was accurate and worth the long wait.", "rating": 4, "date": "1/21/2019"}, {"text": "Nice atmosphere. Good menu selection.<br&gt;My wife and I were seated quickly on the patio amid a Friday night throng of other waiting customers waiting for seating. I overheard the host mention a 20 minute wait time for indoor tables.The server was wonderful and very attentive. The down side for me was the food. I ordered the Charbroiled Choulotte Steak. A cut of sirloin that was triangular on its cut and  roughly five inches long.I asked for medium-well and received a rare-medium serving. The server graciously returned it for a bit more cook time.Although the steak had good flavor, it was very tough to chew from being a bit overcooked on its return. My side of mashed potatoes were fair....nothing exciting. A little pricey for food that I would consider mediocre. If we return, I&amp;#39;ll more than likely stick to the desserts!", "rating": 3, "date": "4/5/2014"}, {"text": "I&amp;#39;m extremely disappointed in the service and food. Visited during lunch, and while busy was still seated fairly quick. Waitress couldn&amp;#39;t have cared less about taking our order or refilling drinks. I lost count how many times she walked past our table with empty glasses on the edge. Once we did finally made the order it came out cold. The spinach and cheese dip was bland with over fried chips. We took a few bites and pushed it aside (what a waste of $13!), the burger was over seasoned and greasy and the Alfredo literally made me sick to my stomach and I barely ate half of it. After the service and the sub-par food I had no interest in ordering any desert. Our tab was over $50 and was not worth half of that.", "rating": 1, "date": "4/14/2018"}, {"text": "Have been to this restaurant, in OKC and in other cities, dozens of times and this was my most disappointing experience. I sat at the bar and ordered a salad for a late lunch. Waited 25 minutes, salad was flavorless and the used place settings of other guests sat on the bar well after their departures. I know they are better.", "rating": 1, "date": "3/2/2019"}, {"text": "So look, Cheesecake Factory is certainly not going to be confused with fine dining any time soon. Here&amp;#39;s one thing I&amp;#39;ll throw out about them: Most chains figure they&amp;#39;re going to do one thing well, and then they&amp;#39;ll add a few throwaway dishes to cover the tastes of the folks who aren&amp;#39;t interested in whatever they&amp;#39;re most &amp;#34;proud&amp;#34; of. This is how you wind up with people like my [redacted], who will think nothing of ordering a glass of Chardonnay at a run-of-the-mill Mexican restaurant.<br&gt;<br&gt;Cheesecake Factory, on the other hand, has attempted to create mass-market, easily replicable and average-quality food that will appeal to the tastes of ANYONE who walks in the door. Any four random pages of their menu book would be more than enough for your average chain, and they have way, way more than four pages. I&amp;#39;ve had the food more than I wish, and while it isn&amp;#39;t great, it is usually at least average and keeps that standard across the ridiculous variety of stuff they&amp;#39;re churning out. And I also give them bonus points for having the word &amp;#34;factory&amp;#34; in their name. It&amp;#39;s not like they&amp;#39;re hiding what they&amp;#39;re up to, are they?<br&gt;<br&gt;You need great service to get to &amp;#34;above average&amp;#34; for this kind of place, and I&amp;#39;ve never had that at this location. But there are chains out there doing way less ambitious work, and not doing it as well.", "rating": 3, "date": "8/26/2013"}, {"text": "As a California native, I&amp;#39;m a big fan of Cheesecake Factory. I miss this place and I make sure to stop by every time in California. This location is not the Cheesecake Factory I know. I came here on a Friday night with my wife and kid. You always expect a wait so that was no problem. We got seated and it just took a long time to get some service. The table beside us was seated a few minutes after us and someone greeted them immediately. They received their drinks fast too. After all that, we finally got some service. As it turns out, we had the same server. I guess he could only tend one table at a time.<br&gt;<br&gt;My wife asked for the nutritional menu. It&amp;#39;s common practice for her to ask and receive one. The server didn&amp;#39;t quite know what that was. He said he would check. He comes back and says they don&amp;#39;t have one available. Ok fine. My wife decided to order a turkey sandwich but we were told they are out of turkey. My wife goes to her next option; they are out of that too. We order margaritas--by far the worst margaritas we&amp;#39;ve ever had. We could have drank margaritas out of a can that tasted better.<br&gt;<br&gt;Like I said, I&amp;#39;m not sure what&amp;#39;s up with this location but I hope people don&amp;#39;t think they are all like this.", "rating": 2, "date": "2/20/2016"}, {"text": "This was the best I loved it and there are so many choices I chose the Buffalo wing and it was nice and spicy best buffalo wings ever I highly recommend this restaurant", "rating": 5, "date": "2/17/2018"}, {"text": "The best food at a restaurant hands down! Delicious crab bites, meatloaf, and chicken Madeira ! This place is always delish and totally worth our drive from Lawton. It is also very clean. And the cheesecake...save room! There is so many different ones to choose from. It is hard to pick a favorite.", "rating": 5, "date": "2/3/2018"}, {"text": "This is a pretty solid chain restaurant. We come here only probably about 3-4 times a year, but it is always really good. We visited a few weeks ago, and I got the Thai salmon and I had no complaints. It was cooked really well and the sauce on it was really good. This place has everything (literally almost everything) on their menu; it&amp;#39;s THE biggest menu I&amp;#39;ve ever laid eyes on! <br&gt;<br&gt;I deduct a star for the atmosphere. This is a very large place, and it gets pretty loud inside. Although, I will say they do have a patio outside that I have never sat at. <br&gt;<br&gt;Other than that, this is a definite &amp;#34;go-to&amp;#34; for Cheesecake (obvious reasons). The Oreo cheesecake is my favorite-- it&amp;#39;s pretty much like heaven in your mouth.", "rating": 4, "date": "4/22/2016"}, {"text": "Food poison, yes my wife and I took my son out for his birthday on Tuesday, my wife and I shared 3 appetizers and 3 hours later we were both sicker than we ever thought we could be. As a result we missed our plane home, had to stay in the hotel for another day and keep our rented car for another day. This place is a HEALTH HAZARD!<br&gt;I gave it a 1 star because there wasn&amp;#39;t a minus 10 to select.", "rating": 1, "date": "1/19/2018"}, {"text": "After a long day at work and a whole lot of Christmas shopping, ended our evening at The Cheesecake Factory! Amazing cocktails, food, and service!", "rating": 5, "date": "12/23/2016"}, {"text": "First off, the parking here is ridiculous. It is impossible to park in their poorly designed lot so just plan on parking at the mall and hiking to the restaurant. They have 6 &amp;#34;to go&amp;#34; parking spots, which is ridiculous. <br&gt;The restaurant is hot, loud, dark and the wait staff is rude. The menu has way too many items on it. <br&gt;The food is overpriced and mediocre. <br&gt;I&amp;#39;ll never be back", "rating": 1, "date": "12/30/2015"}, {"text": "We had waitress bailey and she was an amazing waitress, she did not check in too much, she did not check I&amp;#39;m not enough. She always refilled my drink whenever it was getting close to finished. I had the salted caramel cheesecake and I don&amp;#39;t usually eat cheesecake but this cheesecake was phenomenal. I also got the shrimp fettuccine Alfredo and it was amazing. Overall a great experience 5/5 stars", "rating": 5, "date": "1/5/2019"}, {"text": "Cheesecake has been my favorite dessert for as long as I can remember, so of course this place is one of my favorites. Their cheesecake is to die for! The food is also pretty great! If anything, though, come for the cheesecake. That&amp;#39;s what makes this place memorable.", "rating": 4, "date": "7/17/2015"}, {"text": "We tried it again Sunday afternoon about 4pm. The service was great.  Food was great. We ordered 2 appetizers, 2 entrees, and a piece of cheesecake. Everything was cooked wonderfully. Only problem was they forgot to bring a salad before the entrees, but overall it was much better than our last trip. The food was delicious! I got the Korean Fried Cauliflower and Skinnylicious Veggie Burger.", "rating": 5, "date": "10/28/2018"}, {"text": "Poor Service. Be prepared to wait for your waitress/ waiter for at least 20 min after seated. They messed up and forgot that we where there. The manager apologized and took our drink orders. Then they forgot again! We finally saw the manager took our order for starters and dinner. The dinner came 35 min after and the starters came 10 min after our dinner! <br&gt;We did complain and they did offer one of the appetizers for free but regardless the service in this restaurant really needs to improve. <br&gt;Food is up the CheeseCake Factory. Just not the service.", "rating": 2, "date": "6/26/2015"}, {"text": "Large menu with great selections to choose from. Known for large portions, elected to order off the slimmer menu. Perfect for Seniors because it has smaller portions that satisfy. Some of the best mix drinks in town.", "rating": 5, "date": "8/16/2018"}, {"text": "Heads up, this place is near the mall so you may experience less than desirable waits and service due to the employees overwhelmed with the masses awaiting their deliciousness.<br&gt;Yes this place is great to chow down then walk off the calories or shop then relax with their encyclopedia of a menu. Some of my favorite appetizers are the Avacado rolls, white hummus, bang bang shrimp. Their pasta Da Vinci is delicious. And I&amp;#39;ve tried most of their cheesecakes so you&amp;#39;re gonna have to go with what flavors speak to you. If you&amp;#39;re a wino,  try their red sangria. I&amp;#39;m pretty sure I drink pitchers of that. So delicious. Don&amp;#39;t be intimidated by the options as some people are. It&amp;#39;s broken up so just find what flavors you&amp;#39;re in the mood for and I&amp;#39;m sure your waiter can steer you into a direction that you&amp;#39;ll enjoy.", "rating": 5, "date": "6/18/2015"}, {"text": "Excellent cheesecake!!! So many varieties to choose from to include low carb options and gluten free options as well as sweetened with Splenda option. Something for everyone! You are able to be seethed for dining or grab and go cheesecake. Friendly service. Clean and fun atmosphere.", "rating": 4, "date": "10/21/2017"}, {"text": "Cheesecake Factory has great service and huge variety to select from in their menu. And their food is pretty good. But I have to emphasize &amp;#34;pretty&amp;#34;. It&amp;#39;s not great. However they are asking you to pay for great food and delivering pretty good. <br&gt;There are so many great local places that specialize in the different foods offered here whose food is GREAT and will most likely be cheaper.<br&gt;It just doesn&amp;#39;t stand up to the competition.", "rating": 2, "date": "1/2/2015"}, {"text": "First off, if you come here and don&amp;#39;t get cheesecake, your wrong.   I failed by not taking a picture of our desserts (Reese&amp;#39;s, lemon and Raspberry, and carrot cake cheesecakes).  I ordered the fried catfish dinner, came with mashed potatoes, green beans and corn.  The seasoning on the cat fish was really good and you could tell the corn was right off the cob.  My wife ordered the Baja chicken tacos, which were amazing and the lime cilantro white rice that came with it was really good as well.  Overall great dinner, just hold back on the entrée&amp;#39;s and save room for dessert.  One thing that bugged me a little, but isn&amp;#39;t necessarily bad, was that the menu almost had too many options.", "rating": 4, "date": "9/5/2015"}, {"text": "So, this place was different than what I expected. I has expected a restaurant atmosphere, and not a huge seating area where every server was wearing white, and there was a 2 hour wait!! Guess what?? We sat at the bar! Haha! Take that, people waiting on a booth! Bartender was great, and was very personable. She explained menu items, made my friend a FABULOUS Margarita that wasn&amp;#39;t even on the menu, and gave us a very good first experience! I will be going back, AND sitting at the bar area next time. <br&gt;<br&gt;Food was really good. Had the crab dip, and wings. Pretty darn good!! Smores cheesecake was so large, we really didn&amp;#39;t have room for it, but it was fabulous! Ready to go there again!", "rating": 5, "date": "2/8/2015"}, {"text": "The Cheesecake Factory has some of my favorite food but I had a horrible service experience. Came in, got sat, we were sitting there for 10 minutes before we were even greeted to get our drink order. My boyfriend ordered a Diet Coke and halfway through drinking it he noticed there was A DEAD FLY IN THE DRINK! We quietly notified our server and he immediately took it back because we weren&amp;#39;t trying to cause a scene. He said he told his manager(I doubt it) and said he would come talk to us. But a manager never came. And when we got our check... he still charged us for the Diet Coke. Nothing had been comped. And we weren&amp;#39;t expecting a free meal but seriously... got charged for a Diet Coke that he drank halfway through with a dead fly. Ya. Nice.", "rating": 2, "date": "9/29/2018"}, {"text": "The restaurant decor is nice and clean but a little dark in lighting. It was a little packed but the food and service was great and we didn&amp;#39;t wait long at all to be seated or get our food. If you don&amp;#39;t get a cheesecake after dinner make sure to get one to go! It&amp;#39;s worth taking home. I will return again for another meal at this restaurant.", "rating": 4, "date": "11/10/2015"}, {"text": "Service was terrible! We waited for a long time before being greeted by our server. He was at the bar getting drinks for the group of 4 girls sitting next to us. They dropped the &amp;#34;F bomb&amp;#34; like it was the only word they knew! Thankfully my granddaughter wasn&amp;#39;t paying much attention to them! Took a very long time to get our drinks. Dinner arrived about 1 1/2 minutes after appetizer. So we barely touched it. The server boxed our leftovers to go. He failed! He didn&amp;#39;t put any of the sauces on the leftovers. We ordered cheesecake&amp;#39;s to go. We got our check, paid our check and then sat there for 12 minutes waiting for our cheesecake. We eat here quite often. Food is always great! The last few times we&amp;#39;ve been we&amp;#39;ve had bad service!!!", "rating": 2, "date": "9/5/2017"}, {"text": "I wish I could write two reviews for the Cheesecake Factory. One for the food and one for the desserts. The food is just ok. It&amp;#39;s not bad but it&amp;#39;s not my favorite place to eat. The menu is a little overwhelming, but it is a great place to take a big group because they have everything from pizza to tacos. <br&gt;<br&gt;The cheesecake is 5 stars! I have come here just for dessert several times. The choices are endless and the flavor is great! I know they have other desserts, but I pretty much stick to the cheesecakes.", "rating": 4, "date": "9/20/2014"}, {"text": "Fast service, great food, great environment, great attitudes, just a pleasant experience. 5 stars.", "rating": 5, "date": "4/29/2013"}, {"text": "I LOVE The Cheesecak Factory. I&amp;#39;d say at any location the food is 5 stars or very close to it. At this location the service isn&amp;#39;t very great, unfortunately. I normally chalk up bad service to a bad day, but the last three times I&amp;#39;ve been here I&amp;#39;ve felt like my presence was a nuisance to each of the servers. When you walk in you can feel the tense and depressing atmosphere. We went a couple of days ago and the service was even worse than normal. During this visit they forgot the chicken in my son&amp;#39;s pasta, no big deal. I showed the server and she took his dish and came back and told me that there was chicken on there, but they&amp;#39;d make him a new plate. Umm, you saw that there was no chicken in there! I was speechless. Just apologize and fix it. Why is that hard? The server did do a complete 180 and became very friendly, chatty, and wanted to be helpful...when she came around with the check. Anyway, the food is delicious and I hope they change things up around there to make it a more pleasant experience for customers.", "rating": 3, "date": "3/27/2018"}, {"text": "Having never been to one of these, we finally went for a Sunday lunch. The restaurant was about 3/4 full and wait was about 20 minutes.<br&gt;  Service was pretty good for our party of 6. Maybe I was expecting too much but I found the food only fair and about average for a chain restaurant. Had asked for a bread refill when entrees came but we never got it. Meal took an additional 20 - 25 minutes to get to us.<br&gt;   Had some of the cheesecakes for dessert.. Again, they were ok but nothing I found exceptional.<br&gt;  I found on the bill that soft drinks were $3, lemonade $4 and regular coffee was also $3. Average food and unexceptional desserts, even if a bit overpriced based on ingredient, quality and taste are something I can live with. But such over pricing on beverages is a deal breaker for me and tipped the scales.<br&gt;  Overall, it was merely an acceptable experience but the value and experience for $150 just wasn&amp;#39;t there to warrant a return trip.", "rating": 3, "date": "1/22/2017"}, {"text": "I&amp;#39;ve been to this cheesecake factory before and the service was fine. I went back today and our server was rude. We had an older server at first but for some reason she was replaced by Sydney S. after our original server took our orders. The original server put in the wrong salad for my friend so we didn&amp;#39;t blame Sydney for it. The food was good but nothing spectacular. I ended up sharing the lemoncello cream torte for dessert. The mascarpone was beyond bitter so I asked Sydney if that was how it was supposed to taste and she said yes. I&amp;#39;m pretty sure something was wrong with the cake but she made me believe that the mascarpone  was meant to be bitter beyond belief. She saw that I was displeased by it and asked if I wanted something else but before I could answer, she walked off. I don&amp;#39;t think she was too happy with the fact that she had to take our table but that didn&amp;#39;t give her an excuse to be rude. Before this visit we were deciding between Whiskey Cake or Cheesecake factory, we should&amp;#39;ve went with Whiskey Cake as their food is better.", "rating": 1, "date": "5/24/2017"}, {"text": "Went there for lunch with parent. The food was excellent. She had the chicken sandwich. I had the pasta with ship and mushroom. The only complaint is the salad I order was dry and no dressing, I had to Oder extra ranch. The other thing is the salad waitress was so. Other table got their food before ours, when we order first.", "rating": 4, "date": "4/12/2017"}, {"text": "Me and my Wife visited Cheesecake Factory on July 30th, half priced cheesecake day! We chose to sit out on the patio during the sunny afternoon. At this time the restaurant was very busy but our waiter helped us to the best of his ability and was very polite the entire time. <br&gt;We got our menu and was shown the specials. Something new we noticed was the availability of the lunch menu on weekends now. This is new for most restaurants we&amp;#39;ve visited and was a nice option and something we&amp;#39;ll take into consideration for next time.<br&gt;Overall we greatly enjoyed our meal, the food was flavorful and the perfect temperature. It&amp;#39;s always disappointing to go to a busy restaurant and get cold food, but here it was on point. Another plus to this trip was our table-bread was actually warm! Our cheesecake was delicious and really cured my sweet tooth for the weekend.<br&gt;The only downside to our trip to C.F. was service. It had nothing to do with our waiter or the waitstaff that helped us, but more on the organization of the waitstaff. It seemed for the entire patio of at least a dozen tables, there was only our one server. He would have to carry out orders for three different tables at a time to keep caught up. Me and my wife are pretty patient, so we expected to be there awhile. But it was easy to see that some customers were getting irate with the lack of service. Maybe it was the heat...<br&gt;Overall we&amp;#39;ll be returning to C.F. Again in the future and venture more from our comfort zone and try some new foods to review!", "rating": 4, "date": "8/2/2016"}, {"text": "Went on a Saturday early evening around 6pm.  Surprisingly, got seated within 5 minutes.  The service was impeccable and excellent in every way.  The food, not so much.  I had the Evelyn&amp;#39;s favorite pasta, and while full of eggplant and artichokes, plus other veggies, it was drowned in oil and and make the veggies soggy and just okay, at best. My friend ordered the Chicken Castarella and the chicken was excellent with a fab lemon sauce. The asperagus was again, over cooked and oily, and the mashed potatoes were over worked to make them paste like, versus velvety.  The Coffee and Creme cheesecake was the only thing that shined about the meal and met expectations, other than the aforementioned service.  If you are eating there to to get cheesecake...just get the cheesecake to go and dine elsewhere.  Theses were basic dishes that should have been easy for an established restaurant to perfect. Instead it was greatly expensive for a sad meal and great dessert.", "rating": 2, "date": "7/8/2018"}, {"text": "So disappointed! This is usually our treat night restaurant. We went on Saturday evening early to beat the crowds. You can usually count on great service, great meals, great desert... and a fairly large bill. I don&amp;#39;t mind that bill thing if all the other characteristics are in place, but Saturday night was a complete fail on their part. We started out with one server and after our order was placed, we had someone new. Our drinks were never refilled and we rarely saw our server. My daughter ordered the BBQ burger with the sauce on the side (pretty difficult huh). It came out fully drenched in BBQ ranch sauce. My daughter and I received our meals but our server said he would be right out with my wife&amp;#39;s meal (chicken madeira). So we waited....and waited...and waited until a manager walked up and said her meal was served to the wrong table. He apologized and refilled our drinks because our waiter was no where to be seen. Several minutes later we were getting antsy because we were going to be late for our movie. Several more minutes pass and here comes the manager with her food. He offered to buy us a piece of cheesecake but we explained we were running late for our movie. He then offered to discount (not delete) the cost of her meal. It seemed like his biggest concern was getting off without giving a freebie. My wife said we would take the discount. We hurried through our meal to get to the movie. Our waiter then appeared briefly, just long enough to drop off the fully priced meal. Apparently the manager WAS really concerned about his margin. He never got that &amp;#34;partial discount&amp;#34; applied to our meal. I think he knew we were, at that point, in too big of a hurry to wait for a corrected check. For your attention to your margin, Mr. Manager, you purchased this review and a former customer. I hope it was worth it. If money doesn&amp;#39;t grow on trees at your house, think twice about making this your treat night restaurant.", "rating": 1, "date": "4/19/2016"}, {"text": "Decided to give this restaurant another chance after about 7 years of swearing to never go there again (different location, different state). We were not disappointed. The menu is not lacking in choices (almost too many actually). It has a nice variety of things to choose from for even the pickiest of eaters. The food quality has definitely improved over the years. The server was excellent, not overbearing and always seemed to appear when we needed him. The desserts were outstanding but as a helpful tip, you may want to share with a table mate or you will be taking half of it to go.", "rating": 4, "date": "7/6/2014"}, {"text": "So disappointed with their meal serving and quality. House nacho with chicken had no chicken on top. With 15 dollar appetizers, burned chips and cold melted cheese on top was really disappointing. On top of that our entree, which was chicken serve with white or brown rice, had table spoon of rice in middle of chicken curry.. It&amp;#39;s looks like rice spice like side for big bowl of chicken curry.. it&amp;#39;s not worth the money.. do not recommend any friends except dessert.", "rating": 1, "date": "6/16/2017"}, {"text": "I don&amp;#39;t normally review chain restaurants, but the service at this location is out of this world. My friend and I were looking for a restaurant that served late and we found The Cheesecake Factory as we walked out of the mall. We walked in and were seated immediately. Our server, Laura M, was one of the best servers I&amp;#39;ve ever had. She was attentive, patient, and accommodating, especially when she learned about my dietary restrictions. She made us feel right at home, so much so that I&amp;#39;d recommend asking for her by name to anyone going to this particular location. <br&gt;I did have one complaint, but it had absolutely nothing to do with the service. The tile floor was hazardously slick throughout the restaurant. I was concerned about face-planting on the way to our table and every time I left my seat. It&amp;#39;s like there was grease smeared all over the floor. Honestly, even if this was never remedied, it wouldn&amp;#39;t scare us away. People like Laura will always bring in repeat customers. She&amp;#39;s spectacular and I&amp;#39;ll be back even if it means I have to crawl to my table.<br&gt;Anyway, fix that floor and I&amp;#39;ll update this review to 5 stars.", "rating": 4, "date": "2/27/2016"}, {"text": "We arrived at 4.30p on a Saturday. Since there are five of us we weren&amp;#39;t bothered by a 15 minute wait. Axel was our server and seemed to care less, although he was super attentive to the table of three right next to us. When our food finally did come it was only three plates of the five. We waited six minutes for another plate then the last plate showed up four minutes later. The kicker is that it was the kids meal that arrived last. At the very least get the child&amp;#39;s meal out first...how hard is it for chicken strips and fries?!  There was a table of seven near us and amazingly they managed to get all of their food at the same time. The food itself was average; good but not spectacular for the price. The cheesecake is always good.", "rating": 2, "date": "3/19/2016"}, {"text": "If I could give it a 0 Star I would. I ordered the four cheese pasta, and the spinach dip. Not only was it overly priced but it was terribly cooked and tasted so bland I had to dump salty on it to even taste anything and to top it all off I&amp;#39;ve been sick ever since I ate it vomiting multiple times.", "rating": 1, "date": "11/5/2017"}, {"text": "Probably my favorite chain - it is so consistent, wherever you go. My favorite menu item is the chicken medeira - it is fantastic. All of the cheesecake is wonderful. I love the key lime. Anything I have ever ordered has been tasty. A little pricey - but very delicious.  The atmosphere is very nice here - pretty decor. Nice location if you have been shopping.<br&gt;<br&gt;I like to meet friends here for lunch when I am in town.", "rating": 5, "date": "12/7/2011"}, {"text": "They couldn&amp;#39;t just take the gnocchi noodles back and apologize, they had to insult my professionally trained palate!<br&gt;<br&gt;First I would just like to say that I have been preparing various types of pasta since  I was 8 years old starting out under my mother and grandmother in the kitchen; with that being said I stand almost 30 years old and I know exactly what al dente pasta is and how it should be achieved depending on which pasta is being prepared.<br&gt;<br&gt;Today around 2:00 pm I stopped in to pick up a dinner portion of Fettuccine alfredo with grilled chicken to go, to share for lunch. What I was served was something reminiscent of gnocchi in fettuccine form. This culinary faux pas may happen for a number of reasons, one being the water to noodle ratio is incorrect, (not enough water to noodles) which was most likely the problem here. <br&gt;I placed the food back in the original container and returned for a refund to be insulted by some person who didn&amp;#39;t even tatse the food in order to qualify to have an opinion on the dish. How dare you?<br&gt;<br&gt;Next time, apologize, then offer to make the food properly, and if you are seriously sorry offer a free soft drink or dessert. Never insinuate that a customer doesn&amp;#39;t comprehend what a basic dish of anything should be. You take the payments so take the payments and mind your manners, do not tell me that people enjoy eating rubbery chewy doughy pasta, those people and you apparently need to make pasta-mush-gum paste in their own kitchens on your own time  because as a  restaurant you should set the bar higher than that, you should know better, you shouldn&amp;#39;t be wasting my time, and your customer service should be basic if not better. I paid for fettuccine not your idea of edible play-doh or your crass opinion in general. Al dente does not equal gumdrops. Figure it out.", "rating": 1, "date": "11/17/2015"}, {"text": "Takes god damn 45 min for 4 seats when their was empty booths. Service slow and terrible customer service. Save yourself the time and dine elsewhere. Food was awful. My shrimp and chicken tasted dry and the sauce they used tasted like pineapple juice just dumped on it.", "rating": 1, "date": "1/13/2018"}, {"text": "We visited this restaurant on a Saturday at noon with my husband and two small children. The wait was at 15-20 minutes and we got seated 5 minutes into the wait so was a relief. Here comes the frustrating part. The hostess sat us down and I asked where my highchair was and she said she would bring it right out. I don&amp;#39;t like to sit down with my 13 month old unless he is in his highchair otherwise once the highchair arrives he will only want to be in my arms. Something any toddler mom can understand. I am standing there for about 5 minutes while the hostess continues to sit people and no server in sight. I finally walk up to the hostess and she said &amp;#34;sorry we are out&amp;#34;. While she is saying the word &amp;#34;out&amp;#34; she is walking away from me not allowing me to ask how long my wait would be. I go sit down. Finally 10 minutes later our server arrives to take the drink order. Long story short I ate my entire meal with one hand while holding my toddler in the other. Incredibly frustrating having to do that while paying $17 per plate and $7 for a kids meal. I did ask the server and even the manager 2-3 times if there was one available during our meal and the answer was no every time. I am never visiting this place again. <br&gt;<br&gt;P.S IKEA has highchairs for $15 incase you don&amp;#39;t want to ruin another tired moms meal again.", "rating": 1, "date": "1/16/2016"}, {"text": "It&amp;#39;s a shame one cannot post without giving a star...that explains my star.<br&gt;Approximately eight to ten times per month, I eat a grilled artichoke from The Cheesecake Factory.  Tonight my husband stopped by to get carry out and much to my dismay, the artichoke was very different.  Not seasoned at all, just boiled in water and tossed on a grill for grill marks.  It was so awful I couldn&amp;#39;t eat it at all.  My very patient husband took it back to explain that it had none of the usual delicious heavy seasoning.  He brought back what looked like a seasoned one but as I delved into it I realized the seasoning had only been sprinkled on the outside leaves.  Always the seasoning has been in the interior leaves as well.  Same blah artichoke....I&amp;#39;m throwing it out but angry enough to write this review. <br&gt;This is the third disappointment in a carry out meal, otherwise I would just let it go.  Mentioning a problem to management has been useless so YELP, there you have it.", "rating": 1, "date": "10/15/2015"}, {"text": "Cheesecake Factory is known for its cheesecake obviously. I always love my cheesecake from there. Especially since we are located in OKC, it&amp;#39;s nice to have great cheesecake available. The food is okay, but I mainly go for the tasty cheesecake.", "rating": 4, "date": "2/20/2017"}, {"text": "The menu is massive, with lots of choices, even for vegetarians. Discovering that I had more than one option was the best part of our visit. The service was just awful. The waitress was super dismissive and kept looking everywhere but at us while she was taking our order. We had to ask her repeatedly for basic things like silverware, bread plates, napkins, and sugar. Once we got our food, she didn&amp;#39;t come back; we had to flag down someone for our check. This was annoying, but the worst part of our visit was undoubtedly the food. I had the veggie burger. It fell apart pretty much immediately and the flavor was kind of weirdly sweet. My kids had mac and cheese and bowtie alfredo; both were undercooked with watery sauce. <br&gt;<br&gt;I might go to Cheesecake Factory again if I had a gift card, but not if I was paying for it. It was really mediocre.", "rating": 2, "date": "8/18/2013"}, {"text": "I like Cheesecake Factory every now and again. This CF is exactly like any other CF I&amp;#39;ve ever been to. Just like the one in SLC and just like the 2 I ate at in AZ before moving here. There is nothing unique about any particular CF, it&amp;#39;s a chain restaurant but one that I tend to enjoy for my birthday. <br&gt;<br&gt;We had a pretty good experience as far as food goes. In fact service and food were all fantastic until my bff said &amp;#34;It&amp;#39;s her birthday&amp;#34; and not for the obvious &amp;#34;they&amp;#39;re gonna sing and embarass me&amp;#34; reason. It literally took 20 minutes to get my cheesecake with &amp;#34;happy birthday to you&amp;#34; written in chocolate on the plate&amp;#39;s rim. <br&gt;<br&gt;Other than that: I requested pasta with my samlon instead of mashed potatoes. While the request was granted without any fuss the noodles were undercooked and stuck together. The sweet corn tamale cakes though, were so so good! <br&gt;<br&gt;I&amp;#39;m not a big fan of corporate restaurants. I typically prefer and dine with local companies, just sayin&amp;#39;", "rating": 3, "date": "3/10/2012"}, {"text": "My family and I went to the Cheesecake Factory for lunch on a Saturday afternoon. We all ordered our meals but they brought my son&amp;#39;s meal 20 minutes before any of the other meals...even before we received our appetizer. I ordered the meatloaf and mashed potatoes...my meatloaf was raw in the middle and I was sick the next day. We also found something foreign in our cheesecake...string we believe. We were all so disappointed from beginning to end. We hope this cautions people from this restaurant.", "rating": 1, "date": "11/15/2015"}, {"text": "Overprice on everything, went with the &amp;#34;Famous Factory Meatloaf&amp;#34; bland no real flavor. You can get a whole cheesecake for the same price as a slice. Wait staff was excellent.", "rating": 2, "date": "2/10/2016"}, {"text": "I usually try to stay away from chain restaurants because I think the food lacks the extra love and attention needed to make a good meal, but I had a $40 gift card to The Cheesecake Factory and I needed to go to Penn Square Mall anyway. My experience today reconfirmed (for the hundredth or so time) my distrust of chains.<br&gt;<br&gt;Let me start with the good news - the cheesecake at The Cheesecake Factory is amazing. Every dessert I&amp;#39;ve ever had from here has been consistently, sinfully delicious. They have a huge variety of cheesecakes to choose from and the display is enough to make my mouth water. I&amp;#39;ve tried several different kinds, but my favorite is the simple classic cheesecake with strawberries and whip cream. I know they get all of their desserts shipped in. Nothing is made in-house. This is usually a big food turn-off for me, but the deliciousness of the cheesecakes wins me over. I love it! Even though you&amp;#39;re looking at around $7 a slice, I think it&amp;#39;s totally worth it. I can&amp;#39;t say the same about the non-bakery items.<br&gt;<br&gt;Ok, so I will say the complimentary sourdough and dark honey-wheat bread they serve is great. I was really hungry when we got there and happy to find out I didn&amp;#39;t have to wait for our food to get a little nibble in. However, after the bread, my meal went way downhill. I ordered scrambled eggs with potatoes and a bagel with cream cheese. The eggs looked and tasted like edible plastic and the potatoes were over-processed and bland-tasting. My favorite thing was the bagel and cream cheese, but even the bagel was burnt a little bit. I really haven&amp;#39;t had a good food experience any time I&amp;#39;ve visited this restaurant and I have come to discover that a ridiculously long menu usually equals blah food as is the case here.<br&gt;<br&gt;Also, although our waitress was sweet and somewhat attentive, I think the servers might be overworked here. Everyone seemed frantic and frazzled. And why do they make them all wear white everything?!? Not a good look for frazzled wait staff in my opinion.<br&gt;<br&gt;I guess the moral of this story is, BREAK THE CHAINS unless you are satisfied with bland food. But do go in and pick up a cheesecake if you&amp;#39;re in the area. You won&amp;#39;t be disappointed with that.", "rating": 2, "date": "4/7/2013"}, {"text": "We were in okc because we had some things to do around town. And we decided to have Cheesecake Factory and of course it was good as always. I really don&amp;#39;t understand the not so good reviews at all because everything I have ever had there is very good. Today I got the Louisiana chicken pasta it was so so good. Very flavorful. No complaints at all. My husband had the chipotle chicken pasta that is what he always gets when we do get to a Cheesecake Factory he loves it and he loved it here today he said the taste has never changed. My kids had the pasta napoletana and it was very good as well and all of the pasta dishes had so much food. We also got the egg roll platter for our appetizer and all the flavors were fantastic. I also got a raspberry lemonade and omg it was the best tasting lemonade I have ever had. For dessert I got the mango key lime cheesecake and it was so so good the key lime part was so tart but it was very good. We will definitely be back again next time we are in town. And the service was very good we never had a issue with our waiter he was nice and helpful. My husband asked him about what pastas were spicy and he helped him with finding the ones that were.", "rating": 5, "date": "10/25/2018"}, {"text": "Ok, The Cheesecake Factory does not take reservations and will not allow anyone to add their party to the wait list unless the entire party is present. We walked in at 1215 with a party of 9, 4 adults and 5 children. We were told the wait would be 30 minutes max. At 40 minutes manager approaches me and tells me party in our seats are eating dessert and it should be another 10 to 15 minutes. 20 minutes later, after we see a party of 9 seated that arrived well after us, I approach the manager and ask him how much longer as we have been waiting over an hour at this point.  He looks at us with a blank stare on his face and although he did not admit the fact he had skipped over us (either by mistake or on purpose) I realize he had as he again walks through the entire restaurant looking for a differant place to seat us. By this time my wife&amp;#39;s furious and the children are starting to melt down being bored and hungry. The manager strings us along another fifteen minutes making our entire wait over 80 minutes!! We have never had a bad meal here, service has always been spot on. Joe, waiter, took great care of us, and although still seething with anger I took care of him as well via tip. Meals, dessert, two drinks came to $100. I won&amp;#39;t be back. Any restaurant that does not take reservations, or call ahead, or allow one person to sign up party without entire party being present, AND THEN EVEN SCREW UP A WAIT LIST, does not get my return business. We were treated like badly behaving livestock waiting in the shoot to be castrated, one after the other, then sent on our way. I am so very sorry, yes i goofed that up bad.  Is there anything i can do to make it up to you....anything, just say the word! Cheesecake Factory but this pain won&amp;#39;t go away this time. I won&amp;#39;t be back.", "rating": 1, "date": "2/22/2015"}, {"text": "I normally love Cheesecake Factory. Here in OKC, we were seated within 5 minutes, which is good bc no one was there. After we ordered, we waited about 20 min for our food, which is fine but server was in such a hurry to flip his table, he wanted to box up our meals a few minutes in. Food was ok, overpriced for the quality. Cheesecake was yummy, as always. Server wanted our ticket paid before we ever got dessert n then offered to package it up quickly. Whole dinner was rushed. We were in and out in 50 minutes for a $100 dinner and almost half of that was waiting on three entrees.", "rating": 2, "date": "3/25/2016"}, {"text": "My husband and I almost always come here on a regular Friday night date night. We love LeAnn F. as our server and specifically request for her each week we come. She takes such great care of us. The food here is so great. We have not had one bad meal yet. The wait was over an hour and a half tonight but well worth it. :)", "rating": 5, "date": "2/21/2014"}, {"text": "Corn fritters didn&amp;#39;t taste like corn, just deep fried batter and the pizza had just enough sauce to give a red tint. White chicken chili is just big chunks of chicken in a thick sauce. For the price of the food that isn&amp;#39;t acceptable. Great service rose the review to a 2!", "rating": 2, "date": "9/6/2016"}, {"text": "Great food, great service and of course they have great dessert, strawberry cheesecake was awesome!", "rating": 4, "date": "11/16/2016"}, {"text": "Great service and amazing food! Yes, it is pricey, but who doesn&amp;#39;t love cheesecake? The general manager stopped by our table and was very nice to us! Will return!", "rating": 5, "date": "3/31/2016"}, {"text": "On rare occasions, I love to over-indulge at the Cheesecake Factory.  So last night, when I was pulling into OKC, OK, and my friend suggested it for dinner, I was all game.  :)<br&gt;<br&gt;This CCF is no different than the others, other than it was a lil less hectic feeling.  It&amp;#39;s a huge restaurant that is kept very clean and has beautiful, classic decor.  My friend and I sat at the bar so we could chat, watch the game and enjoy the night away from the restaurant bustle.  The bartender, Kaitlyn, was super cute and nice (just the way my friend likes em) and when our food came out, it was delicious as always.  <br&gt;<br&gt;I like to order the Black Pepper Jamaican Shrimp.  It&amp;#39;s a lil spicy and always tasty.  I followed it with a Lemon Raspberry Cheesecake, which will take me 3 days to finish because my friend ordered his own, the pecan pumpkin seasonal cheesecake.  All was good!<br&gt;<br&gt;Thank-u, Cheesecake Factory, for the dependable, tasty food and service!<br&gt;<br&gt;See ya there!", "rating": 4, "date": "10/7/2010"}, {"text": "The food here is delicious! I&amp;#39;ve gone many times for dinner, but I met a friend most recently just to have a slice of cheesecake. The waiter was really nice. When we were ready to go, I asked for a box to take the rest of my cheesecake home. After I asked for the box, I never saw the waiter again. About 15-20 minutes later, and after the restaurant closed, a different waiter asked if I needed a box and I said yes. I never saw him again either. I finally took my plate up to the cheesecake station and asked for a box. The woman behind the counter was super super kind and boxed it up for me, even adding more whipped cream. I felt bad because we needed up staying about 30 minutes after they closed, but I wanted to take my food home! I will definitely go here again, but the service may not be the best when they are about to close.", "rating": 4, "date": "7/20/2016"}, {"text": "Service was great! I have been coming here for years and nothing changes which is a good thing! The food is always excellent and the drinks are always strong like I like them! When u drive 3 hours for some good food that lets you know this is place to be!!!", "rating": 4, "date": "10/3/2015"}, {"text": "The food is good. The menu is so big it&amp;#39;s daunting but they have options for almost anything you could want. I think it&amp;#39;s overpriced. It&amp;#39;s always packed so it&amp;#39;s best to come in the mid-afternoon in between lunch and dinner hours or else you won&amp;#39;t be able to find a place to park and you&amp;#39;ll have a long wait.", "rating": 3, "date": "9/15/2015"}, {"text": "I ate at here 5-12-15. This was my first time to eat at a Cheesecake Factory. I was soooo disappointed! Our service was horrible. Our waitress was terrible! She never refilled our drinks. Never came to check on us. She was very rude when we waved to her &amp;amp; asked her for refills. The food was mediocre. The sauce was good the pasta was good but my shrimp was way overcooked, tough, and chewy. The only reason I am giving two stars is the cheesecake. It was phenomenal! It was a large piece, creamy, fabulous! Everyone at our table got something different  for dessert and it was all fantastic. My entrée was  $18, my margarita was $10.50, and my white chocolate, caramel, macadamia nut cheesecake was around $7. It is a pretty expensive place to eat. If I ever go back it will be for the cheesecake only and I will get it to go.", "rating": 2, "date": "5/16/2015"}, {"text": "Food was good, service not so much. Erica did not go out of her way to be a good server. She split the check without asking and then when I asked to put them together, she said can I just run  them separate. I could tell by her body language that she hates her job.", "rating": 1, "date": "11/14/2015"}, {"text": "I wanted to do an update for this chain. I went here recently again after shopping with my husband. My husband had the carbonara which he said was not carbonara and did not taste good. I had the lettuce wraps which they didn&amp;#39;t even bring out to me until ten mins after my husband got his meal. The manager however did apologize and asked me if I wanted a soup or salad while I waited, but I declined. Anywho.. my lettuce wraps only had one tiny piece of chicken, and was not satisfying. The cheesecakes however have always tasted yummy. I usually get the Godiva, yum. Bottom line is dine some place else and get dessert to-go here.", "rating": 2, "date": "12/5/2012"}, {"text": "I have to jump on the band wagon and ask, what&amp;#39;s the big deal about this place? the Orange chicken was def Orange and sweet with no other flavor and the avocado eggrolls were bland. This was strike 2 so I won&amp;#39;t be back", "rating": 2, "date": "12/27/2014"}, {"text": "This place is very clean and the atmosphere is nice.  Our wait was a little long but we got there right at 6:00.  Waitstaff was very polite and helpful.  The menu is huge and can be a little intimidating when trying to decide.  I would definitely eat here again.", "rating": 4, "date": "1/28/2016"}, {"text": "I believe that Yelp should adopt a negative star capability...  just a suggestion. That being said I typically never post anything to a websites comments that can be viewed as disfavorable because I feel like any restaurant can have an off night. However, when the staff is less than helpful when food is brought to the table frozen in the middle for one member of my party, and the plates are completely cold for myself and two others, an apology and a replacement entrée  is all that is needed. When are our server finally brought the two replacement chicken Bellagio&amp;#39;s after waiting an additional hour it was completely drenched in oil. Now being that I waited two hours to eat I went ahead and had a few bites despite the egregious service that I received, only to be made physically sick due to all the oil that in my opinion was given out of spite. I spoke with 2 managers that did not acknowledge the cold food. One person in our party never received their original order, and they received the replacement entrée that was frozen in the middle. No one apologized or an the original entrée that was offered never made it to the table.  There was not any acknowledgement for the lack of food service by our waiter as well.  I will not be visiting this location ever again. There are a lot of options in Oklahoma City that far surpass this culinary experience and receiving bad service at a major chain, i.e. (The Cheesecake Factory)  is not worth the time or money. I hope other people have a better experience at this location because frankly mine was deplorable.", "rating": 1, "date": "7/23/2017"}, {"text": "Ever have a waiter that really went out of his/her way to make you feel like you were inconveniencing them?  I asked our waiter, John M. if we could have a booth instead because my friend&amp;#39;s chair was uncomfortable.  If looks could kill!  That dude was practically seething the rest of the evening and not even hiding it.  Very sarcastic.  On a positive note the was good but it took a little longer than average for entrée.", "rating": 3, "date": "9/7/2015"}, {"text": "Just had my Birthday lunch here, worst visit I have ever had. Waitress disappeared for about 15 minutes. She would say &amp;#34;Do you need anything else?&amp;#34; Then not even come back with what I asked for. Food was less than what I have come to know from Cheesecake Factory. My calamari was burnt and all clumped together in a giant ball. Half of which was actually chicken tenders when you started pulling it apart. My appetizer, bread and my meal all came out together. Heaven forbid I ask for a straw. I had to ask for a refill.  Didn&amp;#39;t even order the Cheesecake I wanted before I left because I was just over the terrible service.", "rating": 1, "date": "8/2/2014"}, {"text": "For all of the hype that this restaurant gets my experience wasn&amp;#39;t too bad. We went on a Monday night so, thankfully, there was no wait (which, on the weekends I hear, can be terrible). Our hostess sat my date and I at a tiny, two-person table squeezed in between two full tables. One of the tables was full of very loud teenage girls obsessed with selfies. <br&gt;Anyways, back to the food. I asked for a water with lemon, pretty basic, but never got a lemon all night even after asking the waiter multiple times. I ordered the shrimp BLT and a side salad. The salad was a good mix of greens with a very yummy, chunky blue cheese dressing. The sandwich was massive! It had thick strips of crispy bacon and large slices of tomato, although the tomato had not fully ripened yet (yay green tomatoes!). There was very little shrimp which was disappointing because let&amp;#39;s face it, shrimp is the whole reason for living!<br&gt;<br&gt;Next up, the cheese cake!!! I ordered red velvet cheese cake and my date had the cookie dough. They were both pretty epic. The cookie dough cake has actual cookie dough in the middle! Wow. The red velvet is worth the $10 and it&amp;#39;s so huge that I had cheese cake for the next three nights. <br&gt;<br&gt;All in all, I would recommended this place to someone during a weekday. Nice atmosphere (unless you get placed next to high school girls), friendly staff, and yummy food. A bit pricey but even if you just go for dessert it&amp;#39;s worth it.", "rating": 3, "date": "7/15/2014"}, {"text": "Love this place food is always amazing service is almost always perfect.. this last time I requested another shot un my drink. It was really weak. The server told me I wasnt going to taste the alcohol.. I simply asked her for another shot, after I told her I didnt want to see her anymore I got a new server and my simple request was fulfilled... I will be back often not to let one bad server kill the awesome atmosphere here..", "rating": 5, "date": "4/22/2015"}, {"text": "Being my first time in this city and this restaurant The Cheesecake Factory is definitely on my return list. The restaurant had a nice feel to it and was very relaxed. I cannot express the level of customer care demonstrated by the waiting staff. My waitress in particular, Micala, was &amp;#34;the bomb&amp;#34;. She was easily available, very personable, and informative. Definitely would recommend to a friend!", "rating": 5, "date": "6/24/2017"}, {"text": "I&amp;#39;ve been to Cheesecake Factory many times over the years. I don&amp;#39;t think the food is amazing, and the cheesecakes are good but nothing I crave (I&amp;#39;m a baker myself so it&amp;#39;s pretty hard to impress my sweet tooth). Food is predictable and consistent, so it&amp;#39;s a good place for a crowd where everyone has different tastes. There&amp;#39;s pretty much something for everyone. I gave four stars because my husband&amp;#39;s favorite dish is the Steak Dianne, and it&amp;#39;s pretty darn good. I&amp;#39;ve always received good service here, though it can be a little slow with a large lunch crowd. The lunch portions are still pretty large and will fill you up, though I&amp;#39;m not sure if it&amp;#39;s the food or complimentary bread that fills me up more. If I had to pick a cheesecake though, it would be the dark chocolate cheesecake, though I can&amp;#39;t remember its specific name. Mmmmm I love dark chocolate!", "rating": 4, "date": "5/15/2014"}, {"text": "This Cheesecake Factory has, unfortunately, gone downhill lately because of bad management: poor service and food not prepared well!  Go to Whiskey Café around the corner for a much better dining experience.", "rating": 1, "date": "10/15/2014"}, {"text": "The best restaurant. They never dissapoint. This place is clean and the waiters are very friendly. Im in this place once a week and orders either miso salmon or shrimp scampi, all these years I have ate in this place, I have never once had bad service. This is my go to place to eat.", "rating": 5, "date": "8/17/2015"}, {"text": "Typical chain. Nothing special. The food is decent. The portions are HUGE! The service can be hit or miss. You&amp;#39;ll either get someone who goes above and beyond or someone who forgets you&amp;#39;re there. <br&gt;<br&gt;The best thing here is the cheesecake obviously.", "rating": 2, "date": "7/14/2012"}, {"text": "Their food and gigantic menu are consistent with all the other Cheesecake Factories around the country. Even though the outdoor seating areas overlook the beautiful mall parking lots, they do try to make it as nice as possible.<br&gt;<br&gt;I&amp;#39;m probably in the minority of diners here because we never get dessert, but their cheesecakes look amazing.", "rating": 3, "date": "6/24/2012"}, {"text": "Been to many cheesecake factories, love them. However, at 11:30 on Saturday we were seated at a long row of tables very close seating.<br&gt;I do not want to eat within 1-2 ft of a stranger. I asked if we could sit somewhere more private. The hostess looked at me like she did not <br&gt;understand me. I repeated it. She said no booths available. I said ok.<br&gt;Manager came over and asked if we wanted to wait on a booth, I said no<br&gt;Just did not want anyone next to me. He said he was going to fill up the restaurant (of course). I felt that he he came over to let me know that he did not need my business so we left. Made me soooo sad.", "rating": 1, "date": "8/8/2015"}, {"text": "This place was great. I really like the food and the service was accurate and delivered in a timely manner.", "rating": 5, "date": "6/20/2017"}, {"text": "I would give a better rating however Managment and staff isn&amp;#39;t doing their job of keeping customers in order that are waiting on a table.  Tonight I went in to the bakery to get a cheesecake, people were everywhere, there was no path to get into the restaurant to put your name on a list to get a table or to get to the bakery, people were packed like sardines waiting on a table, I tried my best not to push anyone however my body was in contact with another body from the moment i walked in the door, if an ambulance was to come and get someone in need it would take them a good 5 minutes to get into the restaurant passed the door and they would be pushing people the entire way.  This was aggregating and super annoying to attempt to just buy a cheesecake from their bakery, in front of the bakery you couldn&amp;#39;t look a the cheesecakes on display because customers were standing in front of the case and there was no where for them to go inside the restaurant, there was plenty of room outside.  There were people in front of the register where i usually pick up the cheesecakes and you have no idea if they are being waited on or waiting for a table, nobody would move, this experience sucked really bad.  The staff is always friendly, the cheesecake i got for the family for dessert was great.  I&amp;#39;m putting blame on management for extreme unorganization, this is dangerous, the fire marshal needs to be called.", "rating": 2, "date": "3/3/2018"}, {"text": "I ate there yesterday and got food poisoning from the fresh salmon. Up all night with green apple two step. Told waitress somethings was funny about the food, she just discounted the statement with offering a substitution.", "rating": 1, "date": "3/16/2015"}, {"text": "Worse service Oklahoma City Cheesecake Factory.  People who were seated after and next to us were waited on and received their food first.  But it gets worse.  These people finished their food, got their dessert and bill before we ever received our order at the table.  I went to notify the manager that we had not received out food.  And, like the manager could not understand the problem.  Our order finally arrrived and the waiter explained the glitch which was in the computer, but he never bothered coming over and explaining the situation until after the manager was notifed.  So it was nearly 30-45 mins before we ever received our lunch orders (sandwiches and salads -duh!).  And the manager nor waiter ever offered any compensation or free anything.  I won&amp;#39;t be going back again.", "rating": 1, "date": "3/12/2016"}, {"text": "Favorite place. So many choices. All the deserts are great. Everything tastes fresh and service also usually great.", "rating": 5, "date": "12/8/2014"}, {"text": "always consistent on the service and food drinks are good also just a basic all around great place can get super loud at times but its tailorable.", "rating": 4, "date": "9/25/2016"}, {"text": "Had a great experience here yesterday.  the food was great and our server was amazing. Tall girl I believe her name was Victoria, truly went out of her way to make our order right for us.  Even gave us a great suggestion for desert that I loved. Ask for her if you want a great experience and great food.", "rating": 5, "date": "1/23/2015"}, {"text": "I don&amp;#39;t get the hype. It was OK. Pricey IMO. I ordered a sandwich and it wasn&amp;#39;t very big width wise but was stacked so high I barely could take a bite which I hate! A slightly bigger bread would make it easier to eat. I had a slice of cheese cake which was tasty but nothing amazing.", "rating": 3, "date": "1/1/2014"}, {"text": "My husband, child ,and I chose the Cheesecake Factory for our family day/my birthday.  Huge mistake. It was a busy Sunday morning. I expected it to be busy like it was. We got seated quicker than I expected. Our waiter came to our table maybe 5 minutes after we were sat. He took our drink orders. We waited 10 minutes to get our drinks. He also brought us out some bread and we finished it before he could even come back and take our order. The Sunday brunch sounded wonderful. I ordered &amp;#34; fried chicken and waffles Benedict &amp;#34;. My hubby ordered a burger. We have a 17 month old daughter so she would just share with us. We waited and waited for our food to come out. Our waiter never offered more bread. A table seated after us got their food first. Finally our food arrived. It looked great. Big portions. Unfortunately I wasn&amp;#39;t a fan of my food. I managed to get down half a waffle and that was it. Our waiter never came by to see how we were doing or how the food was tasting. When he did come by he cleared our plates and asked if we&amp;#39;d like dessert. I did. He brought us by the menu again to choose what we&amp;#39;d like. It took him a very long time to return to get out order. We had been waiting a long time so I just ordered a slice of cheesecake to go. All in all we were there for 2 hours and the service was slow and inattentive. Huge disappointment. Wish we hadn&amp;#39;t wasted our family day on this restaurant. We even drove an hour out of our way to eat there.", "rating": 2, "date": "3/3/2017"}, {"text": "This place is pretty good for a chain restaurant.  I went there for a late lunch and was seated quickly.  I ordered the pasta carbonara and it was very good.  My dining companion order the herb-encrusted salmon and he said it was good, as well.  We also got dessert--kahlua coffee cocoa cheesecake (or something like that) and THAT was amazing!  I love the huge menu here, I always feel like I have lots of options.  The negative, though, is the ambiance.  It&amp;#39;s always really loud in here.  Get a booth if you can, as it&amp;#39;s generally quieter.", "rating": 4, "date": "4/1/2014"}, {"text": "If I could give Cheesecake Factory less than 1 star, I would. I never post anything on yelp because I feel like any restaurant can have an off night. However, when the staff is less than helpful when food is brought to the table frozen in the middle and the plates are completely cold, an apology and a replacement entree&amp;#39; is all that is needed. We spoke to with 2 managers that did not acknowledge the cold food. One person in our party never received their original order, and they received the replacement entree&amp;#39; that was frozen in the middle. No one apologized or an the original entree&amp;#39; that was offered never made it to the table.  There was not any acknowledgement for the lack of food service by our waiter as well.  I will not be visiting this location ever again. There are a lot of options in Oklahoma City that far surpass this culinary experience and receiving bad service at a major chain is not worth the time or money. I hope other people have a better experience at this location.", "rating": 1, "date": "7/22/2017"}, {"text": "I sat at the bar and enjoyed watching the Thunder in the playoffs.  I had a cold beer and enjoyed tasty pot stickers as my appetizer.  The service at the bar was excellent.", "rating": 4, "date": "6/21/2014"}, {"text": "Over worked chain.  They lost our reservation, then told us they don&amp;#39;t take them.  We did get free dips, but they weren&amp;#39;t the highlight of our experience.  Service is always questionable here and I&amp;#39;ve only been 3-4 times in my life.  Half our table received their food in 15 minutes and the other half it took almost 40 minutes for some soup and salad. They also added gratuity  - which I hate - we are extremely generous tippers, until you add gratuity.  Everyone always seems like they&amp;#39;re running around like crazy and are flustered. Not an enjoyable dining experience.", "rating": 2, "date": "12/19/2013"}, {"text": "My wife and I LOVE this restaurant! I wish I could give it a sixth star. Some of the best food in the metro can be found right here without the exorbitant prices you might find at some of the other local restaurants. Here you can expect high quality food with the &amp;#34;fine dining&amp;#34; experience without paying fine dining prices. While the lines might be long at prime times without a reservation, the service is always fantastic and the food and drinks leave nothing to be desired. If you want a slice of some of the best cheesecake in the world then get ready for it! Cheesecake Factory has an entire menu of flavors to choose from and we are convinced that there isn&amp;#39;t a bad one to be had! Brunch is served Saturday and Sunday from 10:00am - 2:00pm. We can personally attest that the chicken and waffles are incredible, and on a warm day you can enjoy your meal on their patio if you choose. I hope you give them a try. I&amp;#39;m sure you will not be disappointed.", "rating": 5, "date": "12/30/2017"}, {"text": "I love this place, they never disappoint! If you havent tried the ahi tar tare you&amp;#39;re missing out. It is so incredible! Tuxedo cheesecake for me as well!", "rating": 4, "date": "3/3/2014"}, {"text": "I&amp;#39;ll probably get hate mail for giving Cheesecake Factory a two star review since the gargantuan portions guarantee a perpetual crowd but who wants hubcap-sized plates of mediocre food? Seriously, I&amp;#39;d rather have a small dish of something that tastes divine than a trough of something that tastes like packing peanuts.<br&gt;<br&gt;I also wonder if there&amp;#39;s a Bread Nazi in the kitchen rationing the bread baskets since it seems like bread delivery is random and/or tables worthy of bread are chosen on a lottery system. Service is also a little spotty- wait staff is always pleasant but there seems to be a lack of communication regarding seating since servers seem befuddled at first by your appearance in their section.<br&gt;<br&gt;The avocado spring rolls are usually good (hence the two stars) but not good enough for me to return if I&amp;#39;ve got other dining options (or even an unopened can of soup at home).", "rating": 2, "date": "6/11/2007"}, {"text": "Yeah, I know people love this place, but I think its kind of overrated. And overpriced. The portions are enormous and after paying close to $20 for an entree you feel kind of obliged to take your little doggy bag back home and try and get a second meal out of it. Admittedly I did go out drinking later that night and it made for some decent 3am munchies. Look I don&amp;#39;t mind paying good money for a meal thats going to knock my socks off but I didn&amp;#39;t find that here. <br&gt;<br&gt;Decent cocktails but again more than I really like to pay when I&amp;#39;m at a chain restaurant devoid of any kind of atmosphere. Good cheesecake but honestly... I think I&amp;#39;ve had better.", "rating": 3, "date": "11/17/2010"}, {"text": "We have eaten here many times in a number of states. Big menu. Plenty to choose from. Interior is visually interesting.<br&gt;<br&gt;Wait staff has always been good.  Yes, it is a chain. But their business plan works. And if you like cheesecake, there is plenty to choose from on that front as well as other desserts.<br&gt;<br&gt;The wait on weekends can be crazy. So plan ahead. Usually things slow down by 8:30 if you don&amp;#39;t mind eating later.<br&gt;<br&gt;The only complaint I have is that some of the tables are set up very close to each other. And if it is busy, you kind of feel like you are wedged in there with the masses. Not exactly quaint and cozy if you happen to be seated in that section.", "rating": 3, "date": "6/25/2011"}, {"text": "Love the new fish tacos! My fav cheesecake is the red velvet.  Service was okay. Our waitresa was anxious to clean the table of things I often wasn&amp;#39;t finished eating. Overall a good place for our date!", "rating": 4, "date": "10/14/2013"}, {"text": "Not great. Not bad. Just food. I have had good experiences at other ccf restaurants. This one was a let down. Also, got sick after eating here, possibly a touch of food poisoning!", "rating": 3, "date": "1/1/2013"}, {"text": "I&amp;#39;m not gonna lie, this place rocks! I love eating at The Factory! I&amp;#39;ve eaten at this one twice. The first time I ate dinner and dessert...Chicken Parmesan with a mocha cheese cake slice afterwards. A-MAZ-ING! So good! And the wait staff was great. That time I went with some friends and our waitress was pregnant and about to pop at any time. She did so good for being so pregnant that we left and went to Wal-Mart and bought her some baby clothes and diapers and formula and stuff! She cried! It was great!<br&gt;<br&gt;The Second time, I went with a group of friends and we had dessert on the patio. So beautiful! The bathrooms are very very nice. The inside is so nice and the place itself is just great. No negatives from me. I highly recommend The Cheese Cake Factory.", "rating": 5, "date": "7/27/2009"}, {"text": "Went here for Valentine&amp;#39;s day and had a great experience! The waitress took tremendous care of my table. The food was perfectly cooked and arrived extremely quick especially considering how busy the restaurant was. My recommendation would be to try the Oreo cheesecake for dessert! It was absolutely amazing!", "rating": 5, "date": "2/19/2014"}, {"text": "The Cheesecake Factory is by far the best casual restaurant in Okc. The service is incredible and the food is always great.  They have the best selection and the staff always exceeds all expectations of a restaurant!", "rating": 5, "date": "1/21/2016"}, {"text": "Worst atmosphere and tacky decor I have ever seen, it is like Egypt meets grandma. The food is so bland and twice my silver wear has been dirty.", "rating": 1, "date": "7/11/2014"}, {"text": "Amazing! Great food every time we come in and employees are always clean cut. It is a little pricey, but the food is incredible and portions are huge. And I can never leave without cheesecakes!", "rating": 5, "date": "3/28/2015"}, {"text": "Sometimes a corporate chain place is exactly what you need.  If you are going out to eat with a group that has varying tastes, it&amp;#39;s nice to take out the mystery element.  I like The Cheesecake Factory because I know what to expect.  The atmosphere is a little more upscale than your average family restaurant.  Casual enough to be relaxed but just fancy enough to celebrate a birthday or anniversary.  <br&gt;  This location is free standing but next to a large shopping mall.  The menu is extensive so definitely email out a link to the indecisive.  I do like that you can order a lunch special on the weekends.  The portions are still gigantic and their warm bread basket is addictive.  I usually skip appetizers in an attempt to save room for cheesecake but the avocado rolls are really good.  Imagine a mix between guacamole and eggs rolls- the best of both worlds.  <br&gt;  Besides cheesecake, the reason I go to CF is for pasta.  I feel a little less guilty splurging on a bowl of the Fettuccine with Chicken and Sun Dried Tomatoes when I know I am just minutes away from chasing it with a cheesecake induced sugar rush.  I like to get all my sinning done in one sitting.  My sweety likes the steak and eggs on the brunch menu.    They do offer a Skinnylicious menu if you want lighter fare but that just seems like a way to make your table mates feel bad about themselves. Do you want to be &amp;#34;that&amp;#34; guy or girl?<br&gt;  The service was good even though we went during the Sunday brunch rush.  The one thing I would suggest is to ask to keep one menu as that table to browse the cheesecake flavors.  My favorites are the Key Lime, Lemon Raspberry and White Chocolate Raspberry Truffle.  Don&amp;#39;t plan anything too ambitious for about 4 hours after a trip to the Cheesecake Factory- usually a nap while watching TV will help you through the food fog.", "rating": 3, "date": "12/1/2012"}, {"text": "Love love love the Cheesecake Factory. We did have quite the long wait, but considering it was Friday night at dinner time I can&amp;#39;t complain too much. Our waitress was prompt in taking drink orders, and gave us plenty of time to look over the ridiculously long menu. Seriously, it&amp;#39;s 15 pages. We ordered our food and only waited 20-30 minutes on a busy night, which is just fine for me- I filled up on some sourdough and pumpernickel bread. My boyfriend and his dad had crab cakes and loved them. Really, they raved about them for days. I had a burger which was nothing special but a good burger nonetheless. Then we all shared Tex Mex egg rolls. Man oh man, I wish I could eat those every day. I love those things!", "rating": 4, "date": "8/29/2014"}, {"text": "I love the Vietnamese Spring Rolls! Santorini Farro Salad is my next favorite.  I&amp;#39;ve never been disappointed. Waiters always attentive. Hubby loves the filet mignon. It&amp;#39;s cooked to perfection every time.", "rating": 5, "date": "5/17/2014"}, {"text": "Another overrated chain restaurant. Atmosphere and food were mediocre. Save your money, and go across the parking lot to Elephant bar instead.", "rating": 2, "date": "7/10/2008"}, {"text": "It is the Cheesecake Factory. I had the grilled eggplant and roasted red pepper sandwich.Phenomenal. My son had the mac and cheese burger. Fantastic. His girlfriend had the buffalo chicken sandwich and my husband had the factory burger. They both enjoyed theirs. The appetizers were yummy as well-firecracker salmon and the artichoke and spinach cheese dip. What is worth mentioning here is the manner in which we were treated. I have been here many times as it is the only Factory within a bazillion miles. It is ALWAYS crowded. This is not a problem for me. I am fully prepared to wait. However, I do not appreciate being rushed. If one is going to spend a hundred bucks for a meal, I think the option of at least wiping your mouth after the last bite should be open to you. We had barely laid our forks down before the bill was received and plates were whisked away.  I don&amp;#39;t appreciated being pressured to leave because the Factory failed to build a big enough building. Of course our waitress got our generous tip-I don&amp;#39;t like not paying- just give us a chance to take a breath before you decide it is time for us to leave.", "rating": 4, "date": "3/16/2014"}, {"text": "I don&amp;#39;t want to admit that I went here, but I stopped by last night for dinner with some friends. The wait staff was extremely courteous, especially because we fell into the auto 18% gratuity. The menu was huge and took hours to go through. I had a caramel apple cider that was like warm apple pie in a glass. I followed that up with a large house salad and split a vegetable penne. The pasta was cooked perfectly, but the vegetables were bland and over done. Overall I had a pleasant experience and would come back.", "rating": 3, "date": "1/8/2010"}, {"text": "This place has the largest menu of any restaurant with all types of food to please anyone&amp;#39;s palate. Start out with the Ahi Carpaccio or the Crab Cakes, then move right into the Bistro Shrimp Pasta, California Cheesesteak Sandwich or the Fresh Grilled Mahi Mahi and finish it off with the Tiramisu cheesecake or the Dulce de Leche Caramel cheesecake, both are to die for!", "rating": 5, "date": "10/19/2009"}, {"text": "We went here because we were given Birthday gift cards.The staff was very friendly,our waiter was new to the job,but he did everything he could to make our visit a great experience.The menu is very extensive.My mother in law had the taco salad,it was huge and was very good.My husband had a seafood dish which he said was good.I had a shrimp pasta dish.I rarely complain but the only thing on my plate that was great was the shrimp.The pasta and it&amp;#39;s sauce were very bland and the pasta hadn&amp;#39;t been cooked much.I like my pasta done not just warmed in water.I did take it home and added spices and it was great then ! For the price I don&amp;#39;t think we will be in a hurry to go back. It is a chain with very high prices,more like a fancy coffee shop.I love going to nice places and don&amp;#39;t mind the price if the food is great.This place just isn&amp;#39;t my cup of tea as they say.", "rating": 3, "date": "2/10/2014"}, {"text": "We went here while on a business trip in OKC.  We had to wait a bit for a table as it was a really busy evening.  It was definitely worth the wait.  Food was incredible, cheesecake was delicious, and our server (Nick, I think) was very friendly, knowledgable, and took good care of us.   I will definitely come here the next time I have to travel to OKC.", "rating": 5, "date": "3/23/2012"}, {"text": "Very over rated.  Sure, the menu is huge, as are the portions.  Unfortunately, none of the dishes are anything more than mediocre.", "rating": 2, "date": "4/19/2010"}, {"text": "We get take-out here all the time. The food is really good, but the take-out service is terrible. There&amp;#39;s one guy in particular who answers the phone and is often very snotty; he will actually scold you if you take longer to get there than the amount of time he tells you it will take to get your food ready! We&amp;#39;ve had to wait really long for the food to be ready once we got there, as well. The food is really good though, and besides that one guy and the occasional long wait, it&amp;#39;s worth the trouble.", "rating": 3, "date": "3/28/2011"}, {"text": "It&amp;#39;s good but pricey.. but then again, the portions are gargantuan. i&amp;#39;ll go back here for special occasions, but that&amp;#39;s about it.", "rating": 3, "date": "2/9/2011"}, {"text": "I generally enjoy a factory of cheescakes, but on this occassion I found it mind-numbingly exhaustive.  Correct me if I&amp;#39;m wrong, but the waiter is supposed to do the work, not the patron, no?  I&amp;#39;m guessing our waiter is new to Cheesecake Factory, if not to waiting tables in general, if not new to the world.   Perhaps he spent too much time under the California sun as that&amp;#39;s the only menial bit of &amp;#34;conversation&amp;#34; I was able to concentrate on before I started gauging my eyeballs in an attempt to remove them from their sockets and shove them in my ears.  How many times are you going to ask me if I wanted meatballs with my spaghetti after I repeatedly ordered alfredo and finally gave up and settled on mushroom ravioli...hold the meatballs.  And if I wanted to be corrected on my pronunciation of &amp;#34;Bruschetta&amp;#34;, which I still maintain has a soft shhh sound to it, I&amp;#39;d consult the Oxford dictionary as opposed to being auditorially accosted with the cacoughanous ear beating of the confirmation that I wanted to start with &amp;#34;Brewsketta&amp;#34;.  The food was palatable, though hardly worth the wait.  Until Mr. Sweet Valley High is more experienced or no longer employed here I doubt I&amp;#39;ll be willing to roll the dice with this place again.  All together now, when I say Mali, y&amp;#39;all say boo.", "rating": 3, "date": "3/25/2009"}]}