{"address": ["8711 E 71st St S", "Tulsa, OK 74133"], "monthly_reviews": {"2019": [[0, 2.5], [1, 3.0], [2, 2.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 3.0], [7, 3.5], [8, 4.0], [9, 3.5], [10, 3.5], [11, 3.0]], "2017": [[0, 3.5], [1, 3.0], [2, 3.0], [3, 3.0], [4, 3.0], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.5], [11, 3.0]], "2020": [[0, 3.0], [1, 2.5], [2, 2.5], [3, 2.5], [4, 2.5], [5, 2.5], [6, 3.5], [7, 4.5], [8, 4.5], [9, 4.5], [10, 4.5], [11, 4.5]], "2018": [[0, 3.0], [1, 3.0], [2, 2.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 2.5], [7, 3.0], [8, 3.0], [9, 3.0], [10, 2.5], [11, 2.0]], "2021": [[0, 4.0], [1, 4.0]]}, "reviews": [{"text": "We visited this location to celebrate my sister&amp;#39;s 30th birthday. We had a party of 8 (6 adults and 2 small children 6 and under). We got our name on the list, and my mother mistakenly said we had 6 people. The hostess said it would be 15-20 minutes. We waited for over 30 minutes, and we were never seated, so I went to check with the hostess station. They acted like they didn&amp;#39;t realize we were waiting, even though we had a buzzer and our name was on the list for 6 people. i explained we had waited well over our quoted time. It was at this time I let them know we had the 2 small children as well. She then said &amp;#34;Oh, well, that changes everything. It&amp;#39;s going to be another 20-30 minutes at least.&amp;#34; I thought this was absolutely crazy. Another hostess then chimed in that they couldn&amp;#39;t just make seats appear out of nowhere, etc...basically I was getting treated really poorly by the front desk, and this immediately upset me and put me in a bad frame of mind. I went back to tell my family what was going on, and we all decided that we would just go somewhere else (Andolini&amp;#39;s in Jenks, and we had an amazing experience and customer service there) I do not believe that there was absolutely nothing they could do to work in 2 small children with a table of 6. It was their attitude and poor customer service that really snowballed the experience and left me feeling mistreated. Long story short, the front desk was horrible. They ruined what should have been a landmark birthday celebration for my sister. Honestly, the prices charged at Cheesecake Factory, I think I expect a lot better service than a Chili&amp;#39;s. As far as I&amp;#39;m concerned, i will never come back. I doubt my family will either. They are building a BJ&amp;#39;s right next to this location, so we will gladly go there and spend what would have been a very large ticket elsewhere.", "rating": 1, "date": "10/15/2019"}, {"text": "Great food, our server Trey was awesome, very polite and always check on us. Thanks Trey.<br&gt;We had a reservation and went really well!", "rating": 5, "date": "8/14/2020"}, {"text": "Cheesecake factor thrives off of its name more than off its food in my opinion. It&amp;#39;s a place to go eat for celebrations and occasions such as prom or getting drinks after finding out you got promoted at your job. The ambience is nice &amp;amp; you feel like you&amp;#39;re in a fancier type restaurant and their price point suggests the same. <br&gt;<br&gt;The food on the other hand is average. The presentation is always adequate but the actual taste leaves room for improvement. <br&gt;I have been to Cheesecake factor on multiple occasions &amp;amp; the food has never wowed me as much as the restaurant has. In my personal experience my food has been under seasoned, bland, or just lacking. <br&gt;<br&gt;Tonight I got the Louisiana pasta. I was expecting a Cajun flavored dish with some spice that&amp;#39;d be balanced out by the breaded chicken. What I got was dry noodles with hints of what could have been delicious flavors. <br&gt;I asked if they could bring me some of the sauce to help the dish &amp;amp; the friendly waitress did. It definitely helped bring life to my pasta. But when you&amp;#39;re paying $20 for food you expect food ready to devour upon arrival.", "rating": 3, "date": "5/3/2019"}, {"text": "I had the tamale cakes for an appetizer.  They served the wrong pasta and a server walking by asked how were doing and she got us the correct pasta.  Cheesecake is always fantastic.  The food was not as flavorful as I remember but still with a visit", "rating": 4, "date": "10/6/2020"}, {"text": "We stopped here for dinner here on a Friday night around 6:30 pm. We were able to be seated immediately outside on the patio. Our server, Amber, did an amazing job, she was attentive our entire dinner without being overbearing. We ordered two rounds of cocktails with our meal and they came out delicious, possibly the best Mai Tai you can get here in OK. The food came out promptly and was hot, no complaints everything tasted great (we got the factory meatloaf and jambalaya pasta.) For dessert we ordered two different slices of cheesecake that were phenomenal. Everything about this dinner, top to bottom was excellent. From the service, drinks, food, I felt the price of our meal was justified and we will definitely be returning in the near future. Only thing I will comment on was the bread, due to how busy it was they were behind on making it so we were only able to get one basket which came out a little late. Not our server&amp;#39;s fault and she was very gracious about it.", "rating": 5, "date": "9/19/2020"}, {"text": "I just picked up a to go order of cheesecake. The cost of the slice was 8.63. Its 330pm so it&amp;#39;s not super busy. It was an easy going experience. Didn&amp;#39;t require much, but just wanted to note that it went smoothly. I usually get the dulce de leche cheesecake, and if I dine in I order the Chinese chicken salad.", "rating": 5, "date": "10/31/2019"}, {"text": "Great dinner, The Branzino with broccoli and asparagus was well prepared. Very Enjoyed it. Service was very good and the cheesecake dessert was amazing.", "rating": 5, "date": "8/15/2019"}, {"text": "This place is my favorite place I&amp;#39;ve ever been and will ever go to. I&amp;#39;m literally known for my obsession in my family. I&amp;#39;ve been dozens of times, ordering something different every single time, and it&amp;#39;s perfect EVERY SINGLE TIME. Best service, best food, best atmosphere. Hands down would go here daily if I could!!!!!", "rating": 5, "date": "4/26/2020"}, {"text": "Flys dancing on our table ... waitress took my drink away before I was done (water mind you) before we got our dessert. Miso salmon was a let down tonight and I&amp;#39;d be craving it since I first had it in Cali 2015. My rice was over cooked and the salmon had two flavors bland salmon sitting in an overpowering sauce. The fruit on the kids plates was not impressive... we get better fruit at chik fila and it&amp;#39;s fresh. <br&gt;Of course cheese cake and bread are a win but after dining at one of their California locations I expected more. We goto use the restroom and the trash is overflowing and toilet paper roll was on the floor *sign. Table wasn&amp;#39;t cleaned properly before we sat down with bits of food hanging out. Something dried and green. I don&amp;#39;t have a clue maybe apart of someone&amp;#39;s salad. Lighting isn&amp;#39;t the best either. It&amp;#39;s really dim in there. <br&gt;Overall I won&amp;#39;t stop going to TCF but I&amp;#39;ll stick to the STL and Cali locations.", "rating": 2, "date": "8/11/2018"}, {"text": "I repeat I repeat, get anything besides their fries. That was the only thing I ordered when with my party. Severe chest discomfort and indigestion, they will not digest is what I&amp;#39;m saying. I&amp;#39;m just saving you from a lot of discomfort if you&amp;#39;re reading this.", "rating": 3, "date": "8/27/2020"}, {"text": "On Tuesday, August 4th there was a sign on the door saying they they are temporarily closed.", "rating": 5, "date": "8/4/2020"}, {"text": "The service was amazing as usual. From the Tex-Mex eggrolls to the fresh brown bread and butter two their Tuscan chicken it was a magical event", "rating": 5, "date": "6/30/2020"}, {"text": "Well first off, I had placed a reservation for a party of 4 for 8 pm. I get received notification that my reservation is confirmed. We get to the host station to check in and we are given a excuse that there is no reservation, because the person at the restaurant who is responsible for on line reservations had not confirmed any on line reservations apparently for the last hour. So we waited until 8:25 pm to be seated, and the food was not even worth the wait.", "rating": 1, "date": "7/19/2020"}, {"text": "I do not recommend this place. The workers are rude and made us wait on our reservation an extra 40 minutes. Please think about going someone else before choosing this establishment.", "rating": 1, "date": "6/13/2020"}, {"text": "Horrible experience here. Terrible service. Never offered bread or dessert. The rude blonde bartender put our check down before we had even received an appetizer. One of our water glasses was used and unclean but served to us. Once we got our leftovers home we discovered a FINGERNAIL in the burger! Unbelievable and disgusting. Go somewhere cleaner and friendlier. I used to come here for special occasions but never again!", "rating": 1, "date": "10/16/2019"}, {"text": "I&amp;#39;ve frequented this location for many years (over right now), and have had great experiences. The food is fresh, made to order, the bread is amazing, and of course, the cheesecake has an extensive list, and the taste is second to none. I usually get excellent service here, but recently had a couple of less than great experiences where the waitress disappeared for periods of time longer than 20 minutes. Everything is good, but I really enjoy the chicken farfalle! Other than that, no other complaints, it&amp;#39;s always clean, the even have convenient slings for your baby&amp;#39;s car seat, and the atmosphere is great for date nights!", "rating": 4, "date": "6/20/2018"}, {"text": "I was surprised to see that there was no wait for a Friday evening. Every other Cheesecake Factory I have been to usually has at least a 45 minute wait. In Tulsa, we walked in and were sat immediately.<br&gt;<br&gt;Service was very prompt, in fact, a little too prompt at times, with our server rushing us through our meal. <br&gt;<br&gt;As an app, we ordered avocado egg rolls, my go-to for Cheesecake Factory. They were delicious, as usual. Our entrees came out before we finished our app and after 2 bites of dinner, our server rushed over with the cheesecake menu. She was friendly, however, and did offer several recommendations for Cheesecake. <br&gt;<br&gt;Overall, not a bad experience, just a little rushed. Cheesecake was on point, as usual.", "rating": 4, "date": "11/11/2017"}, {"text": "Terrible service. I ordered through doordash app and did not get alll of my meal. Spent well over 60$. The managers did not try to rectify the problem<br&gt;Just gave me wrong ohone numbers to call.  Awful customer service. They really don&amp;#39;t care if you are satisfied.", "rating": 1, "date": "3/22/2019"}, {"text": "House Cabernet Sauvignon and Cajun chicken littles with broccoli and mashed potatoes (because I&amp;#39;m so fancy )<br&gt;<br&gt;Also had the strawberry topped cheesecake..<br&gt;I&amp;#39;m ready for bed now.", "rating": 5, "date": "5/4/2018"}, {"text": "We traveled 2 hours to eat here, arrived at 3:17 was told it would be an hour to hour and a half wait. We really wanted to try this place so we waited, and waited. <br&gt;We finally asked if we were getting close and was told they had accidentally deleted us from the system.<br&gt;When we were finally seated we waited again for an hour and a half for the food to arrive. When it did our plates came out in stages with the first and last 20 minutes apart. There were 5 adults and 2 children in our group. We had to also ask for silverware 3 times before finally stopping a random waiter and asking him for some. Everyone decided to get to go boxes after a few bites, we&amp;#39;d had enough.<br&gt;The food, waiter and whole experience was not that great. They did comp us a complimentary cheesecake for each person. <br&gt;We will not be back, not even for the cheesecake.", "rating": 1, "date": "5/12/2019"}, {"text": "Cheesecake Factory used to be wonderful!! We have visited for years. However, they have paired down the ingredients to a point where the food is bland. I get the effort to keep costs down and menu prices down, but at some point you have to raise prices, you can&amp;#39;t keep re engineering the food and expect people not to realize what is going on.<br&gt;Cheesecake Factory is a shell of it&amp;#39;s old self.<br&gt;One comment on the service, the wait staff is very friendly but it seems ill trained. For example, we actually had a small issue which would have been funny if not so sad. The waitress and the kitchen staff could not figure out what a slice of raw onion was. My hamburger was so overcooked (3 people in party had hamburgers, all of which were well done and very dry) I asked for a slice of raw onion in hopes of making the burger edible. First my waitress suggested I already had onion on the burger and she looked puzzled upon my request. The waitress went back to the kitchen and brought out a slice of grilled onion that was covered in black pepper. I explained to the waitress that this was not a slice of raw onion, she seemed to have no clue what a raw onion was and went back to the kitchen. To my surprise, out came a cook or chef to apparently straighten me out.  He explained that I had a slice of onion, I showed him what was brought out and asked if the grilled onion was a slice of raw onion, he reluctantly agreed that in fact it was not a slice of onion. All I wanted was a whole slice of onion. I was given a couple of onion strings from a slice of onion. I gave up, my burger was now cold and not edible. Yikes, all I wanted was a slice of onion. Again all  the burgers were well done, dry, tasteless and missing various condiments.<br&gt;<br&gt;My guess is Cheesecake Factory&amp;#34;s run is over. Time to move on.", "rating": 1, "date": "12/24/2019"}, {"text": "Used to love this restaurant. Tonight was not a great experience. Popped in to pick up low carb cheesecake. Was not greeted. Waited 20 mins  while servers played around for 2 plain pieces of cheesecake to be put in boxes. Taste was actually pretty good for it being low carb, but there was a fruit fly right smack on top of my husbands piece.", "rating": 2, "date": "1/26/2020"}, {"text": "000 delicious. It may seem crazy but this is my go to for pasta. Louisiana chicken pasta bowtie pasta is so yummy with the right amount of spice. The full bar area very nice to have a business meeting cocktail dinner date first meeting dates the inside design is very very nice I love it. All the servers are friendly :-) nice helpful and pleasant and seem to another job. Of course do not miss the bakery out front at the entrance they have all the different cheesecakes you can buy before you leave buy the whole cake or a slice. They have steak it is a little pricey here but you pay for quality and that&amp;#39;s what you get here top of the line service white linens on the table pretty spiffy. Couple of 2- drink and appetizer dinner and dessert you&amp;#39;ll spend 100 easily, be ready <br&gt;I will definitely be back. During the lunch hours not so busy and probably seated right away never have to wait to get serviced. The flat bread pizza is pretty good, fried cauliflower taste delicious and not hummus was pretty good and the pita chips are over cooked.", "rating": 4, "date": "8/11/2019"}, {"text": "Yes, it is a chain restaurant, but I love Cheesecake Factory. I currently don&amp;#39;t live near one, so when I went to Tulsa for the day, my friend and I decided we must go!<br&gt;<br&gt;CUSTOMER SERVICE:<br&gt;The host, our waitress and the other employees we came into contact with were very friendly and helpful. Great customer service.<br&gt;<br&gt;AMBIANCE:<br&gt;All Cheesecake Factory&amp;#39;s have the same decor and ambiance. I am a fan and think it is very nicely done. <br&gt;<br&gt;FOOD:<br&gt;For having such a large menu, they do a good job at it. It seems that most of the time when places have such a large menu, it isn&amp;#39;t good. However, the majority of things I have tried here (between a lot of locations) have been good. I have a few things that I stick with because I really like them, such as the salmon salad and Baja chicken tacos. This past time I ordered the Baja chicken tacos and will admit the rice and beans were different and were not good, so that is a bummer, but it has normally been good.<br&gt;<br&gt;DESSERT:<br&gt;This has to have their own category haha. It is The Cheesecake Factory afterall! I love a lot of the cheesecakes. Most of the chocolate, peanut butter/chocolate ones are my favorite. I also love the raspberry one and the lemon one. <br&gt;<br&gt;I&amp;#39;m also a fan of their non-cheesecake desserts. I love the Linda&amp;#39;s Fudge Cake, Black-Out Cake, Lemoncello Cream Torte, and the Strawberry Shortcake. Mmmmm I want some now! Haha.", "rating": 5, "date": "3/15/2016"}, {"text": "So. Came in late night for some dessert. Spent nearly 40.00 on cheesecake to go. <br&gt;Cheesecake delicious. <br&gt;Counter help? Sorry. Rude. <br&gt;I&amp;#39;ll spend my 40.00 elsewhere. <br&gt;Customer service is everything. And his?? Well. <br&gt;Pathetic.<br&gt;No need to worry. I won&amp;#39;t be &amp;#34;putting him out&amp;#34; any more.", "rating": 1, "date": "11/29/2018"}, {"text": "I can only comment on the cheesecake here. I got a slice of their turtle cheesecake delivered last week through DoorDash. It was delicious, the cheese part had a nice texture that wasn&amp;#39;t too soft or too hard, and the bottom layer was perfect. It came with whipped cream which I&amp;#39;m not a fan of, but luckily it was to the side so I didn&amp;#39;t have to worry about it. I wanted to eat the whole slice in one sitting but it was too much and I ended up saving some for later.", "rating": 5, "date": "12/10/2018"}, {"text": "This is the first time I have ever done anything like this but last night a couple of friends came in from out of town late the only place we could find open was the Cheesecake Factory and they treated us like kings we closed the place down the food was fantastic the service was really good and nobody seemed to mind that we were there late I&amp;#39;d highly recommend just place the calamari is off the rack everything was good I can&amp;#39;t wait to go back again my friends were really impressed I just felt I should say something because they did a really good job and our waiter I can&amp;#39;t remember his name but he was a good guy and he knew everything and waited on his hand and foot even though the place was technically closed so that&amp;#39;s all I can say I just recommend you ought to give it a try it&amp;#39;s a really classy joint", "rating": 5, "date": "9/22/2019"}, {"text": "Very delicious food it is somewhat costly. prices are in the double digits but the food is very much worth it and they give you a lot. me and my husband went here for valentines day we had to wait a while to be seated and also our order taken but I&amp;#39;m just assuming it was because it was valentines day. Hoping to go back soon and try out more food.", "rating": 5, "date": "2/20/2019"}, {"text": "Pricy cheesecake. <br&gt;Love the Salads and the happy hour menu. Wish the happy hour would start a little earlier than 4pm.", "rating": 3, "date": "12/19/2018"}, {"text": "One star foR the to go services, we went there Saturday night to just get cheesecake to go it was busy didn&amp;#39;t  mind waiting in line but when we ordered no one said nothing about the wait just rude they had a good 10 people in back there running around and it took 35 min just to get 2 sliceS of  cheesecake Cashier didnt even mention a  wait she just said one sec and stand aside horrible services the  only thing that saved it was the cheesecake was good.", "rating": 1, "date": "2/10/2020"}, {"text": "So this is a chain... But.. if they messed up on the cheese cake... I would remove a star... But they don&amp;#39;t and they always have up front parking so you can call in your pre-order and they just bring it to your car... I mean how great is that!<br&gt;<br&gt;So once  you get passed the 20 page menu of food items...... ...... .... Pretty much everything here is really good.. My all time fave is the steak dianne... I think that&amp;#39;s the right spelling... Oh well it is just damn good... <br&gt;<br&gt;And the cheese cake.. My fav is the oreo.. usually get it all the time and then sit there in my sugar induced coma happy! Be ready for a wait though, everyone loves coming to this place and if you are right in the middle of eating time you could have a 20 minute wait.", "rating": 5, "date": "8/28/2017"}, {"text": "They have great food service and atmosphere, but they are rather pricey, so be forewarned on that, in case you didn&amp;#39;t know.<br&gt;We had the Shepherd&amp;#39;s Pie and split it, and it was heavenly. Try it, by all means. It is unique.", "rating": 5, "date": "10/6/2018"}, {"text": "I am so disappointed. This place has really gone downhill since they moved to the mall. Tonight, we were taken to a table that was not clean and there was smashed food on the floor. Also the silverware was not clean. Our food was mediocre. The salads were smaller than normal. We had two sides of spinach which were so salty, we could not eat them. They were kindly replaced by thawed frozen fruit. My coffee was never refilled and the service was slow and the food delivery came sporadically. <br&gt;<br&gt;I dint normally do restaurant reviews, but I was very unhappy with my experience tonight. I used to love Cheesecake Factory and was a regular customer. It will be a long before I go back again.", "rating": 1, "date": "5/21/2018"}, {"text": "A party of 6 for lunch- great choice. The menu has many many options. Our waitress was fun, knowledgeable and very efficient. We ordered 6 different entrees and our only regret is that we didn&amp;#39;t have room to finish the generous servings. The three couples split different cheesecakes and they were delicious. We love the Cheesecake Factory and the Tulsa location is no exception- it is a very clean restaurant and easy to get to right next to the mall. We always enjoy a meal there when we are in the city.", "rating": 5, "date": "8/13/2018"}, {"text": "My all time favorite restaurant in Tulsa!! Everything is amazing! From the food, staff, atmosphere, even the building is pretty! Haha Their food is the BEST!!", "rating": 5, "date": "10/27/2018"}, {"text": "My daughter picked the Cheesecake Factory as her 11th birthday dinner. They decorated my daughter&amp;#39;s cheesecake plate by writing &amp;#34;Happy Birthday&amp;#34; in chocolate syrup. She loved it. They sung to her &amp;amp; our server was very attentive. It was great, especially how busy they were on a Friday night!", "rating": 4, "date": "9/15/2018"}, {"text": "Came here almost a month ago for dinner and again a few days after for lunch. It took us awhile to get seats, but it was very busy, so it&amp;#39;s okay! It was well worth the wait! Our waitress was very nice and answered all of our questions! We ordered a pizza and burgers and were not disappointed. Both the pizza and the burgers were so delicious that we had to come back a few days later and get them again! Love The Cheesecake Factory so much and will definitely be back for more.", "rating": 5, "date": "4/8/2019"}, {"text": "We were unable to get directions to the Cheesecake Factory from the Tulsa airport on your app so we didn&amp;#39;t make it.<br&gt;It used to be easy to get maps from current location to a restaurant on the app but I guess with all the updates it&amp;#39;s not available any longer.", "rating": 1, "date": "9/23/2018"}, {"text": "Well I never thought i would see the day when i had a bad experience at The Cheesecake Factory, but low and behold.. I did... Lets begin, because it really wasn&amp;#39;t that bad, but its bad for the standard that The Cheesecake Factory holds.<br&gt;<br&gt;So I order a dish with majority pasta, and when it came out it was still gooey, and soft... like it was never cooked to begin with. Everything else was fine, besides that.. but i mean, come on now.. how do you mess up pasta of all places. I mean, my mom that doesn&amp;#39;t even cook couldn&amp;#39;t mess that up. <br&gt;<br&gt;Overall its wasn&amp;#39;t that bad, but it the took the waiter forever to come back, and check on us. By the time he got back to us everyone else&amp;#39;s food was already finished, and i was just sitting there with a bowl full of chunky pasta. Hate to say it, but i wouldn&amp;#39;t recommend going to this Cheesecake Factory.", "rating": 2, "date": "1/17/2018"}, {"text": "Super Disappointed tonight. The food was great the waitress was great. The issue was that my son who is 17 called a week ago and I was w him to make sure it was done correctly.  Made reservations w a manager for 8.  They had prom canceled because of Covid 19 so planned their own 2 months later and chose here.  The reservation was not there even though he was on the phone for 10 minutes with a manager to make the reservation. The manager in charge this night told Him they don&amp;#39;t take reservations on weekends. Then he heard another couple come up and had reservations. You should&amp;#39;ve never treated him like a child because I gave him plenty of tip money for the waitress even though you added the gratuity for a party of eight. And then he had to wait for a table for 30 minutes because u chose to forget his reservation.   I am in the restaurant business but you would think after seeing these kids being disappointed over and over for the end of the school year with COVID-19 that you would been a little bit more accommodating", "rating": 2, "date": "6/13/2020"}, {"text": "With so few vegan breakfast options in town, it was easy to give this spot 4 stars. They have quite a few vegan/veganable breakfast items here. The wife and I both enjoyed our food. The wife ordered the Impossible Burger, yes they have it now, and I ordered the veggie burger. Both were good. They also have (vegan) avocado toast, succotash (sans butter), and a surprising amount of other stuff.", "rating": 4, "date": "2/9/2019"}, {"text": "I have eaten at CF twice before and was amazed by their customer service both times. Tonight was a different story. Our waiter seemed to forget we were there, even making eye contact with us and just walking pass while we had been waiting for him to take our order for over ten minutes. He would literally disappear for long periods of time. In fact, it almost seemed as if we were a huge inconvenience to him. He never smiled, he never responded to our &amp;#34;thank you&amp;#34;, and he basically liked like he hated life. That&amp;#39;s not fun for the person dining out. <br&gt;<br&gt;The food was lovely and the people behind the cheesecake counter were excellent. The waiter almost ruined our experience. Service means a lot to me. So three stars is all I can manage.", "rating": 3, "date": "11/25/2017"}, {"text": "If you like grease spaghetti, then this is your place!  Seated promptly good service, food was meh.", "rating": 2, "date": "6/9/2018"}, {"text": "I really love the menu here. Normally everything sounds so good. Unfortunately I tried a new dish and it did not work out well. It had no flavor. The manager was kind enough to switch it out for something that did taste good. However, I must say, especially on a holiday, the service was amazing! I&amp;#39;d like to give props to our servers, Israel and Alba. Both extremely hard working, rushing around, happily helping customers. They made my meal a success! Thank you for your sacrifice and hard work on New Year&amp;#39;s Day!", "rating": 4, "date": "1/1/2019"}, {"text": "We were indecisive when trying to decide what we wanted for dinner so we decided on Cheesecake Factory due to the wide variety of the menu. We went in a little after 9 and got a booth without having to wait. Our server was Rayleen and she was great. She provided the quick and silent service that I always tried to provide when I was a server. <br&gt;<br&gt;I decided to try something new and had the Fish Tacos and my Fiance had the Chicken Bellagio. Everything we ordered was cooked fresh and it was all delicious. Even the white rice served with my entree had a surprising amount of flavor. We were ridiculously stuffed but wanted to try the Salted Carmel Cheesecake, so we split a piece (who could eat a whole one anyway?). We have tried several of the various Cheesecakes before, but I have to say that the Salted Carmel might be the best. It is super rich though. Our meal was less than $50.", "rating": 5, "date": "6/11/2016"}, {"text": "Cheesecake Factory is one of my favorite chain establishments. We don&amp;#39;t have one where we live so we had to stop in while we had the chance! <br&gt;<br&gt;I love the avocado egg rolls. Always have! They are amazing. If you love avocado, try them. They are wonderful. <br&gt;<br&gt;I got a Raspberry lemonade to drink and it was ok. I wont order it again. It was extremely sweet and not to my liking, but I&amp;#39;m sure some would love it! <br&gt;<br&gt;My husband and I got the tostada chicken salad to share and it was delicious. It was HUGE. I usually go with the bang bang chicken, but was looking for a lighter option and this certainly didn&amp;#39;t disappoint. We really liked it, but next time I would get the dressing on the side so we could save the leftovers, because there will always be leftovers. <br&gt;<br&gt;Last, the best part, the cheesecake. I am not a cheesecake fan, but the cookie dough cheesecake if one of my very favorite desserts. That&amp;#39;s why I give four stars. Because I seriously LOVE it. It may be because it&amp;#39;s basically a slice of cookie dough with bits of cheesecake, but, either way, it&amp;#39;s wonderful. I&amp;#39;ll always come back to CF, as long as they have the cookie dough cheesecake anyway.", "rating": 4, "date": "12/30/2016"}, {"text": "For breakfast, desserts, and drinks, I would give them 5 stars. There are only a few places that I like the Pina coladas and Sangria Swirl frozen drinks. Lunch and dinner is just 3 stars. At dinner time, the lighting is low and I can hardly read the menu, so don&amp;#39;t forget your reading glasses, and during the winter hours when it gets dark early, you might want to have one of those tiny LED lights in your purse.", "rating": 3, "date": "8/12/2018"}, {"text": "Called in and want to have some cheesecake to go and I was waiting on hold for more than 10 mins. And finally get the chance to speak to bakery and they hang up on me!! Called back again and put me on hold again....and I hang up and called them again. They told me the manager will pick up my call in two minutes but they hang up on me again!! Horrible experience and I would give 0 star if it&amp;#39;s an option.", "rating": 1, "date": "12/31/2018"}, {"text": "I went in for a late lunch and ordered my favorite salad. I really like the taste of the chopped salad with the sweet brown bread.My salad arrived and I asked about the bread. I was told that the restaurant does not have bread at the moment. Disappointed. About 35 minutes later as I was preparing to leave the bread arrived. I&amp;#39;ve never been to a Cheesecake Factory who runs out of bread. I question the management.", "rating": 2, "date": "2/2/2019"}, {"text": "This place has gone down hill for me. I honestly feel like the food is way over priced for the quality you get. I don&amp;#39;t mind paying upwards of $20 a plate if the food is worth it, and unfortunately here it&amp;#39;s not worth it. The salmon on my salad was over cooked and rough. And our service sucked last time! We were there for well over an hour when we were done in 15 minutes. No refills.. bread came out after 20 minutes of being there. I would rather go to Texas Road House and spend half the money for better quality food.", "rating": 3, "date": "4/10/2018"}, {"text": "Slow service. Best thing there is the cheesecake.  Ordered the Cuban sandwich with sweet potato fries  and it was good.", "rating": 3, "date": "8/26/2019"}, {"text": "I was not happy with the food this time here! They didn&amp;#39;t have what I wanted and what they did have was not good at all. It took 10 minutes to get the check. We never got any refills. It was just very disappointing!", "rating": 1, "date": "7/6/2018"}, {"text": "Great lunch today--the place was packed when we arrived at 2:00 but nonetheless the service was great.  Both the spicy chicken chipotle pasta and the Louisiana chicken pasta were great!!  We indulged with two slices of cheesecake--key lime and dulce de leche.  Both delicious!!!&amp;#39;", "rating": 4, "date": "7/20/2018"}, {"text": "My cousin Leesa and I went here today for lunch to celebrate the New Year. It was packed because of New Years Day sales.<br&gt;<br&gt;She ordered a Sauvignon Blanc and I ordered a glass of Prosecco. For our entrees, she chose the herb crusted salmon with asparagus and a fruit bowl. I chose the lunch size fish and chips. <br&gt;<br&gt;The food was delicious as always and we decided to get our cheesecakes to go. I ordered an OREO Dream Extreme, while she chose a Key Lime Pie.<br&gt;<br&gt;Our meal was delicious and we would definitely come back!", "rating": 5, "date": "1/1/2016"}, {"text": "I don&amp;#39;t get to eat here but maybe once a year.  <br&gt;<br&gt;The food was very good.  I had a BBQ bacon cheeseburger.  My wife had meatloaf.  She loved it.  The service was good, and the cheesecake is always delicious.<br&gt;<br&gt;The only downside on this visit was the amount of time we waited to get our food.  <br&gt;<br&gt;All in all this was a good visit.", "rating": 4, "date": "9/26/2017"}, {"text": "We normally come here for dinner and usually get the chicken Madeira, which is fantastic. One weekend when my relatives were in from out of town we came for a Sunday brunch. It was one of the worst meals I gave ever had. Both my wife an I got the chicken and waffles eggs Benedict. The egg was the only item on the plate motto complain about. The waffle was  bland, and only half a waffle. The chicken was cooked, fairly oily breading without much flavour. The hollandaise sauce tasted like it was out of a bag from Sysco. And the home fry potato&amp;#39;s had been deep fried till they were little more than grease soaked hollow shells! They had been cooked to oblivion and were mostly inedible. We have two small children so the idea of asking them to remake it was not an option if we wanted to get a nap for the kids.", "rating": 1, "date": "11/17/2018"}, {"text": "Desserts are outstanding, but sometimes I want other food to supplement the sweet stuff.  I just can&amp;#39;t find anything worth coming back for.  So carry out cake is what I&amp;#39;ll be doing in the future.  Doubt me? Try the brûléed French Toast ( aka French Charcoal )", "rating": 2, "date": "10/8/2018"}, {"text": "Partner and I came in just for cheesecake around 9 PM. We were seated immediately, which I&amp;#39;ve been told is unusual as it&amp;#39;s normally very busy. Our waitress seemed very displeased upon learning that we would only be having cheesecake and continued to make her displeasure obvious throughout the rest of our visit.<br&gt;<br&gt;I ordered the Caramel Pecan Turtle cheesecake and my partner ordered the Snickers cheesecake. Our cheesecake came about 10 minutes after we ordered. Both cheesecakes were warm - I didn&amp;#39;t have a basis for comparison, but my partner told me that they are usually chilled. My cheesecake looked like it had melted a bit, but the other one looked fine. Both tasted very good despite the warmth.<br&gt;<br&gt;Our waitress refilled our drinks very frequently, but barely spoke a word. About two bites into our cheesecake, she dropped off our bill and said &amp;#34;no rush&amp;#34; in a tone that sounded quite agitated. Her negative demeanour put a damper on the experience, as we felt quite rushed after that.<br&gt;<br&gt;Overall, not a great experience. My partner assures me that his previous experiences have been excellent, but I don&amp;#39;t think I&amp;#39;ll be back.", "rating": 2, "date": "7/19/2015"}, {"text": "So, why give a chain restaurant 5 stars? We had some excellent service! We wanted to so happy hour apps and that is usually at the bar,but we had a 2 year old and an infant with us. The hostess found a way to make it work. Then the two year old decided to pitch a two year old fit. A waitress stopped back, acting oblivious to the noise, and asked how old the child was. She said she has a two year old and finds a plate of chopped fruit settles her kid down and could she bring us some? She was so nonjudgemental and kind, and it worked like a charm. The Cuban rolls were great as was the pear gorgonzola flat bread. The crab balls were overdone. All the cheesecakes were great. But the kindness of the waitress (she wasn&amp;#39;t even assigned to us) was the best part.", "rating": 5, "date": "6/15/2017"}, {"text": "You can never go wrong with The Cheesecake Factory.  I was happy to see this close to my hotel and that it has late hours.  Both the food and service were great.  We dined here twice while we were in town.", "rating": 4, "date": "8/29/2015"}, {"text": "Second time at Cheesecake Factory in Tulsa.  Service was painfully slow on both visits.  Food was good however on 2nd visit my steak was not cooked long.  I could of sent it back but the waitress was so slow I was afraid I would be there forever.  She was also not very friendly, and didn&amp;#39;t offer to refill drinks.  <br&gt;Definitely not up to Cheesecake Factory standards like the one in Kansas City.", "rating": 1, "date": "11/17/2018"}, {"text": "Pros: my friend has never been here before. I explained this place as &amp;#34;they probably have over 50+ different offerings of American, Italian, and Asian food. And a bunch of different types of cheesecake.&amp;#34;<br&gt;<br&gt;Cons: took her 20 minutes to look over menu and pick something to eat. They stopped serving my go to order of shrimp BLT. Got the spicy Cajun pasta instead. It was decent. Friend got some kind of salad.  It was OK.", "rating": 3, "date": "9/8/2015"}, {"text": "I think I&amp;#39;m done with this Cheesecake Factory. Amazing cheese cake; however, every single time I go to their pick up counter the wait time is almost 20 min. Stupid for takeout while waiting in the restaurant for a product that is already made.. I don&amp;#39;t know if other Cheesecake Factories are like this one, but that&amp;#39;s just not worth it.", "rating": 2, "date": "3/18/2018"}, {"text": "The cheese cake factory of Charolette continues its decline in service and quality of food.  Our waitress didn&amp;#39;t offer refills and forgot 50% of our requests.  We were unable to order desert through our waitress.  This place is no longer worth the wait or price.  I get better service in 3rd world countries, literally. I&amp;#39;m not coming back.", "rating": 1, "date": "10/14/2018"}, {"text": "Over the years my family and I have frequented this location, and for good reason. The food is always fresh and delicious, and the service has always been lovely. I haven&amp;#39;t tried a single thing on the menu that I didn&amp;#39;t like, and I can specifically recommend the meatloaf very highly! All of their cheesecakes--as expected--are delicious, and the environment is always very pleasant. Love this place!", "rating": 5, "date": "8/6/2018"}, {"text": "This was a very pleasant meal and very delicious. I ordered a chicken biscuit which was absolutely wonderful. We had a crab and artichoke dip for a starter, also absolutely yummy!<br&gt;<br&gt; And for dessertfor dessert, we had pumpkin cheesecake, which was very very good. Our server was attentive. She suggested great food. And kept all our drinks full. <br&gt;<br&gt;I Will definitely come back.", "rating": 5, "date": "10/28/2014"}, {"text": "Very busy busy tonight around here they are running short on several items and our waitress was a bit slow at the beginning but she pulled up picked up by the bootstraps and stepped up to the plate some of these other idiots like the man bun were on around here I don&amp;#39;t care for but it&amp;#39;s still noisy like usual the food always taste good", "rating": 4, "date": "9/22/2018"}, {"text": "Very dissapointed. The grilled salmon came out raw  once , i sent it back 25 min later i asked waitress if it was done she brought a new peice out to me, guess what it was cooked heavier on outside but inside was more raw than the 1st peice !<br&gt;So i said just nevermind , the manager was bery nice 5 - stars - genuine- the waitress really dont want to work , she puts on a act that meets bare min. to serve food , but she just has this attitude like dont ask me for anything , and if you do you feel like you was the straw that broke the camels back . So the manager talked me into a steak ,<br&gt;the steak was the worst steak ive ever had . I didnt even eat all of it . Only a few bites. the aspargus was horrible . I have been to many cheescake factoru including this one and had really good experiences but the is worst one ever i dont know if i blame the cook or the fish &amp;amp; the cow. <br&gt;However I will say the vanilla bean cheesacke was 5 star awesome good , they can still do a cheescake that rocks like nobodys buiness<br&gt;Btw i hope this doesnt make me look negative Im just being honest, this is 1st 1- star review ive given I used to not say anything about bad exp. but idk i guess im pretty dissapointed i really liked this place.", "rating": 1, "date": "8/25/2018"}, {"text": "Pro AND Con: the menu is HUGE. There is so much to choose from that it can be a bit overwhelming. <br&gt;<br&gt;My cocktail was one of the prettiest drinks I&amp;#39;d ever seen decorated with a pineapple slice and a strawberry. <br&gt;We had the fried cheese as an appetizer. It came out in little squares and was adequate for two people. <br&gt;<br&gt;I ordered the &amp;#34;skinny&amp;#34; salmon and veggies which was a Great substitute to the higher calorie menu!<br&gt;<br&gt;My son ordered the buffalo chicken sandwich which was ginormous! <br&gt;<br&gt;Skipped Che cheesecake after seeing how many calories were in each slice! Some had close to 2,000 calories!!", "rating": 4, "date": "4/1/2017"}, {"text": "Yesterday had filet and it was great. Today they ran out of filet so I ordered a Factory Burger.  Order was medium rare came out med cold.... over cooked and yet cold ... with cold grilled onion mix on top. Bar tender requested manager come talk to me repeatedly but never showed up. Guess I am a snob but for mid scale restaurant today&amp;#39;s service was not good", "rating": 1, "date": "8/21/2018"}, {"text": "Wish they had more vegan and vegitarian options. Seems every entry has butter, oil, or milk. Very few choices left", "rating": 5, "date": "4/28/2019"}, {"text": "I go here quite a bit since it is by the mall and they have so many food options you will always find something to eat. I have been to Cheesecake Factories all over the country and this place is not anything special. I mean it is a chain restaurant, and even though they &amp;#34;specialize&amp;#34; in cheesecake it is still not made in house and shipped in frozen from a company for you to order. Regardless, the cheesecake is pretty good and i stop by here sometimes for just dessert. <br&gt;<br&gt;The service here is also pretty decent- I mean they are all mostly younger kids in school working here as a part time job so you really cannot expect much. If you are looking for a place to grab food  and also has a dish for everyone this is a good place. The prices are fair and the portions are huge. I personally just never leave here after eating feeling good about what i consumed. <br&gt;<br&gt;Don&amp;#39;t forget they also have national cheesecake day where you get cheesecake for half off!!!", "rating": 3, "date": "9/11/2014"}, {"text": "Just like every other Cheesecake Factory in the world. Mass produced food and impersonal service. Food is blah for the masses.", "rating": 2, "date": "7/14/2018"}, {"text": "Never have I had a server that has gotten everything right. They all seem to be in training or new. While most of the time I have no complaints on food quality/ quantity/ or presentation, the chicken Cesar salad - to go - made me sad. Literally 6 croutons and a few pieces of chicken all thrown into a box so it looked like a box of Romain from the grocery store. The presentation and quantity of - well anything but lettuce - was dismal. And when I spoke to the manager he said presentation was something they needed to work on..... really.... he said that. He the. Asked what I would do, and said thanks for your input and scurried away. <br&gt;I am sad for this. I am an overall Cheesecake Factory fan. But these folks need to step up their game.", "rating": 2, "date": "7/6/2018"}, {"text": "I don&amp;#39;t have anything in particular against The Cheesecake Factory, but I do think that it&amp;#39;s extremely overrated. This restaurant is located on the outer ring around the parking lot at Woodland Hills Mall. It&amp;#39;s typically very crowded and the seating is nothing special - quite a few tables have booth on one side and chairs on the other. We were very close to the table next to us and didn&amp;#39;t really care to hear every word of their conversation or their children screaming.<br&gt;<br&gt;That being said, the food tastes very, very good. You can order a lot of different foods because it&amp;#39;s an extensive menu and I&amp;#39;ve yet to eat something I didn&amp;#39;t like. However, most of the food is exceptionally bad for you so I feel like it&amp;#39;s cheating in a sense (give me some butter, sugar, and huge portions and I can make you something good, too). This establishment just seems bad for society.<br&gt;<br&gt;It&amp;#39;s generally overpriced and I&amp;#39;m kind of surprised people consider this to be a fancy or nice restaurant - again, it&amp;#39;s OK but you can find much better food in Tulsa for a better price.<br&gt;<br&gt;In closing, this restaurant is fine but there are many better options. The food and service are very good, but this isn&amp;#39;t a particularly special dining experience.", "rating": 3, "date": "7/24/2016"}, {"text": "I ordered from The Ceesecak Factory tonight using door dash. I was so disipointedvwith what I got all of the portions were much smaller than I would have got in the resturant. We were missing an item and one of the pieces of cheese cake was only the back half, half of it was missing. I thought that a phone  call would fix this as I have always had good service from TCF in the past. The manger was not helpful and did not show any indication of caring at all about the dissatisfied customer who just spent $149. She told me I would have to deal with Doordash.  So now I am left to wonder if the door dash driver stopped and ate half my order or the much more believable possibility that Cheesecake factory new they were not going to make anything right and just slopped my order together. Poor customer service from a restaurant is unacceptable when there or so many great choices. GOOD BY CHEESE CAKE FACTORY.", "rating": 1, "date": "3/10/2019"}, {"text": "I have eaten here 10+ times.  Always great service.  I had to ask for bread, I had to ask twice for sugar for tea.  <br&gt;I am so disgusted. We haven&amp;#39;t got our food yet and I want to leave. <br&gt;My wife that just had brain surgery two weeks ago wants Cheesecake or I would.", "rating": 1, "date": "2/1/2015"}, {"text": "It&amp;#39;s a cheesecake factory, so it has a lot of those chain restaurant qualities that can be kind of bleh. However, as far as chain sit downs go, it is definitely one of the better ones. They have just about everything on their menu and it&amp;#39;s always at least okay. The appetizers and dessert are the gold starts of this place. Entrees aren&amp;#39;t stellar. I give them credit for getting me with the wine though. I&amp;#39;m a sucker for a refill when asked and they asked, a lot. So it is really easy to wrack up an expensive bill here if you aren&amp;#39;t careful. Cheesecake is great, but it&amp;#39;s not cheap. I recommend deciding what you want to eat and going somewhere cheaper because I imagine the quality isn&amp;#39;t going to go down that much.", "rating": 4, "date": "9/22/2017"}, {"text": "Very good food in my opinion, they have an extensive list of food to order. The meatloaf is very good along with that world&amp;#39;s famous cheesecake. I highly recommend this place, the wait can be long but that just tells you how many people like the food.", "rating": 5, "date": "4/23/2018"}, {"text": "I ordered a burger medium and well I got a shoe essentially. I feel it was overpriced hype. Best thing was the cheesecake I suppose I shouldn&amp;#39;t be surprised. Decent jack and coke though I will say that.", "rating": 2, "date": "4/22/2018"}, {"text": "We were not impressed with the customer service we received last night. I was told that they were out of the crab artichoke dip after trying to order it, so then tried to order the chicken samosa but were told they are also out of that. Big disappointment. I ordered a margarita and had to wait 20 mins for it. The only time the waitress checked on us was to take our order and to bring me my check, which she tried charging me for the chicken samosas we never received because they were &amp;#34;all out.&amp;#34; We waited approximately 45 mins for the waitress to return and I told her my daughter would like to order dessert and I would like a mojito. The waitress seemed disappointed that we wanted to order more 10 mins before closing time. Slow service and mediocre food. By the way, their cheesecakes are nothing to rave over and we had to watch a drunk couple wrestle each other in their booth the entire time. I won&amp;#39;t be returning anytime soon. The level of service has really declined over the years.", "rating": 3, "date": "3/11/2019"}, {"text": "I remembered having great cheesecake at Cheesecake Factory, so I decided to go to the one next to Woodland Hills Mall. A family member and I went and picked up some pieces to go. While the service was fine and they were good after we got them home, the prices per slice gave me sticker shock. $7 for one slice of cheesecake? Really? <br&gt;<br&gt;Next time I will make my own.", "rating": 3, "date": "4/17/2017"}, {"text": "Tonight I had the worst meal ever at a Cheesecake Factory.  The best parts were its being close to the hotel and the server, David Z.  He did a good job.  The crispy Brussels sprouts were not crispy....they were sitting in grease and tasted very greasy.  The roasted beets with goat cheese was so sour with a vinegar dressing that all I could taste was vinegar.  I love beet salads, but this was drenched with way too much dressing.  The sweet tea and oat bread were good.  I ended up eating half the salad and 1/3 of the Brussels sprouts.  Will not eat here in future visits to Tulsa.", "rating": 2, "date": "12/11/2018"}, {"text": "Obviously it&amp;#39;s good. But the steak Diane is amazing.  Always cooked perfectly. Gravy is delicious! And I recommend getting a side of the corn succotash, because it goes great with the Diane and is also super yummy!", "rating": 5, "date": "9/19/2018"}, {"text": "Wow.  The WORST service. 10 minutes to get drinks, then we order, they&amp;#39;re out of one thing we ordered, that happens, but we weren&amp;#39;t told until several minutes after ordering. Then we had asked for bread twice, he never brought it, about 30 minutes passed and the tables that had just been sat got bread, one of which our waiter brought it to, while avoiding eye contact with us. I was DONE. I found another waiter and asked him to get me a manager. So he goes up to some woman who i assume is a manager, she walks around looking for someone else for literally 2 minutes straight. Finally some other woman comes up and I ask for a check and tell her everything and said I&amp;#39;ll just pay for what I got she begs me to stay and enjoy our food and she will take care of it. She brings bread, food, whatever. Then we never saw her again, the guy brings our ticket, literally nothing comped! So we paid $70 for the worst service and management EVER. So disappointing and I will never be back.", "rating": 1, "date": "2/18/2019"}, {"text": "On a recent beautiful day I decided to try out the patio at Cheesecake Factory. I had to be in that area of town and thought it was the perfect spot to sit outside and enjoy some sunshine.  I&amp;#39;ve always loved the inside of Cheesecake Factory, but if you haven&amp;#39;t tried out their patio, it&amp;#39;s worth a visit!   For years I went to CF when I was out of town as a fun special treat.  Now that we have had one in Tulsa for years I kind of forget about it unless I&amp;#39;m out dining on a special occasion.  Of course their cheesecake is amazing but my favorite dish there is a Cajun pasta with chicken and shrimp.  Just the right amount of spice!  Everything I&amp;#39;ve ever had at CF has been wonderful, but I&amp;#39;m absolutely loving their lighter menus when you don&amp;#39;t want to be too indulgent.  On my recent patio trip I got the turkey avocado sandwich that came with a lovely side salad... all for under 590 calories.  They have a huge selection of healthier options, so remember them even when you just want something on the lighter side... and a patio.  :)", "rating": 4, "date": "9/7/2017"}, {"text": "The service was absolutely horrible, my friends and I waited a hour for food and we received the food it was cold. This issue was brought to the manager and his response was rude. Will not be returning there.", "rating": 1, "date": "6/20/2018"}, {"text": "After having the same waitress several visits, and putting up with her less than friendly attitude to the adults at the table I decided to contact the manager.   This waitress always treats the children like gold, but is rude to the adults and is put out but any requests made.  One of the entrees was brought out 3/4 of the way through everyone else&amp;#39;s meal and we were still charged for it.  We asked for a to go drink and it was never brought.   I contacted the manager by phone and he offered to send me a gift certificate to compensate for the late food.  It&amp;#39;s been 11 days.  No certificate in the mail.   I think you can do better than this Cheesecake Factory", "rating": 1, "date": "12/31/2018"}, {"text": "Of course this place is legit! It is the Cheesecake Factory. The menu is like a dictionary with 1000 choices but they are all good. Portions are huge so you could share. YOU.MUST.GET.CHEESECAKE! You can&amp;#39;t live unless you get it! Great location and quite vibe. I dig it!", "rating": 2, "date": "4/18/2017"}, {"text": "First time I went I had the Crispy Chicken Costoletta (Chicken Breast Lightly Breaded and Sautéed to a Crisp Golden Brown. Served with Lemon Sauce, Mashed Potatoes and Fresh Asparagus). It was everything I hoped it would be. The lemon sauce was to die for. My boyfriend got a burger &amp;amp; fries, the fries are really good and for all you ranch connoisseurs, this is the GOOD ranch!<br&gt;The menu is a novel, I suggested checking out the online menu first so you have an idea of what they have if it&amp;#39;s your first time going.<br&gt;Second &amp;amp; third time I went I had the Chicken and Biscuits (Sauteed Chicken Breasts Covered with a Rich Pan Gravy, Served with Our Mashed Potatoes, Vegetables and the &amp;#34;Best&amp;#34; Buttermilk Biscuit). It definitely is a &amp;#34;Comfort Classic&amp;#34;. Portion size is huge, so you might wanna share. <br&gt;Oh yeah... the cheesecake is awesome too.", "rating": 4, "date": "1/11/2014"}, {"text": "Had a wonderful experience, server was friendly and very helpful, food arrived in a reasonable time frame, our drinks were replaced quickly, and the bread was nice and hot. Cheesecake was de~lish, more choices than you can imagine. Family friendly, with clean restrooms!", "rating": 4, "date": "12/6/2017"}, {"text": "Great atmosphere, a bit dark but my eyes are sensitive to bright light so that was a plus. The service was excellent. The food ordered was a giant portion and I took half home as well as my party.", "rating": 5, "date": "11/15/2015"}, {"text": "You would think that after spending $30 on 3 slices of cheesecake the lady at the counter would be a little more polite. She was really rude. That is why I give this place 3 stars. Plus we just came in for cheesecake and it&amp;#39;s taking FOREVER for them to get get it ready. I wouldn&amp;#39;t come back to this place.", "rating": 3, "date": "3/29/2017"}, {"text": "As always this place was crazy busy. We only stopped in to get cheesecake to take back to the hotel. Cheesecake Factory, you never disappoint! It&amp;#39;s way pricier than any food I&amp;#39;d normally eat, but come on, I don&amp;#39;t eat cheesecake at 8PM every night.  Great food, good service and cool atmosphere for a date night.", "rating": 4, "date": "3/17/2017"}, {"text": "This is our first time. Perfection.. We had the cheese pizza, Chicken and biscuits,  and I had the Chicken Farfalle. . The blueberry mojito was awesome!", "rating": 5, "date": "4/4/2016"}, {"text": "I love Cheesecake Factory for their Sweet Corncake Tamales and Avocado Egg rolls (especially the sauce it comes with). It&amp;#39;s one of those restaurants I turn to when I can&amp;#39;t really decide where to go since they have a variety of dishes to choose from, but I always gravitate towards the Fettucini Alfredo, Steak Diane, or the Avocado Egg rolls. The flavor is always consistent and the service is always so quick and accurate. I also order their strawberry lemonade, it&amp;#39;s so refreshing but it can be a bit too sweet, so I just add a little more water. I highly recommend their chocolate mousse cheesecake or the keylime one!", "rating": 4, "date": "3/26/2017"}, {"text": "The best food hands down! The appetizer firecracker salmon is amazing! The portions are huge when I was expecting maybe 2-3 fish tacos but it came with 4 big ones! There was a mix up with our meal and the manager came out got on our level and apologized. He threw in a free slice of cheesecake that topped the night off! I also highly suggest getting the blueberry mojito!<br&gt;We will be returning for our next date night!", "rating": 5, "date": "8/12/2015"}, {"text": "The pros: My salmon was good, a tiny bit dry, served with tartar sauce which is unusual with salmon but turned out to be pretty good. Good mashed potatoes, broccoli was steamed just right. I really like the bread. Big portions mean at least one meal of leftovers at home. <br&gt;<br&gt;The cons: Far too many items on the menu. Seriously, less than a quarter of that would be preferable, I think the quality would be higher. <br&gt;<br&gt;There is an &amp;#34;original&amp;#34; (plain) cheesecake, and there is a &amp;#34;fresh strawberry&amp;#34; cheesecake. The strawberries are glazed on that one (ew). They wanted to charge me more than a couple dollars to sub fresh (non-glazed) berries for the glazed ones. Nope. That&amp;#39;s dumb. Kinda soured the experience for me. We spent $67 (before tip) on dinner for two people, and they couldn&amp;#39;t put un-glazed berries on dessert?<br&gt;<br&gt;Service was about a 7/10. <br&gt;<br&gt;Still pretty good dinner, but there are other places in Tulsa I&amp;#39;d rather spend that much money on.", "rating": 3, "date": "10/23/2015"}, {"text": "You know what you&amp;#39;re going to get when you come to a Cheesecake Factory. The menu is vast and the quality is level across the board.<br&gt;<br&gt;I can&amp;#39;t remember ever ordering a meal here that I didn&amp;#39;t enjoy. I&amp;#39;m recently in a depression since they removed the Ahi Tuna Roll from the menu. I had a soul connection with that appetizer..<br&gt;<br&gt;The wait staff here are always on their A game. Enjoyed myself immensely and I&amp;#39;m coming back whether they like it or not.", "rating": 4, "date": "12/31/2014"}, {"text": "The worst experience. I&amp;#39;ve come for a carry out and placed an order for just ONE cheesecake. I do understand that it was a busy Saturday evening but having too many helpers couldn&amp;#39;t help managing the time. Very poor resource and time management. They made me wait for 20 minutes for just one cheesecake which has already been made and kept. All that they had to do is remove and pack. Very poor resource management.", "rating": 1, "date": "10/14/2017"}, {"text": "Still of the most consistently delicious, fresh chopped salads.. service is always great.", "rating": 5, "date": "10/9/2017"}, {"text": "This fancy restaurant deserves a these good reviews because one the atmosphere the food is excellent soup was not as expected but still a great soup one of the best I&amp;#39;ve had in a while the chicken is has a soft delicious batter the seats are comfy looks like a kind of a Egyptian look a nice sealing and flooring tile fast service", "rating": 4, "date": "10/8/2017"}, {"text": "We travel from Northwest Arkansas (and anytime we are returning from Texas) to eat here at least twice a year. Love the food, enjoy the service (usually)... until today when we arrive and are told we can&amp;#39;t have our dog sit with us on the patio. Excuse me but I just drove very far to get here, have a party of 5, but your restaurant has a policy to refuse dogs ON THE PATIO??!!! Guess this will be the last time we come.", "rating": 2, "date": "7/24/2017"}, {"text": "I had pretty low expectations for this place, but it was actually pretty good. I&amp;#39;ve had bad experiences at so many non fast food restaurant chains so I try to keep my expectations in check. The wait time was insane, definitely make a reservation. Avoid the weekend if you can. <br&gt;<br&gt;The service was good, our waiter was attentive and helpful despite how packed the place was. The chicken parmesan was delicious and the portions were generous. <br&gt;<br&gt;The main meal was good, but the cheesecake was the best part. So good! I recommend the s&amp;#39;mores cheesecake. <br&gt;<br&gt;All in all, don&amp;#39;t expect a fancy gourmet meal at the Cheesecake Factory and you will enjoy it. It&amp;#39;s a bit expensive but the food is much better than what you get at Applebee&amp;#39;s, Olive Garden, Chili&amp;#39;s, Abuelo&amp;#39;s, etc.", "rating": 4, "date": "4/16/2015"}, {"text": "We have been to this CCF with family 4-5 times over the past two years. Every time we are satisfied with their ambiance, service, selection and quality of food. This makes us wonder why we don&amp;#39;t go there more often! Must be because they are so busy all the time and we don&amp;#39;t want to wait. This time they surprised us when we were able to make a reservation!  Hope that this was not a fluke.", "rating": 5, "date": "11/2/2014"}, {"text": "Big location with good customer service and very friendly staff. I wasnt sure what to get and our waitress  was knowledgeable  and recommended a few different things. I ordered the stuffed tortilla and it was amazing. My son ordered the mac and cheese  burger and he loved it. Of course no meal can be complete at the cheesecake  factory  without dessert. We opted to share the white chocolate  macadamia cheesecake  and it was amazeballs!", "rating": 5, "date": "7/3/2015"}, {"text": "Horrible horrible. Saw them on the news this morning regarding tips. That should of been my sign, but baby girl wanted to eat there.<br&gt;We were seated and got drinks and bread. When we went window shopping at the dessert counter,  our table got cleared. All the food came except the chips and cheese. That should have been the easiest to make. Everyone else finished eating before my friend received her chips and cheese. The manager brought them out and they were burnt. Where is the pride in the establishment you run? The third order came out burnt too. I give up. We ordered cheesecake.", "rating": 1, "date": "8/14/2017"}, {"text": "Stick to what the name says, Cheesecake. <br&gt;That was the only food that was prepared how it should be. The key lime cheesecake and red velvet cheesecake are to die for. But as for the man course dinner, I was disappointed to say the least. I got the shrimp and chicken gumbo with white rice, the flavor was good if you could get past the huge chunks of fake tasting rehydrated peppers. My wife ordered the fish tacos with black and cilantro rice. The black beans tasted as if they were straight from a can and were also quite cold, and the rice was clumped together like it had been sitting all day, also cold. And the &amp;#34;crispy&amp;#34; fish was soggy from all the grease. Horrible food experience, service was desent, but will only be back for cheesecake.", "rating": 3, "date": "8/30/2015"}, {"text": "Have been here a few times and have enjoyed it tremendously. Haven&amp;#39;t had any complains on their food, It&amp;#39;s always fresh and well cooked. I find myself wanting to try something different on their menu but I keep going back to the same thing! Their sirloin is very juicy and tender..Their loaded mashed potatoes is delicious, and you get two types of breads upon your entire visit, one is sourdough and the other is wheat bread.<br&gt;<br&gt;If you haven&amp;#39;t tried their fried macaroni balls then you should definitely ask for them. They are quite large and you get 4 on a plate with an excellent type of marinara sauce.<br&gt;<br&gt;It&amp;#39;s not a cheap restaurant at all. My fiance &amp;amp; I both get the same thing (sirloin steak, mashed potatoes, and the macaroni appetizer and our bill is usually $60 (without tip) and if we both get 1 slice of cheesecake each then it runs around $70-$80<br&gt;<br&gt;Reason i&amp;#39;m rating this a 4 star is because i am a fan of this restaurant, their food is amazing and the staff is always nice and the overall appearance of the place is nice and clean. The 5th star it&amp;#39;s lacking is the price, there&amp;#39;s not a lot of decent places that have great food and service quite like the cheesecake factory, but it&amp;#39;s hard to go when your on a tight budget.<br&gt;<br&gt;They do have outdoor seating that usually isn&amp;#39;t packed like it is inside. If it&amp;#39;s going to be a bit chilly out then it&amp;#39;s ok because they have tall heaters that keep you nice and toasty.", "rating": 4, "date": "5/6/2014"}, {"text": "Once again my fellow yelpers have let me down. Every time I have been to a cheesecake factory the food is bland and lacking in taste.  On top of that the server is extremely slow when I am looking across at many empty tables.  I am done with this restaurant. How anyone can give 5 stars shows me they must eat TV dinners alot.  I have been to this chain and gotten the same results!", "rating": 1, "date": "3/6/2017"}, {"text": "The food was great. But I have to say the hostess was so nice and welcoming she made me feel right at home her name was Alex .", "rating": 5, "date": "7/11/2018"}, {"text": "The hostesses were inefficient and the restaurant as a whole didn&amp;#39;t seem able to keep up with the volume of customers.", "rating": 2, "date": "3/12/2017"}, {"text": "The server at the bakery counter was extremely rude. She couldn&amp;#39;t find my order and then acted irritated with me after showing her my receipt. I had already paid for the cheesecake. Finally she rechecked the to go orders and found mine. She blamed it on the worker before her and never apologized for the wait or anything. Her irritation with me was unwarranted. Poor service but still great cheesecake", "rating": 2, "date": "4/15/2018"}, {"text": "My wife and I had dinner and dessert on Sunday night. The hostess seated us immediately and the wait staff was very quick and very responsive. We&amp;#39;ve been several times before and the hardest part is deciding what to get on their very broad menu.<br&gt;<br&gt;Because we knew we wanted dessert we passed on the appetizer and settled for the Cuban and Italian Sandwiches. Both were awesome.  We ordered the sweet potatoe fries and they came out hot and delicious.<br&gt;<br&gt;We splurged and each had a slice of cheescake. My wife ordered the chocolate variety (can&amp;#39;t remember exactly which one) and it was so rich! I wanted the Key Lime but the waiter returned and said it was frozen and not available. Sad. I settled on the Mango-Key Lime and it was pretty good.....but I really wanted the Key Lime.<br&gt;<br&gt;We left very full and pleased with the evening.", "rating": 4, "date": "9/8/2014"}, {"text": "I love this place for date night or girls&amp;#39; lunch out.  I always get the Thai chicken lettuce wraps and I save room for dessert.  I love the service and the ambiance. For lunch, arriving right at 11 gets immediate seating.", "rating": 5, "date": "8/20/2014"}, {"text": "If I could give 0 stars I would. I use to go here very often and I have spent tons of money here, but not anymore. What restaurant runs out of chicken at 8 pm on a wednesday night? I have never encountered this before amd I am very displeased and disappointed. And the staff is generally very unpleasant and not very helpful. I love the food, but time after time I go there I am always disappointed in some way. Will not be back if I can help it. Not worth my money or time.", "rating": 1, "date": "6/14/2017"}, {"text": "best filet thick steak mignon,  unexpected !  Sides of mash pot, green beans tasty as ever.", "rating": 5, "date": "6/13/2018"}, {"text": "Cheesecake Factory is a great place is you&amp;#39;re looking for variety. Their menu is absolutely massive. As a vegetarian, I have multiple options. I really love their veggie pasta. I think it&amp;#39;s called Evelyn&amp;#39;s Favorite Pasta. Their cheesecakes are, of course, delicious. However, the price point is nearly highway robbery. $8 for a slice of cheesecake is just ridiculous if I&amp;#39;m being honest. I can see $5-6 as fair. It&amp;#39;s good for a special occasion, but I can&amp;#39;t see eating here regularly because of the pricing.", "rating": 4, "date": "12/5/2016"}, {"text": "Five stars without question. Stopped in for lunch today and had the steak diane which was very tender medallions of certified angus beef steak covered with black peppercorns and a rich mushroom wine sauce, served with mash and grilled onions. By far the best chain steak I&amp;#39;ve had in a long time, and coming from the Cheesecake Factory who would have thunk. The staple strawberry cheesecake was bursting with flavor as would be expected. There are some menu items you probably would not order at this type of restaurant, but there&amp;#39;s enough of a variety that your bound to find something very good off of the menu. Nice clean restaurant with great service and atmosphere.", "rating": 5, "date": "2/10/2016"}, {"text": "The food was good. Then this happened. We sat for 20 minutes without a greeting. When the waitress did greet us, she didn&amp;#39;t even look at us. She said &amp;#34;be back in a minute&amp;#34; as she walked by. The restaurant was not that busy as it was 9:30 pm. They don&amp;#39;t close until 11:00 pm. 15 minutes later she came back and took our drink orders. I ordered a water with lemon and my husband ordered a beer. She brought them back quickly, but said they were out of lemons. No big deal right? Then when my dinner came out with lemon slices as garnishes. Whatever. She never came back to refill drinks. My husband only got the one beer the whole night. She was really good at taking the plates away though. We had a calamari appetizer that we moved to the middle of the table when our food came. It was a fairly large table and my husband and I were talking and using our phones. I know, shame on us, but when I looked up she had taken our bread and our half plate of calimari. Again, we didn&amp;#39;t see her for awhile so we just ate our meals. By the time she came back we were full and didn&amp;#39;t want another full appetizer so we just let it go.  My husband ordered a 3 cheese pasta that came with chicken and asked if he could change it to beef. She said no problem. She said nothing about an up charge. I would not have had an issue with a few dollars, but I would have liked to have been informed. Our bill came and they charged $8 for the substitution! That was more than half the original price of the meal!!! At the end of the meal, she took the bill and tossed it on the table without saying a word to us. My husband was furious at this point. He put his card in the bill and stood it up. What felt like a long while later, she picked up the folder (without a word) and disappeared again. She finally brought our card back, and again just threw it on the table and said thank you. What should have been a nice meal and a relaxing night was ruined.", "rating": 2, "date": "3/30/2018"}, {"text": "It&amp;#39;s hard to find fault with a place that has a novel for a menu - unless it&amp;#39;s one of those places that has 1,000 menu items and does all of them poorly. The Cheesecake Factory does a nice job of having a variety of menu items and does them well - even the pasta is cooked acceptably.  <br&gt;<br&gt;As far as the Cheesecake...I am not sure I&amp;#39;ve ever had it. Famous for their crazily caloric portions, I&amp;#39;m not sure how one leaves room for desert at this establishment. They all look good and there is an amazing variety.  Maybe everyone orders off the &amp;#34;skinny&amp;#34; menu and saves room that way? I give props to them for creating a menu of lighter, healthier options, but honestly I didn&amp;#39;t look at that menu. I don&amp;#39;t go to an establishment like this to eat baked chicken or steamed fish.<br&gt;<br&gt;Did I mention the portions are enormous? The crab wontons are delicious and easily enough for a table of four.  The Louisiana Chicken Pasta is quite yummy - parmesan breaded chicken, spicy creamy sauce, and bow tie pasta with peppers, what&amp;#39;s not to like? Get ready for a to go box and lunch the next day!<br&gt;<br&gt;Items like the chicken tacos are also yummy...honestly, there are so many items on this menu you&amp;#39;d have to be a hardcore regular to try them all.  One of these days, I&amp;#39;m going to get a cheesecake to go, just so I can feel like I had the whole experience!", "rating": 4, "date": "3/15/2014"}, {"text": "Avocado egg rolls were good but i ordered a Chinese chicken salad to go and i get home and realize that they didn&amp;#39;t give me any dressing to go as well. Yes awesome cool expensive lettuce but im not about to eat it with no dressing and now they are closed and im mad that i have no food to eat for my midnight snack so YEA im leaving Oklahoma tomorow and will never get my stupid dressing.", "rating": 1, "date": "2/12/2017"}, {"text": "The service was slow! When we arrived it was before the dinner rush so we expected more attention but this was not the case. The manager had to help the waitress and we had to ask several times for desert. We really had hoped for better service.", "rating": 4, "date": "11/22/2016"}, {"text": "Service was ok, but the food we ordered was simply not good at all, I ordered a burger which was served in a baguette bread, seriously who serves a burger in such dry bread, it only had cheddar cheese and tomato plus it was cold, my husband ordered the shrimp Alfredo it did not have enough Parmesan cheese the only reason I&amp;#39;m giving it 2 stars it&amp;#39;s because the cheesecakes are always scrumptious, I would suggest sticking to making cheesecakes, I&amp;#39;ll be back for the cheesecake but not for the the dishes they serve, totally overpriced.", "rating": 2, "date": "4/15/2018"}, {"text": "I&amp;#39;m sure all the Cheesecake Factories are incredible. At this one I ordered the quesadillas, which were, naturally, fantastic. Then I had the banana cream cheesecake (I&amp;#39;m having a hard time ordering anything else because it&amp;#39;s just too amazing)... and it was.... can you guess? Amazing! hahaha! Yep, this place is great. I&amp;#39;ll be back", "rating": 4, "date": "12/2/2011"}, {"text": "Went there on a weekend night with my s/o we werent given an option between a booth or table. Our server checked in on us once after taking our order. Meanwhile many servers kept rush from the kitchen and the floor near us making us more and more anxious to leave. Pasta was amazing but the service was terrible so I won&amp;#39;t be returning.", "rating": 1, "date": "11/16/2016"}, {"text": "This is the second time I&amp;#39;ve been here and this is the second time I have not been impressed. The wait wasn&amp;#39;t too long, but the hostess and front staff did not look organized and sat our party at a table meant for a different party. <br&gt;<br&gt;Then, it took forever to order and even longer to get the food. The food has large portions, but the food was decent.", "rating": 2, "date": "3/28/2014"}, {"text": "Banana cream cheesecake topped off our Asian chicken lettuce wraps and chicken quesadillas. The sauces with the wraps were a peanut ginger and very good, along with the sweet chili. The quesadillas had a generous portion of guacamole, picante and sour cream. Very good. Cheesecake Factory rarely gets it wrong!", "rating": 5, "date": "2/19/2014"}, {"text": "Awesome Food &amp;amp; Cheesecake!!! Ceaser Salad Is Awesome &amp;amp; The Chocolate Mousse CheeseCake Is Awesome! Close By The Mabee Center Where I Had To Go!", "rating": 5, "date": "7/22/2016"}, {"text": "Place looks nice but what a joke. I had a hamburger which I tasted ok until I bit into the gristle. Burger came with no condiments 5 minutes wait. The ketchup came in a 1/2 dollar size dish 3/8 inch deep. Just enough for the hamburger. So 5 more minutes for more ketchup for fries this time even smaller 8 fries later 5 more minutes for more ketchup. Ask to look at cheesecake and they gave us a menu to share. Wife went to get another 20 minutes later taking cheesecake to go sick if this place.", "rating": 1, "date": "12/10/2016"}, {"text": "As always the food is good, just watch out for the snarky young blond that seats you.  <br&gt;<br&gt;She was terribly rude to my party, leaving me to wonder why she allowed to have a customer service job.", "rating": 3, "date": "3/7/2017"}, {"text": "This place is delicious. Their bread is probably my favorite complimentary bread I get anywhere, and the pumpernickel is SO good. The avocado eggrolls are to die for, although the sweet sauce took a little bit for me to get used to. This place has a MASSIVE menu with a lot of options, however, while this is awesome, it can also be a little overwhelming. <br&gt;Their cheesecakes are a must, although by the time you finish your food, you may not have room for dessert. Just take it to go, it&amp;#39;ll be just as good the next day.", "rating": 4, "date": "3/17/2015"}, {"text": "Great lunch. Christina V was an excellent server. Made the experience much better than just good food", "rating": 4, "date": "2/21/2018"}, {"text": "It has been 3 years since Ive eaten here because of the food and dirty silverware I experienced so long ago. Im glad I had taken the risk on trying it again because it was really delicious! Our server was amazing, fast, and helpful. Only 4 stars because a mojito cost $11.50. Kinda ridiculous but it was the most flavorful mojito I have ever had!!", "rating": 4, "date": "4/8/2018"}, {"text": "As always, great food and lots of it. We had the chicken bellagio, chicken marsala, salmon and a burger. Plus Cheeaecake!!!  It was all fantastic!<br&gt;<br&gt;At Cheesecake Factory, consistency is key. Each restaurant has the same great food.", "rating": 5, "date": "2/13/2017"}, {"text": "We are pretty frequent guests here - it&amp;#39;s close to the mall and so it&amp;#39;s convenient to relax here with a glass of wine after long day of shopping :)) the menu is sooo big - you can try something new every time. But our favorite here is margarita pizza with a thin crust and amazing flavor, melts in your mouth!!! It&amp;#39;s a perfect appetizer for 2-3 people or a lunch as a whole. Also Ahi Carpaccio is delicious. They are pretty busy usually, but thankfully we never had to wait for a table - they have plenty of seating. And service is pretty fast too.", "rating": 5, "date": "6/7/2014"}, {"text": "Haters be hatin&amp;#39;! <br&gt;Best chain food in Tulsa, it is all delicious.  Love the small plates and unique appetizers. Great drinks too. Beautiful atmosphere.", "rating": 5, "date": "11/30/2013"}, {"text": "I&amp;#39;ve never had a bad experiences at the cheesecake factory. Great food, great waitors. Only thing is they told me they were out of Turkey cause of avian flu. Which must&amp;#39;ve been an inside joke because the next day I went to Arby&amp;#39;s and had a Turkey sandwhich. It sounds as through they ran out and Ned to anticipate better on stocking turkey meat.", "rating": 5, "date": "10/23/2015"}, {"text": "We stopped in for an early lunch on the way to our sales conference.  This location is right next to the mall and we picked up a few things while waiting for the restaurant to open at 11 am.<br&gt;<br&gt;We were one of the first groups to come into the restaurant for the day.  If you have never been to The Cheesecake Factory, be prepared--the menu is HUGE.  I don&amp;#39;t know how they fit everything on there.  In my opinion, they should make the menu smaller and eliminate some of the items that are not as popular.  We took advantage of the lunch menu.  The size of the meal is smaller and so is the price.<br&gt;<br&gt;Our plan was to have a small lunch and finish with some cheesecake.  The lunch sized items were still large enough to fill us up and we were unable to eat another bite.  No cheesecake for us, unfortunately!  We would have taken some to go, but did not know if we would be able to check into our hotel to use the refrigerator in our room.  Split a meal with someone and then get the cheesecake.  That&amp;#39;s what we will do next time!", "rating": 4, "date": "8/12/2013"}, {"text": "It&amp;#39;s alright <br&gt;The food is average <br&gt;The service is average <br&gt;The cheese cake is average for $8<br&gt;$40 before tip for 2 people and well I know of better place to go eat for less", "rating": 2, "date": "11/10/2014"}, {"text": "I love their appetizer bread soooooo much, haha! Surely, the cheese cake is the most popular in their menu! I always get a velvet cake when I come every time!", "rating": 4, "date": "3/7/2016"}, {"text": "Service was trash. Also Was calling in a to-go order and was hung up on thankfully because the girl didn&amp;#39;t seem to know what she was saying or doing anyways lol", "rating": 1, "date": "12/2/2017"}, {"text": "Finally a Cheesecake Factory in Tulsa.  I finally made the visit to Tulsa&amp;#39;s Cheesecake Factory.  I had it in other parts of the country and always knew one would go over well here.  Cheesecake Factory has a colorful menu and I always have such a hard time deciding what to eat here.  I get something different every time and still get confused on what I want.  <br&gt;<br&gt;In the past I have got the lemonades they make here and they kick ass.  The meatloaf is fantastic.  The Chicken and Biscuits are good.  The pastas all rock and the Asian salad is great as well.  This time I ordered the Cuban Sandwich, my sister got some chopped salad, and my girlfriend ordered the Pasta Carbonara.  And of course I had to get some cheesecake.  I split a slice of Snickers Chunks and Cheese Cake.<br&gt;<br&gt;Cuban Sandwich-  This was all around pretty terrific other than the bottom of the sandwich being a bit soggy.  I have had better cuban sandwiches but this one hit the spot.  The fries here are out of this world.<br&gt;<br&gt;Pasta Carbonara-  This got better the deeper into the dish you got.  I think more of the flavors came out after the top was gone.  Very good though.<br&gt;<br&gt;Snickers Chunks and Cheesecake-  One thing you need to know about Cheesecake Factory is, they do cheesecake right!  And when you see the extensive list of cheesecakes to choose from your head might just explode.  The Snickers and cheesecake combo was sinful and made me cry.  DAMN GOOD!", "rating": 4, "date": "1/8/2009"}, {"text": "Super good for the husband and I. Even took my dad for his birthday. The staff is charming, hardworking, and funny. The food was wonderful and service great. Only holding back on that last star due to a little  lack in up keep with drinks and the mishap of dirty silverware. <br&gt;Great place. Great food. Great service.", "rating": 4, "date": "4/12/2013"}, {"text": "We had never been to The Cheesecake Factory before, and we probably won&amp;#39;t go again. <br&gt;We went in at 3:30 on a Saturday, and it took almost an hour to get out our meals. No water refills, no beer refills, our waiter was in and out too quickly for us to even ask for another. When our food finally arrived, the waiter accidentally turned too quickly and half my meal went all over the floor. I understand this is a complete accident, and he said he would take my meal off our ticket. We asked for To Go boxes which he took back and packaged for us. Then the waiter came up and said &amp;#34;I&amp;#39;m sorry I couldn&amp;#39;t get that meal taken off your ticket, I couldn&amp;#39;t find the manager. So here&amp;#39;s the bill.&amp;#34; And sat there and waited for us to pay. Uh, what? I worked in the service industry for 7 years...when you need the manager...you can find the manager. <br&gt;I was annoyed so we just paid and left. I went to open the To Go box with 1/2 my meal and it looked like it had been thrown in there, then someone threw up in it. There was no way it could be eaten...unless I used a spoon. <br&gt;It was disgusting. <br&gt;So, we ended up paying $60 and I didn&amp;#39;t even get to eat my meal after being there for an hour and a half.<br&gt;I will end on a good note and say that the Cheesecake was delicious!", "rating": 1, "date": "10/13/2017"}, {"text": "Surprisingly all around excellent. Excellent staff, excellent waiter, and excellent food. I had the loaded potato soup. I cannot imagine it being more excellent. Everyone was pleased and the place was packed on a Saturday. After eating at The Rusty Crane, I have to say this place kicks that place squarely in the nuts, and it&amp;#39;s a chain. Oh, not a fair comparison? You&amp;#39;re right because TRC is just that inferior. Sorry...", "rating": 5, "date": "5/30/2015"}, {"text": "Ate at Tulsa location yesterday for my friend&amp;#39;s birthday celebration.  What a perfect experience.  Great service.  Excellent food. Decadent cheesecake.  Thanks!!!! I can&amp;#39;t wait to return. She had caramel chicken which I sampled. Yum.  I had factory combination of Steak Diane and Shrimp Scampi with healthy substitution of broccoli for mashed potatoes. Delish!!! Great pomegranate margaritas. And the cheesecakes are the bomb!!! She had Adam&amp;#39;s Peanut Butter Cup Fudge Ripple Cheesecake and it was very rich and had peanut butter in it. I had the Kahlua® Cocoa Coffee Cheesecake<br&gt;and it was perfection. I&amp;#39;m getting hungry just thinking about it.", "rating": 5, "date": "8/15/2011"}, {"text": "Bread is brought to the table at the start, one white choice and one brown choice.  I have no idea what kind they are, but the brown bread was some of the most delicious bread I&amp;#39;ve ever had.  It was sweet and soft, but not in a weird way. The white bread was extraordinarily average.  I enjoyed the Carbonara with chicken, but the order came out wrong (I specified no peas.)  Also, our appetizer, nachos with spicy chicken, came out after our pasta, so the manager offered us a free piece of cheesecake. We ended up getting the Hershey&amp;#39;s chocolate, and it was delicious. Overall, the food was really good, and our waitress seemed very nice.  There seemed to be miscommunication among other servers and runners, and that&amp;#39;s what caused our lapse in service.", "rating": 4, "date": "10/3/2015"}, {"text": "Been here few times. One of our favorite restaurant.The foods is extremely good. Love the bread that they been served before your order. And the cakes are best cakes ever. Waiters had a good jobs.Expensive restaurant but it worth it.", "rating": 4, "date": "7/20/2014"}, {"text": "Enjoyed the great service!Thai lettuce wraps are my favorite.Need to make sure your getting the wraps and not the Thai tacos.I didn&amp;#39;t understand and got the taco&amp;#39;s.Both are delicious the taco&amp;#39;s are all assembled and you don&amp;#39;t build your own and less messy.", "rating": 5, "date": "6/24/2016"}, {"text": "Excellent food and good service. My husband and I are here on a Friday night so there was a long wait time, about an hour and a half, and I feel like the restaurant was way over capacity with all the people waiting. But I was expecting a long wait on a Friday at 7pm. I ordered the parmesan herb crusted chicken with green beans and mashed potatoes, my husband got a bacon cheese burger and fries. The food was all amazing, I couldn&amp;#39;t finish my meal and brought half of it home. We ordered our cheesecakes to go but had to try them in store. I got the red velvet cake cheesecake and hubby got the Oreo dream cheesecake. Both were phenomenal, huge pieces, and the taste was to die for. It was my first time eating there and I was not disappointed! Will be back many more times!!", "rating": 5, "date": "3/7/2016"}, {"text": "One word---cheesecake. I think even if they had terrible food I would come here just to eat cheesecake. It just so happens, the food is not terrible, it&amp;#39;s pretty darn good. I usually steer clear of chain restaurants and I know this is one that gets a lot of criticism from foodies, but I just love it. It&amp;#39;s always super busy, they have a novel for a menu and the servers dress in all white and wear ties. It&amp;#39;s easy to criticize what looks like an overrated restaurant. First of all, there is always a wait. I went on a Saturday at 5pm and still had to wait, but it was only for 10 minutes. The wait is worth it though. The huge menu can be overwhelming for some. If I came here more often I would venture out and try new things, but I usually stick to my favorites-pasta or chicken. The crispy chicken costeletta is one of my faves! Crispy chicken with a lemon butter sauce served with mashed potatoes and asparagus. It&amp;#39;s a huge portion too. You can definitely take home half of it for another meal. My favorite appetizer is the chicken samosas. They have a large variety of small plates and appetizers. I plan on trying a few next time instead of one entree. <br&gt;<br&gt;Now for the cheesecake. The pumpkin cheesecake is back for the season. It is amazing! It&amp;#39;s creamy and spicy and the whipped cream on top is the perfect finish. I have to say I&amp;#39;ve never had a bad piece of cheesecake there. The white chocolate raspberry is delicious and fruity, but the Hershey&amp;#39;s Chocolate Bar is one of the best. I can&amp;#39;t eat a whole slice by myself because it is so rich, but it&amp;#39;s nice to share with someone. My husband and I usually get a slice each and share. Now I&amp;#39;m craving cheesecake for lunch. Too bad it&amp;#39;s so far away from me.", "rating": 5, "date": "11/11/2014"}, {"text": "I&amp;#39;ve been wanting to try this place for a while (Thanks, Big Bang Theory). There&amp;#39;s not one close to where I live. My boyfriend and I had a date day (since Tulsa is only about 2 hours from where we live)and decided to stop here after walking around the zoo all day. It was wonderful. The menu is very diverse, the service is excellent and our food was perfect. The boyfriend got one of the Glamburgers and I got the grilled turkey burger. For dessert, we shared the Kahlua cheesecake, the apple crumble cheesecake (I can&amp;#39;t remember the actual name) and a double shot of espresso. So glad we decided to try the place. Looking forward to a location in NW Arkansas. :)", "rating": 4, "date": "4/29/2015"}, {"text": "Been here more than once.. The atmosphere is great, love the dim lighting and big booths. I would say that Cheesecake Factory is just an overrated chain restaurant..Everytime we come here the service isn&amp;#39;t that great, the food is just average which you pay too much for.. Tables sticky more than once already...I have a few favorite meals and cakes I like to get, but every time I order some items it seems they get worse with every try.. For example the last time I ordered the factory nachos they didn&amp;#39;t have enough flavor..were too soggy and the chicken was too chewy and over cooked.. Too salty.. Won&amp;#39;t be ordering that anymore. What our favorite thing to come here is for just coffee or tea with a cake or cheesecake.", "rating": 3, "date": "5/13/2015"}, {"text": "I know, it is a chain. Yes, it is true, if you&amp;#39;ve been to one Cheesecake Factory you&amp;#39;ve been to them all. This is truly a very good and quite underappreciated thing. I&amp;#39;ve been to this restaurant in seven different states. They have mastered the art of consistency. Service is great and the food is great, always.", "rating": 4, "date": "7/7/2015"}, {"text": "Food overall is moderate ... Had the meal was too big the portion ... Waitress did not really explain well of what the meals comes and portions ... Menu is TOO Big and complicated ... Pricing is not bad, cakes are tasty but that&amp;#39;s the only positive ... Will be back again for cakes though ...", "rating": 3, "date": "9/18/2013"}, {"text": "First time at a Cheesecake Factory. The restaurant is beautiful inside, and we were seated quickly on a Saturday afternoon. Then we realized that the decorations that were intended to look like torches around the dining room looked very much like the Eye of Sauron from the Lord of the Rings. Our server was less than interested in helping our party of six decipher the enormous menu, that had more items on it than I have ever experienced before. It is so large that when we were telling each other about entrees we had to reference it with a page number. I had the seared tuna salad, and it was good, everyone&amp;#39;s food was good, the cheesecake was good, but it was all expensive. Our server kept the drinks full, but not very nice at all. I doubt we come back for a long time.", "rating": 2, "date": "7/12/2014"}, {"text": "I am not a &amp;#34;chain&amp;#34; eater. Not that I won&amp;#39;t eat at chains, I just prefer to eat locally. I have not had anything that I did not like, never had bad service, have had to wait a little longer to be seated at times but will always be back. I had the pear something salad off of the &amp;#34;Skinnylicious&amp;#34; menu and it was quite tasty. Very light, very fresh!!! I would get it again for sure. My wife got the Chicken Madeira and I got a couple of bites of her food as well and of course, yummy. What I like about CF is that there is almost something new every time I go.", "rating": 4, "date": "9/6/2014"}, {"text": "The Best food, choices, and certainly deserts!  The parmigiana chicken is INCREDIBLE!", "rating": 5, "date": "4/7/2017"}, {"text": "21 page menu...? Seriously? Not impressed enough with the atmosphere to come back. Acoustics make it very loud. Unsweetened tea tastes like it was made with dirty water.", "rating": 2, "date": "10/17/2014"}, {"text": "I ate here with my husband, I ordered the New Orlean&amp;#39;s pasta. No complaints it was a great pasta with a spicy kick. He ordered the chicken fettuccine. He said it was bland. I will be back for sure. I always get their fried macaroni and cheese balls which is very filling and that I love!", "rating": 4, "date": "2/21/2015"}, {"text": "My husband says this is the best food he&amp;#39;s had in Tulsa since we moved here. He is in love with the fish tacos. I had the chicken medeira and it was good. Cheesecake was superb.", "rating": 4, "date": "12/2/2015"}, {"text": "My husband and I spent $80 one night for cold food. What my husband ordered was not available but he wasn&amp;#39;t told until after we placed our order. The waiter came back and asked what he wanted instead but failed to provide a menu. In addition,  although small, they ran out of bread?!? They didn&amp;#39;t offer to compensate for the less than satisfactory experience. I probably won&amp;#39;t return.", "rating": 1, "date": "6/4/2014"}, {"text": "Why this place is in Tulsa, Oklahoma I will never know. Overpriced! Only people that go here are stuck up rich folks and spoiled mallrats.", "rating": 1, "date": "11/4/2015"}, {"text": "No IPA or micro brews 1 star<br&gt;Food was OK, fish taco&amp;#39;s,  3 star based on what I have eaten in other restaurants.<br&gt;Salsa 1 star out of the can and not spicy<br&gt;Just a run of the mill chain restaurant doing there best.  Not bad and not great", "rating": 3, "date": "12/5/2012"}, {"text": "If you have a large group and some picky eaters with you, Cheesecake Factory has everything!  I&amp;#39;ve been to several CFs and am not really a fan of their non-specialty menu. I feel like if a restaurant wants to do something really great, it will narrow down its options, but that&amp;#39;s just my opinion.  <br&gt;<br&gt;Do NOT order salad at CF! They are totally worthless and not worth the $9-10 or whatever the cost is. I don&amp;#39;t know why I don&amp;#39;t remember this each time. If you order any type of salad, it appears huge...it&amp;#39;s mostly filled with maybe 3-4 cups of iceberg/some romaine lettuce. Whatever the salad was advertised as (i.e. roasted veg, chicken, etc), that particular topping might be in the quantity of 1/8 to 1/4 cup. So you&amp;#39;re paying for iceberg lettuce.  <br&gt;<br&gt;My mom ordered some chicken tacos from their SkinnyLicious (or whatever it&amp;#39;s called) menu and enjoyed them.  Besides my crappy salad that was maybe 100 calories and did not fill me up, I ordered an egg, tomato and English muffin. The eggs appeared to be powdered eggs (that odd yellow color), but I could be wrong. The tomato was surprisingly good for a chain restaurant and muffin just OK. <br&gt;<br&gt;Everything I&amp;#39;ve eaten here on this visit and others is just OK.  I&amp;#39;ve ordered the Vietnamese spring rolls wasn&amp;#39;t all that impressed. IMO, the cheesecake is too waxy and I prefer homemade.<br&gt;<br&gt;The service, however, was great. Our server was happy and pleasant and came by numerous times.  She did an excellent job!", "rating": 2, "date": "7/6/2012"}, {"text": "First time here! Absolutely love it! Our server, Barbara, is amazing! And the food is to die for. We&amp;#39;ll be back very soon!", "rating": 5, "date": "9/11/2015"}, {"text": "Not gonna lie, the decor is hideous.  Not sure if I just don&amp;#39;t get it or what, but it&amp;#39;s ugly. Now that I have that out of the way, the food is consistently good. The cheesecake is also pretty phenomenal.  You&amp;#39;ll never settle for less after trying it out. The service was pretty good, too. All in all, what you&amp;#39;d expect from a chain place. Worth a visit or two, definitely.", "rating": 4, "date": "1/20/2015"}, {"text": "We went on a Wednesday evening, didn&amp;#39;t expect it to be busy but it was. Upon arriving we were offered a table/booth right away. We declined due to trying to be placed in between 2 large families w/ a lot of kids. I asked the hostess if we could wait for the booth that was being cleaned.. She said no that the family before us was waiting for a booth but she would put us next in line. She handed me a buzzer and we went on the wait 5-10min later after 3 families came in, our buzzer went off. We got to the counter and she told the person who walked us to our seats to hold off and the family after us was told to follow him and The booth in question that i had requested went to them.!! Once he came back from seating them he walked us to the very back of the restaurant and sat us in a booth meant for a family of 8-10 people. It was unnecessary for my family of 3. &amp;#34;we didn&amp;#39;t complain&amp;#34; thats their loss of profitability. &amp;#34;<br&gt;<br&gt;The waiter was mediocre to bad .. took forever to order or get things we requested (i.e. ranch &amp;amp; refills) My husband&amp;#39;s order was incorrect and had to be sent back by the time we received his food back everyone else had already eaten. <br&gt;<br&gt;Dessert, we were stuffed but of course could not say no to CheeseCake .. we got them to-go. Upon opening them. They were upside down in the container and smushed in the container.<br&gt;<br&gt;For spending 120$ on 3 people for dinner and having such crappy service is just unacceptable.!", "rating": 2, "date": "6/5/2014"}, {"text": "So disappointed in the Factory. We get to Tulsa a couple times a year and always go to Cheesecake Factory.  The lunch menu items although nicely proportioned did not have the usual quality and taste.  My lettuce was actually wilted and water soaked.  Fries with burger also soggy.  Burger did not have its usual excellent flavor.   Ordered three different kinds of cheesecake, all tasted like they had been in the case for way too long.  Not sure what is happening here. As they are always busy. Quality control needs to be examined.  Wish I could rave here but not worthy.", "rating": 2, "date": "8/15/2015"}, {"text": "Great food, great service. Our bartender Byno and his manager gave a very personal experience. Thanks for starting our vacation out right. #lovinglife #cheesecakefactory", "rating": 4, "date": "10/8/2014"}, {"text": "Food - meh. good from frozen food<br&gt;Desert - amazing cheese cakes. erhmergerd.<br&gt;<br&gt;I would maybe split a dish (because the portions are huge) and then split a cheese cake. There is no reason to get your own dish unless you REALLY wanna take home and reheat reheated food.", "rating": 3, "date": "8/14/2014"}, {"text": "The dessert is great. That&amp;#39;s obvious. The regular food is not so great. It is ridiculously costly for what you get. I can&amp;#39;t recommend for dinner. But sure wouldn&amp;#39;t turn down a pie of cheesecake for dessert.", "rating": 3, "date": "5/6/2015"}, {"text": "Been here a couple of different times and the food is below average and way, way overpriced!!! I wont make the mistake of giving it another chance. Just a way overated chain that doesnt live up to the hype.", "rating": 2, "date": "1/12/2015"}, {"text": "If I&amp;#39;m getting a cheesecake only to go order at 1030pm that probably means I want to eat it soon. What I got was a frozen piece of cheesecake that was impossible to eat. 3 stars is only because I like the food there in general. Come on people. If I ordered it at the restaurant would you have brought me a frozen piece? So disappointing.", "rating": 3, "date": "11/7/2015"}, {"text": "We are HUGE fans of the Cheesecake factory and this was probably the best tasting meal I have ever had in a branch of this chain.<br&gt;Strong and potent long island iced tea for beginners, then moved onto <br&gt;the BLT salad with big chucks of blue cheese and tasty bacon,beautifully split in two for Dane and I to share.<br&gt;Being from New Orleans I had to have the Louisiana Pasta that was perfect and just what I wanted this evening....a cajun inspired mildly spicy cream sauce and bow tie pasta served with about three breaded,hot and juicy chicken breast on top...absolutely delicious!<br&gt;Finished with their new Mango Macaroon Key Lime cheesecake that melted in our mouths.<br&gt;Fantastic meal all around and the best thing, the place is open till 11PM and we didn&amp;#39;t even have to wait for a table! WOW, that is unheard of our in California where no matter what night you go, expect to wait at least an hour!", "rating": 4, "date": "3/30/2011"}, {"text": "Bar staff was good. He kept out drinks filled and was friendly. I had a chicken dish, I think chicken marisala, he said it was a hot seller and I can see why! It was fantastic. The mashed potatoes were perfect, the chicken cooked just right and the sauce with mushrooms was creamy and had a great flavor.", "rating": 4, "date": "9/14/2013"}, {"text": "The food is awesome. Seriously- five star food. But... I have to take into account everything else, so three stars it is. <br&gt;<br&gt;The place is HUGE. Too big. I know it&amp;#39;s nice to be able to get a table more quickly, but the tables are so close together you might as well pull up a chair at the table next to you. It&amp;#39;s weird. You feel like whispering because it seems inappropriate to talk at an audible volume with strangers so close to you.<br&gt;<br&gt;Let&amp;#39;s say you get a booth. Score! The booths are HUGE. You must have a family of nine, because the booths are large enough to accomodate a mid-size sedan and are usually filled with children. So many children. (Plight of going south in Tulsa, I suppose.) Here&amp;#39;s the next awful thing:<br&gt;<br&gt;The menus are HUGE. They make close to every style of every dish ever. The thing is, the menus don&amp;#39;t just have food in them- they have advertisements. I&amp;#39;ll repeat that- ad-ver-tise-ments. It&amp;#39;s offensive. I should be eating for free if they&amp;#39;re getting paid by advertisers just to have me look at their menu. <br&gt;<br&gt;Lastly, and I know this is nit-picky but I&amp;#39;m a Virgo, the waitstaff is forced to dress in white. Do you know how hard it is to find white pants? They look awful on everyone, they have a touch of the dingies and I feel so bad for these people to have to have more than one pair. Although, the young man who was serving us smelled as if he didn&amp;#39;t worry about having backups or washing the current pair of choice. Excellent.<br&gt;<br&gt;Good food, but is it worth selling your soul? That&amp;#39;s for you to decide I suppose. I did love the primavera.......", "rating": 3, "date": "1/2/2009"}, {"text": "See, here&amp;#39;s how I see CCF. There was one in Pasadena,CA so whenever I took the drive over the bridge from Glendale, I would walk down Colorado to window shop and check  things out. Night outings would show me a crowded lobby of the CCF there. A table would take at least a 50 minute wait. So when I visited last, my dear friend and I wanted to dine here and due to the wait, we instead dined at Louise&amp;#39;s across the way. So, the wait has never been an issue (except the last time, I was 5 months pregnant with son #2 and I was hungry!). Also, the wait has never been news to me. If you want to go on a Friday night date night and want to eat here, you have to be prepared for a wait or go early. <br&gt;<br&gt;Now, onto the food.... delicious. The only thing is there is so much on the menu, it is hard to decided waht to order. But once you do, it is awesome. I haven&amp;#39;t had anything bad here.", "rating": 4, "date": "1/29/2009"}, {"text": "You always know what you&amp;#39;re getting with Cheesecake Factory: fresh-made food at a chain restaurant and portions large enough to feed an army of horses. We started with the ahi carpaccio which is always delicious, especially when the kitchen goes light on the mayo-based drizzle. The Pasta Da Vinci was a savory, splittable second course.  Of course, the cheesecake is a nice cap on any meal (try Vanilla Bean or Macadamia Nut), but dessert is overpriced.", "rating": 4, "date": "7/26/2009"}, {"text": "One of my favorite restaurant chains and this was in no exception. The menu is a book of many delicious items and so many different choices. I tend to lean toward ordering what I know. The Chicken Madeira- Sauteed Chicken Breast Topped with Fresh Asparagus and Melted Mozzarella Cheese, Covered with Fresh Mushroom Madeira Sauce.  Served with Mashed Potatoes. YUM. Order a strawberry martini-they infuse fresh strawberries with Ketel One vodka, hand crafted per order. Stout but awesome-you can see the seeds floating in your drink and I always finish off with White Chocolate Raspberry Truffle cheesecake. So rich and by the point, you are stuffed but you have to have cheesecake. So, eat half your meal, take the rest home and always make room for dessert. I have attached pics of my last meal as described here. The only bad thing...prepare to wait!!! Everytime I have been here (3 times in last two months) the lobby is standing room, body to body of people waiting and its usually an hour.", "rating": 5, "date": "12/19/2007"}, {"text": "So maybe I went on a week night and things were not up to par...<br&gt;The Cheesecake Factory is always beautiful with a huge menu etc...<br&gt;<br&gt;But I was there alone on a business trip, got sat in the bar area and then it took roughly 15mn for someone to come over and ask if I needed any water!  After that, service was sketchy at best, but my appetizer was great, my bread showed up with my meal, and my Endives/Pear salad looked like a heap of lettuce with shreds of endives and some sort of candied pears...  <br&gt;<br&gt;I guess it wasn&amp;#39;t what I expected... and it was a LOT of not what i expected.", "rating": 2, "date": "9/17/2009"}, {"text": "It&amp;#39;s Sunday, and the church crowd is hungry. You&amp;#39;d think service at a restaurant like the Cheesecake Factory would be painful and asinine to attempt. <br&gt;<br&gt;Well, we decided to bravely attempt it anyway, and were surprised. <br&gt;<br&gt;Upon arriving, we noticed the parking lot was full.This and the plethora of people dressed in formal is always discouraging; however, to our surprise, we were hastily seated. <br&gt;<br&gt;Our waiter was flooded with other tables, but we still received much attention <br&gt;<br&gt;What made this a great experience was the fact that even during their busiest time they still manage to offer great service.", "rating": 4, "date": "7/28/2009"}, {"text": "Went in for an early dinner and it was not even busy...had TERRIBLE service!  Staff were unattentive and barely checked on us.  It took forever to get our food and it was cold when it arrived...I mean COLD!  When I complained to the server he nodded and simply said &amp;#34;OK.&amp;#34;  He then walked away and only returned to give us the bill.  I work too hard for my money to come into a place like this and have it taken for low end service!  Sadly I will not be coming back!", "rating": 1, "date": "7/5/2016"}, {"text": "The service was doting and excellent. The food, unfortunately, was horrific. I ordered chipped beef sandwich and it was the saltiest thing that I ever put in my mouth. My wife ordered fish tacos and she seemed had the opposite problem--no flavor at all. I&amp;#39;ve heard good things about this Cheesecake Factory before so I&amp;#39;m hoping it was a chef&amp;#39;s error. My meal left me in physical pain, however, and after that I won&amp;#39;t be back.", "rating": 2, "date": "9/7/2013"}, {"text": "The cheesecake is wonderful.  <br&gt;<br&gt;Service was absolutely horrid!! <br&gt;<br&gt;We will never eat at The Cheesecake Factory again!", "rating": 1, "date": "6/17/2009"}, {"text": "Worst anniversary meal we&amp;#39;ve ever experienced! We had a gift card, that&amp;#39;s why we decided to try it. We got the Renee&amp;#39;s special (lunch). There was no choice of soup. The salad was extremely bitter. They didn&amp;#39;t have turkey for the turkey sandwich. It took them 15 minutes to come take our drink order only because my husband went to the front to complain. Won&amp;#39;t be going back! The waitress was extremely friendly.", "rating": 1, "date": "12/18/2015"}, {"text": "Yummiest cheesecake around, besides my moms of course. The atmosphere and service at this restaurant are great! The menu boasts 14 pages of tasty drinks and foods, but in my opinion it is like reading a mini novel. Not complaining about too many choices, but it makes it hard to decide what to order. We started with the Thai Chicken Lettuce Wraps, and looking back on it this was my favorite dish of the meal excluding the cheesecake. For our second appetizer we tried the tuna steak (cannot remember the exact name of the dish) and it was awesome too. I had the shrimp fettucini alfredo and my husband had the filet. Both were very yummy; I always make a point to try his dish too to get some variety. All in all, it is a great restaurant. I would warn that it is a bit on the pricey side and it is not an eat and run kind of place (we were there a total of 2 or 2 1/2 hours). It is also great to just stop in and grab some cheesecake to go though!", "rating": 4, "date": "5/22/2012"}, {"text": "Have never had the pleasure of eating within the establishment but have had friends and family bring me cheesecakes from here. Simply amazing. The very best cheesecake and so beautiful.", "rating": 5, "date": "11/30/2013"}, {"text": "Evelyn&amp;#39;s Favorite Pasta is good. Corey, our server, is great.", "rating": 4, "date": "6/10/2013"}, {"text": "Most excellent meal for our first time. Had the shepherds pie. Very good but different spin on what I&amp;#39;m used to in shepherds pie. Only thing I didn&amp;#39;t particularly like is the lightning. It was very dark and hard to read the menu which nicknamed the &amp;#34;phone book&amp;#34;. The cheesecakes my gawd don&amp;#39;t know how many they had but the mango key lime was excellent.", "rating": 5, "date": "6/15/2012"}, {"text": "What can be said that hadn&amp;#39;t already been said? Nothing, everyone in my family loves it. The service is great, the menu is a book that has something for everyone, really everyone, no really e v e r y o n e, the food is thought out and very good, the portions are unreal so there is alway something to take home. Good luck on choosing cheesecake cause it&amp;#39;s all good (you&amp;#39;ll be taking that home too). It&amp;#39;s usually busy and there&amp;#39;s some wait time to get seated, so plan a little time for it if your like us and drive from the country to Tulsa to shop.", "rating": 5, "date": "1/3/2015"}, {"text": "Absolutely amazed.  Atmosphere, food, food selection, service...above top notch!  Being from Little Rock, we have a new reason to visit Tulsa. Will be back and will bring a group!", "rating": 5, "date": "7/14/2015"}, {"text": "Cheesecake factory is one of the best restaurants in the Tulsa area. The Tuscan chicken is outstanding!", "rating": 5, "date": "9/21/2014"}, {"text": "We don&amp;#39;t have one of these in nyc, so I always go when I am on vacation.  I almost always get the same things--either the Cajun Chicken Jambalaya or the Crusted Chicken Romano, and of course, I split a slice of cheesecake (usually picking whatever the special is).  I love this place.", "rating": 4, "date": "6/2/2011"}, {"text": "I chose this past weekend to take my wife out on a date, unknowing that it was prom night. Oops. Big mistake right? Wrong. I was surprised when I called ahead ( from my Yelp BB app) that the wait was only 30 minutes, so we decided to risk the limos, makeup, and pimples.<br&gt;Walking in the decor is amazing.  It has the look of a very fancy upscale restaurant. Definately a plus when taking the Ms. out on the town. The waiting area left us a little cramped, but I&amp;#39;ll give them that on prom night. Lets just say they were busy.<br&gt;Our wait was just around what we were quoted and we sat down in a private booth got to business. Drinks- Strawberry lemonade that was rediculous. I had heard the lemonades were good, but this was lemonade heaven. <br&gt;She had the avacado chicken club. A mammoth sandwich packed with chicken, avacados, tomatoes, etc. I thought it lacked a little on dressing but it was good.<br&gt;I had the Louisiana Chicken Pasta. Bow tie pasta in a southern spicy sauce with what looked liked southern style chicken fingers on top. The portion was more than I could finish. The flavor was similar to Outback&amp;#39;s Toowoomba Pasta, and the chicken complemented the sauce well.<br&gt;Dessert was the Banana Creme Cheesecake.  Cheesecake with a banana creme topping, whip cream and sliced bananas. Do I need to explain it?<br&gt;Overall I liked this place and will be back. Good service, good food, great atmosphere.", "rating": 4, "date": "4/18/2010"}, {"text": "The Cheesecake Factory is just what it is food wise, but what made my time there tonight was the service.  Richie our server was so friendly and accommodating, despite numerous special requests from my &amp;#34;high maintenance&amp;#34; co-workers.  In fact one of the &amp;#34;skinny&amp;#34; drinks was returned because it tasted funny and Jacob, the manager, came over, talked to my co-worker to get what she wanted, just as she wanted it.  Both Richie and Jacob made this a great dining experience!", "rating": 4, "date": "5/20/2014"}, {"text": "I love this restaurant!  Fantastic selection, excellent food quality, good service, big portion sizes, decent prices, wonderful cheesecake, you can&amp;#39;t go wrong.  I wish we had one of these where I live.  I got an appetizer for my main meal and didn&amp;#39;t even finish it, then got some cheesecake and didn&amp;#39;t finish it either, so I had plenty left over which is cool.", "rating": 5, "date": "8/4/2009"}, {"text": "Typical chain food. Not bad.. The best and only reason we go to the cheesecake factory .... the cheesecake .. duhhh...", "rating": 3, "date": "10/19/2010"}, {"text": "A huge menu -- I mean the selection is awesome -- and great food presentation.  Too bad the food itself doesn&amp;#39;t quite live up to the reputation as often as not.  The serving sizes are far more than the average person can eat, so plan to take some home -- you definitely are paying for it!  The tab at Cheesecake Factory always manages to be considerably more than you had planned to spend.  Great decor.  Loud.  Busy.  Over-rated.", "rating": 3, "date": "6/19/2008"}, {"text": "I been here twice already and I have had the worst luck possible. The first time the service just sucked. The second time everything I ordered was out. They took 15 minutes to tell me they didn&amp;#39;t have any tuna left. I would never come back again.", "rating": 1, "date": "4/18/2010"}, {"text": "Caramel Chicken is so good. Enough food to split. Excellent service.", "rating": 5, "date": "8/31/2010"}, {"text": "The food is very good!  I cannot complain about that.  The price is a bit high though.  The other night I had a to go order that was 1 cheeseburger and 2 pieces of cheesecake for $28.  Wow.  For as much as the cheesecake costs I would expect bigger pieces and less whipped cream fluff.  The burger was just about the same as Fudruckers down the street near 169.  In the future when I want cheesecake and a cheeseburger I will go to Fudruckers and if I can find a cheesecake that compares to the C.F. I will go there.  But like I said, the food is damn good!  Just a bit too costly in my opinion.  My mouth is salivating as I type this.   I need to win the lottery. :-)", "rating": 4, "date": "3/28/2010"}, {"text": "i love the food! i dislike the service, the wait to be seated, the loudness, the crowd, trying to park, the hike to the door after i park and i don&amp;#39;t know why the $ was only marked 2x- if you get an appetizer and a meal with drink (and I&amp;#39;m not talking alcoholic beverage either)and cheesecake to go~ because your too full to eat it there. did i mention HUGE portions?  it&amp;#39;s and easy hundred dollar outing.  i still love the food! :)", "rating": 3, "date": "3/10/2009"}]}