{"address": ["330 N Milwaukee St", "Boise Towne Square Mall", "Boise, ID 83704"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.0], [2, 2.5], [3, 3.0], [4, 3.0], [5, 4.0], [6, 3.5], [7, 4.0], [8, 4.0], [9, 4.0], [10, 4.0], [11, 4.0]], "2017": [[0, 3.5], [1, 3.5], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.5], [6, 4.0], [7, 4.0], [8, 4.0], [9, 4.0], [10, 4.0], [11, 4.0]], "2020": [[0, 4.0], [1, 3.5], [2, 3.5], [3, 3.0], [4, 3.0], [5, 2.5], [6, 3.5], [7, 3.5], [8, 3.0], [9, 2.5], [10, 2.0], [11, 2.5]], "2018": [[0, 4.0], [1, 3.5], [2, 3.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 4.0], [7, 3.5], [8, 2.5], [9, 3.0], [10, 3.5], [11, 2.5]], "2021": [[0, 2.0], [1, 2.0]]}, "reviews": [{"text": "I really dislike leaving any business a poor review, especially one that I have supported for so many years. Today my husband and I went to Sunday Brunch for my birthday. We went into the bar hoping to catch some football but their 2 TVs were &amp;#34;broken&amp;#34;. I ordered a mimosa and it came in a glass that was not only small but had a lot more orange juice than champagne. When I asked our server if it came in a 1/2 caraf or anything larger, the bartender told her she could put it in a wine glass and charge me twice the price, which would be $17.00. I opted out. I ordered the CA omelette and when I got it, the potatoes were cold. We had to ask for absolutely everything during our meal. More coffee, salt and pepper, another drink, and the check etc. we even had to ask for our plates to be removed. Our son is a server so we&amp;#39;re super sensitive about tipping well, but we only left 10% today which pulls on my heartstrings. I don&amp;#39;t blame the server, I blame management for not training her properly and not keeping a finger on the pulse of what&amp;#39;s happening in the restaurant. Sad to say we most likely won&amp;#39;t be returning anytime soon. There&amp;#39;s just too many other better options.", "rating": 1, "date": "11/15/2020"}, {"text": "My husband called an order to go and said he would get a slice of cheesecake when he got there to add to the order.  He arrived and our meal order was ready, hubby said he would like to add a piece of cheesecake to the order.  Guy at bakery counter told him &amp;#34;you should have called that in too&amp;#34;.  Told him it would take 5-8 minutes to get the slice of cheesecake and there were two other people working there.  Second time in a month we&amp;#39;ve had crappy service at Cheesecake Factory.  If I had been there I would have called the manager over immediately.  Don&amp;#39;t waste your time, this restaurant has obviously lost their customer service focus.", "rating": 1, "date": "6/27/2020"}, {"text": "Horrible horrible service! I ordered through Door Dash and the chicken picatta came as dried chicken breast with nothing else. The manager at the restaurant said she couldn&amp;#39;t help me at all since I ordered through Door Dash (she seemed completely apathetic and unwilling g to help at all). It took me several attempts and long conversations through Door Dash who wouldn&amp;#39;t refund me for the meal, tip, &amp;amp; service fee. It&amp;#39;s insane! Horrible service.", "rating": 1, "date": "4/26/2020"}, {"text": "We ordered a pumpkin cheesecake for Thanksgiving dinner. Server asked us if we wanted pecan or regular. We told her definitely regular didn&amp;#39;t want the pecan. Today we took it out, thawed it only to discover it was pecan. SO disappointed. Sadly this has happened before with another that we throughly enjoyed but I figured since she asked and we were insistent that it could not be pecan we were safe. Next time I&amp;#39;ll probably go to Costco. Dang I so wanted pumpkin.", "rating": 1, "date": "11/28/2019"}, {"text": "Went to Cheesecake Factory today and was very disappointed, the salad I ordered, the guacamole salad had very little cheese and equally little beans and corn,  I Lol as they seemed like a garnish. Also I got my initial drink brought to me AFTER my lunch came!  This is not a Covid induced complaint either. They were not very busy today.  Too bad. Food is normally good and so is the service.     Update: I am not sure why Cheese Cake Factory routed me to General Questions?  This is not a question, rather a review that is not positive, why re-route me?  Why not address this here?  Even more disappointed to be handed off to &amp;#34;General Question&amp;#39;s&amp;#34; what is that supposed to achieve?  That customer service is handled through a questions department?", "rating": 2, "date": "10/7/2020"}, {"text": "Huge thank you to this whole team! We ordered through Doordash right before their system went down, so we never got our order. So I called and asked if I could just order the whole thing again and pay them when I picked it up (everything has been sitting for so long that it was not good anymore). But the manager offered to do it for free since I had already paid for it through Doordash.<br&gt;<br&gt;This was such great news after the longest day ever. Thank you again!", "rating": 5, "date": "6/22/2019"}, {"text": "Say they take reservations over the phone. Transferred to desk and was told they don&amp;#39;t. I have to use the website. Tried using the website. Won&amp;#39;t do a reservation for more the 6 and you have to call to make one.  Then called and found out they don&amp;#39;t take reservations over 6 on the weekend. Sigh. Wish they would get the story straight. And this has nothing to do with Covid.", "rating": 1, "date": "9/4/2020"}, {"text": "Not to shabby. The steaks we had were good, drinks were delicious, but they pack ya in like sardines! <br&gt;The lighting is so low we could hardly see our food. Didn&amp;#39;t matter my because it tasted good. <br&gt;Dessert is always delicious, when you want to share a slice!  Crispy Brussels sprouts were amazing as well!", "rating": 4, "date": "12/30/2018"}, {"text": "Terrible drive up service. Placed an order on-line, paid and headed to the restaurant. Arrived 25 minutes later and announced I was there for pickup. I was told it was not ready and I will receive a text message when ready. At 45 minutes from the original order, I went inside to check on the order. It was still not ready. At an hour, I requested my money back. Be prepared for a long wait and still no text message at the hour....", "rating": 1, "date": "5/1/2020"}, {"text": "Another great waiter for my friend&amp;#39;s birthday dinner celebration. :-) he was very personable and easy to interact with. He said his favorite part of the job is the employees he works with so I can see there is great hiring going on.<br&gt;But I got there too late and my friends had already eaten but free bread was still there, and was delish as always, and was worth a tip for his great customer service.", "rating": 4, "date": "8/22/2019"}, {"text": "Always, Cheesecake Factory provides delicious food for dine-in or takeout. We have never been disappointed for new or classic choices on their menu. This time, we ordered takeout, and everything was new for us this time, not surprisingly excellent! All was ready when I arrived in 20 minutes, still hot when we dined at home, and worth the time &amp;amp; money! PLUS you can&amp;#39;t miss or skip the world famous CHEESECAKE. They have a couple dozen varieties to choose from! A few favorites include White Chocolate Macadamia Caramel Cheesecake, Mango Key Lime Cheesecake, (classic) Strawberry Cheesecake, Caramel Pecan Turtle Cheesecake...<br&gt;A good writer can make a review worthy of the quality of the overall culinary experience at Cheesecake Factory, but please go check it out yourself with someone for a birthday, an anniversary, or whatever!", "rating": 5, "date": "9/6/2019"}, {"text": "While up in the area of the mall we were trying to figure out where to go to eat and remembered we had not been to cheesecake factory in a long time. Most of the restaurant is still the same if you&amp;#39;ve been going off and on for over a decade like we have, and just like all the yelp reviews, always a long dreaded wait which usually takes much longer than they even say. We got our buzzer at 7 PM were told 30 minute wait.... after 45 minutes we were seated. We decided to split a meal, the wife and I, because we wanted to have room for cheesecake of course. We ordered the Parmesan crusted chicken that comes on a spaghetti type noodle, and instead of the red sauce we substituted it for their Alfredo sauce which is quite delicious as we&amp;#39;ve have  had it in the past. Plenty of food for two people if you have salads and such. We each ordered a salad prior to the meal, One house salad and one Caesar salad. The small salads aren&amp;#39;t much to speak of, the house salad is just lettuce us throw on a plate with really no other garnishes to go with it and your side of dressing. The Caesar salad was pretty flavorless and is so finally chopped it&amp;#39;s hard to eat but it is plenty big. The house bread thats served with any meal is absolutely amazing though. After our salads we waited a half hour for the meal to show up, way too long after we&amp;#39;ve already eaten two loaves of bread waiting, we let the waiter know that it was lukewarm as well, the manager and the waiter were extremely nice and we were comped the meal. That gave us even more of an excuse to splurge on the cheesecake, in which we got a large to die for caramel pecan turtle helping. Incredible, barely finished it. This review comes with a mixed heart, the food is very good but the wait was ridicules especially since you can&amp;#39;t call ahead for seating, and the fact that we were comped the main meal helped and just the fact that they knew it could&amp;#39;ve been better as well. I&amp;#39;m rating this three stars because we will be back of course, and when it&amp;#39;s better I will adjust my rating. My biggest tip would be to come when you have extra time so you can get a buzzer and go maybe walk around the mall and shop till about 10 minutes before they say so you&amp;#39;re sure to be there when it does buzz. Just way too long of a wait to just stand and be in a heard like cattle. Another problem I have is the center seating are almost family style tables you&amp;#39;re literally closer to someone you don&amp;#39;t know on your left or right than you are with your date directly across in front of you. It is quite loud and you have to raise your voice to hear Each other, fortunately we had a end table up against one of the center walls so we weren&amp;#39;t as crowded.  Sorry for the dark photos, the Restraunt has such poor lighting that we had a hard time reading our menu as well.", "rating": 3, "date": "2/21/2020"}, {"text": "Disappointed in the customer service response when I called in to change my appointment time. The staff is usually friendly and helpful so I&amp;#39;m very surprised by this negative experience.", "rating": 2, "date": "9/2/2020"}, {"text": "Had delivery from doordash and there was 6 chicken pieces in my chicken w/ broccoli pasta dish. My friend has the chicken coconut thai dish and he really liked his but this is my review. If I&amp;#39;m paying $15+ for a pasta dish i expect to eat food.", "rating": 2, "date": "8/7/2020"}, {"text": "We ALL know how amazing this place is. When we go, we all choose to ignore the ENORMOUS amounts of fat, calories, grease, etc that is in whatever we order...except for maybe caesar salad...WITHOUT dressing hahaha! <br&gt;So, I went here for my Birthday a couple weeks ago. Our original plan was to go to Romio&amp;#39;s, but my Birthday landed on a Sunday this year...I know, yawwwwn! Next year...MONDAY! ugh lol.<br&gt;Romio&amp;#39;s was closed and apparently is now closed every Sunday...but whatever! At least I&amp;#39;m not bitter  lol.<br&gt;So we went to Cheesecake Factory. In the past, I always loved their 4 cheese pasta. I mean, shit is delicious! OH! and one of the best things there....their pumpernickel bread! RIDICULOUSLY GREAT! hahaha! <br&gt;Yeah, I carb TF...OUUUUT when I go there lol. We all deserve a night like that every once in awhile....even if the calories are tripled compared to other restaurants lol.<br&gt;That brings me to this. The REASON  ahhh, the reason for the 3 stars.<br&gt;In the past, you&amp;#39;d go there, pay like 16-18 bucks for this 4 cheese pasta. The prices went UP and the servings....went...dowwwwwn! <br&gt;Very disappointing. <br&gt;As some of you know, I kinda love the gym. I&amp;#39;m there/here a lot lol. <br&gt;So when I have a &amp;#34;fat night&amp;#34; I want that....a fat night hahaha! I got good food, but I was do sad at the servings size. <br&gt;Cheesecake has lost a lot of it&amp;#39;s magic and appeal....for ME at least. It&amp;#39;s obviously still a very popular restaurant. Maybe for me, because I don&amp;#39;t eat a lot of that type of food anymore, that&amp;#39;s why it&amp;#39;s lost a lot of it&amp;#39;s appeal...I dunno. Last time I was there...was like 2 years ago and I got almost double of what I got. <br&gt;This usually happens to restaurants and tho. They suck you in, get you hooked, then they switch shit up ALL KINDS of crazy too and then....they don&amp;#39;t think customers notice...OR maybe they do and just don&amp;#39;t give a shit  haha! <br&gt;I know many reading this, love that place and don&amp;#39;t get me wrong, I just LIKE it now. My love for the Factory....has died. The candle has burned out hahaha! <br&gt;Will I go there again? Ha! No. Probably not. Why would I do that when Romio&amp;#39;s is literally 3 minutes north of there!! Hahaha! <br&gt;When I&amp;#39;m back home in NY, visiting family and if they wanna go there (my parents) of course I&amp;#39;d take them. My dad loves that place.<br&gt;My mom, whenever we went in the past, she&amp;#39;d say in her thick NY accent...&amp;#34;ya know this crap is LOADED with calories! It&amp;#39;s &amp;#39;haarrible&amp;#39; for ya&amp;#39;s&amp;#34; I&amp;#39;m like...and yet, here ya are eating with us! &amp;#34;I&amp;#39;m here for the Cheesecake and cawfee&amp;#34; <br&gt;Anyway, that&amp;#39;s probably the only way I&amp;#39;d go again or if a friend wanted to go or something...because...AGAIN...Romio&amp;#39;s is right up the street.<br&gt;I wish for the life of me that I could remember our waitresses name was. She was FANTASTIC! So friendly and gentle. I loved her. Cheesecake always has amazing staff. Super friendly. This woman was extra special though.<br&gt;Ok, ya&amp;#39;ll! That&amp;#39;s it for me on Cheesecake Factory! <br&gt;<br&gt;If you read all of it....THANKS! I appreciate you! <br&gt;<br&gt;Cheers, everyone!", "rating": 3, "date": "11/14/2018"}, {"text": "I used to enjoy this restaurant but there are way to many exceptional places for the same price as eating here. I likely won&amp;#39;t be back after my last experience. My daughter got take out and $18 later we had two pieces of cheesecake. One had rotten strawberries on it, which we couldn&amp;#39;t tell until we got home. For a $9 piece of cheesecake it should be fresh and delicious.", "rating": 2, "date": "1/22/2020"}, {"text": "Excellent food, fantastic service. The food took a little long to come,however the wait was so worth it. PS the Coconut Mojito is delicious.", "rating": 5, "date": "2/29/2020"}, {"text": "I really enjoy the food here and wish we could come inside and eat but every time we try we can never even hear each other talk. This place is to loud and impossible to enjoy if dining in. We only door dash or do carry out.", "rating": 4, "date": "12/21/2019"}, {"text": "We dined at the Boise location 2 nights ago. I was nervous to dine there because I know that the menu is HUGE.. so many options. So I told myself to only order something off the Skinnylicious menu.. and something I would not prepare at home. So I ordered the skinnylicious salmon. UMMM YUM!!<br&gt;It had a nice crisp sear to it, mild and flavorful! The broccoli and carrots were fresh and tasty! Thumbs up!", "rating": 4, "date": "6/3/2019"}, {"text": "Went to The Cheesecake Factory with a few of my friends and we&amp;#39;re seated immediately. First glance at the menu and it was practically a novel. About 20 pages of I remember correctly. The alcoholic beverages (peach Bellini and vodka tonic) were apparently delicious (I&amp;#39;m not 21 but my friends were). However, the food was kind of plain. I ordered the fish and chips and the fish was flavorless and dry and the outside was a little overcooked but the fries were good. Unique sauces as well. The bread that they serve before the meal was to die for! My boyfriend got the Chicken Alfredo and it was soooo buttery, which I&amp;#39;m not a big fan of cause I feel like a dish should have more taste than just butter. Now the cheesecake... that was the best cheesecake I have ever had and is the main reason why this review is four stars. I got the mango key lime cheesecake and it was just rich enough. The service was amazing! I can&amp;#39;t quite remember the server&amp;#39;s name but she did a great job and was very funny. Good lunch portions. Overall, a good meal just less flavor than expected in accordance with the prices.", "rating": 4, "date": "8/4/2020"}, {"text": "The food is amazing and the service perfect. I also highly recommend the mango key lime cheesecake, I think it&amp;#39;s the best I&amp;#39;ve ever had!!", "rating": 5, "date": "6/20/2020"}, {"text": "We stopped over here for a quick bite on our overnight passing through Boise. We were happy to find a restaurant we know where the food is good with nice large portions. We arrived at 5, which was great because we were able to get seated right away. I liked how they had an abbreviated menu with slightly smaller portions. We didn&amp;#39;t want to have any leftovers, and this was just right. I got the shrimp dish with the sauce on the side. That was perfect because the shrimp was plenty buttery and with the sauce too it would have been way to much cream. My husband got the fish tacos. That was a very nice portion size and he ate it all and was full and satisfied at the end. My kids each ordered the kids meal sliders. It was nice they also got a drink and dessert. The Cheesecake Factory is always good. We left happy and full.", "rating": 3, "date": "6/25/2018"}, {"text": "I normally would give this place a 5 star review for getting us seated quickly and pretty friendly and quick service, but we were so disappointed with our food. I asked for something to be put on the side and it still had some inside my meal. My husband got a flatbread and it wasn&amp;#39;t even cooked all the way so when he picked up a slice it was floppy and all his toppings kept falling off. For wanting a nice night out it was kind of disappointing.", "rating": 3, "date": "7/2/2020"}, {"text": "This is not the first cheesecake factory I have been too, but this is probably the last time I will be going to this location. My husband and I went here yesterday for the first time to have a early dinner. We arrived and waited 15mins to be seated, when we were seated we noticed that we could see about 14 open tables around us, I only assume there wasn&amp;#39;t  enough staff so I didn&amp;#39;t think to much of it.<br&gt;<br&gt;Our waitress came and got us drinks and brought us bread, while we sat there my husband pointed out that the table had a bunch of caked on gunk on it. Now I know that no restaurant table is super clean, but I would like to think that they could get the chunky stuff off at least.  After he pointed that out he pointed me to the floor of the table next to us. Now this table along with 5-6 more next to them were all bussed and set up to seat people, no one was using them. But the floor underneath the one next to us had flood under it, and not just bread crumbs, but some decent sized pieces. We looked  around us and there was a lot of old food pieces, some dirty napkins, and just filth. I get that floors get dirty but the place wasn&amp;#39;t that busy and if you have all these open tables you would think someone could grab a broom and just do a quick clean up to get the big stuff.<br&gt;<br&gt;As for the food. I had the club sandwich which was good, but it is hard to mess up a club. My husband had some sort of spicy chicken sandwich which wasn&amp;#39;t spicy, had almost no chipotle sauce, and the cheese looked like it just sat out in a warm place instead of being melted on top. We both had fries as a side which were insanely bland.<br&gt;<br&gt;The services was ok. The waitress and hosts were nice and friendly, but our waitress wasn&amp;#39;t super attentive and didn&amp;#39;t get drink refills till we were done eatting, which was kind of a waste. In the end we left disappointed and slightly grossed out.", "rating": 2, "date": "3/19/2018"}, {"text": "Believe it or not, this is actually a great place to get an amazing meal while dieting! I&amp;#39;ve done it 3 times! It doesn&amp;#39;t hurt that I&amp;#39;m not a big cheesecake fan. They have an entire menu of delicious skinny options! I had the Tuscan chicken and it was outstanding! Just under 600 calories, but I only ate 2/3 so even less. While everyone else is loading up and feeling stuffed and guilty, you can stick to your diet and feel fantastic!", "rating": 5, "date": "8/14/2019"}, {"text": "Cheesecake Factory has been my go to for Sunday brunch for a long time- today there were four of us, we arrived as the first group of six tables this morning. Every table around us was served and near finished before a Manager came to our table to apologize that the waffle maker was broken and food would be out soon- our waitress never came back until it was time to collect the check. Only two of us ordered waffles, the rest of the food arrived cold after a hour and 15 mins. Our waffles were the wrong ones and when we asked for the accompaniments the Manager seemed irritated. Our bill wasn&amp;#39;t even partially comped? $100 for brunch for 4- I expect better. Will not return.", "rating": 1, "date": "11/18/2018"}, {"text": "I love the food at cheesecake but it is so disappointing when I order delivery and never get bread and butter. The bread and butter is one of our favorite parts and it should be included in all the orders.", "rating": 1, "date": "3/8/2020"}, {"text": "The food was great as always. I got the lettuce wraps and she helped me make them vegan friendly. My daughter loves getting sides so she ordered green beans and mashed potatoes. Our server, Seau was the best part of our visit. She is very kind, funny and personable. We will be back because of her!! Thanks Seau, you&amp;#39;re awesome!", "rating": 5, "date": "10/24/2019"}, {"text": "Reviewer #120<br&gt;<br&gt;I&amp;#39;m a big fan of The Cheesecake Factory, specifically the cheesecake! <br&gt;They have lots of very good food, too, but the cheesecake come in so many flavors, and large sizes that I find myself going out to dinner elsewhere and stopping by here for dessert. <br&gt;<br&gt;My mom got a side of strawberries for her cheesecake and gave them to me. To be completely honest, they were the biggest, best tasting strawberries ever. I felt like I never had a real strawberry until I had one from CF. I think they fly them in super fresh or something. <br&gt;<br&gt;There is sure to be a flavor that everyone will love. <br&gt;<br&gt;The seating isn&amp;#39;t the best and you&amp;#39;re super close to other people, but it is what it is. The artwork on and architecture is beautiful and a conversation piece for sure.", "rating": 4, "date": "8/6/2017"}, {"text": "I have always loved the cheesecake that I can get at Cheesecake Factory, but I have really started to enjoy their actual food as well! Yes, the menu is extensive.  I wish it was like a 1/3 of the size it is, but I end up sticking with what I know &amp;amp; don&amp;#39;t venture out to try something new. <br&gt;My husband and I had Hunter as our server for the last 2 visits. I have to admit that service in the past has been pretty hit or miss....with more misses than hits. However, once we had Hunter, my faith was restored! He is always totally attentive without being annoying, he is super friendly, and he even managed to remember exactly how I wanted my cheesecake. I hadn&amp;#39;t been here for about a month and my cheesecake order is a bit of a pain in the ass...strawberries on the side, glaze on the side, whipped cream on the side, &amp;amp; I want the original cheesecake with the sour cream topping, not the standard cheesecake that is served with the strawberry cheesecake. Yes, I have food issues. Yes, I know I am a pain...but I do tip well!  He has only been our server once before tonight, but remembered everything about my order. Impressive. <br&gt;For dinner tonight we ordered:<br&gt;Chicken Parmesan Pizza Style<br&gt;Old Fashioned Cheeseburger &amp;amp; fries<br&gt;<br&gt;The Chicken parm is seriously AH-MAZING!! Seriously! It&amp;#39;s balanced perfectly and the chicken maintains its crispness without tasting over fried or breaded<br&gt;<br&gt;The burger was also on point.  It&amp;#39;s always seasoned really well and doesn&amp;#39;t require a ton of sauce to make up for the lack of flavor. <br&gt;<br&gt;The only negative is how crowded it gets and when it&amp;#39;s crowded (most nights) you are seated super close to other diners. It doesn&amp;#39;t allow for much privacy, but hey, I&amp;#39;m willing to endure it when the reward at the end of the night is cheesecake!", "rating": 4, "date": "11/4/2017"}, {"text": "One of my favorite restaurants. I&amp;#39;ve never had a bad experience here. They&amp;#39;ve never messed up my meal. I love their bread I actually look forward to that. <br&gt;Favorite dish is the Steak Diane. Mr. Euro (my fiancé) loves their chicken dishes. He&amp;#39;s into their chicken piccata right now. Cheesecake wise, go for the white chocolate raspberry. It&amp;#39;s so good, it&amp;#39;s delicious but not too rich. You can actually enjoy it. Great food, wonderful ambiance. My only complaint if I had to find one is there&amp;#39;s bad cell phone reception? Haha. But you don&amp;#39;t need your phone at dinner anyway! Great place!", "rating": 5, "date": "8/18/2017"}, {"text": "Cheesecake Factory usually is very good which is why I gave them 3 stars... but I just had the lettuce wraps delivered through Doordash and the lettuce was very dirty, and looked old. The rest of the order was very good, but ended up tossing the lettuce part of the lettuce wrap... that being said, I will be visiting this establishment again.", "rating": 3, "date": "3/8/2019"}, {"text": "Getting seated took a while, as usual for Cheesecake Factory. Once we got seated the service was great! We got our food faster than I expected and the waiter always made sure we were taken care of. You can&amp;#39;t go wrong with the Cheesecake Factory!", "rating": 4, "date": "2/22/2020"}, {"text": "I love the Cheesecake Factory, they have excellent food and the place is usually clean. I gave this location 2 stars because the service is terrible. I came in to eat on way through town and waited over an hour for my food. I decided to give them another try, stopping in on my way through, i decided to order to order to go and I had to wait 30 mins just to put my order in. They need more help on the to-go side.", "rating": 2, "date": "7/6/2019"}, {"text": "The menu at this place is the biggest  I have ever seen in a restaurant.   I kid you not that it has several pages just for the appetizers.  That being said,  there is something for everyone in your group.  The place is very big and is nice plus they do have a bar.  We love the selection of small breads that come out before the meal.  The waiters are professional and effective. The kitchen gets your food out pretty quickly and does well if you have a modification to your meal.  We like to order a selection of appetizers and call it a meal but I have ordered from the menu and have always been pleased.  We also enjoy ordering our cheesecake to go at the end of the mill. The hardest part is picking out one of the cheesecakes from what I perceive that is at least 25 choices.  I would definitely recommend this place as one of the best restaurants in the mall area.", "rating": 4, "date": "9/26/2017"}, {"text": "I will admit I&amp;#39;m not a huge fan of chain restaurants and I tend to stay away from them. When The Cheesecake Factory was one of the few options I had for food delivery, I figured I would give it a try. I was actually pleasantly surprised with the food that was delivered! The egg roll sampler, chicken riesling, truffle honey chicken, and cheesecake were SO GOOD!! I&amp;#39;m so glad I decided to step out of my &amp;#34;chain restaurant&amp;#34; comfort zone with this one :)", "rating": 5, "date": "5/17/2019"}, {"text": "Huge portions and good reliable food. Service was great. Our Airbnb waitress was amazing, patient with us making our way through the huge menu and recommending good choices from it. Will come back again.", "rating": 5, "date": "7/12/2019"}, {"text": "Our bartender, Katie provided the best bar and food service imaginable ... all with the brightest smile and  most attentive attitude. We watched her ensure that all her customers felt special, and her team mates were kept uplifted, as well. She seems very well trained  in customer service at the most professional level. We&amp;#39;d steal her away for our business if we  could!", "rating": 5, "date": "2/8/2020"}, {"text": "Great Service from Dannie .. Prompt, Friendly, and Very Professional.<br&gt;Make Sure You Ask for Dannie&amp;#39;s section. We had a Pricing / Coupon Error and Filinea , The Manager, (hope I spelled her name Right) is a Class Act as she Immediately Apologized for the Misunderstanding  and Took care of it<br&gt;with a Smile .. Very Impressed.... Oh Yeah, The Shrimp Scampi was Just <br&gt;Amazing .. and Lastly .. Don&amp;#39;t order the Hot Fudge Sundae, it is about the<br&gt;Size of a VW Bug.. Huge ... <br&gt;kudos from Big Mama", "rating": 5, "date": "5/17/2018"}, {"text": "This review is based both on quality of food and service. In the last month we have been here twice. Both times we didn&amp;#39;t receive the usual attentiveness we&amp;#39;ve come to expect for CF over the last 10 years(Experiences include SoCal NorCal Seattle and Bellevue).<br&gt;<br&gt;Our cocktails didn&amp;#39;t come until after our meal when they were ordered before, and I expected them to come with our appetizers. And we had to request more drinks, flagging other waiters down just to get help. The drinks never came. And both times my husband said his steak was over cooked and poor quality. <br&gt;<br&gt;Needless to say, we decided to skip dessert not sure if we would get it at all.", "rating": 2, "date": "7/30/2018"}, {"text": "Want delicious food? Go to The Cheesecake Factory! SO delicious! I tried the crispy fried cheese, mac &amp;amp; cheese burger, and white chocolate raspberry truffle cheesecake. My husband had a pepperoni pizza. They also give you warm bread and butter.<br&gt;<br&gt;Here&amp;#39;s my thoughts on the food: the complimentary bread and butter was very yummy! I tried a couple bites and was hooked. I ate too much because I couldn&amp;#39;t help it! The crispy fried cheese and marinara was PERFECT. Seriously amazing. Delicious blend of spices and the cheese was extremely melty, creamy, and hot. No room for improvement, they were just wonderful. The mac and cheese burger was also delicious. The burger itself had great flavor and was cooked well. It was very juicy, which is a must for a good burger. I loved the toasted buns, too. It comes with onions/lettuce/tomatoes etc on the side, but I didn&amp;#39;t put anything on it. I wanted the full taste of the burger. I will say that the strong (but yummy) flavor of the burger basically overpowers the taste of the fried mac and cheese, so it&amp;#39;s not very obvious that you&amp;#39;re even eating mac and cheese too. The extra cheese sauce they drizzle on it is flavorful though, and just having the mac and cheese on it contributes to the juiciness of the whole thing. I&amp;#39;m glad I ordered it because it was a very good burger! But next time if I ordered I wouldn&amp;#39;t bother wasting the calories on the extra mac and cheese since it&amp;#39;s not really that noticeable. It&amp;#39;s more about how good their burger is on it&amp;#39;s own! The fries that come with it are good, but not amazing. The white chocolate raspberry truffle cheesecake was absolutely delicious. I loved it so much. I was absolutely stuffed from the other food and still couldn&amp;#39;t get enough. My husband said the pepperoni pizza was good. Not anything particularly special, though.<br&gt;<br&gt;As far as the service, it was great. The restaurant was busy, but beautiful to look at (if quite darkly lit). A couple of negative things did happen, due to human error. The lady who brought our food to the table accidentally tipped my husband&amp;#39;s platter so that one of his slices of pizza slipped onto her arm. She apologized and they made it up by bringing extra pizza to the table. At the end, our waiter accidentally brought the wrong receipt and we didn&amp;#39;t read it carefully enough, paying an extra $10 for our meal. He stopped us on our way out to apologize and correct the mistake. These things were really no big deal, and the only reason I mention them at all is because I find that in reviews people often find any excuse to be angry with an establishment. We didn&amp;#39;t let silly things ruin our night. We had a great time at The Cheesecake Factory. They brought our food quickly, our waiter was friendly and consistent with checking in, and we of course loved the food. I will definitely be returning to try more things on the menu, because they have something for EVERYONE. Huge menu with every option imaginable. If you&amp;#39;ve never been, it&amp;#39;s time to give it a try!", "rating": 5, "date": "11/17/2018"}, {"text": "I want to give this place more stars because I have eaten at other locations in Ca and been really impressed, but I wasn&amp;#39;t very pleased with my chicken enchiladas. They were okay, but something about the food seemed tired and old and dry. The black beans were the best part of the entree. However, I really enjoyed the fried Korean cauliflower appetizer. The texture, taste, and sauces are delightful. Would return again to try something else since their menu is so enormous.", "rating": 3, "date": "5/24/2019"}, {"text": "I am beyond disappointed with the quality of the cheesecake I received from the Cheesecake Factory today. I ordered the cake for my daughter&amp;#39;s 16th birthday, as cheesecake is her favorite. I sent my husband to retrieve the cake and when he brought it home, not only was the writing barely legible,  but her name was spelled incorrectly, the cake was already sliced (could have lived with that) and there is a large dent in the side. This cake was over $60. I will never order a birthday cake from there again.", "rating": 1, "date": "12/15/2018"}, {"text": "The food is amazing!!! I sat at the bar and Katie C was soooooo sweet and friendly!!! She makes great drinks and gives great menu choices!!!!  I will be back!!!       Krissy!", "rating": 5, "date": "6/8/2019"}, {"text": "I love Cheesecake Factory! I love the food and the desert! My husband and I come for brunch all the time which is always wonderful!  The lemon ricotta pancakes are so good!  The place is very clean. One thing I think that could be improved it&amp;#39;s the silverware . When you get to the table the bare silverware is sitting on the bare table.  And that is a little bothersome for a germ a phob like me haha .  So it would be nice if they set the silverware on a napkin or wrapped it up .  I had tacos last time we came for dinner the fish tacos! They were very delightful  everything came out nice and hot!", "rating": 5, "date": "8/9/2018"}, {"text": "Absolutely appalled by how slow this restaurant is. My wife and I went to Olive Garden for supper then she headed home and I stopped by CCF to pick up dessert and take it home. 2 slices of pie. I was told, &amp;#34;give me a couple minutes and I will have that right out for you&amp;#34;. TWENTY-FIVE minutes later she finally noticed I was still standing there. The problem is, this is not the first time I have had to wait forever for a to-go order here. NEVER AGAIN!!!!", "rating": 1, "date": "6/27/2019"}, {"text": "Great diversity of food. <br&gt;<br&gt;Asian food wise:<br&gt;Love the Shanghai spicy noodle  very favorable. <br&gt;Cashew chicken with rice is great. It is not honeyed sweet version but more like a authentic Chinese style.", "rating": 5, "date": "4/21/2018"}, {"text": "From out of town and had pulled in for a to go order. I ordered a Greek salad.. got to the hotel to unpack a salad that is made with yellowed, wilted lettuce. I ordered it with no onions, it came with onions and zero dressing. None. And none on the side. I had to throw it away. When in Boise I&amp;#39;ll definitely eat somewhere else.", "rating": 2, "date": "4/26/2019"}, {"text": "Typical Cheesecake Factory  Fantastic service, food came quick. (Bread took a while, but it&amp;#39;s fresh, so no complaints ) Platters has way less food than all previous locations we&amp;#39;ve been to. We typically like to save leftovers for a next day meal... first time we&amp;#39;ve had that issue. Otherwise, good stuff", "rating": 4, "date": "5/11/2018"}, {"text": "I&amp;#39;ve always liked this place , the food is pretty great for a chain restaurant . I found out they serve brunch this weekend while we were there . The lemon ricotta pancakes were to die .The hazelnut chocolate cheesecake is insanely good , and Our server ( Jake ? ) was really  great .<br&gt;The bad part is how it gets so hard to hear what the person In front of you is saying when. It&amp;#39;s busy because the outdated music they play over the speakers is so loud it&amp;#39;s deafening. Also it&amp;#39;s claustrophobic when you&amp;#39;re sat in the bar at those low top tables . Feels like like people are way too close for comfort. Other than that I would probably give it five stars .", "rating": 3, "date": "2/26/2018"}, {"text": "We went for brunch and were seated quickly. The front desk person was friendly as was the waitstaff. I ordered the brioche French toast which sounded amazing and the looks of them did not disappoint. However the insides were just to squishy for me. Our waitress handled my request for something else amazingly well and a Belgian waffle was a perfect swap. Sunday morning brunch went off, with just a small hitch that was handled quickly and efficiently. Thank you waitress at Cheesecake Factory for not making me feel bad.", "rating": 4, "date": "2/18/2018"}, {"text": "We&amp;#39;ve been going to the cheesecake factory for probably 20 years now. We moved to Boise a couple years ago and had a good meal here. Since then the food has gone downhill dramatically but the price stays incredibly high. Recently we had an order delivered. Two fettuccine Alfredos neither of which came with garlic bread, and one was filled up about twice as much as the other. Another order included shrimp scampi, which included a few shrimp a tiny mound of angel hair pasta, and the sauce was in a little plastic container. The last was chicken marsala or other chicken dish that my daughter almost refused to eat. Five skimpy meals for $100, and most of the leftovers went in the trash. We will never return or order from cheesecake again. I will add that a month ago we did eat in the restaurant and I ordered a Carne Asada Which was probably the worst meal I&amp;#39;ve ever had in the Boise area. I don&amp;#39;t know if they&amp;#39;ve change the cooks or management but this place has really gone down hill. You&amp;#39;re better off going to a fast food restaurant.", "rating": 1, "date": "4/4/2020"}, {"text": "I have been impressed lately with the menu options. I&amp;#39;m glad they are going to a more healthier menu options. I have discovered their avocado toast. Oh my, it is delicious! I like to add chicken to mine. The amount of avocado they add, they don&amp;#39;t skimp on the portions. I also love their mint iced green tea. The server we had was nice, checked on us several times and my drink was never empty.", "rating": 5, "date": "3/13/2018"}, {"text": "Took my family here while my mother was in town. Had an amazing time...Shane took amazing care of us. He let me try the bloody mary mix before I ordered to make sure it was something I liked. We got warm bread and butter before our meal and ordered the fried mac and cheese and the crab artichoke dip for an appitizer. He offered to walk us through the exstensive menu which includes a wide variety of entrees. All of the entrees we ordered were amazing. Shane boxed up our food for us and our cheesecake. He also boxed up my salmon which I had today and i&amp;#39;d have to say was still amazing. 5 stars to the the host, server, and kitchen. The Cheesecake Factory definatly has an amzing staff and management and I&amp;#39;d like to thank the entirety of the staff for accommodating my family and extended family durring our visit.", "rating": 5, "date": "4/29/2019"}, {"text": "Very slow. We waited for 30 minutes before the waiter came over to take our drink order. The waiter never even came to check on us at all. We had to ask another waiter to get us drinks, to get us boxes, and to get our check when that person wasn&amp;#39;t even our waiter. Food is trash as well.", "rating": 1, "date": "3/22/2019"}, {"text": "I enjoyed my visit for a late lunch. It was a day I gave myself to just enjoy life and I&amp;#39;m so glad I choose The Cheesecake Factory. Their menu is a delight and so hard to choose from, so I choose a nice glass of Sirrah Red wine first to guide my selection. Both the greeter and the server were fabulous which went a long way to making good food taste even better. I finally decided upon the Spicy Caesar Salad and the Fried Calamari appetizer. Both were complimented by the wine I&amp;#39;d ordered and the fresh hot bread with butter on the side. Even though the hour was late for lunch, the restaurant was maybe 25% full. Yet there was a quiet atmosphere in the booth in which I dined allowing me time for reflection. I will be back! I like the design of the restaurant and the chance for an intimate dining experience in most of the seating available. If only I had taken pictures. The food presentation was beautiful, so I just dug in and enjoyed the hard work of the meal preparers. It was all Yummy!", "rating": 5, "date": "1/25/2019"}, {"text": "Keep coming back for the food and not service. Not trying to sound negative but it seems like every time we come in service gets worse. A huge pet peeve is that if you come in at 11am for lunch they will cram you in the back corner with everyone who comes in instead of utilizing the entire restaurant. Today we were given a broken glass to drink out of that was extremely sharp and they did not offer to bring us a new one.  The last time I was given a piece of shrapnel in my sandwich. I love the food here I hope this gets reviewed by upper management.", "rating": 2, "date": "3/3/2016"}, {"text": "Restaurant was clean. All employees were pleasant. Chris, our server, was attentive and efficient!! The food was amazing!!", "rating": 5, "date": "1/14/2018"}, {"text": "Came Here On March 15th, It Was A Group Of 7. Hostess Said It Was An Hour Wait. Which Is Understandable Since They Were Busy And I Had No Reservation For My Family. Once The Hour Past I Asked The Hostess If We Were Ready And She Rudely Said &amp;#34;Um You Have 15 Minutes Left&amp;#34; lol I&amp;#39;m Just Like Okay That&amp;#39;s Fine. We Got Sat, Our Server Robert Cha Was Great! Food Was Excellent. Drinks Were Amazing. Bill Was Like $165 For 7 People Which Was Not Bad, He Didn&amp;#39;t Grat Us Which Amazed Me Since We Were A Bunch Of Mexicans lol So I Gave Him $200. Would Of Been 5 Stars But I Didn&amp;#39;t Like The Hostess Attitude.", "rating": 4, "date": "4/28/2019"}, {"text": "The only restaurant that I&amp;#39;m 100% SURE sent me to the hospital with food poisoning.  DON&amp;#39;T EAT THE RAW FISH!!  Aside from that, the majority of their food, while tasty, is fat- and-calorie laden, unhealthy fare.  Sorry to say, we&amp;#39;ve taken this off of our list of Friday Night Out choices.  <br&gt;<br&gt;NOT recommended.", "rating": 1, "date": "3/29/2019"}, {"text": "I picked up dinner for four. I ordered the meatloaf. When I got home I could hardly believe what I got. Burnt, not charred, burnt both sides. If I cooked this at home I would not have served it and called out for pizza. They got two stars because of how polite the front staff was. The employee who put that crap in my to go box should be fired. I do not feel this is indicative to this corporation but I&amp;#39;m hungry and pissed.", "rating": 2, "date": "1/11/2019"}, {"text": "First night in Boise, decided to go to the Cheesecake Factory. Waited about 20 minutes....well worth the wait! Our server Allyson L. Was fantastic! Courteous, cheerful, honest! She was so busy but made my birthday extra special by going the extra mile!  She even carded me and I&amp;#39;m well above legal age! Thank you Allyson &amp;amp; Cheesecake efor a wonderful birthday!", "rating": 5, "date": "1/1/2019"}, {"text": "Waited an hour for our food. The appetizer we got was crab cakes, which were frozen. When I got my pasta is was completely undercooked. The manager was really respectful after we expressed our complaints, but we won&amp;#39;t be coming back here again for anything but the cheesecakes which are usually pretty damn good.", "rating": 1, "date": "12/30/2018"}, {"text": "We had only been once before, the menu is overwhelming with something like 15 pages and 300 different food choices. Lisa narrowed it down to which pages to look at and the page that was her favorite which we were really grateful for. They were out of the chicken parmesan that I wanted but she was able to manipulate the menu and get me exactly what I wanted. Hands down favorite part of the experience was the service. Lisa was amazing and we will definitely be back just to see her <br&gt;-Madi", "rating": 5, "date": "3/4/2019"}, {"text": "Just like every Cheesecake Factory I&amp;#39;ve been in, this was a good experience.  Always love the atmosphere, the awesome bread, the passion fruit tea and the very good service.<br&gt;<br&gt;  Favorite part of our meal was when my precious daughter in law (who recently had a baby) said it was the best meal she&amp;#39;d had in a long time.  (she had the seared tuna salad).  <br&gt;<br&gt;  That being said, I had the shrimp scampi, herb crusted salmon combo and it was beyond rich.  Is it really necessary to bread and fry the shrimp before dousing it in a ton of butter?  (uh, don&amp;#39;t answer that)...and the potatoes would have done so much better with less fat, also.  <br&gt;<br&gt;  Husband&amp;#39;s fried shrimp was not the best.  I know because I tried it.  He didn&amp;#39;t complain however, as he was busy with his new grandbaby.<br&gt;<br&gt;  Steak-lover in our group seemed pleased with his steak and said it was cooked right.<br&gt;<br&gt;  Everyone agreed that the white chocolate raspberry cheesecake was right as right can be!", "rating": 3, "date": "11/13/2013"}, {"text": "We were staying at a local hotel. After putting babies to bed we sent out for food. The cheesecake part of the Lemon Raspberry cheesecake wasn&amp;#39;t set. Tamale corn cakes had hardly enough sour cream and salsa. No avocados. Pasta was good though.", "rating": 3, "date": "11/29/2018"}, {"text": "You know when... you are at a Great Restaurant when the management has staffed the restaurant with truly great &amp;amp; honest Servers who are looking out for their guests. We are visiting Idaho for the 1st time and what happen is a real great testimony to the citizens of this state.... (we are from Southern California where the outcome would have been different....)<br&gt;My Daughter accidentally left her $200.00 Airpods at the table when we left on 8-14-19. (FYI... the Meals &amp;amp; Drinks were great) Our Server (Her Name is April) picked up the AirPods and turned them into her manager. Since we love CheeseCake we decided to eat again tonight 8-15-19 and April saw us sitting down at another server&amp;#39;s table and came over and told us she had found my Daughter&amp;#39;s AirPods the night before!<br&gt;I had figured the AirPods were lost... never to be seen again... and to have such an honest person come forward and do the right thing was just fantastic! <br&gt;Living in Los Angeles you just don&amp;#39;t see this type of action enough and you get hardened and learn to assume the worst... and get use to ... will i do not need to say anymore..<br&gt;So to the management of this CheeseCake on North Milwaukee in Boise... Great Food &amp;amp; Drinks and you have the BEST Server in Idaho .... and her name is April!<br&gt;<br&gt;Koen", "rating": 5, "date": "8/15/2019"}, {"text": "I love going to the Cheesecake Factory whenever I go somewhere that has one. I took my daughter and she loved it. Our waiter was awesome. We always had full drinks and was always asked if we needed anything else. Plus the food was great. Will be going back when we are in town.", "rating": 5, "date": "10/9/2018"}, {"text": "There&amp;#39;s not a bad thing on the menu. Great service and amazing food. Huge portions and reasonably priced. Favorites include: Steak Diane, Coconut Thai Chicken, and  Chicken Madeira. Cheesecake: Chocolate Hazelnut Crunch", "rating": 5, "date": "11/5/2018"}, {"text": "I had to call twice for a refund on the cheesecake that they left out. Still no refund. Not great customer service and our food was thrown away it was so bad. I cannot believe we aren&amp;#39;t getting our money back. Someone contacted me on here telling me to contact them on their website and again, well over a week with no response. We won&amp;#39;t come back and we won&amp;#39;t let our friends go either.", "rating": 1, "date": "1/4/2019"}, {"text": "Typically I avoid the Cheesecake Factory because it&amp;#39;s a bit overwhelming and past experiences have been unremarkable. However, while visiting family in Boise we decided to go to Cheesecake Factory for lunch since it could accommodate our whole party (12 adults, 5 kids). It was lunchtime but kind of late and in the middle of the week so it wasn&amp;#39;t too busy. We were able to get a table within about 5 minutes. Our party arrived in waves which I think benefited us and the wait staff and kitchen because we all ordered as we arrived and none of us had to wait for our food for a long time. <br&gt;Myself and my mother-in-law have to eat a modified diet and were able to find entrees that worked with our needs.<br&gt;Our waiter was very attentive and great with all of us. He was patient with the kids and the mess we all made. All in all it was a good visit.", "rating": 4, "date": "6/26/2017"}, {"text": "Whoops. Put in the wrong review for the wrong place. Here is an update and the correct review: <br&gt;<br&gt;I have been on the road raising awareness for veterans with PTSD and veteran suicide since November 2016. I walked across America twice and am now on a bicycle for the last 9,000 miles. I was lucky to have been able to eat here. The staff was great and is a true reflection on the management here which I was also able to meet. They are kind and a joy to talk with. I sat at the bar and it was easy to have a conversation with the bartender. I asked what newer things were on the menu and he was all over it. He suggested the pineapple chicken and shrimp. I look over the menu and told him to pick one of the three I saw. He suggested the same dish again. I am very thankful I took his advice! The dish was one of the better dishes I have had in a very long time. Most of the time I can not finish a plate. This was so good that it was all gone before I even knew it! The back of the house did a fantastic job!! I can&amp;#39;t say enough great things about my experience here. You must stop by and try this dish if you are in the area!", "rating": 5, "date": "5/31/2018"}, {"text": "This is our second time in four days visiting this restaurant and both times we were not impressed. We had eaten there for both lunch &amp;amp; dinner service and even though not slammed it took FOREVER to be seated, once seated it took FOREVER to be approached for our drink order or even just an introduction.  My coffee cup had something on the inside of the glass and the salmon with mashed potatoes were drenched in oil, looked ugly to eat and made us sick! The restroom was out of soap on Fri and on Mon it was still empty... coincidence I would have guessed but now I think not! The service was fine once it got going and the cheesecakes are always delish other then that this place has been removed from our list of fav places to eat when visiting Boise.", "rating": 2, "date": "7/8/2019"}, {"text": "Had the crispy fried Mac &amp;amp; Cheese balls and shared a slice of Cinnabon Cinnamon Swirl Cheesecake. Both were absolutely delicious", "rating": 5, "date": "11/18/2018"}, {"text": "I&amp;#39;ve been to the Cheesecake Factory several times and this is the first time I&amp;#39;ve been so disgusted with the service that I&amp;#39;ll probably never go back. When we arrived there was no hostess. The nice young lady behind the bakery counter actually seated us. After 5-10 minutes our waiter finally came to the table. We told him we wanted espresso and the. He informed us that they may have already shut the machines down and he would go check. Another 5-10 minutes passed before he brought water. And informed us it would be a 5-10 minutes wait on the coffee. Then approximately 35 minutes after we arrived he finally brought our espressos and took our cheesecake orders. We only half finished our cheesecake and asked him for boxes. He did box them up and brought them back with our checks. After another 10-15 minutes wait we took our checks to the bartender area to have them process our payments. I&amp;#39;m thoroughly aggravated with the service and will tell all of my family to avoid going there unless they want to have terrible service.", "rating": 2, "date": "9/17/2018"}, {"text": "Horrible service Oscar G 0551..you are as personable as a rock. You didn&amp;#39;t bring the bread we asked for. We waited an hour and forty-five minutes for our food. The chicken was burnt and you only filled our water glasses after you brought us the check. It was a horribly expensive meal...yikes...I will not go back ever", "rating": 1, "date": "11/17/2018"}, {"text": "My husband and I were leaving the mall and decided let&amp;#39;s grab a bite. The weekend before Christmas was crazy and getting out of the mall was more than I could take.  We were sat immediately.  Our server Sara had the personality of oatmeal. She clearly does not like being a server and is less than ambivalent about serving. Ok. Our server and food were cut from the same cloth. Mediocre at best and lacking in personality or flavir. We sent back the guacamole made to order. Spicy means it tastes as spicy as oatmeal. We get it back and it&amp;#39;s still oatmeal. We asked for onion, cilantro and green chillies which we received.  Once we remade the guac. It was better. However I was over the place. My husband thought his martini was OK. So I stated let&amp;#39;s get outta here. <br&gt;<br&gt;Bottom line: go to a diner you will get the same quality in Food.", "rating": 2, "date": "12/17/2016"}, {"text": "Fuck. That&amp;#39;s probably not enough for a review. So, here&amp;#39;s a list of grievances: extremely poor and dim lighting, nearly offensively so. Obscenely slow kitchen. The microwaves can&amp;#39;t all be that slow. Sure, it&amp;#39;s an excessive menu, but really, I could have driven somewhere else, returned with food and eaten it all before the dishes got to the table. Wait staff was solid, but unspectacular, though I will note she tried (and missed) very hard for charming. Points for effort there...kinda.<br&gt;<br&gt;Calamari was ok and so was the Bang Bang dish. It was billed as chicken and shrimp, but what they really meant was a pepper coconut cream vaguely sort of curry sauce, substandard rice, a half-handful of small chicken chunks and 2 shrimp. Joy. The salted caramel cheesecake is probably floating around somewhere in one of those circles of Hell, though the middle part wasn&amp;#39;t totally offensive. This place is also stupidly overpriced and I really don&amp;#39;t know what it is, but the only good locations I&amp;#39;ve been to of these places has been on the East Coast...not sure why, but every location I&amp;#39;ve been to out West has simply not gotten it...if you feel like throwing a pile of money at mediocre junk, here you go.", "rating": 2, "date": "11/30/2016"}, {"text": "Once again disappointed by the service, food, and management at Cheesecake Factory. We decided to try this place again after the first time we didn&amp;#39;t get greeted for 35minutes no waters no bread no anything when we did the waiter blamed the hostess and then when we did get our food my pasta had three different noodles than the ones that were supposed to be in the pasta and my fiancé&amp;#39;s food steal was cold. THIS VISIT... we got sat and greeted fast. We ordered promptly cause we already knew what we wanted to eat. (We are watching our food intake so requested no bread. )We ordered a  medium rare and rare steak... 15min go by our waitress says our food will be right out.... 23min go by still no food. Finally the manager on duty comes by after 25min and says he is sorry our food should be right out, I told him it&amp;#39;s okay we may just leave... he says I would hate for you to leave hungry.... LEAVE HUNGRY I&amp;#39;m thinking?? I&amp;#39;ve been sitting here for almost 30min waiting for a steak that should have taken 6min and 4min to cook.. I&amp;#39;m past being hungry I have to be in work in an hour and a half. We leave before getting our food. Never will I be going back to this restaurant sorry but I will not be disappointed again, love your cheesecake but I will not support a place who can not take care of there guests in a timely manner especially when the restaurant isn&amp;#39;t even full. Did I mention both times we came it was beginning of the lunch shift so it&amp;#39;s not like they are slammed... good luck Cheesecake Factory.", "rating": 1, "date": "4/9/2019"}, {"text": "Came here because of a cravings a family member had. It was fine. a ok. nothing better to say really. their tables are oddly big and its very hard to talk to each other especially since the music is so loud and the atmosphere is so &amp;#34;romantic&amp;#34;. meaning... dark. i hardly saw my menu. i really get upset when its too dark in a restaurant. when I&amp;#39;m hungry i expect to see the menu and the food i get served. Makes me paranoid when i cant see what i eat or if the place is clean. feels like they are hiding something :). The food wasn&amp;#39;t bad. I had salmon with brown rice and they didn&amp;#39;t over cook the fish. no fry sauce. what?! had to explain what it was. Cheesecake was dry, way too sweet and tasted old. fail on desert that supposed to be their signature dish. quite pricey too. big portions.", "rating": 3, "date": "12/1/2016"}, {"text": "Great service, great food as always. Ordered miso salmon and it was awesome. Glad I ordered the lunch portion because it was still a lot of food. Definitely going back on my next visits.", "rating": 4, "date": "7/28/2018"}, {"text": "We come here often for dinner but this time just popped in for dessert and coffee. One of our favorite go-to&amp;#39;s when we&amp;#39;re at or near the mall. They&amp;#39;re always super busy so you can usually expect a short wait. The lemon raspberry cheesecake is always a good stand-by and you can&amp;#39;t go wrong with with carrot cake cheese cake! And they have good coffee too!", "rating": 5, "date": "12/6/2016"}, {"text": "My favorite place to eat! I love to get the chicken carrots and mashed potatoes. They have a wonderful GF menu. They actually have GF dessert that isn&amp;#39;t ice cream. Their portion sizes are very generous. I would recommend this place to anyone.", "rating": 5, "date": "4/12/2019"}, {"text": "Two hours from walk-in to when the food arrived, pasta was cold, congealed and gummy.  Shrimp was overcooked.  Food had clearly been sitting under the lamps, undelivered, for a while.  By this point it was almost 9pm and waiting for new food was out of the question.  All of us took a couple of bites, ordered our cheesecake to go (took another 25 minutes) and left.  $220 bill an everyone left hungry.  Will never be back.", "rating": 1, "date": "12/26/2018"}, {"text": "We are having the best dinner ever and Alan Johnson is by far the best waiter I have ever had. Got the bread right away and the food is hot. Definitely ask for his section..", "rating": 5, "date": "6/10/2017"}, {"text": "My husband ate here last night and have decided we will come back more often for dinners. I ordered the very simple sounding Herb Crusted filet of salmon and was blown away! The presentation was beautiful. The salmon over the mashed potatoes was the top of a jellyfish and the &amp;#34;tentacles&amp;#34; were the asparagus! The lemon sauce made my taste buds sing and I have NEVER had a salmon cooked so perfectly. It was so moist and tender. Kudos to the chef on that masterpiece!<br&gt;My husband had the Chicken Bellagio and that&amp;#39;s what I&amp;#39;m going to get next time I ago. Another seriously top-notch dish! The wait staff was solid (and sported lots of tattoos!) and I love the atmosphere in there. The lighting is gorgeous, in my opinion, although I did notice a nearby customer using the flashlight feature on his phone to read the menu! As always, the cheesecake didn&amp;#39;t disappoint. <br&gt;We will definitely be back!", "rating": 4, "date": "12/3/2016"}, {"text": "I&amp;#39;ve never been to a Cheesecake Factory before, so I&amp;#39;ve never understood the hype. <br&gt;<br&gt;This location is near my office, so my boss recently treated me to lunch here. <br&gt;<br&gt;The staff was wonderful! They were all very friendly, attentive, and quick. It was a gorgeous day, so we opted to sit out on the patio, which was just lovely. <br&gt;<br&gt;The menu was expansive - like, excessively so - but it gave me a lot of options to choose from, as I&amp;#39;m limiting/excluding certain foods from my diet currently. <br&gt;<br&gt;I ended up ordering the Grilled Chicken Lettuce Wraps - Mexican style. YUM! I was a little disappointed with the small amount of chicken in each one, but the flavor was incredible. I could have eaten another plate of them.... or two. <br&gt;<br&gt;It&amp;#39;s a little on the expensive side, which I think will be the only hindrance on future returns. But, I&amp;#39;ll certainly be trying that famous cheesecake down the road..", "rating": 4, "date": "4/11/2016"}, {"text": "The food is over priced and they messed up several of our orders. The staff was great. My brother in law found half a plastic bread tie in his food. A complete accident and I get things happen. Im probably one of the easiest going understanding customers and even I was really disappointed.", "rating": 2, "date": "5/20/2018"}, {"text": "Well, it&amp;#39;s a chain. So you&amp;#39;re going to get the full chain experience. However, the Pasta D&amp;#39;Vinci remains, hands down, my very favorite chain dish. I love the Boise location, the patio is fantastic! Nothing &amp;#34;special&amp;#34;, but, hey, sometimes you just want consistency.", "rating": 4, "date": "12/7/2015"}, {"text": "Still our fav for a few drinks and bs talk old fashion booths make it cool prices high but food still going Steady", "rating": 5, "date": "5/1/2018"}, {"text": "I always enjoy going to the Cheesecake Factory.  Expect to wait if there is a special event (half price Cheesecake day for example) or its a busy Friday or Saturday night.  This wouldn&amp;#39;t be so bad if the lobby had a bit more seating.  Often you have to stand because all the benches are taken.  The servers are usually very friendly.  There has only been one time I can think of where we felt a bit forgotten by our server.  The food is always fresh and flavorful and I love all the variety.  The cheesecake is great but expensive so we don&amp;#39;t always indulge.  Last time we went was half price cheesecake day and it was very busy, waited about an hour to be seated but the hostesses kept us updated and they got me some water while I waited (I was 9 months pregnant) and I thought our server was very attentive.  He made sure our cups were always filled and we had plenty of bread while we waited for our meal.", "rating": 4, "date": "9/17/2017"}, {"text": "We arrived at about 10pm, keep in mind they close at 11. Upon arrival no hostess was present. A nice woman from the bakery/ to go order area sat us at a table. Then after about 5 mins the waiter came over and tried to take our drink order. He tells us that the coffee machine is being cleaned and he would need to check to see if he could even get us coffee. After about 10 mins he returns saying he can and then we order coffee and water which he says will take about 10 mins to make because the machine was being cleaned. About 10 mins later he takes our order for cheesecake. And another 15 goes by before we receive our coffee. After we start eating and decide to take the rest of our cheesecake home he takes 10 mins to box them and give us our bills. Now we wait for 10 mins and he still doesn&amp;#39;t show to process our bills. We had to track down the original woman who was at the bar to help us. He then shows up and processes our bills. Two of us paid with cards and my mother in cash. He then says he has to go find a drawer to get cash from and takes another 10 mins just to get that. Food was good but seriously need to step it up in the service department.", "rating": 2, "date": "9/17/2018"}, {"text": "I have had two really excellent experiences at the CCF recently! The first one, was a delish brunch on Sunday! Peach Bellini + Monte Cristo French Toast. Does it get any better than that? I think not! You have to try the french toast! So delish. <br&gt;<br&gt;I brought my brother and his girlfriend here for a dinner &amp;amp; we had a great time. Our server Isaiah, was amazing! He gets a big shout out. He made our whole dinner experience great. More peach bellinis &amp;amp; laughs all around! Thank you for making our time together even better! We love sitting outside &amp;amp; the food is always great!", "rating": 4, "date": "7/21/2014"}, {"text": "What&amp;#39;s not to LOVE about the Cheesecake Factory? They have a great menu - I had the chicken parmigiana pizza style and of course cheesecake for desert. The staff was friendly and service was great and the food was awesome!! We try to go there every trip to Boise plus it&amp;#39;s right at the mall so walk off the lunch or dinner shopping at the mall.", "rating": 5, "date": "8/3/2017"}, {"text": "I eat here often as the food is delicious and they have great customer service! A few times they messed up my order but they quickly fixed it and took responsibility.", "rating": 5, "date": "2/20/2019"}, {"text": "I just wanted to update. I spoke with the manager Melanie  and she was so sweet! She apologized for everything that happened and made the situation right! Will continue to dine here because for one the food is amazing and for 2 it&amp;#39;s obvious management really does care!", "rating": 5, "date": "1/2/2019"}, {"text": "The Cheesecake Factory has been at the Boise Towne Square Mall for almost ten years now.  My first experience was such that I didn&amp;#39;t want to go back there.  The portions were huge although tasty and it just appeared that mega amounts of food and dessert was the idea here.<br&gt;<br&gt;We&amp;#39;ve been here recently for lunch and ordered from the Skinnylicious menu tasting wonderful salads and flatbreads with a smaller calorie output.  Today we opted for brunch which is only served on Sundays here.  Normally this restaurant opens at 11 AM but on Sundays opening time is 10 AM.  Compared to other popular and crowded breakfast places around here this one was fairly quiet and we didn&amp;#39;t have to wait!<br&gt;<br&gt;Coffee was robust and fresh.  The orange juice was freshly squeezed.   We ordered.   My husband and I shared a Spinach, bacon, mushroom and cheese omelet and an order of lemon ricotta pancakes.  Our son opted for a Chorizo and Avocado omelet.   Egg orders come with sides of fried potatoes and a choice of bread.<br&gt;<br&gt;The omelets were nice and fluffy and we all enjoyed the combinations we ordered.   The lemon ricotta pancakes were thin, almost crepe like  and came with a small carafe of heated maple syrup.  There was a sprinkling of powdered sugar on the plate and sliced strawberries.  I used about a tablespoon of syrup and honestly wouldn&amp;#39;t have needed any since the pancakes on their own were very light, with a touch of lemon and perfectly delicious!<br&gt;<br&gt;When we finished, the server asked if we&amp;#39;d like to see a dessert menu.   It was out of the question---we were full!  I&amp;#39;m thinking that the Cheesecake Factory should change it&amp;#39;s name.   There are definitely so many choices on the menu and healthy ones.   There are even calorie counts listed after the items.  Very helpful to those of us wanting to keep the carbs, fats, and calories under control.   And if you really want a special treat after that----there is always cheesecake!", "rating": 5, "date": "6/11/2017"}, {"text": "After our prior incident and sending the Corp. Office a copy of the Yelp review. AND: After 4 calls I made to them in the last two weeks / Finally a return call today: They made it right and sent their apologies along with an electronic gift card, via email.<br&gt;We hope to go back and have a better &amp;#34;over all&amp;#34; experience!", "rating": 4, "date": "3/19/2014"}, {"text": "I enjoyed eating here with my wife.  The service was awesome thanks Veronica and the food was delicious.  I was so full I had no room for cheese cake!  Also any business that donates to veteran events like this one has are a 5 star in my book!  I appreciate any businesses who supports and continues to support our veterans who have served our country.  I would recommend this place and will keep returning.", "rating": 5, "date": "7/21/2015"}, {"text": "Best food in town, I&amp;#39;ve never had a bad meal. <br&gt;Iwish  seating were more private but it is nice Place besides this issue.", "rating": 5, "date": "2/9/2018"}, {"text": "The food was good enough... the lighting was awful. <br&gt;<br&gt;Not sure why the lighting is so bad. Maybe they forgot to pay the power bill.", "rating": 3, "date": "9/21/2016"}, {"text": "Seated promptly even though it was Black Friday and crowded.  Our server, Lisa C was very knowledgeable with the menu and made some recommendations that we were very happy with.  New to the area, we asked here about living there and she was extremely helpful as to where to live and dine.<br&gt;<br&gt;Tuna carpaccio was very tasty, herb crusted salmon cooked to perfection, stuffed chicken tortillas had great flavor.  I would definitely go back.", "rating": 4, "date": "11/29/2015"}, {"text": "Order food to go tonight. Asked for bread and butter and it didn&amp;#39;t get put in the bag. Ordered fish and chips and no chips. Honestly what a disappointment", "rating": 1, "date": "1/21/2019"}, {"text": "Well, a little surprised to be honest.   Sat at the bar where there are two bartenders and 3 customers.  I ordered a beer and some food.  The bartender did not make up a place setting for me ( which others had and is customary).  Food came quickly as did my drink.  I asked for a bottle beer and a glass.  I had to pour it myself.  No one checked on me.  I had to get their attention for salt/pepper and for a soda.  Plan on getting dessert to go.  Wish they were more focused on the customers in front of them.", "rating": 2, "date": "4/1/2017"}, {"text": "I&amp;#39;m not a fan of this place. <br&gt;<br&gt;I&amp;#39;ve heard a lot of hub-bub about the Cheesecake factory and how great it is butttttt...I don&amp;#39;t see it. The only reason I&amp;#39;m giving it 2 stars is because our server was AMAZING and the Lemoncello cake was really good. But the food was terrible, and so was the seating.<br&gt;<br&gt;I never realized how important it is to be comfortable when you eat until I came here. We were seated in the corner booth closest to the hostess area. Now when I think of a booth I think of comfy, lush seating. NO. It was harder than sitting on the ground. It hurt!!! I had to sit on my sweater in order to stay because my butt AND my back were KILLING me within the first 10 minutes. And I&amp;#39;m only 25 years old, so I cant imagine older folks trying to settle in and have a good meal here. <br&gt;<br&gt;Our server was incredible. He was very attentive and tried his best to help answer our questions about their ridiculously HUGE menu....there are more than 12 pages...and most of them are advertisements...Yup. That&amp;#39;s what I want while I&amp;#39;m eating, to look at advertisements for other places in town. What is this, Las Vegas!? No. It&amp;#39;s Idaho. <br&gt;<br&gt;First we ordered the Crispy Crab wontons as an appetizer. I should have assumed that a restaurant that had everything from Chinese to Mexican would be a jack of all trades and a king of none... The wontons themselves were flavorless and chunky. Not what I look for when I&amp;#39;m eating a cream cheese and crab wonton. The dough was cooked too long so it had a slightly burnt taste too it and it was way too thick to begin with. The sauce was really runny and was not sweet and sour but more of a soy sauce and sweet...not tasty. <br&gt;<br&gt;For dinner I ordered the Pasta Carbonara and a side salad with ranch. My salad came out with the &amp;#34;wontons&amp;#34; and the salad was wet. They had pre-dressed the salad too so all the dressing was runny and the leafs were all soggy...all I kept thinking was &amp;#34;I&amp;#39;m spending $6 on a salad that I could have made for 25cents at home..and it would be tastier.&amp;#34;....sad thoughts. <br&gt;<br&gt;Next....the Carbonara...sigh. What a disappointment. The sauce was like water. I know why they give you a spoon...it&amp;#39;s so you can pick up the milky watery sauce from the bottom of the bowl and spoon it over the pasta...yum...*sarcasm*. The pasta was cooked well but there was no flavor but fat coming through to me. It just tasted horrendous. <br&gt;<br&gt;My friend ordered the Garlic Noodles upon recommendation from our server. YUCK. I was so grossed out by the flavor profile of this. It was like eating the remnants of an old gym sock. Oh and also - if no one tells you, when you order chicken on your pasta, there will be bones. No one told us this. We had some fun with that. :/<br&gt;<br&gt;Again, like I said, our server was great and the cake we ate was delicious. I will go back for dessert, and nothing else. And it will be to-go because the seating there is horrendous.", "rating": 2, "date": "5/18/2015"}, {"text": "Was disappointed at first but they took good care of us! The wait time was long but our waitress made it very pleasant!", "rating": 5, "date": "12/23/2018"}, {"text": "Tonight was our Family&amp;#39;s first time to the Cheesecake Factory.  I was so excited because all I have heard was how good it is. Well, we were seated within five minutes, which was good, the waitress came up asked us for our drinks,  became combative with my husband,  was short with us and seemed like she was irritated with us the whole time because my husband wasn&amp;#39;t ready to order a drink yet. We overheard a manager and waitresses talk bad about another Customer. We were seated by the back till, overheard All the waitress talk bad about their customers, along with the bust boys.  Watched the manager go back and forth with a large amount of keys hooked to her pants, back and forth, stomping like she was a little girl not getting her way. We watched the bust boys take 10-15 minutes to bust a table, and continued to get glared at by our waitress. Then what really tipped it to a bad experience is that the our waitress kept reaching over my husband and he kept smelling her gross, smelly, armpit.  How is that for your food? I always wanted to go but not now. We will never go back and we spent over a hundred dollars with no dessert. The good thing is, food was good.  Give the cook credit where it belongs. Sorry Cheesecake Factory for leaving a bad taste in my mouth.", "rating": 1, "date": "12/16/2018"}, {"text": "I LOVE the cheesecake here so I was disappointed last night when my friend found a hair in her food. We were all pretty disgusted but shook it off and still had a great time. The waiter didn&amp;#39;t offer to replace her food or refund the money when he found out about the incident. It happens, I thought. Unfortunately today while enjoying my leftovers for lunch, I found a coarse, black hair mixed in the herb topping on my herb crusted salmon. Two hairs?!? I am thoroughly grossed out and if I ever return, it will be to get cheesecake to go.", "rating": 1, "date": "4/7/2017"}, {"text": "Came in for dinner with my boyfriend, we started off with mai tais and an appetizer. The drinks were good, (although not too stiff for their 10$ a piece price point). I understand that upscale restaurants often don&amp;#39;t list the prices of their cocktails, but come on.. We are talking about a chain restaurant that shares walls with mall stores. I&amp;#39;d like to see how much I&amp;#39;m dropping on one drink without having to ask. So that was a little annoying, but our food was tasty enough. We had the buffalo blasts app, and I ordered the farfalle pasta with chicken and garlic and my bf ordered the Kobe beef burger with a salad. We both got cheesecake to go and it was decent, but really for how much everything cost us it could have been a bit better. Especially at a place named for cheesecake, lol. Anyways, next time we want to spend nearly 100$ on one meal we&amp;#39;ll go to The Melting Pot or Chandlers.", "rating": 3, "date": "1/24/2015"}, {"text": "Omg...what a great meal. The atmosphere was nice and it allows us girls to catch up. The portions were more than we could eat and we had to take our cheesecake home. We will definitely be going back.", "rating": 5, "date": "9/19/2017"}, {"text": "Food is ok. Service is ok. Nothing great or spectacular. Especially for the price. If you get pasta or any saucy food don&amp;#39;t let them store it for leftovers to take home... you won&amp;#39;t get any of the sauce for leftovers, only the dry pasta.", "rating": 3, "date": "9/10/2018"}, {"text": "We stopped in after a rough day, and they were wonderful!! We had some special requests and they got our order spot on! If you are vegetarian, then this is the best chain restaurant to get a veggie burger. It is not a frozen, processed bun. They make it at the restaurant and it has a LOT of flavor!! Loved it!!  <br&gt;<br&gt;Make sure you enjoy the company of your party, because the building doesn&amp;#39;t have very good cell signal, and you won&amp;#39;t be able to bury your face in your smart phone. Not recommended for blind dates!<br&gt;<br&gt;We told the waiter that they need to get wi-fi, because we couldn&amp;#39;t make our hotel reservations.  He offered to let us use his phone from another carrier. We declined, be were very appreciative of the gesture. <br&gt;<br&gt;Last but not least, don&amp;#39;t leave without some cheesecake.  They&amp;#39;re all good!!<br&gt;<br&gt;P. S. Please let me know if they ever get wi-fi, and I&amp;#39;ll change my rating to 5 stars.", "rating": 4, "date": "6/29/2015"}, {"text": "They made a mistake on my wife&amp;#39;s order by delivering her meal to the wrong table. (It happens, no big deal). The waiter, assistant manager, and manager all apologized, and handle the situation very professionally.  We plan on going back, great food.", "rating": 5, "date": "1/23/2017"}, {"text": "Celebrating family on their last night in town and everyone wants something different. Been thinking of trying the factory for a while and figured this would be a good a time as any. <br&gt;Cheesecake Factory gets a bad rap for a number of things, the first thing being the length of their menu. And yeah, it&amp;#39;s the first thing I thought of when I heard we were going there, and yes it is very very long, but the staff there embraced it. They themselves referred to their menus as novels. Way to roll with the punches there Cheesecake Factory. <br&gt;It was surprisingly busy for a Wednesday night. The food was great and the staff was sharp. The portions were perfect and it wasn&amp;#39;t as expensive as I thought it would be. Over all, I didn&amp;#39;t have a bad time. I actually had a decently pretty good experience. You know this chain, you know what you&amp;#39;re gonna get. It&amp;#39;s the Olive Garden plus ten. Worth at least one shot.", "rating": 4, "date": "1/28/2015"}, {"text": "A restaurant that is a little on the high end but the food and the service never disappoints. The inside is very spacious just a little loud for my taste at times.", "rating": 4, "date": "10/23/2018"}, {"text": "Went in for dinner and ordered the NY steak MR. Steak was cooked well done, server checked about 5 minutes later. Took the steak back, left the mashed potatoes and broccoli for me to eat while waiting for the new steak to arrive. 10 minutes later new steak arrived, I am the only one eating at the table. No apology from manager for a horrible experience. Paid the full price and left.", "rating": 1, "date": "8/11/2018"}, {"text": "So everyone knows I worked at the Cheesecake. The food is great but the Cheesecake is not made here or all restaurants really. They have a factory in California and others where they mass produce then, freeze them and send them out. They are only decorated at the Cheesecake Factory. All the dessert are shipped frozen. It still good food but not fresh desserts.", "rating": 1, "date": "9/29/2017"}, {"text": "Ordered eggs Benedict with grilled chicken and breakfast diced potatoes. When it came the hollandaise sauce was broken and my entire plate was full of oil. The potatoes were undercooked and hard. The chicken overdone and chewy. They did replace my plate and gave me gravy instead. The waiter was nice. I wouldn&amp;#39;t go back.", "rating": 2, "date": "9/29/2018"}, {"text": "We were a group of people and had very good experience visiting the place. Service was quick and food was quite decent for a chain of restraunt.", "rating": 4, "date": "5/18/2016"}, {"text": "Love this food chain. Taste has always been consistent. I&amp;#39;ve been to least five different locations. Ordered same food. They&amp;#39;ve never let me down so far.", "rating": 3, "date": "7/18/2015"}, {"text": "Cheesecake Factory what else can I say? Lol. Everything is massive here from the cheesecake slices, portion sizes and even the menu is massive like a huge book. There menu has so much to offer I try to find something new every time I go. So this time I had the spicy New Orleans pasta. I actually found it last minute boy I was glad o did it was delicious!! It comes with a nicely breaded Parmesan chicken and the sauce is perfect the heat doesn&amp;#39;t overwhelm you/take away from the flavors of the dish. I only ate half I mean you can&amp;#39;t not eat here and not get Cheesecake lol. Our waitress was very attentive and was right on the with the water and even went the extra mile she put our slices of cheesecake in to-go containers so we&amp;#39;d be ready to go and since we only planned to eat half. I ordered the seasonal pumpkin pecan cheesecake-omg that was incredible!! Do yourself a favor grab a slice before it&amp;#39;s gone!! If your looking for a nice night out either for just desert or for dinner this is the place!!", "rating": 5, "date": "11/10/2016"}, {"text": "We came in on a Saturday night, a group of 5 people and were told that there would be a 10-15 minute wait. We waited about 30 minutes and no one ever let us know that the wait would be longer. All we saw was that every one else that came in after us got seated well before us so that was quite frustrating. The manager came out to apologize but didn&amp;#39;t offer any resolution. Not good customer service. HOWEVER, if you can overlook that, the quality of the food was good and our server Chuck had great customer service.", "rating": 3, "date": "11/13/2016"}, {"text": "I had the PASTA WITH SHRIMP AND SAUSAGE. Made with rigatoni pasta, shrimp, and Italian sausage, the generous portion was covered in a rich and spicy marinara sauce that was delicious. Our server was Forest, his customer service was excellent.", "rating": 5, "date": "10/14/2017"}, {"text": "Just finished a great dinner here with my wife. The service was very good and the meal was exceptional! We both had the shrimp scampi cooked in butter and garlic. The meal came with bread and butter and we also enjoyed a dish of chicken pot stickers. Everything was excellent. We were seated in the back where it was very cozy for us. The only drawback was the background music was a bit load and although in or youth we enjoyed the music load, we are seniors and prefer a more subtle and softer music. Other than that, we both love the place. Pricey but the meals were worth it! Of course we will be back.", "rating": 5, "date": "1/20/2018"}, {"text": "Wow, the menu prices are really high now. So, if you think you can go in the appetizer page and find something reasonable, forget it. Appetizers are almost as much as full menu entrees. We ordered the fish tacos and Cuban sandwich. Tacos were okay but sandwich was very salty. Our bill was $31.15. I gave the waitress two twenty dollar bills. She took the money and never came back. A $9 tip? That would be a 30% tip without even asking. I had to find the woman and ask her to bring back the change. Got hit on both ends....high prices and aggressive tip-greedy servers.", "rating": 1, "date": "12/5/2016"}, {"text": "Always too much food but it&amp;#39;s great.  Less atmosphere and better food portions would be my focus.  Sometimes chains get too big and forget their customer service", "rating": 3, "date": "4/29/2015"}, {"text": "I got food poisoning on May 6th because of their pasta. I was throwing up all night and had a severe upset stomach for days that I became dehydrated and had to goto the ER for fluids. Even then, I was off because of how much electrolytes I had lost. That&amp;#39;s the last time I had Cheesecake Factory.. I had the Four Cheese pasta, never again. Prior to this I loved Cheesecake Factory and I&amp;#39;m sure I&amp;#39;ll have it again at some point. Just never that pasta.", "rating": 3, "date": "7/13/2018"}, {"text": "IM OBSESSED WITH CHEESECAKE FACTORY. But seriously, it&amp;#39;s my husband and my favorite place to eat out, despite it being somewhat expensive. My favorite meal is the spicy cashew chicken. It is loaded with delicious flavor. Another good thing about cheesecake factory is the fact that they have huge portion sizes so I&amp;#39;ve always had leftovers. The service is great-- the staff has always been polite and attentive. I&amp;#39;ve always had very positive experiences there.", "rating": 5, "date": "6/13/2017"}, {"text": "I dont go here very often anymore. Its not that its not a good place, because it is. They just took my favorite dish of the menu. My wife loves it here and I know why.<br&gt;<br&gt;The decorations are nice, its clean and the servers that I have run into are super friendly.<br&gt;<br&gt;One thing that I love (I cant recall if its this one or not that does it) are servers that knell down to table level to take your order. I love this. I have only seen 1 restaurant do it. I think it makes servers seem more friendly. <br&gt;<br&gt;There are a lot of places out there that are not clean, the wait staff are not user friendly, and the food is bad.<br&gt;<br&gt;When you find one that wins in all these categories, it makes me want to mark it as a keeper.<br&gt;<br&gt;The only reason I am giving them 4 stars instead of 5 is because they took Carmel Chicken off the menu. <br&gt;<br&gt;Carmel Chicken was like an upscale General Tso&amp;#39;s Chicken. A really bad name for a really excellent dish.<br&gt;<br&gt;Speaking of the menu here, its huge. Its one of the biggest menus I have ever seen. How they pull off keeping so much food on hand and having cook staff able to cook each one so well, I have no clue.<br&gt;<br&gt;I am not a fan of Restaurant chains. But in the case of this place, I cant find any faults with them.<br&gt;<br&gt;I an not much of a drinker, but I do like an occasional cocktail. I have the Pina Colada here and its awesome. <br&gt;<br&gt;Like another restaurant that I wont mention, this place knows how to make one without using a mix.<br&gt;<br&gt;On my last visit, I had the Mac and Cheese Burger. It might sound odd, but you need to have this. They burger is topped with their fried Mac and cheese balls and some of the sauce. The balls are crunchy and cheesy. <br&gt;<br&gt;The burger is charbroiled. Its smoky and flavorful. If I was to give one negative, I would say that the cheese sauce over powers the burger a bit.<br&gt;<br&gt;But then again, its cheese! Is there such a thing as too much cheese?<br&gt;<br&gt;The other down side I will give is that its on the pricy side. The bill for the 3 of us (One of which is a 10 year old) was $40. A stretch if you are on a budget.<br&gt;<br&gt;But in my opinion, this place is worth the splurge. And dont even get me started on their cheese cakes. If you love Cheese cake, trust me, you will want to come here", "rating": 4, "date": "5/7/2014"}, {"text": "Had great lunch with the girls that included my &amp;#34;standard&amp;#34; Miso salmon over mashed potatoes (vs the rice that doesn&amp;#39;t always seem to be right) but the salmon cooked perfectly as usual.  Everyone else&amp;#39;s lunch very good. ..orange chicken with sweet potato fries, Cashew chicken salad (honestly the chicken was forgotten but promptly brought out) the waitress was ok...she had a grenadine explosion on the front of her white outfit (not bad just little spatters) but oddly the rest of her looked kinda dirty..weird..like rolled out of bed and put yesterday&amp;#39;s clothes on. .the apron pretty gross..anyway..food very good just very surprised at cleanliness of waitress (who had no name tag and didn&amp;#39;t announce her name). Thank goodness for the shared lemon raspberry &amp;amp; red velvet cheescake; divine! Made everything right!", "rating": 4, "date": "11/10/2014"}, {"text": "Food is awesome! ALWAYS. <br&gt;<br&gt;What isn&amp;#39;t awesome? Getting charged for a different tables bill and the manager Laurel arguing with me on the phone that she&amp;#39;s &amp;#34;too busy&amp;#34; to get to a POS system and fix it. Heres the best part, gave her my number TWICE so that I could get a call back, and sure enough, Laurel didn&amp;#39;t have enough time to call me back. Call again and spoke to a male manager, and he was AWESOME. Gave me the person to contact. <br&gt;<br&gt;What makes me maddest? Not that the charge is STILL on my card 2 weeks later, not that Laurel has ZERO customer service skills, but that I called corporate TWICE and neither person I left a message for had the time to call me back.<br&gt;<br&gt;Sorry, your food is great, and if your customer service skills were great too... I&amp;#39;d support you. Alas, I&amp;#39;ll eat elsewhere. Since you were too busy to call me back or  refund my money I&amp;#39;m conveniently too busy to give you any of my business. There are PLENTY of restaurants with great food that also have awesome customer service. I&amp;#39;d be empathetic of Laurel if she was even remotely human towards me, but it got personal on the phone and for that I say.. Get rid of her. Do your staff and your business a favor.", "rating": 1, "date": "12/22/2013"}, {"text": "Service is extremely slow no matter what time of the day you come. Lunch prices are a little spendy but dessert is always amazing", "rating": 1, "date": "1/31/2018"}, {"text": "Cheesecake Factory is excellent. Service is outstanding and food is alway on point.  Took the girls today for recognition lunch and they all had cheesecake before their lunch.  So I recommend this to everyone! Cheesecake before your lunch is the key to a great lunch.", "rating": 5, "date": "2/8/2014"}, {"text": "I LOVE this place. The service isn&amp;#39;t always great but their food is amazing! I get the same thing every time, Chicken Marsala. My mouth waters every time. I don&amp;#39;t drink alcohol so often times I&amp;#39;ll get a non-alcoholic strawberry daiquiri, I know it&amp;#39;s all sugar, but sometimes even a drink that&amp;#39;s all sugar is hard to do. I&amp;#39;ve been here for birthday, anniversary, graduation dinners, SO good. Their only flaw I would say is they struggle taking care of big groups sometimes, and they are a little pricey. But for the BEST chicken Marsala in the valley, totally worth it.", "rating": 4, "date": "11/19/2015"}, {"text": "Can&amp;#39;t believe I haven&amp;#39;t written a review for this place yet!! I love Cheese cake factory. The food doesn&amp;#39;t disappoint. I&amp;#39;ve tried so many things and I&amp;#39;m always happy. I come for happy hour at least 4 times a month and dinner at least 2 times a month. I get the cosmopolitan..... get a cocktail with your meal any one is usually good! I had to knock a star because sometimes the service is super slow. I once sat at a bar top and saw my drink that I ordered 10-15 mins ago just sitting at the bar pass dying while other less busy servers were just standing waiting for their drinks. As a server it pains me to watch this. It literally would&amp;#39;ve taken two seconds for one of them to deliver it to us and help their fellow server out. I had to get up and ask the bartender to grab our drinks for us. One bad experience doesn&amp;#39;t take away from this place though. I would recommend sharing a slice of cheesecake (I can never finish one).", "rating": 4, "date": "11/29/2017"}, {"text": "I&amp;#39;d only been here once before (years ago) and was put off by all the huge, meaty dishes. So glad I went back! Their new &amp;#34;skinny&amp;#34; menu has some amazing vegetarian options. I had spring rolls, the pear/bleu cheese/caramelized onion flatbread, a glass of Syrah and of course, cheesecake. It was all delicious.<br&gt;<br&gt;They even brought a baby plate to keep my son entertained while we waited. But despite it being a busy Friday night, our service was prompt. I&amp;#39;m definitely looking forward to going back.", "rating": 5, "date": "4/29/2014"}, {"text": "What you&amp;#39;d expect of an enormous chain restaurant, minus the service snafus.  Appetizer was taken off the check since, well, i didn&amp;#39;t want my appetizer after my meal.  I was more or less pretty pleased having a lunch date here with my little one until my husband texted me, as he was having lunch at Momofuku.  What a buzzkill.", "rating": 2, "date": "7/10/2016"}, {"text": "My husband, son, and I visited the Cheesecake Factory and were unfortunately very disappointed. Our waiter was very friendly but checked in on us way too frequently. So much so that we felt very rushed and a little uncomfortable. Our conversations were constantly interrupted and as we rarely go out to dinner, it was frustrating to have this special time feel so hurried. There were plenty of open tables. I ordered the French Dip sandwich and was surprised to see that for $14, it came on a hamburger bun! My husband&amp;#39;s small generic beer was $6.25. He normally pays $4 at the local brew pub for excellent craft beer. We ordered a piece of cheesecake to go and it was a disappointment as well: half the size of the pieces we saw other patrons in the restaurant enjoying. For $8, I should not have that tiny of a piece especially since this is the Cheesecake Factory.", "rating": 2, "date": "6/13/2016"}, {"text": "Cheesecake Factory is my fallback. We are never disappointed with the food or service.", "rating": 4, "date": "3/3/2016"}, {"text": "I Love This place. It is one of my favorite places. My Ex Fiance&amp;#39; Ashlynn and I would eat here a lot before I lost her in a horrifying Car Accident we were both in 8 Months ago. I try to stop by here frequently even if just for a Slice of Pie. To remember her. The Staff are great and the atmosphere friendly. The first time we came was because we were Fans of the Show the Big Bang Theory. Please stop by during happy hour for half priced Apps.", "rating": 5, "date": "2/20/2016"}, {"text": "The cashier at the bakery did not give one rate about me. I was shocked at my treatment they were so busy I was more like I was just in the way.", "rating": 1, "date": "4/7/2018"}, {"text": "Slowest service ever.  No way that Fish tacos should take more than 40 minutes to come out of kitchen.", "rating": 2, "date": "4/5/2018"}, {"text": "My mom is in town and we were treating her to a special dinner for her birthday. We were told right as we sat down that they were out of most steak and salmon dishes. Ok, no problem. We looked over the menu for a while and finally decided. My husband tried to order the bang bang chicken and shrimp, only to be told they were out of that too. He finally decided on the burrito. We all get our food after a long wait and my husbands burrito was lukewarm. He hated to say anything because we all had our food finally and he knew it would take a while to get it back. Sure enough we were all done with our food before he even got his, which was just the same burrito heated up. We ordered cheesecakes, which tasted great but the coffee we got with it wasn&amp;#39;t even hot. The manager spoke with us and said sorry about the burrito, but that was it. She seemed to have her hands full with a lot of people being upset about the lack of food options being available. I think we should have been offered a discount or something but the waiter and manager honestly seemed to care less. I would definitely avoid this location if you actually want to order food and eat it together.", "rating": 2, "date": "9/16/2018"}, {"text": "The food was pretty good, especially the cheesecake, but the service was awful.  First, there were no reservations in the evening.  When I called three days prior, they told me there were no reservations, but that I should call an hour before our party of 9 was planning to arrive.  When I followed their request, the person who answered the phone was fairly belligerent, telling me that they did not take reservations (which I already knew) and that I couldn&amp;#39;t expect them to save a table.  I tried to explain that I was only following instructions, but they demanded to know who I had talked to.  How would I know?  I talked to the person who answered the phone three days prior!  We arrived at 6:15, weren&amp;#39;t seated until 7pm, didn&amp;#39;t receive our food until 8pm, and had to wait a long time for them to take our dessert order.  It was very noisy, the decaf coffee was stale, the chairs were unsuitable for a long time sitting, the service was slow and sparse.  We finally left a full three hours after we had arrived.  A very disappointing experience.  We&amp;#39;ll choose somewhere else next time!", "rating": 2, "date": "1/26/2018"}, {"text": "We had excellent service by the waiting staff.  And the food was surprisingly delicious!  My girlfriend and I lingered over the cheesecake menu and came away from the whole experience delighted.", "rating": 5, "date": "3/13/2018"}, {"text": "Yesterday my husband and I ate at this location for lunch .. the food was awesome and we had the nicest waiter .. he was super nice .. thank you ..", "rating": 5, "date": "2/25/2017"}, {"text": "The service was excellent, our waiter was very friendly and patient with us. When we had questions he was quick to help with the answers ain&amp;#39;t explaining the menu and giving recommendations. The good was well prepared and made just as ordered. I would come back again just for the service.", "rating": 4, "date": "5/20/2014"}, {"text": "I hate even giving them a 1 Star! I had a day to go on a date with my two year old grandson. After which we were going to the aquarium. I have been looking forward to this date with my little man for a whole week. The waitress took our order and I ordered an appetizer and a meal and asked if she could bring my grandson&amp;#39;s food out when it was ready. She proceeded to bring his food out and appetizer which I did not eat very much of because I was looking forward to my meal. I did not see her again until an hour + later and by then I was really upset and did not want my meal, I was just ready to leave. Sitting and entertaining a 2 year old for an hour + is hard.  When I looked at my clock, I realized i had been there for one hour and 20 minutes and never got my meal and suddenly the waitress showed up and stated &amp;#34;oh you never got your meal?&amp;#34; Ummmm I only had one waitress so if you didn&amp;#39;t bring it to me how would I have gotten it. Miraculously it was almost instantaneously prepared by which point I just wanted to leave. Due to this situation we only got to visit the aquarium for 30 minutes and that was very very frustrating. I am so disappointed in this experience and even after talking to the manager I didn&amp;#39;t feel this situation was resolved. I assume that she saw a single person with a baby and figured I wouldn&amp;#39;t be a good tipper so I wasn&amp;#39;t worth her time. I however am an amazing tipper usually tipping between 25-30% so her loss for making assumptions. I of course will go back because i love this restaurant but not with my grandson and myself as it wasn&amp;#39;t worth the money or time!", "rating": 1, "date": "2/2/2019"}, {"text": "My wife and I stopped in for dessert after finishing dinner at another restaurant.  Strawberry cheesecake hit the spot for me.  My wife had the Smores Cheesecake.  She was given a large portion and was not able to finish it all.  We have eaten dinner here in the past and have always had a great meal and great service.  Our waiter tonight was prompt and friendly.  We will head back soon for a date night soon.  Good job everyone.", "rating": 4, "date": "8/27/2015"}, {"text": "The Cheesecake Factory usually had great food and great service. Today we had neither. The crab bites tasted good but were cold. The spinach and cheese dip was horrible. Too much spinach and not enough cheese. So so bland. The chips were stale. When we sent it back, they didn&amp;#39;t even ask why. Drinks ran and out and getting refills was difficult.  2 stars are because the cheesecake still tastes ok.", "rating": 2, "date": "7/10/2016"}, {"text": "Not my particular style. Went during the holiday season, and why I don&amp;#39;t know.  I don&amp;#39;t care for the mall or the surrounding areas so I think I set myself up for failure with this visit.<br&gt;<br&gt;Service was decent, but nothing special.<br&gt;Food was likewise average, but nothing really stood out.  You would think with a menu as large as they have there would have been something that amazed me.  <br&gt;<br&gt;I know i should give it a second chance, but I just don&amp;#39;t think I can bring myself to it.", "rating": 3, "date": "1/22/2014"}, {"text": "So I have been here twice this week and both experiences were substandard (which is pretty sad considering the price point is mid-high. <br&gt;<br&gt;One of the times, I went in and just wanted a light lunch, so I sat at the bar. The bartender watched me come in and sit down but was talking with someone who was apparently a friend. I waited for ten minutes as she passed by me not really doing anything but chatting. Finally I tried getting her attention by saying &amp;#34;excuse me&amp;#34;, but it took me three times to get her to finally acknowledge me. Then I ordered a salad and a margarita. As I ordered, she rudely AND INCORRECTLY &amp;#39;corrected&amp;#39; my pronounciation of the name of the salad. When my food came, the salad was a little bland (it had very few of toppings described on the menu. The margarita glass had so much ice packed into it that there was hardly anything in there and the whole drink was watered down and covered in condensation.  She also used table salt for the rim. Srsly, you&amp;#39;d think Cheesecake Factory could spring for something better.. <br&gt;<br&gt;The bartender didn&amp;#39;t even wait for me to ask for my bill. She just threw the bill on the counter in a cup. Yes, inside of an empty glass, I kid you not. When I paid cash,  she didn&amp;#39;t pick it up and return my receipt . Essentially, I needed to leave and couldn&amp;#39;t even get my change, despite asking for it; which forced me to overtip against my will. I&amp;#39;m pretty sure that&amp;#39;s stealing. <br&gt;<br&gt;Then, when I was leaving, I went to the cheesecake counter and had a similarly crappy experience. I waited in line to order a piece to go. When I got to the counter, the lady acted impatient and rude. I ordered something out of the glass case and she rung up my order before informing me that I would have to wait for several minutes before they could open up a glass case, put a piece of cheesecake on there, and then hand it to me. Are you kidding me??!?? Instead, she chose to stand around and tidy up, chat with her co-workers and waste my time. Seriously?!?! What the heck?!?! I&amp;#39;ve never regretted eating out more! I paid for an overpriced lunch and also got treated horribly! Just wow! What a disappointment.", "rating": 1, "date": "9/4/2015"}, {"text": "Busiest day of the year. I understand that. But when I&amp;#39;ve waited in line for 45 minutes to just get cheesecake and the guy at the register answers 3 phone calls before helping me - hmmmm. Not good customer service. Then he was rather rude about why he couldn&amp;#39;t give me two pieces of cheesecake for the half price. Taking one home to a friend who is ill in bed. After waiting so long do they really think I&amp;#39;m not gonna just get both pieces and pay whatever price they charge?  As I&amp;#39;m leaving the line for just cheesecake is still out the door. Good thing the cake is so yummy.", "rating": 3, "date": "7/30/2015"}, {"text": "Popped in for a little cheesecake treat and ended up splurging for dinner after Lisa, our waitress told us about some of the delicious dishes here. We were not disappointed! Her service was fabulous, prompt and friendly, and the food was as good as she said it&amp;#39;d be! Overall a great experience and I will definitely be asking to be served by Lisa again!", "rating": 5, "date": "11/11/2017"}, {"text": "Went there with my wife on Saturday and had the Miso Salmon.  It was maybe the best Salmon I&amp;#39;ve eaten at a restaurant and my wife concurs.  Also, the waitress, &amp;#34;Lisa&amp;#34;, was as good as it gets.  She is friendly, listens, and actually understands customer service.  She has recommended the Chicken Stuffed Tortillas, so we&amp;#39;ll go back soon and give them a try.  If she says they are good, I believe it.", "rating": 5, "date": "8/24/2015"}, {"text": "Always great food and dessert is never a disappointment! They have great pizza and Chicken Marsala, the Fish and Chips are also great! I love the Lemon Raspberry, Black Tie Chocolate Cake cheesecake, but the Tiramisu and Lemon Meringue are also delicious! Service is also excellent, always attentive and helpful! I would give 5 stars but the acoustics are terrible and between the noise and music unless you go in on off hours it&amp;#39;s impossible to carry on a conversation with your dining companions without shouting. If they turned down the music it would be perfect!", "rating": 4, "date": "5/16/2015"}, {"text": "This Cheesecake Factory is pretty much the same as all the rest... Beautiful building, good food. Last time I went I didn&amp;#39;t love the server but that happens right? One thing I hate about it is the dark lighting at night, I&amp;#39;d like to be able to see my food a little more. All in all it wasn&amp;#39;t my favorite experience (alright service and bad lighting) but I&amp;#39;ll be back because the food is so good.", "rating": 4, "date": "1/3/2016"}, {"text": "The food was decent, portions were good, the service was slow. The best dish at our table was the spicy chicken chipotle pasta. Expect to spend a lot $$$", "rating": 3, "date": "12/31/2017"}, {"text": "I loved my dining experience at The Cheesecake Factory. My husband and I are from out of state and we don&amp;#39;t have these restaurants close to us, but you can be sure I will be eating in the Cheesecake Factory when I&amp;#39;m close.  <br&gt;<br&gt;Our waiter, Tyler was very pleasant and he seemed to have perfect timing when it came to serving us.<br&gt;<br&gt;The hamburger I had, was scrumptious.  It is so hard to find meats with flavor like when I was young. You could tell it didn&amp;#39;t have preservatives because of the taste. The food was also presented so nicely on the plate.<br&gt;<br&gt;I felt the place was so pretty, too. I&amp;#39;m sure you can tell I was happy with my whole dining experience.  What a treat.<br&gt;<br&gt;I took some cheesecake to go and I&amp;#39;m looking forward to having it later.<br&gt;<br&gt;I must say, everyone on the staff was cordial as my husband and I left also. They said thank you and wished us a nice rest of our evening !  Kudo&amp;#39;s to all !", "rating": 4, "date": "8/24/2013"}, {"text": "Is it a big chainish type place?  Yes.  Would I rather have been dining at an independently owned restaurant featuring an intimate setting and personal service?  Absolutely.  That being said, went to dinner here with a group of six, and found it to be better than I had anticipated.  <br&gt;<br&gt;What I liked:   Firstly, they rock a fine cocktail (If I were rating the cocktails, absolutely four stars--I would definitely stop off here for an after mall shop cocktail sometime).  Not only that, but, my dining companion and I upgraded the vodka in our cocktails from the house to Belvedere and from what I could ascertain were charged very minimally for the more expensive vodka (don&amp;#39;t know if it was an accident?  We each had a few, so the accident was made repeatedly, in that case).  Dinner was decent.  Wasn&amp;#39;t wowed, but wasn&amp;#39;t disappointed either.  I had the Portobello sandwich, which was well made with fresh mushrooms.  The fries were fine (not memorable...but fine).  The cheesecake was delicious.  They have a slew of varieties and offer an ample slice (we had some left over to take home). <br&gt; <br&gt;What I didn&amp;#39;t like:<br&gt;First, our group of six were seated at an overly large round table--seriously, it was so big we could hardly converse.<br&gt;<br&gt;Secondly, our entire section reeked of fish.  So much so, that immediately we unanimously decided NOT to order any fish (ummm...ya smell fish?  It&amp;#39;s not fresh).  <br&gt;<br&gt;Finally, no fry sauce--this is Boise!  Ya gotta have the sauce!<br&gt;<br&gt;Overall:<br&gt;Go for the cocktails, stay for the cheesecake.  Or, like someone else mentioned, their menu is huge so if you&amp;#39;re going in a group with varied tastes, definitely a solid choice.", "rating": 3, "date": "1/7/2009"}, {"text": "They have good gluten free pasta and an astounding selection of food. As with all Cheesecake Factories, I guess if the &amp;#34;GF by request &amp;#34; icon was just a little larger, it would be easier to sort through it all. But I am very grateful that they offer the great selection of gluten free meals that they do. The food was good, but this place has super uncomfortable booth benches. I have not encountered that in other Cheesecake Factory locations. <br&gt;<br&gt;My first order came with my pasta undercooked. They gave me a salad so I&amp;#39;d have something to eat while my replacement meal cooked. When it came it was just fine. The manager made a point of checking on me after I ate to make sure all had worked out. <br&gt;<br&gt;I think the uncomfortable seats and noise level were drawbacks, but the pasta was pretty yummy - and huge portions as well. My remaining gluten free pasta heated up quite nicely for lunch the next day!", "rating": 4, "date": "7/25/2015"}, {"text": "I&amp;#39;m writing this review in regards to the terrible service I received at this Cheesecake Factory location. when our waiter Robert approached us he seemed very solemn and mediocre. he wasn&amp;#39;t excited to be working at the Cheesecake Factory as the waiters usually are. it was very disappointing since I don&amp;#39;t live close to a Cheesecake Factory and I always look forward to getting to dine here when I travel to bigger cities. he didn&amp;#39;t make our experience good he made it mediocre. it just made us feel really blah after we left the restaurant. the food was great as usual but the service we received was not the usual. disappointed.", "rating": 1, "date": "2/21/2015"}, {"text": "Just about what you expect from Cheese Cake Factory, the worse part of this place is the novel I mean the menu you have to read to order", "rating": 3, "date": "1/15/2016"}, {"text": "This has to be the worst dining experience ever at a local Cheesecake. 15 mins wait for a table when many are available but not bussed. Very dirty water glass that was never replaced and a very long 48 mins wait for a pasta and chicken lettuce wrap dish. Unexplainable really, especially when the restaurant is more than half empty at 7:30 on a Thursday night. The manager could have done more than comp my pasta  and my toddler&amp;#39;s mac n cheese knowing that I was tweeting my experience and had mentioned that I wanted to speak with them first, but he didn&amp;#39;t seem to care. Perhaps that&amp;#39;s all they can do because they&amp;#39;re swamped with other complaints at that particular location and previous reviews on Yelp. Since it&amp;#39;s a chain, it all boiled down to service as one should expect consistency in their food, no complaints there.", "rating": 1, "date": "2/5/2015"}, {"text": "We went for lunch and our service was amazing.  The fish and chips were fresh and tasty.  The cheese cake was delicious as well.  Pretty spendy, but worth ever bite.", "rating": 4, "date": "10/23/2016"}, {"text": "Came here for my wife&amp;#39;s birthday. I&amp;#39;ve been to other locations and had a good experience but not really here. The place was pretty empty, yet our server was hardly present and our food took a really long time to cook. Once it was here it was pretty good but not worth what we paid.  Sad to say but we probably won&amp;#39;t be back to this location.", "rating": 3, "date": "12/14/2014"}, {"text": "This is my second time eating at this location.  The food is always good. The complimentary bread was hot and fresh and tasty. Both the chicken dishes we had were tasty and hot. As most people know, the serving sizes at Cheesecake Factory are really large so we had plenty to take home. The mashed potatoes were very good and my mango-lime cheesecake was tops. <br&gt;Staff was nice, frequent check-backs. The wait was a little long, about an hour. But it was Friday night at about 7:30 or 8 pm and should be expected. <br&gt;The only complaints would be that there was limited in-door seating in the foyer and we had to wait outside on benches in March for our table. Also the interior is pretty noisy.", "rating": 4, "date": "3/22/2013"}, {"text": "So yea was pretty crazy tonight but my friend and I wandered into the bar area to try to find an open table there and this kind waiter told us one was coming open! Score. 3min wait ;) then Isaiah? (I hope that was his name... I&amp;#39;m seriously really bad with names...) bartender. Looks 19, haha  ;) he took really good care of us. Funny, attentive, fast, personable. Really made us feel at ease. Didnt feel rushed at all despite how busy it was. It&amp;#39;s been awhile since I&amp;#39;ve had service that good. Haven&amp;#39;t been to the cheesecake factory in along time but I&amp;#39;ll Def be going back! Oh and the lemon meringue cheesecake!  Oh my word heaven!!!", "rating": 5, "date": "7/30/2015"}, {"text": "Simply put, The food was not good. I ordered the &amp;#34;specialty salmon&amp;#34; and it was over-salted and ultra fishy. Their only saving grace is the cheesecake. I will never go here for a meal again but I will surely return for another piece of cheesecake.", "rating": 2, "date": "8/4/2014"}, {"text": "Very dirty. Not sure if this is because of the sprinkler issues just this week or what. My family and I were seated in the second booth as you walk in their door to the left. Our table had NOT been wiped down. There was actually catsup smears and crumbs all over it - I was disgusted. The window and vent were covered in dust and crumbs....<br&gt;<br&gt;After having a great first visit to the WA Square Cheesecake Factory in OR we thought we&amp;#39;d give it a try here. Not impressed. To boot our bill was even more $$$ than OR AND we ordered the same thing..... Not sure why ID would be more expensive than OR.....We were there on 11/22/14.<br&gt;<br&gt;We will not be back... a bit grossed out.", "rating": 1, "date": "11/29/2014"}, {"text": "The food is standard chain restaurant food. I&amp;#39;ve been many times and will probably go again if it&amp;#39;s the most convenient option. However I suggest asking not to be sat in Robert&amp;#39;s section (a tall blonde gentleman). Not only was his service poor but his attitude was abhorrent. He actually got aggressive and confrontational with my husband when his tip reflected his bad service.", "rating": 2, "date": "9/15/2014"}, {"text": "I love coming here!  the service is great and the food was fabulous.  The decor is neat and the bar was very well maintained and open for people to see the bartenders at work.  Bring whoever you want here for good times and good eats.", "rating": 5, "date": "8/29/2012"}, {"text": "Today&amp;#39;s visit was a real disappointment. The food took at least 45 minutes to arrive. They claim to have timed it at 1hr 4 min start to finish. I believe that may have been the time that the waitress entered our order, but she didn&amp;#39;t get it into the system very fast. The burger served to me was completely charred on one side, in 3 pieces hidden under melted cheese. I believe they didn&amp;#39;t want to have to start the order over when they knew it was messed up, so they tried to hide it, but even if that wasn&amp;#39;t the case, the burger was really nasty tasting. The other 3 orders at the table were &amp;#34;delicious&amp;#34;, and our server was very friendly and helpful. I still won&amp;#39;t be going back any time soon because I just don&amp;#39;t have 2 hours to sit around held captive in their restaurant.", "rating": 2, "date": "6/17/2014"}, {"text": "You can always count on the cheesecake factory to deliver a consistently good meal and good service. Even though I almost always order the same item, it&amp;#39;s always delicious.  Regardless of what you order, your meal always starts with their delicious, fresh baked sourdough and black bread; served warm with creamy butter.  My favorite menu item is their Asian chicken lettuce wrap tacos.  The wraps are served in leaves of tender Bibb lettuce, filled with grilled, moist chicken, fresh bean sprouts, shredded carrots, and other Asian components.  My favorite part is the two sauces you drizzle over the top, one a sweet cilantro sauce, the other a sweet soy sauce based sauce.  The sauces are addicting.  Nicely flavored and a perfect addition to the taco toppings. It&amp;#39;s ordered off the light meals section and with the bread is just the right amount of food without feeling too guilty.  Today I splurged and tried their buffalo chicken nuggets.  The nuggets are made in house with a nice crispy batter coating, juicy chicken inside, and a schmear of buffalo hot sauce on top.  Some come skewered on a toothpick with a dill pickle slices, which adds a nice briny contrast, and ranch dressing is served on the side for dipping.  Not only are they delicious, but also a very good value at only $5 for 6 large nuggets, good for sharing as a starter.  Our server was good and offered not only the daily specials but recommendations.  Our food came out quickly, and our drinks were re-filled a couple times, would have appreciated a refill after we finished eating and were still talking, but still good service otherwise.", "rating": 4, "date": "12/16/2017"}, {"text": "Had some friends in town last night and we met them, like we always do, at this place. I usually avoid big chains but I have come to really appreciate the Cheesecake Factory. They have an extensive menu, the food is prepared well, is tasty, served promptly, and is hot. The service is excellent -- they must train their staff extremely well. And the prices are totally reasonable. If anything the weakest part of the meal was the Cheesecake itself. But, as a chain they continue to impress me -- well at least this one place does, I have not been to others. I totally recommend this Cheesecake Factory! [BTW -- as was recently in the press, and the subject of lawsuits, we also experienced the inflated tip suggestions on our bill. We split the bill 50/50 across two credit cards but the suggested tips on the bill were based on the whole amount. Luckily we noticed it at the time and didn&amp;#39;t make the mistake of overtipping. SHAME ON CHEESECAKE FACTOR FOR THIS DECEPTIVE PRACTICE. THERE IS NO POSSIBLE EXCUSE FOR IT.]", "rating": 4, "date": "7/11/2017"}, {"text": "Don&amp;#39;t order the salad and sandwich cuz, hello did you order a sandwich with that lettuce. Foods over priced and I just witnessed one of the table staff lay clean napkins on the floor then on a clean table for set up, that&amp;#39;s nasty. The decor does not scream cheesecake to me,it screams don&amp;#39;t set me under one of those light fixtures, they are scary. I guess next time I will stick to the food court.", "rating": 1, "date": "11/23/2015"}, {"text": "Okay, I LOVE the Cheesecake Factory restaurants. The menu is immense and everything I&amp;#39;ve tried on it is delicious. The atmosphere is great too. Feels very upper class almost. <br&gt;The servers are very knowledgeable and easy to joke around with.<br&gt;My only complaint is that my waitress got my order wrong. They brought me the complete wrong thing. I don&amp;#39;t know what she heard me say...<br&gt;I corrected them and they were happy to bring me what I ordered. Its just annoying to watch everyone else you&amp;#39;re with start to eat while you&amp;#39;re waiting. It&amp;#39;s not going to deter me from returning or anything though.", "rating": 4, "date": "8/30/2012"}, {"text": "The service was top notch and the food was really great.  Had an issue with a drink ordered, but the waiter and manager handled it professionally.  Wait time was a little long, but guess it is to be expected on a Friday night.", "rating": 4, "date": "1/22/2013"}, {"text": "All CF are the same. As I recall, the BTS one has giggly girl servers who should learn how to wait tables and givevattention to diners.  I am selective about where I spend my dining out dollars. CF is average.", "rating": 3, "date": "10/28/2014"}, {"text": "WHY WAS THERE NO CELL SERVICE IN THIS RESTAURANT! Otherwise, food was delicious. I got the chicken salad sandwich and a baked potato soup. Yummy! I also tried the jambalaya, which was so freaking good, better than I&amp;#39;ve ever tasted. A little on the spicy side, but I love spicy! Waitress was super nice and helpful in making my  lunch selection.<br&gt;<br&gt;I got a coffee cheesecake. YUM! Really good, never liked this restaurant so much until now.", "rating": 4, "date": "3/8/2012"}, {"text": "Food is good. Cheese cake is amazing! Service is terrible. We are from California originally and have been to several of the franchise locations there and were always pleased with our meal. The Boise location needs some major help with its service. The good is to the same quality but we have been here five times now and keep giving it another shot in hopes it will get better. Out of the five visits we only got a good server once and the other four were the worst we have had anywhere! One insulted us, another broke glass on our food and didn&amp;#39;t offer to replace it, and the other two disappeared for over forty five minutes. So depressing because I love the cheese cake!!!!!", "rating": 2, "date": "2/23/2014"}, {"text": "Fried grn beans and the seasoned edamame with an iced grn tea! Of course the bread basket and butter brought me in!", "rating": 4, "date": "12/13/2014"}, {"text": "Really nice looking place when you enter and you know they put in a lot of architecture work into it and it shows. I like to keep it simple and end up getting the strawberry cheesecake and it was really good. A lot better than what you get from a convenience store and it is expected from this place. They have a lot of different options when it comes to foods and desserts and from what I&amp;#39;ve seen they put in a lot of work to make everything look appealing to their customers. Perfect place to eat for really any occasion and I highly recommend it.", "rating": 5, "date": "7/9/2014"}, {"text": "Waited 45 minutes for food.  Kitchen staff was incompetent.   Very poorly run and not deserving of the name.  Expect better from this chain.", "rating": 1, "date": "2/5/2015"}, {"text": "Cheesecake Factory always has something to fill your hungry tummy. We sat at the bar and has some appetizers. The service was so amazing. Our server was so nice and even offered me a warm wet towel to clean my &amp;#34;sticky fingers&amp;#34; from my appetizers. I was impressed!!  Potatoes bravas=YUMMMMMMMM!!", "rating": 5, "date": "6/12/2012"}, {"text": "We stopped by on Saturday evening for a small celebration.  Fortunately, a couple of us went there early to get a table.  Over an hour wait, wow ok our plan worked out but we really didn&amp;#39;t want to cruise the mall for an hour until the rest of the party arrived.  As it turned out timing was perfect.  <br&gt;<br&gt;Had the Jamaica Black Pepper Shrimp, potato soup and the 30th anniversary cake.  Fabulous food, exceptional service always attentive and took care of our needs without being intrusive.  Staff also sang a great Happy Birthday.  Only minor thing was I should have either ordered cake or cheese cake.  Didn&amp;#39;t go for the confused desert.", "rating": 5, "date": "2/17/2014"}, {"text": "My daughter and I went to the Cheesecake Factory this past weekend.  We were seated at a table about 3&amp;#34; from a family who was super loud.  I could hardly talk to my daughter right across the table from me.  Right after we sat down I looked around and saw several booths available.  I asked to be moved to a booth so we could visit with each other ... We were REFUSED. I should have walked out, I wanted but my daughter wanted to stay. It wasn&amp;#39;t because we were a table of two as I watched them seat each of those booths with couples.  Forget the Cheesecake Factory ... There are a lot of other places to eat who care about customer service.", "rating": 1, "date": "2/15/2016"}, {"text": "My husband ordered the lemon and herb roasted chicken and it was AMAZING!  The sauce was very tangy:). I ordered sheppards pie, which I had never had before, it was very good:)<br&gt;Make sure you give yourself plenty of time to order as the menu is GIGANTIC!<br&gt;<br&gt;Lastly, but not least, make sure you don&amp;#39;t leave without some cheesecake, it&amp;#39;s amazing!", "rating": 5, "date": "9/1/2012"}, {"text": "had a salad, turkey sandwich, and dessert, they brought me the wrong sandwich but I got it later and the manager comped the my entree.  That was nice of her to do and I thanked her also. The manago key lime pie is the bomb and was the the only memorable thing about the meal.  Nice decor and a nice bar also.", "rating": 4, "date": "8/4/2014"}, {"text": "Received  excellent  service from Cerdaro and Chloe. They were. Both on point. Not only fast, efficient and friendly but had us cracking up laughing.the GM Don made himself readily available, which from my experience is rare. Bravo to Boise cheesecake  factory , I&amp;#39;ve been all over the country and Boise&amp;#39;s  is the best one. And food so good &amp;#34;you&amp;#39;ll slap yo mamma.&amp;#34;.lol", "rating": 5, "date": "2/16/2015"}, {"text": "Service was great!  Food was delicious!  My only wish is that they would have a sampler plate of cheesecake available for dessert instead of having to buy one huge piece.  Five or six small pieces of a variety would be ideal!", "rating": 5, "date": "10/11/2014"}, {"text": "OK, I want to hate Cheesecake Factory.  Chain, giant menu, with ads, in the mall, etc...  I can speak to their brunch that it is quite good.  Their patio is nice and reasonably insulated from the mall parking lot.  I have never had great service, but the service is, well, serviceable.  My last visit a table went unubused next to us for our entire meal, which is bad.  There are better local brunch options in Boise (Goldy&amp;#39;s, The Griddle), but not that you can walk in to any time, get a table and full bar options and have a good meal.  Try the chilaquiles (get extra salsa verde and a lime) and you can split them between any two people with a reasonable appetite.", "rating": 4, "date": "6/6/2016"}, {"text": "My coworkers and I came here for our company Christmas party and the service was great and of course the food was amazing. Gotta get my go-to avocado egg rolls and the baja tacos. Then of course the cheesecake came and I had to take it to go but nonetheless yummy the day after. We played a game out our table and even though we were kinda loud and obnoxious, the employees were having a good time watching us get through it. This is our second year and we love it.", "rating": 4, "date": "12/16/2016"}, {"text": "Excellent service! Our waitress was honest about her likes and dislikes in a respectable way. Tried the Crispy Chicken Costoletta. DELICIOUS!!! Very big portions. Not greasy, not too heavy. Also had the Red Velvet Cheesecake. Another great recommendation. I debated between that &amp;amp; Key lime or Vanilla Bean. I will definitely go back!", "rating": 5, "date": "2/17/2012"}, {"text": "Disgusting.<br&gt;I guess I should add more, but I think that sums it up.  I know, what should I expect, the place is called &amp;#34;the cheesecake factory&amp;#34;, but I went there because I had a gift card.  <br&gt;My wife and I both ordered the &amp;#39;pizza and a salad&amp;#39; lunch.  The salad was okay, about what you would expect for a chain, but the pizza was covered with imitation cheese that tasted like plastic, gross mushrooms from a can, etc.  <br&gt;We should have expected this, as the menu is fifty pages long, and whenever there are that many items on a menu it should be obvious that the place uses non-fresh everything and is marginal at cooking everything.<br&gt;Please Boise, veto this place, it is not what we want coming into town.", "rating": 1, "date": "1/2/2009"}, {"text": "Yes this is just another link of the chain restaurant, the food here is GREAT. The Salmon is one of my favorite dishes - I&amp;#39;m not a big fan of ordering fish that I haven&amp;#39;t cooked myself, but it&amp;#39;s very well cooked (I usually order the barbeque salmon). The only thing that keeps this from being a perfect 5 stars is the price of the wine. Really, you can easily spend about $30 a bottle, so keep your eye out on that. Also, they can&amp;#39;t seem to keep managers for some reason (although it doesn&amp;#39;t really seem to affect the overall feeling of the place). The weekend nights usually bring you over an hour wait, so call ahead and make reservations. Overall, the restaurant is an excellent experience with good food and cool ambience.", "rating": 4, "date": "3/27/2014"}, {"text": "Had a great lunch today. Lindsey was a fantastic server and the food was excellent.  Make a special trip to go to this restaurant.", "rating": 5, "date": "9/1/2014"}, {"text": "It&amp;#39;s not about the cheesecakes, it&amp;#39;s about the sweet corn tamale cakes on the appetizer menu.  OH YEAH.  Fairly good cocktails, be aware entrees will be huge, so &amp;#39;lunch portions&amp;#39; is a good plan. You&amp;#39;ll have a box at the end in any case, really. <br&gt;<br&gt;Seating slow at peak times, which is Sunday Brunch here in Boise. They apparently don&amp;#39;t do reservations after 12pm on Sundays, so if you need a large group seated, have a member go and get on the list. We needed seating for 14 (three were kids) over the holidays, and expected something of a nightmare, but were attracted by the menu&amp;#39;s variety as we knew some members of our party were picky (in various ways, such as being diabetic).  We were actually seated reasonably quickly because we called ahead to warn, sent a representative to wait, and all showed up fairly quickly when they called us. Service good, menu large/extensive, yes it&amp;#39;s a chain, and it&amp;#39;s ridiculously popular here in Boise judging by busyness.", "rating": 4, "date": "1/21/2008"}, {"text": "The Cheesecake Factory is so overrated to me.  It was nice that they brought it to Boise though.  The menu is extensive but I&amp;#39;ve never tried any dish that made me fall in love.  I will say that the apple martinis are really good and plus you have the awesome cheesecakes.<br&gt;<br&gt;However, if you&amp;#39;re going out with a group and no one can decide what type of restaurant to go to Cheesecake Factory would be good.  Everybody can surely find something they&amp;#39;d want to order.<br&gt;<br&gt;For the most part, just go there for dessert and drinks.  Skip the food.", "rating": 3, "date": "1/25/2008"}, {"text": "We&amp;#39;ve been fans of The Cheesecake Factory for several years, originally in Portland, OR area.  This Boise location provided the same menu with good service.  But...we just had lunch there, treating guests, and were very disappointed.  The service was slow, although the server was very nice, and the food was so-so.  The menu has changed, apparently, as some of our favorite items don&amp;#39;t taste like they used to.  [corporate cut-backs?]  Not sure we&amp;#39;ll return to The Cheesecake Factory since the prices are still high but the food quality just doesn&amp;#39;t cut it.  Some complaints: silverware was smeared and spotted, looking not quite clean; one guest&amp;#39;s chopped salad contained browned, tired lettuce, etc.; another guest&amp;#39;s pasta dish tasted as if a lot of sugar had been added (crusted chicken Romano and pasta); and the flies were thick inside the restaurant...I was constantly batting flies away from my food (=ugh!).  The bill was $74 for four of us for a very mediocre and rather unpleasant meal!<br&gt;<br&gt;Got a nice response from a Cheesecake Factory representative (8/12/16) so we tried it again (9/3/16).  Had great service but the food still is not like it used to be.  This time Chicken Bellagio was ordered, a favorite for the past few years, and the chicken&amp;#39;s breading was VERY spicy (hot), which it never was previously.  Two members of our party ordered a pasta dish (pasta with shrimp and sausage) and said it was over-the-hill spicy hot...and one of these people loves jalapeno-loaded foods!  Needless to say, the pasta was not enjoyed or eaten down!  I asked the server if they had had menu changes and he was adamant that they hadn&amp;#39;t (said it might be a cook who was doing some changes...?); but I think he was a fairly new employee at this restaurant.  Even the cheesecake we ordered (four different types) was rather blah, compared to the flavorful selections of the past!  What in the world is going on at The Cheesecake Factory?  Guess we&amp;#39;ll be avoiding this restaurant from now on!  <br&gt;<br&gt;The two stars&amp;#39; rating still stands!!", "rating": 2, "date": "8/11/2016"}, {"text": "Great food and excellent service,my wife and I love a good burger and we did not expect them to be the best burgers in Boise,but hands down their quality meat and perfectly cooked burgers were amazing,makes other local burgers taste like fast food in comparison,highly recommend this place....", "rating": 5, "date": "3/20/2016"}, {"text": "We&amp;#39;ve been to Cheesecake Factories all over the country and love the good.  Portions are quite large so bring your appetite or be prepared to take some home.  I will have to say this particular location in Boise is the friendliest of all I have been too. Our server was was great, friendly and accessible but not overbearing.", "rating": 5, "date": "3/15/2014"}, {"text": "Sat down and our table was sticky and had food all over it and there were CHUNKS of food all over the bench from the previous diners still. Literally we wiped off the bench in front of the hostess who was seating us...clearly she had to of seen all the food on the seats but did nothing. Just watched us wipe it off. Disgusting. Then had to ask them to come wipe our table down again. Waiter forgot to bring my daughters juice until we had to ask 20 min after we all got our drinks and she never got the water we asked for. I also asked for another water since I gave her mine and that took about 25 min to get. Food took forever to get and was nothing spectacular. Ordered my daughter a grilled cheese which was cold when it arrived to the table. Pretty disappointing dining experience. Wish we had gone elsewhere...", "rating": 2, "date": "5/5/2015"}, {"text": "Love &amp;#39;em or hate &amp;#39;em, its everything a Cheescake Factory should be. If you have never been to one, trust me Idaho, you&amp;#39;re gonna love it!!<br&gt;Near the mall. Since its Idaho, there&amp;#39;s free parking everywhere!!!!", "rating": 4, "date": "8/1/2007"}, {"text": "Huge menu. Nice staff good food. No cel service in there restaurant so go here to get a break from your cel and you can really claim there calls never reached you. Nice to untether for an hour. Restaurant is at the mall so you can shop and then refuel. Oh and cheesecake. Oh my", "rating": 3, "date": "5/12/2016"}, {"text": "Had some steak, potatoes, vegetables and it was amazing. Our waitress was AMAZING! She was very friendly, and helpful with the menu. It was delicious", "rating": 5, "date": "4/29/2016"}, {"text": "We&amp;#39;ve been there several times since this location opened. We went last night at about 5 p.m. It wasn&amp;#39;t busy at all and we ordered quickly, but ordered items that weren&amp;#39;t our normal choices. My husband order fish tacos and I ordered the Shrimp Louie. It was strange when the meal came and my husband was given the fish and chips and I got a salad with 6 medium size shrimp down the center. Obviously my husband&amp;#39;s order was just plain wrong, but mine was extremely disappointing. I&amp;#39;ve never had a Shrimp Louie with a few shrimp on top - generally it is a large portion of small, sweet bay shrimp, something for every bite of your salad. To say I was disappointed would be a major disappointment. When we finally caught the waitress to say that not only had my husband order fish tacos, but the fish and chips arrived with only catsup, no tartar sauce, she looked at us like we didn&amp;#39;t know what he ordered. I know that is what he requested because it&amp;#39;s not an item he usually chooses and I was a little surprised to hear it. But rather than apologize for a mistake, she acted like we had hurt her feelings even though he told her that he would eat the fish and chips. He could have requested that she correct the situation, but he chose to let it slide. We actually felt like had this been our first visit, we would have felt that we wasted $40+ for a really lousy meal. We&amp;#39;ve been there plenty of times before, but this could slow our rate of return visits really substantially.", "rating": 2, "date": "2/8/2017"}, {"text": "First of all the staff was amazing. Yesterday I was here at the cheesecake factory. I ordered the build your own omelet with their amazing potato. Sadly the potatos were over cooked and hard as a rock. The waitress noticed I did not eat them after I had said how much I really liked them when I placed my order. She asked what was wrong? I had to tell her they were overcooked and hard as a rock and I could not even get my fork to go through them. She offered to bring more but at this time I was full and did not want a load of potatoes brought to me I was finished with my meal. She tried to provide something else soup or salad but as I mentioned I was full. She said well I will talk to the manager we need to do something about this. Totally her idea. Before I knew it the manager arrived and she even said I saw those they were hard as a rock that&amp;#39;s not how they should be. She had took it upon herself to comp my breakfast for me which I did not expect. I have to say that this aggressive move to make sure I was a happy customer really got my attention. I will certainly be back this was not the norm and their food is amazing and so is the staff.", "rating": 4, "date": "9/27/2015"}, {"text": "What a joke.  Sat for 20 minutes with no server even talking to us.  Manager offered a gift card for a return visit.  Why would we go back when we did not get to eat today.", "rating": 1, "date": "1/4/2015"}, {"text": "Our servers name was Michael. He was very polite, energetic, friendly with the guests. He was very knowledgeable about the menu and attentive to the younger generation. The atmosphere was relaxing &amp;amp; casual. The food tasted great, was perfect temperature and portions were great for the price. Cheesecake is amazing as well.", "rating": 5, "date": "2/21/2016"}, {"text": "Very good place to eat or to bring a date,  food will for sure fill you up. Recommend", "rating": 4, "date": "1/14/2016"}, {"text": "I&amp;#39;m a fan of the bar..been searching for the ultimate lemon drop, they make one that&amp;#39;s a double with a little extra sugar that pretty good and the cheesecake isn&amp;#39;t bad either...", "rating": 4, "date": "3/15/2013"}, {"text": "The food was good, not great.  But in my opinion, the restaurant as a whole is way over priced in comparison to getting great food for less at one of the other many options that Boise has to offer.", "rating": 3, "date": "1/17/2015"}, {"text": "Lunch for 4 on 9/2...  There was a salad (chicken/avocado); spicy chicken on brown rice; something like Tuscan chicken from the skinny menu (which is almost un-American at the cheesecake factory) and huevos rancheros.<br&gt;As typical, service was good; the server (big dude with a thick beard) did a nice job.  Also as par norm, it takes a bit longer than you&amp;#39;d like to get your meal and the floor manager did come around and say...sorry about the wait, your food will be up shortly. <br&gt;The food was typical CCF food, huge portions of well flavored food.  The salad actually looked killer and I would order that next time.  The spicy chicken wasn&amp;#39;t the best, it was the same general&amp;#39;s chicken recipe you get at any local Chinese restaurant...so nothing to knock your socks off there.  The skinny thing looked o.k. and the person eating it liked it and the huevos rancheros looked really good and the person eating it said it was.<br&gt;Good food, nice atmosphere, good service...I would say go there...", "rating": 4, "date": "9/2/2015"}, {"text": "My first review was three stars and I find myself going back on regular occasions therefore I am revising my review to four stars.   They now have a skinny menu that is fantastic!", "rating": 4, "date": "10/16/2012"}, {"text": "Had lunch while travelling, the place was empty for its size, but it took 15 minutes to get a seat, then the service was slow.  The food portions are large, the food is prepared correctly.  The staff needs an education on people skills and the waitress&amp;#39;s and waiters need to tend to the clientele not themselves.", "rating": 3, "date": "4/17/2012"}, {"text": "I always have great service and food here. I know its a little $$$ but you do get a lot of food for the money. I have tried lots of things here and will not grip over any of the food. This is a must go to place.", "rating": 5, "date": "12/15/2011"}, {"text": "Had lunch here with my wife and the food was really good. The server was nice and attentive a little cheesy because it seemed she had all of her lines from a script. But still she was good.The avocado egg rolls Really good. The thai lettice wraps very good as well.Upside down pineapple cheese cake oooh soo good.We will be back!", "rating": 4, "date": "2/15/2013"}, {"text": "I feel like I shouldn&amp;#39;t like this restaurant so much because it&amp;#39;s a corporate chain, but I do!  Consistent food and services.  This is a well trained staff.", "rating": 4, "date": "7/17/2011"}, {"text": "Great place to go with a large group... Wrong!  They will NOT take reservations for large parties! You cannot even call ahead. I asked for a party of 7 tonight at 7. The manager said no. Then they suggested I call to see how busy they are tonight before I come. No, the call will not help with getting a table - it will just let us know how long we will likely wait. They will only help us when the whole party is there. What the heck!  We will go somewhere else at 7 - with a reservation!", "rating": 1, "date": "6/30/2011"}, {"text": "Thanks to a gift card we made it to The Cheesecake Factory in Boise. Our Sunday dinner was pleasantly good. We tried the sweet corn tamale cakes, and they were tasty, a bit mushier than I expected. We had a variety of dishes. From pasta to pizza to sandwiches nobody seemed to be disappointed with a choice. The service was outstanding. The waiter, Will or Bill, made the experience a blast.", "rating": 4, "date": "2/18/2009"}, {"text": "The appetizer was great!!  The avocado spring rolls!  My entree was pretty decent..mahi mahi with a mango chutney all sitting on a huge helping of mashed potatoes.  The decor was almost like a casino!  The staff was decent.  I can&amp;#39;t get that appetizer dish out of my mind though.  Also, a bit pricey.  Too full afterwards...no room for the cheesecake!!  I&amp;#39;d go back for the Avocado spring rolls", "rating": 4, "date": "6/3/2007"}, {"text": "If you are a fan of warehouse-style dining (big open space, loud, busy atmosphere, same food at each location), it&amp;#39;s hard to beat CCF. It had been ages since I wandered into one of this chain&amp;#39;s restaurants, longer still for the food and not the tasty martinis.<br&gt;Say what you will about the food. Yes it&amp;#39;s chain food, and yes it&amp;#39;s probably not the healthiest choice out there. That said, we were pleasantly surprised when our food arrived and it tasted - and appeared - like it had been prepared by someone that actually cared about what they were serving. I&amp;#39;ve been to CCFs in more metropolitan areas, and ones in more chi-chi areas - but Boise&amp;#39;s has them beat in food prep and taste.<br&gt;<br&gt;But what really made the Mrs. and I enjoy our meal was our server - Amy K. It was obvious that she enjoys the fact that her job brings a new set of people to her every hour, and it was very apparent that she sees it as an opportunity to make a new set of friends for that time. She was very helpful, happy to be there, and as our meal went on, very personable and conversational. Not your typical &amp;#34;How you doing, ready to order, how&amp;#39;s the food, thanks for coming&amp;#34; that you&amp;#39;d expect from a place like this. I honestly feel like she really cared about us and our meal, and if we walked in there tomorrow (two months after our actual visit), she&amp;#39;d remember us.  If I owned the place, I&amp;#39;d either put her up front greeting people, or put her in charge of making sure everyone on the floor has the right attitude. Her service quite honestly made the experience better, and is the reason for my writing this review.", "rating": 4, "date": "5/18/2010"}, {"text": "As far as chains go, this is a good one. This was one of the only places open on Christmas eve. We had some wine and an appetizer. Which were good but what we really wanted was the cheesecake. I had a Key Lime Cheesecake and he had a Red Velvet Cheesecake.  We also got two more slices to go.", "rating": 4, "date": "12/28/2009"}, {"text": "Service was really good.  I had the Renee;&amp;#39;s Special.  I didn&amp;#39;t really care for it.  It was mostly salad and soup.  I don&amp;#39;t like the Cheesecake Factory salad anyway because of the bittter greens in it.  The soup was barley...just not my favorite.  The Chicken Salad sandwich was O.K.  I am still giving 4 stars because I know I would have been happy with my regular...the Mushroom Burger.  By the way, drinks are a whopping $2.95.  However, they didn&amp;#39;t mind when I asked for a to go cup.", "rating": 4, "date": "7/17/2013"}, {"text": "Always good never disappointing! Love so many dishes here. A simple favorite is the four cheese pasta.", "rating": 5, "date": "5/18/2013"}, {"text": "Read J.K.&amp;#39;s review and we are staying right near the CCF so we thought we&amp;#39;d give it a try. Our first time at a CCF so we really didn&amp;#39;t know what to expect. My wife had the Shepherd&amp;#39;s Pie and I ordered the Chicken Bellagio. Both dinners were served in a very timely manner and were perfectly prepared. The food was hot and attractive in appearance. The meals were both delicious. And, there is a LOT of food.<br&gt;<br&gt;Now for the real treat. Again, following J.K.&amp;#39;s advice, we asked if Amy was working when we came in. She was and we asked to be seated in her station. We were escorted to a table for two. Amy appeared promptly and is everything J.K. described. We told her about her celebrity status on Yelp and she was quite surprised. After we were seated, it became obvious that there was a party of 10 to be seated right next to us. Amy suddenly appeared and asked if we would like to move to a booth instead. Given my hearing difficulties, that was an offer too good to refuse. She immediately bussed the just vacated booth and moved us over. Everything about Amy is just as J.K. stated. She is a first rate server and a real credit to CCF. I don&amp;#39;t know about any other CCF servers since this was our first visit, but I would love to encounter Amy at every restaurant we visit. Thanks, Amy. And if anyone from CCF is visiting this site, find Amy and clone her. She is truly a treasure.", "rating": 4, "date": "5/28/2010"}]}