{"address": ["65 Regent St", "Salt Lake City, UT 84111"], "monthly_reviews": {"2019": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 3.0], [4, 3.5], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.0], [9, 3.5], [10, 4.0], [11, 3.0]], "2017": [[0, 3.0], [1, 3.5], [2, 3.5], [3, 3.0], [4, 3.0], [5, 3.0], [6, 4.0], [7, 3.5], [8, 3.0], [9, 3.0], [10, 3.0], [11, 2.5]], "2020": [[0, 4.5], [1, 3.0], [2, 3.5], [3, 3.5], [4, 3.0], [5, 2.5], [6, 2.5], [7, 3.0], [8, 2.0], [9, 2.5], [10, 2.5], [11, 3.0]], "2018": [[0, 2.5], [1, 2.5], [2, 2.5], [3, 2.5], [4, 3.0], [5, 3.5], [6, 3.5], [7, 3.0], [8, 3.5], [9, 3.5], [10, 2.5], [11, 2.0]], "2021": [[0, 3.5], [1, 3.5]]}, "reviews": [{"text": "I fell in love with the avocado rolls and now we get Cheesecake Factory as our safe meal whenever traveling. The menu is huge and I&amp;#39;ve often gone to work lunches as a safe option for those with dietary restrictions and just picky eaters! The cheesecake is always great to take home later and you are often too full! Give it a try you won&amp;#39;t regret it. Service is always fantastic as well!", "rating": 4, "date": "12/3/2020"}, {"text": "Rarely do I consider writing a one star review, but this restaurant was certainly a deserving exception. There is actually nothing wrong with the food here, it&amp;#39;s pretty standard and consistent fare for what you would expect at a Cheesecake Factory. <br&gt;<br&gt;The reason for this review, and the lowest rating I could possibly give the restaurant, were the extraordinarily rude individuals we encountered at check-in and throughout the seating process. Goodness, if you have a choice, I&amp;#39;m not sure why you would come here. In addition to simply not caring at all about their customers, one gentleman who seemed to be overseeing the seating even accused us of lying. <br&gt;<br&gt;Thankfully there are plenty of choices and we won&amp;#39;t be back. We&amp;#39;re being diligent as well as forwarding our concerns to CCF corporate in Calabasas.", "rating": 1, "date": "12/28/2019"}, {"text": "We stopped by Cheesecake Factory for my very favorite dessert and it&amp;#39;s not cheesecake surprisingly. It&amp;#39;s their Linda&amp;#39;s Fudgecake! It is by far the best chocolate cake I&amp;#39;ve ever had. Make sure to ask for extra whipped cream! Other great things about Cheesecake Factory is the ambiance and the yummy bread they give you at your table. The menu is very large, but it has something for everyone. This location is great being right near City Creek Mall so you can do some shopping after dinner. The underground parking is free for the first 2 hours.", "rating": 4, "date": "2/20/2020"}, {"text": "It&amp;#39;s crazy that I have been to cheese cake factory numerous times but never felt the need review because none of my experience has been review worthy. And even this review isn&amp;#39;t about what I had ... <br&gt;<br&gt;Lol but what my boyfriend ordered. &amp;#39;Cajun Jambalaya Pasta&amp;#39; ... Oh my the chicken and shrimp was so tender ... Someone please kiss the cook for me!!<br&gt;<br&gt; It was so DELICIOUS and DID I MENTION TENDER!! I ended up digging into his food instead of mine....<br&gt;<br&gt; My &amp;#39;Evelyns pasta with salmon&amp;#39; was good, a little bland, I always love all the veggies, in my opinion it needs some sort of sauce to make the pasta a little more moist. But that Jambalaya Pasta THOUGH!!! and here we are with this review. <br&gt;<br&gt;I just wish that all my future Cheese Cake Factory experiences are as good as my last visit.", "rating": 4, "date": "6/11/2019"}, {"text": "I did not feel safe . I ordered on line well in advance and although there are many staff walking about no one at the on line pick up room and the website response says you have to stand in line for cake . Not well marked for on line when you get there . I finally had to ask the hostess ( actually two ) while three of us in line for far too long and more people waiting for cake notified someone to help us for pick up . We waited again . You go in and out the same doorway vs arranging a pass through or evening outside pick up . You stand in line with Door Drivers drivers . <br&gt;<br&gt;I would not go here again . I&amp;#39;m a Cheesecake Factory fan and they don&amp;#39;t have it figure out in SLC .", "rating": 1, "date": "7/24/2020"}, {"text": "Let&amp;#39;s be honest.. does the Cheesecake Factory even need any publicity? Of course not! <br&gt;<br&gt;Honestly, I&amp;#39;ve never had anything less than a fantastic experience here. What you see here are the beer-battered fish tacos with cilantro lime rice and black beans.<br&gt;<br&gt;If you&amp;#39;ve never been to the Cheesecake Factory, stop what you&amp;#39;re doing and go now. Their menu is a novel but their portions are large and food is fantastic. Don&amp;#39;t leave without a slice of cheesecake!<br&gt;<br&gt;Tip: though the appetizers are wonderful, fill up on their complimentary bread beforehand", "rating": 5, "date": "1/20/2020"}, {"text": "Great customer service and fantastic food!! I absolutely love this restaurant. Five Stars", "rating": 5, "date": "1/5/2021"}, {"text": "More tacos and other things... tacos this time overdone,  no salsa, 2 out of 4 tacos no guac. Had to spread it around. That&amp;#39;s weird. Uhm... this isn&amp;#39;t consistent. The asparagus was burnt char and didn&amp;#39;t taste like asparagus. The other day it was cooked differently and not charred. The steak wasn&amp;#39;t seasoned either but bland. Disappointed this time. <br&gt;<br&gt;Tuna tartare was amazing according to my guy.", "rating": 3, "date": "5/31/2019"}, {"text": "I missed Chicken Madeira in the Seattle CKF for far too long. Drove to SLC for that reason in December. Not an expert in how it should taste like, but I found nothing to complain about. Would order again if back here.", "rating": 4, "date": "1/5/2021"}, {"text": "Ahhh. The Cheesecake Factory. What is there to say that hadn&amp;#39;t been said and said again here, there, and everywhere? I find the decor stunningly beautiful and the menu deliciously expansive--and I mean the food menu. The cheesecake menu variety is off the charts! Everything I&amp;#39;ve ever had at The Factory has tickled my tastebuds in all the right ways--appetizers, entres, desserts, drinks. I&amp;#39;d probably eat here once a week if I could afford it! Remember to get validation when you park in the garage! I&amp;#39;d give them six stars if I could.", "rating": 5, "date": "12/28/2019"}, {"text": "I usually don&amp;#39;t have a problem with Cheesecake Factory, as I love the food. However this time I came during dinner, and was given a buzzer that would alert me when there is a table available. After 30 mins, my buzzer alerted me. I went back in and was called to wait in the area to be seated. However, after waiting for 20 minutes they still haven&amp;#39;t called my name. I talked to the desk and asked them why I haven&amp;#39;t been called. They disregarded my question and only responded to me minutes after. After checking, they told me they had called my name previously. I was certain they hadn&amp;#39;t as I was right by the desk. They blamed me after so I was not happy! <br&gt;<br&gt;However, the food was good as usual. I love the avocado roll starter, especially the dip (My favourite appetiser!) I also love the bread they give you once you sit down. I would definitely recommend coming for the food if you&amp;#39;re ready to spend around 50 for an appetiser, 2 entrees and a cheesecake! (The cheesecakes are my favourite). Just make sure that you come earlier to get a table, and make sure the people at the front desk don&amp;#39;t accidentally skip your name and make you wait for 20 more minutes!", "rating": 4, "date": "4/27/2019"}, {"text": "I absolutely love cheesecake factory! My bad review is for their reservation process! This is the 2nd time they have messed up our reservation. We always call a week ahead bc its usually for a special occasion, and they we had 8 people on the reservation. They told my husband that he had to make 2 separate reservations with 4 per table and they would sit us all together when we got there. The day of our reservation they called to ask us why we had 2 separate reservations....my husband told her that its what he was told to do. She basically said he was lying . That is super unprofessional. They need to figure out their reservation system. Its kind of a joke!", "rating": 2, "date": "10/3/2020"}, {"text": "The last few times that we have eaten here have not been awesome.  The food was just so so and I have ended up with a stomach ache after. BUT this time was delicious!  Everything we ordered was fantastic!  And our waiter was fast and very attentive.   I think I&amp;#39;ll give this location another shot after this visit.", "rating": 4, "date": "10/25/2019"}, {"text": "Oh Cheesecake factory, what a place. I can never decide exactly how much and to what extent I like the cheesecake factory. I&amp;#39;ve determined that it&amp;#39;s a jack of all foods but master of none. Our waiter was super super nice and thoughtful and really helped us enjoy our time there, also the barrista who helped me get my cheesecake, Lindsey Shrum, was also very thoughtful and sweet and you could tell how hard she was working. I honestly love the vibe of the cheesecake factory but I just feel like the food just isn&amp;#39;t up to par with the ambiance. Most of the food here is pretty good but not great and the presentation is usually pretty mediocre. This time around I ordered the lemon ricotta pancakes, a side of potatoes and some orange juice. The pancakes were actually very filling and pretty delicious, the potatoes were pretty normal compared to everywhere else, and I really appreciated that the orange juice was freshly squeezed. I feel like if the cheesecake factory could pick one type of food they would do it very well but since they do soo many kinds only a few of their plates actually end up tasting and looking to the level they seem to want to cater too.", "rating": 3, "date": "5/24/2020"}, {"text": "I&amp;#39;ve visited this cheesecake factory twice now. Both times the staff has been prompt, accommodating, and friendly. The food has been delicious and the cheesecake is out of this world. I&amp;#39;ll be back for sure.", "rating": 5, "date": "12/22/2020"}, {"text": "Came here for my birthday Saturday evening. Was told we cannot have more than 6 per table due to COVID. So we split our groups into two, tables were far apart. As we sat down, a table of 11 were sat right in front of us. Pretty odd. Either they were not following healthcare guidelines or we were not being told the truth. Our server was barely around. We were there for an hour and a half &amp;amp; rushed eating our food because we had plans afterwards. All 12 of us were not happy with the experience. Probably will never go there again.", "rating": 2, "date": "12/14/2020"}, {"text": "My only issue with this particular Cheesecake Factory location is the attitude of the girls at the check-in desk. They treat entry to Cheesecake Factory like you are trying to get walk-in reservations at Atera or Sushi Ginza in NYC. I get better customer service browsing at Louis Vuitton.<br&gt;<br&gt;Every single time I try to get a seat they are uninterested and rude. They are usually pre-occupied talking about each other&amp;#39;s drama or on their personal phones instead of helping customers. Asking for a parking validation is like you are taking it from their personal stash. Major attitude adjustment needs to happen.", "rating": 2, "date": "8/14/2020"}, {"text": "This is a beautiful location. My favorite dessert is cheesecake so I will never have a bad word to say about The Cheesecake Factory (God forbid).  I had the crab and artichoke dip. It was good but next time I think I would request it be served with the soft pretzel rather than the French bread slices as they were a bit tough.  I also had the egg roll sampler. It&amp;#39;s plentiful and diverse. My favorite is the southwest one with the green dipping sauce. I apologize for not knowing its proper name but if it helps, it has a sweet tang to it.", "rating": 4, "date": "10/15/2019"}, {"text": "I realize that with the Covid restructuring you can expect a little bit of a difference but this was extremely unexpected....this is my favorite place and I haven&amp;#39;t gotten to go in almost a year at this point...drove 45min down there to meet a couple friends. We ordered our food, their appetizers came quickly and then our food took almost 45min to come out after that. The bread was stale, my food was so cold it felt like it was in the refrigerator and the sauce I was served with the lettuce wraps was not the chili sauce at all it was a watery teriyaki sauce! my friends basket was burning hot on one side and cold on the other...unfortunately it was the cold food side that was hot &amp;amp; the hot food side that was cold. I couldn&amp;#39;t have been more disappointed with this place and will not make the effort to return. The only saving grace was the pumpkin pecan cheesecake, it was delicious.", "rating": 1, "date": "9/22/2020"}, {"text": "This restaurants deserves a 2. It is modeled to be a 2. Cheesecake Factory is not a bad option, but it&amp;#39;s not a great option. The food is mediocre, the ambiance is mediocre, the cheesecakes are delicious, but not enough to make up for the food. <br&gt;<br&gt;My wife orders the same meal every time and I&amp;#39;m tempted to ordering it as well. It&amp;#39;s the only thing that I&amp;#39;ve had that I could see myself ordering again. The chicken bellagio. The meat is actually fried really nicely, with a tasty arugula salad with prosciutto, on top of a bed of noodles with pesto. It&amp;#39;s simple and good, all the ingredients work. I&amp;#39;ve tried a multitude of players at CF, I&amp;#39;ve friend bang-bang chicken, I&amp;#39;ve tried multiple salmon dishes, chicken piccata, burgers, and pastas. At the end of the day I&amp;#39;m disappointed by the food I&amp;#39;ve gotten. The sauce of the chicken piccata was the worst, it tasted like mayonnaise. <br&gt;<br&gt;The things that save this meal were the appetizers, the great service (even on a holiday) and the cheesecakes. We ordered the fried Mac and cheese balls and they were delicious. We ordered the chocolate hazelnut cheesecake, and the mango key lime cheesecake. They were really good.<br&gt;<br&gt;I know it&amp;#39;s not going to happen but I actually think the Cheesecake Factory could be a great franchise if they removed 175 items from their menu. The menus is over 20 pages and there are over 250 items. Slim the menu down and focus your food.", "rating": 2, "date": "2/19/2020"}, {"text": "The food was fine and the waitress we had was great.<br&gt;The hostess or whatever her job is at the front was very disrespectful and bitchy. <br&gt;She had told us it would be a 30-45 minute wait and that time passed. We went to check &amp;amp; we weren&amp;#39;t even rude or upset or anything- but she gave the ugliest look and with so much attitude said &amp;#34;I told you 45 min TO AN HOUR!&amp;#34;<br&gt;Well, you obviously don&amp;#39;t need us to come back. <br&gt;La comida estaba bien y la camarera que tuvimos fue genial.<br&gt; La anfitriona o lo que sea su posicion en el frente fue muy irrespetuosa y malintencionada.<br&gt; Ella nos había dicho que sería una espera de 30-45 minutos y ese tiempo pasó.  Fuimos a ver y no estábamos ni rudos ni molestos ni nada, pero ella nos dio la mirada más fea y con tanta actitud dijo: &amp;#34;¡Te dije 45 min A UNA HORA!&amp;#34;<br&gt; Bueno, obviamente no necesitas que volvamos.", "rating": 3, "date": "7/1/2019"}, {"text": "Cheesecake factory is located at the City Creek  center.  <br&gt;<br&gt;We walked in there was a 25 min wait for a table but open seating at a bar. <br&gt;<br&gt;Of course we sat at the bar :-)<br&gt;<br&gt;Bartender Devin was very nice and efficient    great customer service<br&gt;<br&gt;We ordered the breakfast burrito as usual the portion  was huge.  Thank baby jesus we shared it unfortunately neither one of us were able to finish our portion<br&gt;<br&gt;Cheese Cake factory delivered as usual", "rating": 4, "date": "12/6/2018"}, {"text": "My go to for any gathering, date night, or just after a day shopping. Everything you are craving could be satisfied within the menu. Healthy options as well. Of course the cheesecake never disappoints!!", "rating": 5, "date": "10/1/2020"}, {"text": "Not Impressed from the first part of house i see very poor Hostes Customer Services  the service was good but also should have checked to make sure the silver ware flatware i got was not filty like it was so did have to flag someoen else down for new flateware  the flatbread pizza i had was hit or missed like every other slice had mozeralla and basil on it sorry but that is something that each cut should have one of each on it not every other  the host didnt even seat me just said down that way is a open table lol", "rating": 1, "date": "8/30/2020"}, {"text": "Cheescake was a little dry but other than that everything was perfect. Y&amp;#39;all gotta order rice cheescake, it&amp;#39;s the best", "rating": 5, "date": "2/25/2020"}, {"text": "This place is pretty straightforward good food, however, every time I come here, I leave feeling like its never worth the way too long wait. They really need to do something to remedy the 1-2 hour, plus, wait every single evening. More often than not, we attempt to eat here, change our minds because of the long wait, and end up finding a better, yummier, less crowded restaurant. Though, if you&amp;#39;re down for the wait and really need that cheesecake, this is the place for you.", "rating": 4, "date": "11/4/2019"}, {"text": "Good thing we have kids that like Cheesecake Factory. Good thing said kids don&amp;#39;t have to pay at Cheesecake Factory. Otherwise I could never justify paying such inflated prices for what they offer. This location is nice and all but can&amp;#39;t get past the crazy prices they charge.<br&gt;<br&gt;I guess the fact that we keep going back and paying for their food means they&amp;#39;ve got us (and others) figures out.", "rating": 2, "date": "6/24/2019"}, {"text": "This is seriously the BEST restaurant ever! If you haven&amp;#39;t been to a Cheesecake Factory before you are truly missing out! This places menu is so huge, so before you come in, come in with a mindset to be decisive otherwise you&amp;#39;ll spend too much time going through this! I&amp;#39;ve tried so many different things here, I&amp;#39;ve never had a bad dish!", "rating": 5, "date": "5/3/2020"}, {"text": "Considering the week I visited it was Young Living Convention week in Salt Lake City and there was about an extra 35-40k people in the area. They were very helpful with wait times and the big party we had. The service was was slow at times but completely understandable due to the crowds there at the time.", "rating": 4, "date": "10/1/2019"}, {"text": "We came midday for a slice of cheesecake. The slices are a decent portion size and over 1,000 calories each, so we ate half and took the rest home for later.<br&gt;<br&gt;Tried the low-carb cheesecake with fresh strawberries... blesch. Cheesecake isn&amp;#39;t a low-cal food, so either don&amp;#39;t eat it or suck it up and get a regular because the low-carb I had was dumb and gritty. Not worth the saved calories/carbs.<br&gt;<br&gt;The S&amp;#39;Mores chocolate mousse middle is delightfully creamy and rich with flavors.<br&gt;<br&gt;Check out the confetti slice! If you need cheering up, that one will do the trick!", "rating": 4, "date": "6/26/2018"}, {"text": "Service always good. Food options endless, food quality was good. Got on list and was actually seated faster then told.", "rating": 5, "date": "8/7/2020"}, {"text": "The male manager that night was a power tripping douche bag. Just trying to comply with their stupid rules for the bf&amp;#39;s bday party and he too busy threatening to cancel our rezzie because my ridiculous mask was moving while we were talking. Chill dude. Food was fair as usual, our server worked hard but I&amp;#39;ll likely never go there again if I can help it.", "rating": 1, "date": "11/9/2020"}, {"text": "Amazing food!!! Keep going back to this place tho the line is normally crazy and we always have to wait to get in.", "rating": 5, "date": "7/26/2020"}, {"text": "Everytime I go to the cheesecake factory I always plan or waiting to get seated. For a Friday night that was just what I did. And that was totally fine. And the menu is always overwhelming. But everything is usually great. But tonight...<br&gt;Slow slow service. I got the lasagna verde and it tasted microwaved, my husband got the orange chicken and it was AMAZING and of course the cheese cheese is always great. The bread was never refilled  and was slow to refill our drinks.", "rating": 3, "date": "7/20/2018"}, {"text": "Cheesecake Factory, a solid place to go when you&amp;#39;re either 1. in the mood for cheesecake, 2. it&amp;#39;s Sunday in SLC, or 3. you&amp;#39;ve got a big group and want lots of options.<br&gt;Kind of pricey.<br&gt;They have good bread. Had the Chicken Bellagio recommended by the server, great dish, but if you&amp;#39;re looking for something with big flavor, you might wanna try something else. My sister goes here a lot and gets the Grilled Steak Medallions.<br&gt;There&amp;#39;s so many options for cheesecake it&amp;#39;s beautiful. Out of the ones I&amp;#39;ve tried, Mango Key Lime is a consistent winner. Fresh Banana Cream Cheesecake is probably a close 2nd. Oreo cheesecake is good too, but I&amp;#39;m a sucker for anything with Oreos.", "rating": 3, "date": "6/4/2018"}, {"text": "Stopped in here yesterday with family.  Was not disappointed .Went to Cheesecake Factory all the time in California and this is the first since I moved to Utah.<br&gt;Service was great and food delicious as always. I had the chicken lemon piccata, my favorite! Family had a lunch salad (ha ha, it was huge!) and spaghetti and meatballs.  We all loved our meals and had to take some of it home as it was more than we could all eat<br&gt;Wish this restaurant was closer, like Farmington or Ogden.", "rating": 5, "date": "9/16/2019"}, {"text": "Amazing service employees go out of their way to serve you. The wait for food is long however the quality of the food outweighs the wait time.<br&gt;<br&gt;Our waitress was amazing and helpful the menu items were amazing the restrooms were clean and well maintained.<br&gt;<br&gt;Overall from start to finish was flawless and amazing.", "rating": 5, "date": "1/19/2020"}, {"text": "Don&amp;#39;t try to go for a special occasion.<br&gt;They ONLY take reservations for 6 or less, WHAT???<br&gt;I made a reservation for 8 people on Yelp, a week prior to my daughters 16th birthday. <br&gt;The morning of, they text and say they cannot honor it. More than 6 people.<br&gt;Its too HARD to move a table to accommodate 8 people. <br&gt;TERRIBLE policy, DUMB policy. <br&gt;They just like for their customers to WAIT.", "rating": 1, "date": "8/18/2019"}, {"text": "December 24 2017 Sunday - 3:45 PM for Linner (Late Lunch and Early Dinner together)<br&gt;<br&gt;3 Adults and a teenager<br&gt;<br&gt;Atmosphere - 4 stars<br&gt;Food - 4 stars<br&gt;Service - 5 stars<br&gt;<br&gt;Background - The plan was to shop for board games at the shopping center and find dinner.  Well the shopping center was closed so we went to dinner early.<br&gt;<br&gt;Atmosphere - A very grand looking Cheese Cake Factory<br&gt;<br&gt;Food<br&gt;  Drink - I had the Uinta Cutthroat Pale Ale.<br&gt;<br&gt;  Appetizer - Avocado egg rolls, they were tasty.<br&gt;<br&gt;  Linner - Stuffed chicken tortilla, my basically said it was enchilada without the sauce.  The meal also came with two corn cakes and black beans.  The black beans were a miss for me.  Loved the corn cakes but they were small, could have had four of them.<br&gt;<br&gt;Service - On point.  My garage parking ticket was validated at the hostess station as I left.  The garage gate was open so I did not need worry about it.<br&gt;<br&gt;Future - Sure.", "rating": 4, "date": "12/26/2017"}, {"text": "The service is always great here but the wait is not. I&amp;#39;m pretty boring and get the same plates every single time. The menu overwhelms me a bit, so it makes it easy and I&amp;#39;m never disappointed. If you haven&amp;#39;t tried their Avacado Eggrolls you have not lived! Their Pumpernickel bread is to die for! My meal is one of the best salads I&amp;#39;ve ever had, The BBQ Ranch Chicken Salad and its huge! For a cocktail the Pineapple mojito!", "rating": 4, "date": "2/23/2020"}, {"text": "Update: decided to give them a second chance for my birthday, and it official, we won&amp;#39;t be going back. I ordered the Thai lettuce wraps and all the lettuce was browning. They barely put any sides. Maybe three little pieces of pickled cucumber. My daughters spaghetti was SO spicy. Even for us adults. And the piece of cheesecake was TINY. We ordered it for pickup so there was no getting them swapped out. We&amp;#39;re done with this place. I&amp;#39;m so sad. It used to be awesome, I don&amp;#39;t know what happened. <br&gt;<br&gt;Food was amazing as always, even though the place was packed, the wait wasn&amp;#39;t bad at all. The reason for the low rating is for two reasons. Our waiter WAS SO SLOW. And just didn&amp;#39;t seem to care about his job. He didn&amp;#39;t write our order down which is fine, except he got it wrong. And my husband spent half the time picking onions off his tacos. We didn&amp;#39;t want to send it back because we didn&amp;#39;t want to wait another half hour on our food. We also didn&amp;#39;t get our bread, that we asked for several times, until after our food came. Also, the restrooms were FILTHY. And they didn&amp;#39;t give an option for paper towels, just the gross Dyson hand dryers which breed bacteria. I think this is the last trip to this location.", "rating": 1, "date": "6/1/2020"}, {"text": "The wait was 45 minutes to get a table but Holly and Jessie were set on dinner at The Cheesecake factory so we waited. 30 minutes later we were seated. <br&gt;I split the Madeira chicken and shrimp scampi combo with my daughter Becca and it was fantastic. <br&gt;The bread was also delicious. <br&gt;Our server was prompt and attentive. <br&gt;I will be back.", "rating": 4, "date": "1/9/2018"}, {"text": "I hate to give way any of my trade secrets, but I will because I love The Cheesecake Factory significantly more than the masses, and I think Yelper criticism stems mostly from the long waits. <br&gt;<br&gt;Here it goes: If you want to go to The Factory, and don&amp;#39;t want the lines you&amp;#39;ll often find, come for Sunday Brunch. We arrived today around 10:30 a.m., were greeted by a near-empty parking lot and a zero minute wait. That&amp;#39;s right, all the yummy CF offerings, none of the crowds or noise.  <br&gt;<br&gt;To me, The Cheesecake Factory is the only national chain that is a Jack of All Trades, Master of ... All Trades. <br&gt;<br&gt;They make great Saturday and Sunday Brunch-specific meals. I love the Green Chilaquiles with carnitas, slow-cooked pork (you can also choose chicken), roasted Poblanos, cilantro, tomatillo chile sauce, sour cream, cheese, onions, and corn tortillas. Their Monte Cristo is amazing .. the Monte Cristo is my favorite sandwich and only a few places in town make it right. The Factory&amp;#39;s is my favorite. And the Fried Chicken and Waffles Benedict ... a Factory original mashup of poached and Hollandaise-covered poached eggs with deep-fried chicken strops on top of a Belgian Waffle. And their maple-butter syrup ... man, I could drink this glorious stuff.  <br&gt;<br&gt;On our most recent brunch, we cheated a bit and ate off of their lunch menu. We started with the Egg Roll Sampler: Crispy Cuban (AMAZING, my favorite!), Firecracker Salmon, Tex-Mex, and Avocado. They make epically good egg rolls.  <br&gt;<br&gt;For the main course, I got the Crispy Pineapple Chicken and Shrimp. It&amp;#39;s a little sweet, a little savory, and a lot of yummy. My wife got the Chicken Parmesan &amp;#34;Pizza Style&amp;#34;: Breaded chicken covered with marinara and cheese; it has a big serving of angel-hair pasta with creamy Alfredo sauce.  Both are awesome, but my wife&amp;#39;s Parm has the advantage of being real filling ... the lucky girl gets another meal out of it.  <br&gt;<br&gt;Oh, yeah, they make cheesecake! Faves are a matter of personal taste, but I&amp;#39;ve never had one that is meh or bad. I love them all, but the ones that have a special place in my heart are Adam&amp;#39;s Peanut Butter Cup Fudge Ripple, Reece&amp;#39;s Peanut Butter Chocolate, Craig&amp;#39;s Crazy Carrot Cake, Tiramisu, and Peppermint Bark. <br&gt;<br&gt;Again, go for Sunday Brunch ... a relaxing way to enjoy The Factory.", "rating": 5, "date": "10/15/2017"}, {"text": "At 3pm I tried to make a reservation for 7 people for Friday night at 6pm. I understand that is the prime time for people to go out. They told us it would be a 4 hour wait until they could get us in after 6pm which is basically closing time! It was for a big graduation celebration, so disappointing ):", "rating": 1, "date": "9/25/2020"}, {"text": "I know the covid-19 craziness has changed how restaurants have handled things, but tonight was far less organized than a month ago when we came last time. <br&gt;<br&gt;Previously we called and had food brought out to the car, and it was a smooth process. Tonight was a joke! The line was backed up out the door and around the corner, mixing door dash pickups with online/call in orders. We waited a half hour past our promised pick up time and finally got our food. <br&gt;<br&gt;This location does not have the capacity outside to handle this many cars, and the pickup was understaffed and chaotic.", "rating": 2, "date": "5/9/2020"}, {"text": "So me and my hubby made a reservation at 7:30. We get there and check in and the receptionist says it&amp;#39;ll be a 5-10 minute wait and theyll text us when theyre ready.. So we&amp;#39;re like cool. Then 30 mins go by and  we figured it got super busy or whatever. Then and hour goes by and we are tired af. Whats the point of making a reservation if you&amp;#39;re going to wait that long. So i go insjde and speak to the front desk lady and she says she thought she ping&amp;#39;ed everyone and somehow our message didnt go through  oh and also by this time it was about 8:40pm and they close at 9pm. We felt super rushed to leave and our waiter brought us cocktail menu&amp;#39;s and then when we were going to order a cocktail it was too late to do so.. just not a good experience all around. ‍‍definitely the food was not worth the bloody hour and half wait...", "rating": 3, "date": "7/23/2020"}, {"text": "This location was pretty good, but not perfect. <br&gt;<br&gt;When we entered the restaurant the dessert line and the line to be seat down meshed. The lines were indistinguishable from one another. Many customers were confused where to stand, and there were A LOT of people. The entrance was cluttered. I suggest roping the lines and putting up some signs, so people know where to go. <br&gt;<br&gt;It took us five minutes to be seated. I had a party of 3. It was late on a Saturday night. We ordered the veggie burger, impossible burger, and old-fashioned burger. The veggie burger and impossible burger were not in stock, which is ridiculous. In fact, MOST of the burgers were out of stock. I understand that the weekends are extremely busy for this restaurant, but whoever orders the ingredients should already know that and should plan ahead. <br&gt;<br&gt;So we ordered different burgers. While we were waiting, we were given French rolls/bread that were tasty. The meat from our burgers was tender but cooked thoroughly; We ordered the meat to be well cooked.  It wasn&amp;#39;t over cooked. The bread of the burgers was soft but didn&amp;#39;t fall apart. The salad that came with our burgers was fresh. Everything was fresh and made well. <br&gt;<br&gt;Our waitress was incredibly sweet. I can&amp;#39;t remember her name, but she was kind! I gave her a $20 tip.", "rating": 4, "date": "7/1/2019"}, {"text": "They said they accidentally forgot about our reservation. We waited an extra hour to be seated.", "rating": 2, "date": "9/26/2020"}, {"text": "This used to be my go-to place to eat. I came here a few nights ago for my anniversary, I order a gluten free burger and specified twice very politely that it really needed to be gluten free (bc they had messed up the last two times I came in). The gentleman brings out my death burger so I asked if it was gf and he said no can&amp;#39;t you just take the bun off?.. So as usual they offered me their gross side salad. Then to really top it off we found a baby cockroach on our table. <br&gt;<br&gt;p.s they used to have a GF coffee and cream cheesecake but now they only have one and it&amp;#39;s way too chocolatey to me.", "rating": 2, "date": "10/23/2019"}, {"text": "I just got to this place. So far I&amp;#39;ve been met by some of the most rude, arrogant hostesses ever. I&amp;#39;m really not sure if they actually want business because they are so full of themselves. &amp;#34;We are only seating parties no larger than 5 people&amp;#34;. Hmmm seems quite discriminatory on the surface for any family larger than 5. They then tell you it will be even longer if you divide into groups. They were surprised when I took their tracking device. It was almost as if they expected their discriminatory practices to deter me from eating at their restaurant. I hope the food somehow makes up for the sheer rude, discriminatory behavior. I doubt that it will though. These kind of behaviors leave the door wide open for competitors to offer a superior product and service. I for one hope that the Cheesecake Factory has their a** handed to them on a silver platter.", "rating": 1, "date": "12/19/2019"}, {"text": "Omg. My kids just waited over 2 hours to pickup their take out order and even thought they had a confirmation they didn&amp;#39;t have their order <br&gt;DO NOT ORDER FROM THIS PLACE", "rating": 1, "date": "4/10/2020"}, {"text": "They have great cheesecake and lemon drops.  The entrees are over-priced.  Service was a little slow.  No reservations.  I would go here a hundreds times for cheesecake and lemon drops but eat dinner somewhere else.  Parking was a nightmare.", "rating": 2, "date": "2/6/2020"}, {"text": "Their Shepard&amp;#39;s pie is the best! I ordered through DoorDash and I had my food within 30 mins and it was so good and still warm to eat!!", "rating": 5, "date": "12/17/2019"}, {"text": "The wait time is absolutely ridiculous. We were here for 3 hours. Yes three hours before a show. We came 3 hours early so we would have time to eat. Each time we approached the front desk they increased the time by another 20 minutes. We had to order their soups which took another 15 minutes to get to us. I doubt we will ever go back.", "rating": 1, "date": "12/7/2019"}, {"text": "I love the Cheesecake Factory! We made a reservation and only had to wait like 10 minutes which was awesome. The only negative things is all of the portions were smaller including our appetizer. With our meals being on the more expensive side you just expect the portions will stay the same. Still delicious though and the cheesecake is always perfect!", "rating": 4, "date": "8/31/2020"}, {"text": "Doesn&amp;#39;t everyone love Cheesecake Factory? Besides the wait, the food is always worth it. Quick tip is to hit up the bar area if you don&amp;#39;t want to wait and have a smaller party. For starters, the brown bread is insane. For meals, we&amp;#39;ve tried so many and never really been disappointed. The flatbread pizza (with honey) is good! Chicken costeletta and four cheese ravioli are some of our go tos. Lettuce wraps, and pot stickers are great appetizers and I&amp;#39;m not a fan of cheesecake so I typically skip on the dessert, which is fine because I&amp;#39;m stuffed by that point anyways!", "rating": 4, "date": "11/21/2019"}, {"text": "I&amp;#39;ve only been to a cheesecake factory twice.  The menu was very daunting the first time and I felt intimidated. I also felt the portions were so huge.  I came back with my in-laws while we were waiting to take them to the airport.  There were 7 of us and we were seated pretty fast, less than ten minutes.  Everyone enjoyed their food and the service was great.  I will say that I&amp;#39;m giving only 4 stars because at the end of my sister in laws sandwich was a hair.  It happens and she was basically done so it wasn&amp;#39;t a huge deal, but still not great to find in the middle of your sandwich.  My husband loved his kale and salmon salad, ate the whole bowl! I got the farfalle pasta with chicken and roasted garlic.  I thought it had great flavor and I loved the peas and carmelized onions so much.  The pancetta and tomatoes were also nice.  I wasn&amp;#39;t a fan of the mushrooms, but I have a hard time with mushroom texture and the pieces were big.  I just picked around them so no big deal.  I loved that I could get a lunch size, even with that size I couldn&amp;#39;t finish it all so I have some nice leftovers.  I do wish they allowed for a half/lunch portion available always because even though it was smaller it still was a lot and much more manageable for me and it left no room for cheesecake.  I felt the wine menu was decent.  We will definitely check this place out again.  I wanna try the brussel sprouts because the description sounded scrumptious! Just know that this place seems pretty popular and there were tons of people dining and waiting.  It was kinda hard to leave the restaurant. I still think it&amp;#39;s worth the crowd", "rating": 4, "date": "12/28/2019"}, {"text": "Great atmosphere but a little loud when busy. Almost endless choices on the menu! Really busy when concert or event at Galavan center! Tons of kinds of cheesecakes, deserts, and drinks! Must come at least once, then your hooked.", "rating": 5, "date": "8/7/2019"}, {"text": "If the bathroom is any indication of what&amp;#39;s in their kitchen then run! One word FILTHY, two words F*Cken Filthy!", "rating": 1, "date": "2/29/2020"}, {"text": "Always great food.  If it&amp;#39;s not right, they will make it right.  Great customer service.  Try the Bang Bang Chicken and Shrimp - Incredible!", "rating": 5, "date": "1/31/2020"}, {"text": "It was easy and convenient to make a reservation online.  Once we arrived, we were greeted and given a virtual copy of the menu to look over while we waited.  When our table was ready, we received a text and enjoyed an absolutely amazing meal.   I wish everything was this easy!", "rating": 5, "date": "7/31/2020"}, {"text": "When i moved here in utah from california, I was happy to find out that there is a cheesecake factory near at my place. Same menu.", "rating": 5, "date": "1/20/2020"}, {"text": "The cheesecake here is of course, unbeatable.  But the food is much too overpriced for the quality.  Had a burger here recently and I&amp;#39;ve had better burgers at a fast food joint.   Clever plating can&amp;#39;t compensate for a thick, juicy burger that&amp;#39;s seasoned well, with fresh pickles and onions and sauces.   The fries were also &amp;#39;cute&amp;#39;, but boring.", "rating": 3, "date": "1/30/2020"}, {"text": "We had a wonderful lunch, best one so far in Salt Lake.  Agent 940 took great care of us.  The Avocado and Chicken salad was wonderful, shared the lunch serving with the Combination pizza.  Should have ordered the lunch size, ended up with 1/2 to go.<br&gt;<br&gt;Staff was welcoming and friendly.", "rating": 5, "date": "7/9/2018"}, {"text": "I always take my family from out of town. My go to order is the Falafel Salad and lemonchello cake.", "rating": 5, "date": "1/24/2020"}, {"text": "Worst experience at a Cheesecake Factory ever.  Waited over and hour to be seated, went through 4 items on the menu that were all sold out until we found one, food took almost an hour and it was cold.  Never again.  Avoid this one.", "rating": 1, "date": "12/9/2019"}, {"text": "the cheesecake factory is one of the better chain restaurants out there and has been one of those places that I&amp;#39;ve been going too since I was a kid. i&amp;#39;ve been to multiple locations in multiple states, and the food is always consistently good, and the cheesecake here can&amp;#39;t really be matched anywhere else. <br&gt;<br&gt;we ate here last night for dinner with a group of 9, one of the only downsides to this place is the long waits. my friend who works across the street arrived at 8 and was told that it was anywhere from 30 minutes to an hour of a wait. the rest of our group arrived at 8:30, we waited outside until 9 then were finally called in. we ordered fairly quick, but we didn&amp;#39;t get our food until 9:45, everyone was starving at that point so everyone at pretty quick and ate nearly everything. <br&gt;<br&gt;i ordered the shrimp bistro pasta which included battered shrimp, mushroom, arugula, and spaghetti noodles in a butter cream lemon sauce. it was tasty, but definitely not the best thing I&amp;#39;ve tried here. my husband ordered the jambalaya shrimp pasta and said it was just alright, it wasn&amp;#39;t as spicy as he&amp;#39;d hoped. we split the celebration cheesecake for desert, it was good but didn&amp;#39;t really taste like a cheesecake, more like a boujee birthday cake. <br&gt;<br&gt;overall, I&amp;#39;ve never been disappointed in a meal here, it can get pricy pretty quick, but it&amp;#39;s usually worth it more times than not!", "rating": 4, "date": "8/3/2018"}, {"text": "I went here for my birthday for some family nostalgia. The employees are helpful and happy. Lighting is dim and annoying at times but you get over it once you try the food. Mock tails for kids and cocktails for adults. Great service great food endless menu. Love this place. Would come again.", "rating": 4, "date": "1/19/2020"}, {"text": "No words can really describe what my wife went through. We were lied to over and over about being seated and then once we were seated our food was cold and had hair in it. <br&gt;<br&gt;Very disappointing!", "rating": 1, "date": "8/10/2019"}, {"text": "Tried to get a reservation and called them. The girl had no comprehension of what I was asking. I told her 4 adults and 5 children. Said it couldn&amp;#39;t be done. Tried to do it on line. Said only up to 6. So we went there to split up our tables and then they said &amp;#34; oh we can sit up to 10!&amp;#34;  What the hell!!!! Then say it is a 3-4 hour wait!!!!! When I called in the first place they couldn&amp;#39;t sit us and only a half hour to hour wait. I have worked in the restaurant business and I will tell you .... that is NOT how you treat customers. You try to accommodate. And not sound stupid!!!! They just lost a huge party that was gonna spend a lot of money!!!", "rating": 1, "date": "7/10/2020"}, {"text": "Amazing service. Great food. Took my fiance their as a birthday lunch. Made reservations on Monday December 30, yelp was excellent at reminding me about the reservations. The server we had was beyond amazing, our drinks were never empty, she was great friendly aand attentive.", "rating": 5, "date": "1/2/2020"}, {"text": "Back at it again with 5 stars. I love this place. I go pretty often and it&amp;#39;s just one of my favorite restaurants I can say. Yesterday I went with my brother and aunt. The service was quick, considering a Tuesday night at 6. It was awesome we were seated quickly and our waiter was so amazing. I can never complain about the service. <br&gt;Now for food, I have to first mention... I LOVE THE BREAD here ! Like ugh, yesterday it came out so fresh and warm. I always want to eat like 5 loafs but the portions here at the Cheesecake Factory are huge so if I ever ate that much bread, I can forget about the entree lol. Now onto the real stuff. <br&gt;<br&gt;My brother got the lemon chicken I believe. The portions came out nice with potatoes and a side of veggies. His chicken looked great. He told me that it&amp;#39;s a great burst of flavor in every bite. So if you&amp;#39;re a chicken lover. This would be a good choice, as long as you like lemon too. <br&gt;<br&gt;My aunt got the pasta carbonara, but with shrimp instead of chicken. She really enjoyed it. Finished the whole thing faster than me and my brother eating. She said it was flavorful and the amount of food was more than enough. <br&gt;If you love pasta, this is a good one to try. <br&gt;<br&gt;I got the skinnylicious enchilada. Which I&amp;#39;ve had before, and I love. It&amp;#39;s low in calories but tastes just as great. The side salad it comes with is just wonderful. I absolutely love the cheese and the amount of chicken they place in each one. I think it&amp;#39;s a good healthy dinner if you&amp;#39;re not looking for a basic salad. It&amp;#39;s a must try. <br&gt;<br&gt;We didn&amp;#39;t try cheesecake but I&amp;#39;ll have to next time cause it looks so great! I&amp;#39;ll be back again !", "rating": 5, "date": "3/15/2017"}, {"text": "I drove out from Ogden to Cheesecake Factory for my Birthday... I made an appointment for 7:30 and called when I was getting off the freeway saying I was going to be 5 minutes late. The lady told me I could be 5 minutes late and be okay... I show up at 7:35 EXACTLY. They told me it was too late and it would be 1 hour and 30 minutes to get a table AT LEAST. I find it hard to believe that being there right at 7:35 would inconvenience anyone working there or anyone waiting for a table. ESPECIALLY if the wait was an hour and 30 minutes. Way to be Cheesecake... thanks for being understanding.", "rating": 1, "date": "6/27/2020"}, {"text": "The Cheesecake Factory at City Creek is hectic with lots of people everywhere. We had to wait 70 minutes for a table. You can technically walk around while you wait, but that&amp;#39;s still a long time. Besides the wait time, the food is good. There are plenty of food options. It definitely caters to every taste bud. My favorite dish would be the Miso Salmon. Any of their cocktail drinks are tasty too. I like their food, but for how overwhelming and popular it is it&amp;#39;s something I wouldn&amp;#39;t choose myself. I go anytime a friend or family chooses the restaurant for their birthday. Their prices are on the higher side as well. I always spend about $35+ by myself. Special occasions only for me due to overall experience.", "rating": 3, "date": "3/2/2019"}, {"text": "The Cheesecake Factory is a great place to go for dinner lunch or simply a snack. The wide variety of different foods on their menu shows how pleasant and enjoyable  your visit can be. The service is fast and the host is very quick to make sure you are seated promptly.", "rating": 5, "date": "12/17/2019"}, {"text": "Nothing special!  The wait is disgustingly way too long in Utah.  Not impressed one bit.", "rating": 1, "date": "12/10/2019"}, {"text": "Wasn&amp;#39;t too happy to come in and find out there was no complementary bread. The Cheesecake is so famous for that wonder bread they serve while customers wait for their main meal and sadly management did absolutely nothing to compensate nor replace it.", "rating": 3, "date": "12/8/2019"}, {"text": "We heard all the hype, but it didn&amp;#39;t live up to it. My wife had the chicken tacos - they were good but the accompanying rice and beans were flavorless. I ordered the famous meatloaf - the meatloaf was burned on one side (you guessed it, the side that was down) and I couldn&amp;#39;t taste anything but char. On the bright side, the mashed potatoes were delicious. The corn was terrible though. I sent back my order. When my wife was done eating and I still didn&amp;#39;t have my food, I told them to cancel the order. At that point, I would have assumed the meal might have been comp&amp;#39;d - wrong. I was offered a free piece of cheesecake. So, ~$24 after arriving, my wife had some good tacos. Very unlikely to return. JC", "rating": 1, "date": "6/7/2020"}, {"text": "its been a year or so since we&amp;#39;ve eaten here and we felt like it was a completely different restaurant and experience. The quality that the restaurant used to have just isn&amp;#39;t there and it makes you wonder how they&amp;#39;re staying in business. Definitely won&amp;#39;t be returning. Why? Who wants *brown* avocado egg rolls? The chicken costaletta looked so sad and boring and it tasted the same. The chicken was rubbery and there was very little sauce that used to punch. Oddly, the only thing that was savory of this whole meal was the mashed potatoes. <br&gt;the service was fine, ambiance was typical...the food just sucked and unfortunately we&amp;#39;ll be letting others know to spend their $100 for night out elsewhere.", "rating": 2, "date": "11/6/2019"}, {"text": "We showed up for dinner and were seated quickly but sat for 15 minutes and no one came to our table. We got up to alert a bus boy to help us and then the waitress showed up. We ordered water and a drink. Then waited 5 more minutes and no one came back. Then the waitress came to the table behind us with a piece of cake but did not even bring our water or drinks. At this point we got up and walked to the hostess stand told the manager who expressed no concern and no apology.  We went to Tuscan Brio.  Now enjoying a fabulous meal.  I still like cheese cake factory and go to the one near me in California. It&amp;#39;s now September so I&amp;#39;m moving the starts up to 3.", "rating": 3, "date": "9/3/2019"}, {"text": "This place is one of our favorites to eat! I am not a fan of pineapple, but the pineapple upside down cheesecake is to die for! Amazing food, amazing service, you really can&amp;#39;t go wrong here.", "rating": 5, "date": "12/8/2019"}, {"text": "Food was okay. Service on the other hand was seriously lacking. Dylan, our server, practically ignored us almost the entire time. Our drinks sat empty more than 3/4 of the time we were there, to the point we repeatedly had to ask for the one refill we got. And then when he actually did bother to come by he was obviously not paying attention, my husbands salad was wrong, my sons drink was wrong and when we asked him to a switch it, he said he would have to charge us. God only knows what kind of sauce he brought with the cheesecake we got to go, it definitely wasn&amp;#39;t the strawberry sauce it was supposed to be. My steak was undercooked. It was a huge disappointment and honestly quite ridiculous. We typically go to the fashion place location and absolutely will go out of our way to go there rather than the city creek one from now on. Even though he was one of the worst servers I&amp;#39;ve had, anywhere, we still tipped him almost 15%, as he grabbed the check he dramatically shook his head and was obviously annoyed with what he got, well bud, if you want a better tip, DO YOUR JOB BETTER.", "rating": 1, "date": "2/2/2020"}, {"text": "Thoroughly disappointed with my take out order - Ordered a $19 salad and they forgot the avocado and the lettuce was browning. The 1 piece of bread they provided was rock hard and inedible. Completely unacceptable from a restaurant that charges so much.", "rating": 1, "date": "5/11/2020"}, {"text": "Extensive menu. Friendly staff. Highly recommend the miso salmon! Very busy in the afternoon. Bar seats are usually available. They also have tables in the bar area. Usually no waiting for the bar area seating.", "rating": 5, "date": "2/11/2019"}, {"text": "Big fan of this place, and only giving 4-stars due to the quality of some of the food. Most of their stuff is great, with phenomenal service.<br&gt;<br&gt;Can sometimes suffer from long wait times and terrible parking being right in the middle of Fashion Place. Overall, it is a really great experience that could use some tweeks.", "rating": 4, "date": "10/16/2019"}, {"text": "It was an amazing place to eat. The service was amazing. My water was never empty, so that was nice. The cheesecake was absolutely amazing. I had a great sandwich, it was probably one of the best I&amp;#39;ve ever had. Well worth your money. And if I could suggest a cheesecake I suggest The Salted Caramel. It&amp;#39;s a classic.", "rating": 5, "date": "10/23/2018"}, {"text": "I was in SLC and decided to eat at this cheesecake factory yesterday. I was very disappointed.  I ordered a Greek salad and the Brussel sprouts off of the small plates menu. The waitress returned to let me know that they were out of the brussels sprouts, so I ordered the Nashville hot chicken from the same menu. The waitress returned again to let me know they were out of that also. By this time I was so frustrated, I just had the salad. When the salad came I opened my silverware that had been wrapped up in the napkin. I was disappointed to see that the knife was dirty. But I&amp;#39;m not the type to freak out over small things, so I wiped it off really good with my napkin and began eating my salad. When I was almost to the bottom of the salad, I found a hair in it. In retrospect, I really should have complained to the manager, but I was in a hurry because I was about to be late for an appointment so I simply paid the bill and dashed off.", "rating": 2, "date": "8/14/2019"}, {"text": "I really enjoy the food here!  Love the huge menue too. Service staff are nice", "rating": 4, "date": "10/1/2019"}, {"text": "First timer here. There was a convention, so it took about an hour to be seated. The waiter introduced himself and brought us drinks and then said he would be back soon, 20 minutes later we ordered. We weren&amp;#39;t too upset since he was super swamped running around helping his other customers. We ordered buffalo blasts, chicken Alfredo and the blackened salmon. The buffalo blasts were awesome, but the rest of the food was unfortunately not. My husband was told that they ran out of mashed potatoes and my chicken in the Alfredo was cold. Overall my experience was just ok. Disappointed that the quality of food, didn&amp;#39;t match the high price they were charging. Total time at the restaurant was a little over 2.5 hours with the wait time for seating, ordering and receiving food. I would recommend the buffalo blasts though!", "rating": 3, "date": "9/30/2019"}, {"text": "I used to love the aloha salad and they have completely removed it from their menu. Bring it back!!!!", "rating": 1, "date": "8/12/2019"}, {"text": "My wife and I went to the Cheesecake Factory today. We were able to get a table in the bar area. However, my ID wasn&amp;#39;t able to get scanned due to my dog biting it. They were nice enough to move us to another table without a hassle. I&amp;#39;ll tell you the food was so good. I got the Mac and cheese burger and my wife got the avocado salad. Both really good. Burger so big I couldn&amp;#39;t finish it. To top it off we got a key lime cheesecake. Did not disappoint.", "rating": 5, "date": "8/25/2019"}, {"text": "We love the Cheesecake Factory! The SkinnyLicious menu is great! I got a shrimp dish and it was just the right amount. My husband always gets the Shepard&amp;#39;s Pie &amp;amp; it&amp;#39;s the best! We each got a piece of cheesecake (of course)... I got the raspberry lemon cream cheesecake &amp;amp; it was fabulous! My husband got the tiramisu &amp;amp; it was also great!", "rating": 4, "date": "8/15/2019"}, {"text": "Oh Cheesecake Factory...how wonderful your desserts are but your food is always surprising me every time. If you want a quick delicious dessert fix, this is the place to be. If you want to get it quickly...depending on the time and day you can be waiting for 45 mins for a seat or immediately seating...I don&amp;#39;t think there was ever an in between for me. If you want just cheese cake I would recommend take out. The food court (or during nice days they set up chairs and tables outside) is near by so plenty of seating there and there isn&amp;#39;t much of a wait for food court seating/out door seating.<br&gt;<br&gt;My coworkers and I came here on a Friday afternoon and there wasn&amp;#39;t many people, so we got seated immediately. I decided to go for something new and ordered the spicy cashew chicken. Boy was I wrong to do that. It was one of the saltiest dishes I have ever tasted. After two bites I was just over it and I couldn&amp;#39;t eat any of the rice. The brown rice I got soaked up every bit of sauce. I felt like I was putting spoonful of salt in my mouth. I picked some of the proteins off that wasn&amp;#39;t covered in the sauce. Good thing they kept refilling my cup of water cause I was really thirsty with the saltiness of the food. <br&gt;<br&gt;Another great thing was the bread. Idk if I was just hungry cause all I could eat was two bites, but the chocolate looking bread was delicious. The other bread was just meh. The saltiness of the food and all the water I drank I didn&amp;#39;t feel like ordering dessert.<br&gt;<br&gt;I would totally recommend the desserts here, but do be careful on what you order cause of them are really rich and sweet. Food wise...it&amp;#39;s Russian roulette. I had some that are good but a lot of them which horrifying. The staff here was friendly though...", "rating": 2, "date": "7/31/2016"}, {"text": "Top notch. I highly recommend the steak diane or the chicken madiera.", "rating": 5, "date": "10/2/2019"}, {"text": "I typically give Cheesecake 3 stars for the decent, high calorie food. However, this location deserves only 2 stars. I ordered a Mexican Tortilla salad from the Skinny menu. While the portion of the salad itself is huge like all Cheesecake portions, the amount of chicken was completely unproportional. There were 6-7 thinly slices of chicken breast. I was still hungry afterwards!<br&gt;<br&gt;The restroom is also tiny compared to the size of the restaurant. There was a long line for the women&amp;#39;s room.", "rating": 2, "date": "6/22/2017"}, {"text": "Excellent food and service! We highly recommend you eat here while shopping in City Creek Mall. <br&gt;Bread served first, a large list of wines and cocktails even skinny cocktails and we tried Mamosa and I tried skinny Long Island Ice Teas it was very good not too sweet. <br&gt;For lunch-We shared two unique Appetizers;  Avocado Rolls and Chicken lettuce wraps both truly delicious!", "rating": 5, "date": "11/29/2018"}, {"text": "I understand that Covid causes restaurants to be slow seating people... I was told 45 minutes to wait. It is now 2 hours. You are probably asking why we are waiting- it&amp;#39;s my birthday, my 3 boys and husband are here with me &amp;amp; they told us 45 minutes. We checked to make sure they had our right number. Yes! We checked to see if we are close.. cleaning your table right now. It has now been 30 minutes from that check-in. Be honest! Don&amp;#39;t get our hopes up! We would&amp;#39;ve left-- once we got in it took 25 minutes for our waiter to greet us and we had to ask for one. We had him take our order right when we got there. The bread took 20 minutes because they didn&amp;#39;t have any ready. All the food was good, but we will never return. We all had empty cups for our whole meal. People go to eat for a relaxing experience, to celebrate an event or so they just don&amp;#39;t have to cook.  it&amp;#39;s sad this place has changed so much. If I could give it 0 stars I would.", "rating": 1, "date": "8/15/2020"}, {"text": "I&amp;#39;ve never had nothing but a good experience at Cheesecake Factory, but tonight made me bummed. I made reservations for mine and my husbands Valentine&amp;#39;s date(to beat the rush of tomorrow) we were seated within 10 minutes. Our waitress didn&amp;#39;t come for at least another 10, which seemed long. My husband ordered a soda which he didn&amp;#39;t receive until later after he received his meal and when he reminded the waitress.. then I was told twice that the food item I wanted &amp;#34;was all out&amp;#34; so I settled with the Asian chicken salad. They brought our food out and I was brought the wrong salad. I get it was busy tonight and accidents happen, but we didn&amp;#39;t receive any refills on our drinks, except for one on my water that she only filled halfway because the pitcher ran out and she never came back. It just sucks when you pick a place to have a fun night out and have a crappy experience at a restaurant that isn&amp;#39;t the &amp;#34;cheapest&amp;#34; when it comes to dining out. Hopefully next time will be better.", "rating": 2, "date": "2/13/2020"}, {"text": "Lots of negative reviews, we must have came on an off night. The server was awesome, so attentive, drinks, appetizers, meals all came out very fast and tasted delicious. We even got some cheese cake to go.<br&gt;<br&gt;I think I like this location better then the one at Fashion Place mall.", "rating": 4, "date": "7/25/2015"}, {"text": "The Cheesecake Factory is great. <br&gt;Whether you&amp;#39;ve been to one in another state or to this one, don&amp;#39;t be fooled by the name! <br&gt;This place has a huge menu, and no, it isn&amp;#39;t all Cheesecake! <br&gt;<br&gt;They offer about everything as well as vegan options and gluten free options. <br&gt;<br&gt;Service is great and there buildings are always so fancy and nice inside you can go casual or dress up. It is a nice mix for whatever you are in the mood for. <br&gt;<br&gt;They also have every option for Cheesecake nearly, so make sure you save some room for dessert! <br&gt;The best part, of course!", "rating": 5, "date": "4/10/2018"}, {"text": "I ordered Miso Salmon. I&amp;#39;ve had it several times before and enjoyed it but this time it was way overdone and crusty. The rice was a big lump like it hadn&amp;#39;t been drained. Service was good but a little slow.", "rating": 3, "date": "1/30/2020"}, {"text": "We got cheesecake to go and we were highly disappointed with the portion size of the slice for the price.  They have really gotten small compared to years passed.  The taste was good but don&amp;#39;t expect it to be the same sharable size it has been in the past.", "rating": 2, "date": "7/27/2019"}, {"text": "We ate there for my mothers birthday last Thursday. Amazing food and the waiter was amazing. Went the extra mile on everything. They of course boxed our left overs, and they were great a second time. Great folks.", "rating": 5, "date": "1/22/2020"}, {"text": "This week, two friends and I went to dinner at the Salt Lake City location.  They were both initially hesistant, because their prior experiences there were not great.   After a little persuasion, they agreed to give it another try.   <br&gt;<br&gt;When we arrived we checked in and were told there would be a 15 minute wait.   After 30 minutes and seeing several parties who arrived after us get called, I decided to ask how close we were.  I was told they called us and would need to wait awhile longer since we had missed our chance.   I know this was not possible because we were literally at an arm&amp;#39;s reach from the hostess table.   <br&gt;<br&gt;Next after we we seated and taken back, they pushed two tables for single people together and we were seated.  By that time we were so hungry, all we cared about was getting bread.  When the waiter arrived we asked for a coke and some bread.  The second time he arrived we asked for bread again.  After he walked by the fourth time and would not acknowledge us, we asked a different waiter for bread, which was kindly brought to us in a minutes wait.   My friend, who was not a Yelper by any means,  was so frustrated that she CREATED a Yelp account with the sole purpose of writing a bad review.<br&gt;<br&gt;Our waiter never acknowledged that we didn&amp;#39;t get bread and when we asked him a fifth time he finally brought it out.   The rest of the night was mediocre.  I do love the food but the service was really not up to par.  I especially felt bad for vouching for the company and then to be disappointed and proven wrong.", "rating": 1, "date": "11/12/2018"}, {"text": "The Cheesecake Factory seems to offer a premium dining experience. You&amp;#39;d expect so after paying what you pay for what you eat. The food is great for the first couple of mouthfuls and then feels bland. The bread is incredible and the cheesecakes of course are famously good. I&amp;#39;ve rarely had a good experience with the food and I&amp;#39;ve never had a personable waiter/waitress.", "rating": 3, "date": "5/31/2019"}, {"text": "I tried to call in an order yesterday, they were understaffed at the bakery and I was left on hold forever. I gave up and ordered onlIne, while on hold. When I arrived, I stood at the bakery while the hostess ignored me and a server waiting for a drink for her customer was textIng on her phone and completely ignored me. The girl working the bakery was clearly in need of additional help. The food was ready as ordered. I just can&amp;#39;t with the milllenials and their lack of social skills. I won&amp;#39;t be back.", "rating": 3, "date": "1/20/2020"}, {"text": "I love Cheesecake Factory! The only reason I&amp;#39;m giving it 4 stars is because when I was here a couple days ago our waitress was not very good. Every other time it&amp;#39;s 5! Sometimes the wait is longer than other days but it&amp;#39;s usually not very long. There is a car valet service right outside so we used that for the first time and it was very inexpensive. 5$ and we tipped a little on top of that. I usually get the four cheese pasta here &amp;amp; I&amp;#39;d recommend that to anyone who likes pasta and doesn&amp;#39;t know what to get! I also get the caramel macchiato which sounds like an odd mix with pasta, but for me it works. Delicious food, moderately priced. Love this location!", "rating": 4, "date": "8/1/2017"}, {"text": "Cheesecake Factory is a staple in my family!  We try to go there for most of our special events and even though it is a little expensive, we love the food and the time we spend there.", "rating": 5, "date": "1/15/2020"}, {"text": "*******This is an update*******<br&gt;The guys at the cheesecake got back to me and convinced me to give them another try.<br&gt;Well, they managed to win me back!<br&gt;<br&gt;Everything we ordered was amazing! Seriously, the best I have ever tasted there! The cook that prepared our meal is really talented. Even dishes we tried and loved before were even better!!!<br&gt;The service itself was great too.<br&gt;<br&gt;I must add that the guys at customer service asked me to ask for the manager when I&amp;#39;m there, but since I wanted to try them again without favoritism, I didn&amp;#39;t, so this experience is the same as every other person that was there on that day.<br&gt;<br&gt;Definitely going to go there again!<br&gt;Thank you for making things better.", "rating": 4, "date": "10/28/2018"}, {"text": "Don&amp;#39;t understand the low reviews. It&amp;#39;s a chain and it&amp;#39;s consistent. Can&amp;#39;t ask for more. <br&gt;<br&gt;Food: chicken, mango and avocado salad, kids pepperoni pizza and crispy pineapple chicken and shrimp. Original cheesecake. All tasty and delicious. <br&gt;<br&gt;Service: busy as expected on a Saturday night, so the wait was 1 hour. No surprise there. Our waitress was great, very attentive and met expectations. <br&gt;<br&gt;Location: at one end of the City Creek Mall near the food court bordering 100 S.", "rating": 5, "date": "7/15/2017"}, {"text": "Jared M was  our server tonight, not only was he adorable, but he was very personable. I loved all of the gluten free options which I&amp;#39;m not used to, so I asked him what he recommended. I have to say that was the best pasta I&amp;#39;ve had that&amp;#39;s gluten free! Thank you for having incredible servers and hostesses!", "rating": 5, "date": "7/26/2019"}, {"text": "Terrible experience. Waited almost 15 minutes to even be greeted by the waitress. Mind you, we went last night and were immediately seated so I&amp;#39;m not sure the exact issue. The server never apologized and had an attitude the whole time. We were literally nothing but nice as I used to serve and understand sometimes things happen. But she continued to honestly just suck. Checked up on us once. The bread she brought was one and half loafs (when it&amp;#39;s usually 3).. and clearly old. The food was below average. Overall just sucked. We&amp;#39;ve been to this location many times, we have a weird love for Cheesecake Factory but have always just sat in the bar. Honestly, I&amp;#39;d pass on going to this location.", "rating": 2, "date": "5/16/2019"}, {"text": "Have been here a few more times since the negative review I gave this location a few years back and the service has been great and food was good. My go to&amp;#39;s are always the calamari appetizer &amp;amp; thai lime coconut chicken :) Always satisfies my cravings. They also validate at the front so don&amp;#39;t forget to get your ticket stamped.", "rating": 4, "date": "3/29/2018"}, {"text": "I was really excited to try Slc Cheesecake Factory, however I was sadly disappointed. I ordered the shrimp pasta and was served a huge plate of sauceless pasta with 4 shrimp. The plate ran $20. Definitely could have gone anywhere else and got a tastier shrimp pasta for much less. Cheesecake is delicious. Only reason to eat here.", "rating": 2, "date": "12/23/2019"}, {"text": "Warm, filling comfort food with a great ambience and very friendly staff. We got the Louisiana Chicken Pasta which is super filling and flavorful, as well as some tasty flatbread. Great for a special occasion!", "rating": 4, "date": "5/24/2019"}, {"text": "The Cheesecake Factory&amp;#39;s desserts are out of this world. But in the few dining experiences that I&amp;#39;ve had a Cheesecake Factory your food is really overrated I&amp;#39;m sorry to be so blunt but for what you get fed and what you charge for it, is very poor.<br&gt;The service I had today in your restaurant was very good the appetizers were excellent the bread was great the cheesecakes wonderful of course. But then my entree comes and it was highly recommended the bang bang chicken and shrimp. Most of the flavors were there but I would think with the name bang bang they would be able to eat somewhere also the rice was like chewing up I knew it was maybe a little bit too much al dente he can&amp;#39;t feed people that stuff the service I had today in your restaurant was very good the appetizers were excellent the bread was great the cheesecakes wonderful course. but then my e n t r e e came,  and it was highly recommended to bang bang chicken and shrimp. most of the flavors are there but I would think with the name Bang Bang the would be a little heat somewhere also the rice was like chewing up pine needles maybe a little bit too much Eldon. My hat is off which happens to be a chef hat that place filled up pretty fast today and your kitchen staff was probably slammed as well as your front of the house once again the service is great appetizers were wonderful you can&amp;#39;t beat those but your food sucks do something about it", "rating": 2, "date": "12/19/2019"}, {"text": "SAFE GLUTEN FREE FOOD! Like.. safe safe. This is definitely one of my favorites places to eat, great price for the quality and level of service!", "rating": 5, "date": "6/20/2019"}, {"text": "I am a black doordash driver. Who felt like I was discriminated against when went to this  establishment. I have been to CCF 5 or 6 times to pick up deliveries and have never felt welcome. The CCF downtown SLC is one of those resturants as a Doordash driver you want to avoided at all cost. The food is never done on time and they don&amp;#39;t have a place for DD drivers to sit, your just in a hallway close to the cooks and waiters, in the way. It is a very uncomfortable and unprofessional environment. <br&gt; Knowing this location and Cheesecake Factorys&amp;#39; in general take a long time to get orders out I waited for my pickup time that I was given by DD of 1108. I go to the top door to and to my surprise the door is locked. I go to the other door it is lock as well. I see a Latin lady looking at me from  inside CCF. I see a couple (a boyfriend and girlfriend or husband and wife) walking to the door I just walked to and walk away from it. (Like I&amp;#39;m some sort of criminal)  The Latin lady sees the couple of people  walk past the door and doesn&amp;#39;t tell them to open the door for me. She walks down opens the door and starts getting an attitude.  She said WE ARE CLOSED!!  I said, IM HERE FOR JOHN. DD pick up.  She said that I need to leave the establishment. I say why. Because your being rude. (I&amp;#39;m in shock because she&amp;#39;s the one who gave attitude first) I leave without the food.<br&gt; I get on the phone with DD and let the know that the customers order isn&amp;#39;t going to be pick up. I then call CCF and see if I can talk to the manager. To my surprise this Rude Lady is the manager. (It was like that pop copy skit from the Dave Chappelle show first season) She starts out telling me that she saw me at the first door, and that she came outside to let me in but that I had left. I counter that, by saying if that was true why wouldn&amp;#39;t you say something to get my attention. She was stuck. I then say if you saw I was walking to the other door why wouldn&amp;#39;t you go and open the other door where you saw I was headed. Or why didn&amp;#39;t you tell that couple to open the door for me since you new what I was there for. She was speechless and just hung up the phone. <br&gt; I truly feel like I wasn&amp;#39;t treated right maybe because I&amp;#39;m not white. Idk. But if she&amp;#39;s the manager of CCF I would never dine with them.<br&gt;<br&gt;I have come to the conclusion that doing CCF deliveries are a waste of me time and energy.", "rating": 1, "date": "12/29/2018"}, {"text": "Just went to eat at the cheesecake factory and asked for a shot of vodka told him I had my own sugar-free flavored water I want to put in to , he told me it was illegal in Utah which is a lie I&amp;#39;m a bar owner In Utah and I know better and were really rude about it I told him if it was his policy I could respect as a diabetic I suggest not eating at the cheesecake factory for many reasons John general manager was quite rude so we just left<br&gt;Considering I&amp;#39;ve been a good customer for many years we&amp;#39;re going to have cocktails and appetizers and a main course to bad for them  They just lost me customer", "rating": 1, "date": "6/15/2019"}, {"text": "Excellent service, I brought my one year old and our waiter served us a small plate of sliced bananas and some bread for him which was SO perfect!  Also, I tried their Vegan Cobb Salad and DIED!  It is so good and very filling. Perfect summer dish!", "rating": 5, "date": "8/23/2018"}, {"text": "Great food, great service from the wait staff - Manager was passive aggressive.<br&gt;<br&gt;My wife and I stopped by the Cheesecake Factory on 16DEC2016 at about 2pm for lunch at the City Creek Mall in SLC, Utah.<br&gt;<br&gt;She had the chicken and couscous and i had the Kobe burger (which was outstanding).<br&gt;<br&gt;Our server was knowledgeable and promptly answered our questions about the dishes we placed under consideration before we ordered, and when we did order - they were out in a very reasonable amount of time. I never had to ask for a drink refill: Be proactive on this servers, and you will be well compensated for your efforts.<br&gt;<br&gt;During our meal, the manager came out to our table  and asked me if my 360 camera (that was mounted in a tripod and sitting on the table so I wouldn&amp;#39;t kick or sit in it) was recording video. I told her it wasn&amp;#39;t and she said that she didn&amp;#39;t care...but corporate would. I found this odd that Cheesecake Factory corporate doesn&amp;#39;t allow recording video inside the restaurant. One would think that recording memories and events would be encouraged. I assured her that I was not recording video and showed her that the camera was off by turning it on, showing her the blue LED&amp;#39;s and then turning it back off. I told her that I could place the camera on the floor under the table or on the chair next to me if it was a concern. She said it wasn&amp;#39;t her...it was &amp;#39;corporate&amp;#39; that had the problem, and left. After this interruption by the manager, we went back to conversation and enjoying our meal. <br&gt;<br&gt;A few minutes later, 2 of the waitstaff started taping pieces of paper on the glass separator (level with the camera sensor and lens) apparently to attempt to &amp;#39;block the recording&amp;#39; that the manager had insisted I was doing. My wife got pissed off and grabbed the camera and shoved it under the table. The wait staff (a very nice young woman and young man) said they were tasked by the manager to, &amp;#39;block the recording of how we cook our food&amp;#39;. That is paraphrasing, but she seemed embarrassed that she was tasked to carry out this objective. <br&gt;<br&gt;To be honest - I was embarrassed for her. When I asked her (the wait staff) why the manager didn&amp;#39;t object that the camera was on the table after I asked her if she would feel more comfortable if I placed the camera under the table, she said, &amp;#34;Oh my God, the manager said you were trying to video record how we prepare our dishes, I&amp;#39;m so sorry!&amp;#34;<br&gt;<br&gt;I had the Kobe Burger. It isn&amp;#39;t rocket science how to cook a hamburger. You cook it, flip it, cook it then eat it. I&amp;#39;m not sure why Kobe burger flipping is a secret at Cheesecake Factory...but it was a pretty damn good hamburger.<br&gt;<br&gt;While we won&amp;#39;t be coming back to Cheesecake Factory...it isn&amp;#39;t because the food is bad, or the wait staff is incompetent. <br&gt;<br&gt;It is because Cheesecake Factory &amp;#39;corporate&amp;#39; hired a passive aggressive &amp;#39;manager&amp;#39; that believes people are trying to record how the food is made, and is not genuine when interacting with customers.<br&gt;<br&gt;**UPDATED Monday Dec 19 (a few days after my last visit to Cheese Cake Factory)**<br&gt;<br&gt;I added +1 because as you can see below, CCF responded to my review. It is my opinion that CS on social media is an important part of the Customer Experience. This shows me that CCF&amp;#39;s digital strategy team is willing to pick up the ball after it was dropped by the City Creek restaurant manager. I replicated my initial review on G+ (where they indicate they had responded) but I haven&amp;#39;t read it yet. <br&gt;<br&gt;Validation begets validation. +1 to CCF digital strategy for acknowledging and addressing my concern in a timely manner. I&amp;#39;ll admit I was not expecting a response.", "rating": 2, "date": "12/19/2016"}, {"text": "Came here late and unannounced. Great food and service. $25 for bottle of very good house cabernet. Newfound appreciation for this franchise.", "rating": 5, "date": "1/21/2019"}, {"text": "So this can be a tough place to eat, mainly b/c of the wait time, the shuffling, the noise, and the cost of food. With that said, I still like to go there. I plan on at least a 30 minute wait and make sure I&amp;#39;m going with someone I want to talk that long with! The food was good this time around. We got the crab cakes and the Korean fried cauliflower. I didn&amp;#39;t think the cauliflower would be good (not a huge fan), but it was the best thing I had! The picture shows a half eaten cauliflower dish b/c it was going that quick between 3 people. Definitely try that out. I had the pear flat bread and that was good. I like the light menu options. I didn&amp;#39;t see those when I was there a couple of years ago. We, strangely enough, didn&amp;#39;t get cheesecake as we were so full from our entres.", "rating": 3, "date": "7/18/2018"}, {"text": "This is a nice Cheesecake factory.  They are all pretty much the same. I had my favorite Grilled Chicken and Avocado club sandwich.   <br&gt;<br&gt;The location is nice situated at the City Creek Mall in SLC. Decor is basically he same as every other CF I have ever been to. <br&gt;<br&gt;Employees were friendly and service was good.", "rating": 4, "date": "6/13/2018"}, {"text": "Cheesecake has gone so far downhill. Some of the food was barely edible last night - the salad was bland with wilted lettuce and the pork belly in the sliders was burnt to a crisp and completely inedible. <br&gt;<br&gt;Gone are the glory years of the chain - late 1990&amp;#39;s and here to stay is blandness and low quality. <br&gt;<br&gt;A very disappointing experience and we will most definitely not be back.", "rating": 1, "date": "6/8/2018"}, {"text": "Horrible. I order food then cancel my reservation at another restaurant.  <br&gt;<br&gt;Cheesecake then cancels my order after accepting it. <br&gt;<br&gt;Now no food no place to eat. Good job Cheesecake Factory way to do nothing.  If you can&amp;#39;t deliver on what you promise to your customers you will be out of business soon.  <br&gt;<br&gt;And per your suggestion I voice my opinion on your corporate site.  Twitter, Insta, FB, Snap. You ruined an evening because you didn&amp;#39;t care about the customer.", "rating": 1, "date": "2/20/2018"}, {"text": "I have been to many Cheesecake Factories. All over the country. This has to have been the worst experience (along with some terrible food) that we&amp;#39;ve ever had. It was like we were in the Twilight Zone.<br&gt;<br&gt;First, I have always been satisfied with Cheesecake Factory&amp;#39;s food. We typically order the same dishes. California Omelette and White Chicken chili. <br&gt;<br&gt;We sat in the bar and waited for a good 20 minutes (which is fine-they were busy) but it was the food that killed the drill. They got the order wrong. The omelette was so bad it wasn&amp;#39;t finished. Then we had to ask for ketchup (apparently it&amp;#39;s been rationed) and we got about a tablespoon in a jar. We were also served some sort of &amp;#34;butter syrup&amp;#34;? with the pancakes that was straight oil. <br&gt;They ran out of brown bread and we never heard about that again.<br&gt;<br&gt;We are still shaking our heads about it.<br&gt;<br&gt;The manager did come up to us by the end of my review and apologized, which was nice...but they didn&amp;#39;t comp us for any of it. So...", "rating": 1, "date": "2/18/2018"}, {"text": "We had a lovely time at City Creek Center. I was a little disappointed that it took nearly 8 minutes for anyone to notice us after we were seated. It was a very nice day &amp;amp; I could see there were many patrons dining outside but I wanted to be inside because it was breezy. The food was amazing! I ordered the stuffed cheddar burger in lettuce &amp;#39;protein style&amp;#39; &amp;amp; my man ordered his usual of Shrimp &amp;amp; Chicken gumbo. We were so impressed &amp;amp; savored every bite. Thank you!!", "rating": 4, "date": "6/3/2018"}, {"text": "Wow, it took 3 hours from start to finish. At first the manager was amazing. We had food that wasn&amp;#39;t out in, a broken glass that one of us cut their lip on. Food was cold, and the waiter wasn&amp;#39;t great. The manager did comp us considerably but one of the worst experience I have ever had. Oh and to say, here&amp;#39;s all your checks, pass them around! Not okay!!!", "rating": 2, "date": "4/2/2019"}, {"text": "Well I can&amp;#39;t give less than one star but the staff was incredibly ignorant that I was standing there for five minutes. I asked a question and was referred me to another area. Went there and waited a couple minutes while the staff laughed and cajoled with no help until I asked. I was then referred back to the original area. I told them that &amp;#34;they need to get their shit together.&amp;#34; And was later confronted by the manager. She did not take the Customer is always right stance with me and only defended her lackluster staff. Also the food is overrated and overpriced.", "rating": 1, "date": "12/6/2018"}, {"text": "White peoples&amp;#39; Mecca. Over promised, over charged, and under delivered. My fiancé took me, as she loves this place. I had never been. I ordered the chipotle chicken. I make this sort of fish all the time and was curious to taste a professional version. Not enough chicken, the sauce was burned , and the cook apparently doesn&amp;#39;t understand how to use chipotle in their cooking. My fiancé&amp;#39;s dish had a watered down sauce, it tasted like weak tea. I didn&amp;#39;t send it back because who wants to eat spit?  And then we got into an argument because I shared my thoughts and she said it wasn&amp;#39;t normal. To have such a large menu and to fall short on two noodle dishes is an indication of mediocrity.", "rating": 1, "date": "12/1/2018"}, {"text": "Took a total of 2 hours to be Seated, served and paid. <br&gt;Food was overpriced and did not taste great. The bathroom reeked of urine.  <br&gt;<br&gt;This was my first, and last trip to the Cheesecake Factory. (the kids&amp;#39; French toast was good though)", "rating": 2, "date": "1/20/2019"}, {"text": "Calamari appetizer was good, not great. Ceasar salad though was great-crispy, right amount of cheese and the dressing proportion was perfect. The Orange Chicken was great as always. The Jambalaya, which is usually the best was off the mark. All around not as good, from the noodles to the spices and everything in between. <br&gt;The service was, per usual, outstanding.", "rating": 4, "date": "6/3/2018"}, {"text": "We had a great dinner. We both enjoyed our selections. We chose to order couple of cheesecakes to go. Key lime mango for me and my husband&amp;#39;s Hershey&amp;#39;s Choc. <br&gt;We were very much disappointed that both cheesecakes are foamy, not much of chocolates like it used to be and mine is foamy too and there&amp;#39;s not a tinge of mango and cheesecake. We are not coming back here; the looks are deceiving but they&amp;#39;re not as good as they were before. There are other cheesecakes around the area which are reasonably in price and the real<br&gt;Cheesecakes. Very disappointed!", "rating": 1, "date": "10/19/2018"}, {"text": "horrible service from the hosts no one wanted to sit me and my fiancé idk why?? ruined my life made us wait forever for a table racist service too<br&gt;<br&gt;update: i do like the cheesecake poptory. honestly it has saved me when i been hungry so i changing my one star review to a 4 star", "rating": 4, "date": "9/28/2018"}, {"text": "We always love Cheesecake Factory! It was a super long wait like normal especially on a Friday night. We were super impressed with our waiter, Jonathan H! Shout out to a good waiter in a crazy crowded setting. He went above and beyond for sure!", "rating": 4, "date": "2/15/2019"}, {"text": "We love this place. You can&amp;#39;t go wrong with anything you order plus hello the cheese cake is awesome. We only give it 4 stars because of the price. We feel like it is a little over priced. But we love it so much we keep going back. This time we got burgers. Americana burger, skinny licious burger which I love everything on the skinny menu and 2 kids meals. We shook it up a bit and got a chocolate moose cheese cake instead of the Godiva one.", "rating": 4, "date": "5/30/2016"}, {"text": "In comparison to the fashion place location, this location is much better. We were at city creek and craving for pasta so stopped in. They have a huge menu and I ended up ordering miso salmon instead. Before 5, they offer a lunch menu. I noticed it was pretty much $5 off the dinner prices. Miso salmon was very tasty! My boyfriend ordered chicken Alfredo, it was full of flavor compared to when I ordered it at fashion, which tends to be bland.", "rating": 4, "date": "7/24/2016"}, {"text": "I just wanted to let everyone know about the terrible experience I had at the City Creek Cheese Cake Factory. Our waiter was terrible. Fred (waiter) seemed disinterested, snappy, and irritable. He would leave for 30 minutes at a time, didnt want to answer any questions about the menu, and ruined me and my families night. The restaurant was also out of several things. <br&gt;<br&gt;At the end of the night we left, thank god, but unfortunately i left my card there. So I come back and ask the hostess if she has seen my card to which she replies &amp;#34;the managers need to search their office&amp;#34;. I waited for over 5 minutes with nothing. I presume that the office was so dirty and disorganized that they needed 10 minutes to even search for a card. I then see my waiter and ask him if hes seen my card. He replies with &amp;#34;no&amp;#34; and runs off without any further explanation. They tell me to call tomorrow because there is nothing they can do, even though I had told them I thought it was in one of the black check books. <br&gt;<br&gt;Overall terrible experience, I would not recommend this restaurant to anyone I know.", "rating": 1, "date": "9/8/2017"}, {"text": "I had the Mac and Cheese burger. It was nothing to write home to mom about. That being said, there are other dishes that I seen on other tables that people got and they looked really good. I&amp;#39;m strictly basing my review on my meal alone. I will try something else in the future and may update my review based on the next meal I get. <br&gt;<br&gt;The various cheesecakes are delicious so you definitely should try one of the many selections they have.", "rating": 3, "date": "6/16/2018"}, {"text": "Eh. I&amp;#39;ve never liked cheese cake factory. The food is all bland, and over priced. The service is always slow, because it&amp;#39;s so freaking busy. I can see why people like it, there is everything on the menu, so you can please a crowd. However, if this is date night, pick somewhere else. The only reason I&amp;#39;m giving two stars is because the cheese cake is actually delicious, it&amp;#39;s the ONLY thing they are good at. It&amp;#39;s too bad they don&amp;#39;t serve fresh made whipped cream with it...", "rating": 2, "date": "11/7/2018"}, {"text": "The good:  the food we finally got was good, the server was pleasant. The bad:  it took 50 minutes for the server to come back and tell us they were out of calamari. Then came back to tell us they were out of pretzels. They ended up giving us bread to go with the cheese and mustard.  Then they were out of the first two entrees one of us tried to order. Then my chicken Costello did not have lemon sauce so I had to ask for that. Then they didn&amp;#39;t put the lemon sauce in my to go box!  We were comped a piece of cheesecake but good grief. It shouldn&amp;#39;t be that hard.", "rating": 3, "date": "9/7/2019"}, {"text": "Very short wait server was very nice excellent food they got it out to us very fast would definitely recommend", "rating": 5, "date": "10/4/2019"}, {"text": "Disclaimer: I&amp;#39;m a happy person who is infinitely in love with food. That said, I&amp;#39;m falling out of love with The Cheesecake Factory. The CF has reached it&amp;#39;s peak during my prom years and this will be forever where high schoolers take their dates to woo them into a false sense of grandeur.<br&gt;<br&gt;Let&amp;#39;s highlight some good things. Service is always fast, friendly, and waiters/waitresses always have genuine smiles on their faces. The Cheesecake, I mean come on, it&amp;#39;s the Cheesecake Factory and I will give it to them, still to this day the Dulce De Leche, Snickers, Oreo, essentially all their creations are delicious. And that&amp;#39;s about it.<br&gt;<br&gt;Come on guys, I&amp;#39;ve seen some college publications shorter than the menu at CF. I somehow always manage to spend 30 minutes reading the biggest menu on the planet. Why? Why the need for so many options? Think of it this way. You&amp;#39;re trying to impress a date. Would you wear a dashing tuxedo? or would you wear a tuxedo, a suit, your funeral suit, your wedding suit, your prom suit ALL at once. Why? What are you trying to hide? It&amp;#39;s simple, their absolutely mediocre less than impressive food. It&amp;#39;s really not that good. Just a lot of it on a plate in a dimly lit restaurant so you can&amp;#39;t really see how bad it is. <br&gt;<br&gt;However, what were we expecting? It&amp;#39;s a chain, their focus is essentially the same as McDonald&amp;#39;s, VOLUME. Their intent isn&amp;#39;t making the best mac and cheese burger, or pineapple chicken and rice, or chicken curry, or the best spaghetti there is. They stuff you with volume and trick you into thinking it&amp;#39;s the best thing you&amp;#39;ve ever had. Don&amp;#39;t be fooled. Skip the tom foolery and go straight to dessert. No pretense, you can&amp;#39;t hide a bad cheesecake (or maybe you can).", "rating": 2, "date": "11/27/2017"}, {"text": "The only complaint I have is the wait!!! Consistently great food, top notch, knowledgeable servers, love the bread, and my favorites which I have converted many friends to is the miso salmon, perfectly prepared on a bed of rice and covered in a miso Asian type sauce. I love to get the small plate of Greek salad, and crab cakes.  You really can&amp;#39;t go wrong here!", "rating": 5, "date": "4/2/2019"}, {"text": "Love this place so much. I always get the same thing and usually never stray. Chicken mandera (spelling error) is the best. All their meals are good for two meals because of the size. The service is ok. I feel like they could do better at bringing more bread without me having to ask every time. But that&amp;#39;s probably for less waste. Always love this place and it&amp;#39;s a great when I get to visit this restraunt.", "rating": 4, "date": "1/25/2019"}, {"text": "Very delicious food I really like the spicy Caesar salad and the tomato basil pasta was very good I cannot remember the cheesecake that we had but it was  great.", "rating": 4, "date": "1/7/2019"}, {"text": "Came here with my niece and nephew for dessert. The staff was very nice and presentable. I went during lunchtime so there were a lot of big groups because of the many businesses located nearby. My nephew and I went with the regular cheesecake with strawberries on top. So delicious and of course I ate too much. My niece had a chocolate flavor cheesecake. Our server was awesome. He was never M.I.A.  The managers were also walking around making sure everyone was doing their job. Tables were cleaned fast once the guests left. Overall great experience.", "rating": 5, "date": "7/2/2017"}, {"text": "Our waitress took forever to take our orders. She didn&amp;#39;t get my order right after I told her twice that it was supposed to be gluten free due to an allergy. The food was very mediocre and a small cockroach crawled on our table. I used to get takeout here all the time and never again.", "rating": 1, "date": "9/21/2019"}, {"text": "Unfortunately, this was a Terrible experience for my gf and I. First we were seated at too small table to be comfortable located right next to the bathroom, and waiters order computer. Our waitress was nice and attentive and checked for satisfaction.  The food was very good, avocado egg rolls, pasta nepalotana, and the crusted chicken. All great dishes would recommend. <br&gt;However, back to the table being small.... The food runner brought our appy, but the problem was we had our drinks, menus and small plates on the table....so what does he decide to do, he just starts at the end of the table between my gf and I and pushes from the edge until all the other utensils, drinks, bread basket were pushed every which way. My gf and I had to play a cute game of Tetris but made it work. <br&gt;Food runner couldn&amp;#39;t care less.<br&gt;<br&gt;Conclusion<br&gt;Waitress great<br&gt;Food great <br&gt;Food runner inconsiderate and rushed.<br&gt;Table terrible for an intimate time between two people who wanted a booth to share side by side.<br&gt;I&amp;#39;m 6 feet 4 inches, sitting in a chair that sticks out next to the bathroom and order station and having the waitress having to turn sideways to get between us to serve each table was rather uncomfortable. <br&gt;It&amp;#39;s ok CF we will go again however, I won&amp;#39;t settle for anything less than a booth or a table larger than what we had. I need to hear my date and be able to have everything I order from the bar and kitchen fit the table.", "rating": 2, "date": "2/3/2018"}, {"text": "I love this places &amp;#34;Bar Section.&amp;#34; Always able to get a spot no matter how crowded the Restaurant is. Table for #1 please. I even got a booth this time. What a lucky man I am tonight. Now if only I can get the number of the hot number sitting at the bar in the black &amp;amp; white sweater.  Humm, that&amp;#39;s a different review.", "rating": 4, "date": "1/8/2019"}, {"text": "Party of one: I was sat at a table for two in a section of about 5 other tables. Once seated the waitress dropped off the check to the table beside me. She looked at me and walked off I figured she would return after closing their tab and greet me. When she came back to the table she dropped off their check and went to another table in her section checked on them and walked back out of site. Finally she returned to the section checked on one other table and then decided to make formal contact with me asking for my drink selection. It took a long 10 minutes to ever be waited on or atleast greeted by the wait staff then another 5 to get my drink. This being said it isn&amp;#39;t a busy evening just a moderate Thursday crowd. Service thus far is very unimpressive.<br&gt;<br&gt;After the relief server came over to let me know she was now taking care of me the mood changed and she was very polite and helpful. Her service was a nice change to how the dinner started", "rating": 2, "date": "9/21/2017"}, {"text": "Great food and service! Heather was wonderful and my burger was very tasty! I will definitely be back to this location, Heather deserves a raise her work ethic was flawless", "rating": 5, "date": "9/11/2019"}, {"text": "Good food but it&amp;#39;s expensive as fuck and that&amp;#39;s why I give 3 stars cause I don&amp;#39;t think the food is worth the price. Always a cluster fuck when getting a table and it takes forever to get a table.", "rating": 3, "date": "9/8/2019"}, {"text": "As much as I love to support local restaurants, sometimes I just can&amp;#39;t help going to a mega chain like Cheesecake Factory. Don&amp;#39;t judge me. Is it worth the 30 minute wait? Not really... But when you&amp;#39;re feeling kind of basic, the ahi tuna tartare small plate is always a good go-to dish for me, and the cheesecakes are always yummy. Plus, their vast cocktail menu is full of fruity and deliciously sweet options if you didn&amp;#39;t get enough pina coladas on your last vacation.", "rating": 3, "date": "10/23/2015"}, {"text": "We love the Cheesecake Factory, who could wrong with cheesecake? I love the Thai lettuce wraps and seek them out as often as possible. My husband had the chicken Madeira and steak medallions last night, he said they were both something he would recommend. Raspberry white chocolate cheesecake is a winner in my book.", "rating": 5, "date": "12/28/2018"}, {"text": "Its an average chain with decent food and generous portions. My interactions with the staff have been pleasant, despite it being off the hook busy. Because this place is right at the mall, and for whatever reason I keep ending up there on a Saturday; but the never ending stream of teens keep this joint packed! If you choose Saturday, then give yourself at least an hour. If you have a large party, then get there about two hours early. This way if you get seated in ninety minutes you will be that much elated. The parking garage is close by. Come up through Macys and its just outside the doors between the food court. A plus is that valet parking is right out front. And if you&amp;#39;re staying at a motel with a shuttle, they drop you right at the door. You can buy cheese cake right up front if thats why your there.", "rating": 3, "date": "1/13/2019"}, {"text": "Probably say this TOO often but this place is at the top of my list. If you know me, I like plenty of options and this place offers quite the variety.<br&gt;First time at the City Creek location.  They&amp;#39;re pretty busy during lunch time.  Outside dining is an option on a nice day just like the Murray one.  We were a group of about 15 but the service was still quick and attentive. <br&gt;<br&gt;My choice was the Bistro Shrimp Pasta ($18.95). Holy, flavors.  Shrimp was small but great.  Spagettini noodles, Mushrooms, basil, tomatoes, all included.  The sauce was a basil-lemon base which I really enjoyed.  Something I would definitely order again.  I&amp;#39;ve tried almost all of the pasta dishes they offer and I don&amp;#39;t remember disliking any of them.  Chicken Piccata and Chicken Bellagio are also some of my favorites.<br&gt;<br&gt;Don&amp;#39;t forget to end your meal with a cheesecake!  It&amp;#39;s a generous slice of sweet-goodness. I usually go for Red Velvet or Dulce de Leche.  They also have no problem with packing it for you to-go.", "rating": 5, "date": "9/3/2015"}, {"text": "This is by far the worst Cheesecake Factory experience I have ever had. I have gone to several CFs in other states, but this one gave the well known popular restaurant a bad name. <br&gt;<br&gt;I had a fairly large party and we were celebrating my brother in laws graduation. We understood reservations were not taken at a certain time and by the time we got there it was 8 pm. There was a high volume of guest and parties already waiting to be seated so our wait time was 3 hours. We decided to wait. After about an hour and a half we came back a checked with the host on the wait time and she stated it went down 30-20 mins instead. We were so relieved considering many of us were already so hungry. <br&gt;<br&gt;Across the waiting area there is a dining room. As we waited the remaining time there was a large table that had not been cleaned for at least 30 mins. Once they cleaned it they sat the other large party ahead of us. Half our group are from Vegas and we were surprised how long they waited to clean the table considering that large party probably waited longer than us. At the CF in Vegas they would clean the tables right away. CF staff are quite known to be diligent.  <br&gt;<br&gt;Before we were seated my sister asked the host if our party was gonna be able to sit together or visible to each other and she said yes. Once we were seated we were taken to 3 booths. Two were right next to each other and the other table was four tables away from ours. You can imagine our confusion. I can understand if the booths were right next to each other but to have a third of our party sat on the other side of the section did not make any sense at all. My sister asked the host if there was any way for all of us to sit together and the host said, &amp;#34; I don&amp;#39;t know right now this is the best option &amp;#34; and then walked away to attend to other guest. My sister asked another question and the other host kept saying, &amp;#34; I don&amp;#39;t know, I don&amp;#39;t know...&amp;#34; The responses were not helping at all. <br&gt;<br&gt;We sat down and ordered our drinks. My sister who was very uphad to go up to the podium to speak to the host again about the table arrangements. Eventually the table that was very far from the others was moved to a much closer table. This also meant the servers had to switch. There were great confusion with the seating and our server already seemed flustered and irritable. My sister asked for a plate from the server and he yelled at her and asked if she needed anything else. They took one of the dishes from one of the guest in our party (who did not move at all) to a different table. This person had to watch us eat and when his food came we were already done. We tried to make the most of the dinner. <br&gt;<br&gt;Although the dinner was not what we had hoped would be I appreciate the staff for trying.", "rating": 1, "date": "1/7/2018"}, {"text": "This place used to be good and now its losing its luster for being once a good place to go to. Maybe it&amp;#39;s this location but for my experience of this location I was left with a sour taste instead of taste of great food. First off the wait to order was 25 mins and granted it wasn&amp;#39;t that busy. Bread wasn&amp;#39;t even served to us in that time but cant complain as it is complementry. After finally ordering it took them another 30 mins to just bring the food out which by the way is the real reason why I&amp;#39;m giving a 2 star. Out if the 4 of us being served, two were given food as me and another friend waited about 10 mins for ours. When we finally got it the food tasted and looked like it had been sitting for awhile under a heat lamp. The cheese was starting to rubberize. And the bread was hard from sitting in the air for awhile. The waiter was ok and and the manager tried to help but my appetite had already depleted and was to the point of not being hungry. In conclusion I probably wont be coming back to this location at least. Poor service and attitude. Poor coordinating of getting food out to the customer. Maybe its poor communication but this needs to be addressed and looked into.", "rating": 2, "date": "9/7/2019"}, {"text": "We were visiting Temple Square, dropped in to have dinner. The Q was 20mins and the dinner took a little while to arrive. They have good crowd in there. <br&gt;<br&gt;We ordered the Herb crusted salmon, pasta chicken scampi, and a meatball spaghetti. The salmon is slightly plain, but the pasta chicken scampi was surprising good. The 3 meatballs were pretty good. <br&gt;<br&gt;On the whole experience, the food was good,the service was prompt and cheery. The price is reasonable for the location and ambiance.", "rating": 4, "date": "12/15/2015"}, {"text": "They are completely unable to do their jobs. It took them two hours to say they were out of something. How is that even possible? What are you doing while getting paid? Completely unacceptable.", "rating": 1, "date": "12/21/2018"}, {"text": "So tonight stopped in to have dinner and of course during a very busy, upcoming holiday weekend only had to wait about 20 minutes. We were seated and introduced to Carson our waiter and got drink order started. After looking for a few minutes we ordered our dinner. It was perfect timing when our dinner was delivered and I ordered the Chicken Parmesan &amp;#34;pizza style&amp;#34;. My dinner was undoubtedly the best chicken parm I have eaten anywhere. The Mac and cheese side dish was perfectly cheesy tasting as always.<br&gt;<br&gt;Carson was a little busy with bigger tables but he did he best he could that evening and was very nice. We then ordered our cheesecake to go and paid the bill and headed out for the evening.<br&gt;<br&gt;We got back to our hotel and munched down on the dessert and it was a perfect non-alcoholic nightcap.", "rating": 4, "date": "11/16/2017"}, {"text": "Food was good the service terrible. The waitress took 20 min to bring water and coffee and the place was empty. When I asked to speak to the manager I learned where the issues started. Nice guy but not a leader. Our eggs did not come out hot, we were offered noapology for the wait, the manager did offer to move us. An hour an 10 minutes to get breakfast utter failure.", "rating": 1, "date": "2/23/2019"}, {"text": "Went on a date here. We usually wouldn&amp;#39;t go to places like cheesecake factory, because honestly, the food is only decent but greatly overpriced. We only came because my boyfriends mom gave us a $50 gift card. If we didn&amp;#39;t have the gift card, we&amp;#39;d most likely not eat here. It&amp;#39;s just not worth it for us.  It&amp;#39;s supposed to be a fancy restaurant with amazing food, but my food has never been more than just alright, at any location. <br&gt;<br&gt;What I do love about this place is I&amp;#39;ve always had good service, and my Pina colada is always consistently  delicious. <br&gt;<br&gt;The restaurant&amp;#39;s appearance doesn&amp;#39;t please me. It&amp;#39;s too dark.", "rating": 3, "date": "7/27/2016"}, {"text": "The Cheesecake Factory is one of the most overrated restaurants. If you are going simply for the cheesecake, there is no better place to go to. If you are going for dinner, there is a plethora of better options downtown. Any restaurant that has a nearly 20 page menu can&amp;#39;t do any of those dishes phenomenally (except of course their cheesecakes, I&amp;#39;ve had many and all have been excellent). As far as actual food, this place is very overrated. None of the entrees I&amp;#39;ve had have been that great. They do have some really good appetizers though. The Asian lettuce wraps are really good, but messy. I also really love their grilled artichoke. I always get the artichoke to share with friends when we go here because my friends seem to think this place is really great, so we go here with a certain level of regularity.<br&gt;I came here the first time ever on Sunday for brunch. I ordered the brulee french toast. I will say that that was done very well. My service on Sunday though was not great. My server kept the water full, but he was not a good listener when we asked for things and he didn&amp;#39;t take my leftovers to box them like they always do here. When my boyfriend took me here for my birthday, our server was phenomenal, so it was frustrating not having great service on a very slow morning (think, it&amp;#39;s City Creek, which is closed on Sundays, so not busy at all), compared to the very busy night we went a few months back for my birthday dinner. If you have a large group with different tastes, this is a good place to go because they have everything, but nothing is top  notch here (except the cheesecake).", "rating": 2, "date": "7/22/2015"}, {"text": "We came in for the first time. I had read through the reviews and I must say, this was a very good visit. It wasn&amp;#39;t busy. Got seated very quickly. Our waiter, Carson, was very nice, patient and answered all of my pretentious questions. Food was amazing. <br&gt;I recommend coming in early or calling way ahead. We will be back in.", "rating": 5, "date": "2/11/2018"}, {"text": "I visited this location today with my sis. We both enjoyed the service and our seating location outside in the shade. The quickness of drink refills, the server was nice and our food was good except for one major issue: I HATE warm lettuce. Hate is actually too nice a word, warm lettuce ruins any sandwich/food it touches. I was very clear when asking for no lettuce anywhere on the burger or even on the plate, we also had a joking laugh about it as I quickly told the server about the vileness of warm lettuce. Food comes, looks great! Just as I&amp;#39;m ready to take a bite I see it...a long piece of lettuce hanging off the bottom of the burger. I took the bottom bun off and there was a huge pile of warm lettuce mixed in with some sauce on the bottom. Talk about lunch ruined. I scraped it off but the damage was done. I couldn&amp;#39;t eat the bun and whatever the sauce was on the bottom was ruined. Sadly, even getting off all the lettuce, the flavor was still there. I Drenched the burger in the plain BBQ sauce (description also stated it was a bbq-ranch) but I could still taste the lettuce. I told the server, he apologized and went on his way. That&amp;#39;s where I have the problem. This burger was WAY to expensive to have it ruined with the nasty that is warm shredded lettuce, when I simply asked for it to not be anywhere on the burger or plate. Mistakes happen, it would have been nice if he had offered to have it remade, which I would&amp;#39;ve turned down because I&amp;#39;m not a (total) bitch or wasteful. He could have offered anything to make it better but just went on his way. I have eaten here before and usually enjoy everything. I believe this: the burger would&amp;#39;ve been fantastic had it not been for the lettuce lurking under the patty, soaking it&amp;#39;s juices into the meat. ;) I&amp;#39;ll post about my next experience, which I know will be 100%!", "rating": 3, "date": "8/9/2018"}, {"text": "Great service, decent food. Seating feels alot like a cow must feel lined up for chow time. Just a little tight. If your looking for somewhere to have a private chat with your date, go somewhere else. UPDATE : The Honey Truffle chicken was terrible. More like two chicken strips from Maverick with an old packet of honey squeezed into the plate. Truffles? MIA. service started out great, went downhill fast.", "rating": 2, "date": "6/14/2018"}, {"text": "It&amp;#39;s my first time in Utah and I&amp;#39;m staying up the block so my family and I decided to have dinner at the Cheesecake Factory. They had vegan/vegetarian meals for my sister which was lovely, another plus. I ordered the rib eye, medium rare with mashed potatoes and green beans. Our food arrived and it was all very flavorful and amazing. The meat cut so well and was very easy to eat despite how rare the meat looked. I ate about maybe a fourth or a third of my meal before asking for a box to take home (I don&amp;#39;t eat much so I was expecting leftovers). Our server, Richard, comes over and as I ask him for a box and he stares down at the meat I had cut and asks me if i wanted it heated up more because it looked really pink. He took my plate back to heat and package it but came back and told me that him and a few others decided to remake my whole meal because the meat I had ordered wasn&amp;#39;t prepared the way I asked (medium rare). The meat itself was fantastic and I had no problem taking what I had not finished but they decided to send me back to my hotel with a fresh steak knife, fork, and a whole new medium rare rib eye with mashed potatoes and green beans!!!! Living in San Francisco my whole life I have never received this kind of treatment from anyone. Absolutely wonderful. The people are easy to talk to, the food is beyond amazing, and most importantly the people working to make your customer experience really care for you. If I ever visit Salt Lake City again, I am DEFINITELY coming back here. Thanks again Richard!", "rating": 5, "date": "7/6/2019"}, {"text": "If you receive a gift card for The Cheesecake Factory, I highly recommend it. If not, I would recommend somewhere else. There are so many good restaurants in downtown Salt Lake, you could throw a dart at a map and find a better one. I&amp;#39;ve eaten here three times. The food is much the same each time. It&amp;#39;s okay. I go back because wonderful people in our life gift us. However, I would recommend the cheesecake. I had it once and it was terrific.", "rating": 3, "date": "10/3/2018"}, {"text": "Always good at this place.  The food was great and wait for 4 guests was only 20 minutes.", "rating": 4, "date": "8/9/2018"}, {"text": "The Cheesecake Factory has always been a solid and dependable place. They stay pretty consistent with the quality of their food. Probably one of the better chain restaurants out there. There is a wide variety of comfortable options. While the dishes aren&amp;#39;t very adventurous or extraordinary, they are familiar. There&amp;#39;s usually a SUPER long wait, and they don&amp;#39;t do reservations. Good service and friendly atmosphere.", "rating": 4, "date": "7/9/2018"}, {"text": "We made a reservation on Yelp and where Straight away. We had a great server and the food taste amazing. The salted caramel cheesecake was great.", "rating": 5, "date": "6/25/2019"}, {"text": "We had an excellent experience! Our group was very diverse, food wise. Meat eaters, vegetarians, vegans... everyone was happy. Our server, Keith O, went above and beyond the call of duty to answer questions and make sure everyone was happy.", "rating": 5, "date": "9/9/2018"}, {"text": "The appetizer and side dishes are the only reason that I gave this place 2 stars. They were AMAZING. Sadly, the star of the plate (the steak) came very rare when I ordered it medium. They took it away, and it came back burnt to a crisp. Completely inedible. The waiter (who was actually a good waiter) asked why I didn&amp;#39;t eat it. I told him it wasn&amp;#39;t cooked properly. He told me he would show the chef. I thought that maybe one would be brought to me prepared correctly, or I would be accommodated. Instead, I was given my check. Very sad, because the rest of the food was so good.", "rating": 2, "date": "11/4/2018"}, {"text": "Sometimes getting a table at The Cheesecake Factory in a timely manner can feel as impossible as getting an audience with royalty. I didn&amp;#39;t have high hopes that on the first night of FanX we&amp;#39;d be able to get a table in less than three hours, but they shocked me when they told us the wait would only be thirty minutes. I was even more pleasantly surprised when thirty minutes only ended up being about fifteen.<br&gt;<br&gt;I&amp;#39;m sure because of the event there was a lot of traffic throughout this establishment this evening, but have to compliment the entire staff for remaining professional and high on positive energy. Nothing but good vibes here this night, considering how many oddly dressed people (my party included!) might have passed through.<br&gt;<br&gt;As far as food goes, I&amp;#39;ve mentioned it for another location. I feel like there is something for everyone here; the menu is huge and can accommodate all tastes and even appetite sizes. And if you&amp;#39;re looking for something to help you keep your waistline trim, they&amp;#39;ve got that, too. <br&gt;<br&gt;My friend and I split a pasta dish that she selected; it sounded just okay, but was ridiculously tasty. The wine was really evident in the sauce, and the pasta was cooked to perfection. The chicken was moist, too, and didn&amp;#39;t taste veiny.<br&gt;<br&gt;Our server, Andrew, was extremely professional and rolled with the punches, even when presented with a very odd request. My friend JJ and I don&amp;#39;t get to see each other all that often, and we both have seriously quirky personalities. We decided we wanted to recreate the scene from &amp;#34;Lady and the Tramp&amp;#34; after we were joking about our shared pasta dish and if we only had a meatball and one strand of spaghetti. Andrew graciously accommodated our request, bringing out one meatball and one strand of spaghetti so we could act the scene for a few laughs with our friends. I loved that he said in his ten years of being in the service industry that this was the first time he&amp;#39;d ever had anyone do this particular iconic movie scene. This is the type of service industry professional I&amp;#39;ve always attempted to be, and this is the type of server that I love having when I go up. Keep it up, Andrew!", "rating": 5, "date": "3/20/2017"}, {"text": "I&amp;#39;ve been here three times and love it. I didn&amp;#39;t have high expectations, since I felt like it was probably overhyped. True, it&amp;#39;s pretty dang expensive ($15-30 per person, not including drinks or dessert) and the wait is often bad but the quality of food has made it worth it on special occasions. The chicken and biscuits are my favorite, but also loved the steak diane and shepherd&amp;#39;s pie. (Get something with mashed potatoes, because they&amp;#39;re great here. And trust me, that is not a recommendation I usually make.) There are SO many choices, I&amp;#39;m not sure you can go wrong. Well no, I take that back. Though I haven&amp;#39;t had anything bad, the artichoke dip and raspberry lemonades were both forgettable. The main dishes, however, have yet to disappoint. Portion sizes are massive and your caloric intake will be through the roof, so plan on getting a doggy bag. <br&gt;<br&gt;I&amp;#39;m not typically a fan of cheesecake (which is bizarre, since this place is called the Cheesecake Factory) but this place does it right. I honestly just stick to the original, plain jane cheesecake, so I can&amp;#39;t vouch for the others, but it was really good. (The first time I got it, an employee scoffed at me for not being more adventurous and it was kind of rude, but that was an anomaly in otherwise pleasant service.) <br&gt;<br&gt;My only other complaint is that it&amp;#39;s pretty dark in there. The guy next to me was using his cell phone as a light to be able to read the menu. It&amp;#39;s annoying in Hollister and it&amp;#39;s annoying in a restaurant, too.<br&gt;<br&gt;Overall though, five stars. If you have plenty of time and a wad of disposable income and you&amp;#39;re starving, go here.", "rating": 5, "date": "12/24/2014"}, {"text": "Will not be back to this Cheesecake Factory location - ever! Fool me once, shame on you! Fool me twice, shame on me! <br&gt;<br&gt;Hesitated to come to this location after finding a hair in my takeout about a month before. <br&gt;<br&gt;In a time crunch to get to a play across the street we snagged a table by the bar. Three people said hello, brought plates, napkins, bread etc. Waitress came and basically kicked us out because not everyone in our party was 21. Said some off-hand remark about the &amp;#34;Zion Curtain&amp;#34;!?!?<br&gt;<br&gt;However, just to my left, 10 feet away, there was family of 5 with 2 young children that could clearly see the bar. Just because we didn&amp;#39;t order alcohol on a Saturday night doesn&amp;#39;t give you the right to ask anyone to leave. <br&gt;<br&gt;WILL NOT BE BACK!", "rating": 1, "date": "5/1/2018"}, {"text": "Came to have a nice dinner with a co worker.  During dinner, on the clock waitress Tara Jones decides to take our picture and send it to her aunt Jill Jones who then sends it to my soon to be x husband. While I am eating dinner with my male friend I get nasty texts from family members that I am lying and cheating all because Tara Jones decides to invade my privacy and take pictures. Meanwhile she has no idea what is going on in my life and she&amp;#39;s just trying to start drama. I thought I could come to Cheesecake and feel safe and not feel violated by their working employee that&amp;#39;s on the clock! Unbelievable!  All Cheesecake management did was apologize and send me a gift card for their rude unbelievable unacceptable joke of an employee.  I will not be back to this location and am extremely disappointed .", "rating": 1, "date": "3/18/2019"}, {"text": "Well let me just start by saying this is a chain. With that comes both good and bad perspectives. Food is usually tasty and consistent here. Catch them at an off time but definitely not during rush hour. No reservations taken. Staff is friendly and pretty on top of things. Cheesecake as always......amazing. Definitely a huge variety of foods for every palate and diet. Valet parking a plus. Again though, it&amp;#39;s a chain, so you get what you get lol.", "rating": 4, "date": "5/8/2017"}, {"text": "Best restaurant and service in the Salt Lake City area. This was my first time in Utah and we had the best service here! Our waitress was prompt, friendly and very helpful! Thank you Brenna! You and the cheesecake were the best part of our trip!", "rating": 5, "date": "10/9/2018"}, {"text": "I would say this is a very decent place for a chain. Great atmosphere, good food. However, this place is always packed, so I recommend you to avoid their busy hours.<br&gt;<br&gt;I went here on a Saturday noon, waited for about 10 min for the table. What I don&amp;#39;t like about this place is that the space between each table. It seems to me it&amp;#39;s getting narrower each time I came here. The service were pretty slow that day, it seemed our waiter had forgotten us from time to time. That&amp;#39;s why I didn&amp;#39;t give it the fourth star. <br&gt;<br&gt;I got the lunch pasta-Evelyn&amp;#39;s Favorite, and lunch favorites- Famous Factory Meatloaf. The pasta was a bit tasteless at first, without chewing with the sundries tomatoes, it was flavorless. The meatloaf was enjoyable. It was tender and perfectly seasoned and cooked. I love how they put onion on top of the meatloaf to bring out even more flavor. We ended our meal with the Limoncello Cheesecake. It wasn&amp;#39;t as sweet as the other. I always think that their cheesecakes were too sweet, but this one was unlike the rest, it had a freshness taste in it. I would recommend this cheesecake to those who want something lighter than regular cheesecake.", "rating": 3, "date": "1/3/2015"}, {"text": "JEN thanks you for all tips where to hang out, cause I can&amp;#39;t hang out here all night with you. Awesome service. No bar but you can go down to the high tables without waiting in line for 1 hour", "rating": 5, "date": "4/27/2017"}, {"text": "I sat down and the first thing I noticed was my spoon had old food on it. Huge turn off and very unappetizing. Next, my cloudy water glass had a slow leak that started to make the table wet. Got my food. Food was fine but the sweet potato fries were over cooked and mostly little crumbs.  For the price of the meal, I can honestly say I was disappointed.", "rating": 1, "date": "4/24/2017"}, {"text": "The food is really low quality at such price, aweful customer service and i still have no idea why some people like it.", "rating": 2, "date": "4/30/2015"}, {"text": "The food was excellent, and so was the cheesecake (of course). I booked online and got right in when I arrived. The atmosphere was comfortable and spacious.", "rating": 4, "date": "5/31/2019"}, {"text": "It was my first time here and it was amazing. The warm bread they brought in was probably the best bread I&amp;#39;ve ever had. Jesus. Our server was simply amazing. Shoutout to her. The huge appetizer nachos was huge and no one could finish it. Mind you, there were about 5 people. I ordered the mushroom burger and it was great!!!!!!! My sister ordered the chicken fingers and WOW huge. She loved it.", "rating": 5, "date": "5/20/2018"}, {"text": "It&amp;#39;s average food, way overpriced, and way too busy to wait in line for.  <br&gt;<br&gt;Seriously, has anyone seen a wait under an hour?  Even on weekdays it&amp;#39;s awful.  I&amp;#39;m not sure why the long wait either.  The food is decent, but not great.  Obviously the selection is good, but if you can narrow down your selection then pick one of the local, non-chains that have way better food for less of a cost and no wait.<br&gt;<br&gt;I don&amp;#39;t know what else to say.  I guess if you&amp;#39;ve still decided to go, go for the Chicken Bellagio dish.  The Factory Burrito isn&amp;#39;t very good.  Cheesecakes are good, but when have you seen someone mess up a cheesecake?<br&gt;<br&gt;I would take any local place around the town over this, and maybe some gelato for desert.  You can do both in less time than it will take for you to get a seat here.", "rating": 2, "date": "9/14/2014"}, {"text": "I am very unsure how people still eat here. I have been to this location 3 times now. Every time, terrible service, forgotten food, cold dishes, and a stupid long wait. I&amp;#39;m not sure how they keep all that stuff on the menu &amp;#34;fresh&amp;#34; and ready to go, but what the heck a 32 page menu will suffice. I also hate that a chain restaurant is that close to central downtown and people frequent it so much, when there are more amazing LOCALLY owned restaurants around. That is all.", "rating": 2, "date": "2/3/2018"}, {"text": "The chicken Parmesan sandwich was one of the best sandwiches I&amp;#39;ve ever partaken of!  This place is pricey - but a good change every once in awhile.", "rating": 4, "date": "4/11/2017"}, {"text": "Went to this Cheesecake Factory again in April 2019.  And again, a great experience.  Great food and service.  Thank you Salt Lake City Cheesecake Factory!", "rating": 5, "date": "4/25/2019"}, {"text": "Brevin (employee 246) was fantastic! Loved his cheery attitude, sweet smile, and quick service. Such a good dude!!! Also, a rad tie", "rating": 5, "date": "5/18/2019"}, {"text": "Service was prompt and good , I ordered filet mignon medium but I received an overcooked well done steak. If you serve steak and ask customers how they want it cooked then it should be done as ordered. Don&amp;#39;t order steaks here, waste of money!", "rating": 1, "date": "5/3/2017"}, {"text": "Such a large menu, that it&amp;#39;s hard to get bored eating here. A little pricey, but the portions are huge so keep that in mind. Appetizers are big enough for a meal, and entrees are large enough to take home lunch for the next day. They have two pages worth of cheesecake selections, and everything I have tried has been delicious. If you just want cheesecake, they have a walk up counter at the entrance.", "rating": 4, "date": "8/19/2018"}, {"text": "I was so disappointed with this place that I will make this short and sweet.<br&gt;<br&gt;Pros: Convenient location. Parking validation.<br&gt;<br&gt;Cons: Overpriced. Average food. Slow service. <br&gt;<br&gt;Took 40 minutes to bring our food (which were lighter fare pasta dishes) and our waiter disappeared. Did he clock out? Did he take a smoke break? I dont know but we had to flag down a different waiter to find out if our food was ready. <br&gt;<br&gt;Had to rush to eat our food in 10 min to make it to our show.<br&gt;<br&gt;Terrible experience.", "rating": 2, "date": "3/27/2017"}, {"text": "The food is always good.  The hit or misses are the waiters.  The waiters here are like a box of chocolates; you never know what you&amp;#39;re going to get. <br&gt;<br&gt;One week I can have an awesome waiter who is on the ball with refilling drinks, clearing empty plates and has just enough personality to make the conversation light and short without being annoying.  Another week you can have the worst possible service ever where your waiter disappears behind the cash register and you spot her eating food and on her cell<br&gt;phone when you&amp;#39;ve already asked for a refill. Three times.  <br&gt;<br&gt;Consistency in service here gets a C- but the food is always satisfactory.  I dislike change so I order the same things over and over again but I&amp;#39;m not upset.  Each dish comes out better than the last time<br&gt;I ordered it. <br&gt;<br&gt;Drinks: tequila or Asian pear martini <br&gt;<br&gt;Apps: firecracker salmon, ahi tuna tartar<br&gt;<br&gt;Mains: pasta lovers get the Pasta DaVinchi. <br&gt;<br&gt;Carnivores: hibachi steak with garlic potatoes, tempura asparagus and a delicious sweet sauce to top it off.  Did i mention the meat is fork tender? <br&gt;<br&gt;Dessert: the portions are so generous here that I hardly ever have room for a slice of delicious cheesecake but you can&amp;#39;t go wrong with the classics like strawberry and turtle.  If you&amp;#39;re feeling fancy and want a stomach ache that hurts so good, get the white chocolate cheesecake. Just don&amp;#39;t look in the mirror afterwards bc you won&amp;#39;t like the gut you&amp;#39;ve created.", "rating": 3, "date": "6/9/2016"}, {"text": "The food is sometimes hit or miss, and on occasion they have been out of the food my party has wanted to order, but the Salted Caramel Cheesecake makes up for it 100% and always makes the trip downtown worth it. The staff has always been friendly and professional, never rushing us out and getting our orders out in a good time. Love coming here to decompress after a long week with friends!", "rating": 4, "date": "9/21/2018"}, {"text": "We made a reservation for my sisters birthday for 8 pm. We arrived a few minutes early and were seated within 10 minutes. Our server gave us his recommendations. Our server was fantastic, filling up our bread a couple times and always making sure we were happy and if he could do anything else for us. They were out of a few dishes that we wanted that were out of stock, however we were all pleased with our food. Good experience, I still think the price is a little to high, however, the food sizes are quite large.", "rating": 4, "date": "3/29/2018"}, {"text": "I&amp;#39;m done with this place. It&amp;#39;s always a long wait and the Hostess is always rude. The only reason I gave it 2 stars is because the food is ok.", "rating": 2, "date": "3/14/2019"}, {"text": "Every time I go to the Cheesecake Factory at city creek I get the WORST service and tonight was no different. First the front table stated they had said our name after we waited 30 minutes for the &amp;#34;15&amp;#34; minute wait although we had been sitting next to them the whole time. Second, our waiter helped all the tables around us except for mine. I would not recommend going here and spending the obscene prices on mediocre food and terrible service.", "rating": 1, "date": "11/8/2018"}, {"text": "I had my birthday dinner here. There was a 30 minute wait on a Wednesday! If you don&amp;#39;t want to wait, see if the round tables are available since those are open seating. Our server was great. We enjoyed our time there. I don&amp;#39;t ever have anything bad to say except the wait times can be long. They are always so busy but the service has never lacked. They even sang happy birthday to me!", "rating": 4, "date": "4/24/2016"}, {"text": "I think the cheesecake factory is delicious. Their bread is soft and tasty and every cheesecake I have tried has been to die for, my favorite is the lemon raspberry.<br&gt;Every meal I have had had been good, not out of this world, but really good. My favorite is the chicken bellagio. The raspberry lemonade is also one of the best drinks I&amp;#39;ve had with free refills. We have always had great service!", "rating": 4, "date": "5/10/2014"}, {"text": "Love this location. They have great service and the best chefs. I&amp;#39;m always happy when I leave. Definitely would recommend! <br&gt;<br&gt;My only advice... Since it&amp;#39;s such a busy location, the wait time sucks, so if you&amp;#39;re going on a busy night, plan an hour or two as buffer. Worth the wait though!", "rating": 5, "date": "1/13/2017"}, {"text": "Took my son for his 24th birthday we had a server named Jordan he was amazing he was on it great personality great Style everyone that the downtown restaurant was amazing and I thank you from all of us it was a great time!", "rating": 4, "date": "8/24/2018"}, {"text": "I am sorry to do this but I feel it has to be said. This was one of my worst dinning experiences I have ever had. My husband and I went to this Cheesecake factory with his parents and man did things go horrible awry.<br&gt;<br&gt;First off, I want to point out that we are big fans of the Fashion Place Cheese Cake Factory (will review later) so we have come to expect a level of service from this franchise. Our dinner started off with an extremely long wait to be seated (to be expected at any Cheese Cake Factory) the major issue was the fact that the restaurant was not very active the night we were there (Sunday). After finally being seated we were shoved into what seemed to be the back of the restaurant. The lighting at our table was extremely dim and we were hardly able to read our menus. All things up to this point were forgivable. <br&gt;<br&gt;Things went terrible down hill when our two year old son was playing with his drink. The cup he had seemed to lose its integrity as he was drinking it and decided to give way all over the table (not there fault). Dripping with drink we began to try and scramble to find some type of help from the service at the restaurant. This is where our nightmare continued. After many failed attempts at gaining the attention of multipule waiters and waitresses. I decided to ask the help of a waiter and his response was that he would come immediately after he finished the table he was working on. But after completing the table he completely forgot the promise he had made and even after our attempts to draw his attention he acted as if we were invisible. After he left I tracked down a bus boy who finally came and helped us clean up our table.<br&gt;<br&gt;Next, I feel because we were stuffed in the back of the restaurant our waiter seemed to have forgotten about us. He never seemed to come and check in on how things were going and even after we complained about our lack of drinks his remedy was to bring each of us triple drinks to make sure we were satisfied (which took up to much space on our table and created a new problem with our two year old) the best part was he brought us the wrong drinks. <br&gt;<br&gt;Lastly, the time on the food took an exuberant amount of time longer than expected. Normally I would plan on one hours worth of time but our food took double (solidifying the feeling that we had been forgotten). I know that there is more that I have forgotten but I truly have to give this Cheese Cake Factory a thumbs down. I will not be returning. I recommend you save your money or make the extra drive to Fashion Place.", "rating": 1, "date": "4/8/2016"}, {"text": "This is by far the worst cheesecake service I have ever had and possibly the worst dinning experience ever. <br&gt;<br&gt;Waited 15 minutes for a table on a Tuesday night no big deal. Waited another 15 minutes for our waiter to acknowledge we exist. Still no big deal. <br&gt;<br&gt;Finally ordering. My partner 23 ordered a blue moon and he has a HI drivers license. The waiter examines it quite thoroughly and hands it back saying thanks and &amp;#34;I&amp;#39;ll be right back with your drinks.&amp;#34; <br&gt;<br&gt;Cut to 10 minutes later the waiter returns saying that he needs to take my partners id because he honestly has never seen a Hawaii dl and his manager now has decided they need to verify his id. We hand him the id and he disappears. <br&gt;<br&gt;Add another 5 minutes on that when he returns to tell us he is sorry it is taking so long but his manager is verifying the id in a book because she needs to make sure it&amp;#39;s not a fake id. <br&gt;<br&gt;I then at that point told him &amp;#34;No! no she don&amp;#39;t. Go get the damn drivers license now we are leaving.&amp;#34;<br&gt;<br&gt;Not 2 min later here comes the manager with the id. I honestly couldn&amp;#39;t make out half of what she said but something to the extent of &amp;#34;what&amp;#39;s the issue here? I&amp;#39;m the manager&amp;#34; I told her there was no issue and asked her name as I gathered our belongings to leave. Fire this person now because she is costing you business. <br&gt;<br&gt;We had before tonight eaten at cheesecake often. This was the last straw I don&amp;#39;t believe that we will be returning for some time.", "rating": 1, "date": "2/16/2016"}, {"text": "I&amp;#39;m a fan of cheesecake. I have a few favorite items on the menu, such as the herbed salmon and baja chicken tacos. There is definitely a lot to choose from, and not everything (in my opinion) is good, but it is a good place to go to so everyone&amp;#39;s palate can be satisfied! <br&gt;<br&gt;At this location, Noah was our waiter and he was sooooo nice and friendly. I made sure to tell his manager that because he deserved it! <br&gt;<br&gt;Since there are only two cheesecake factories in Utah there is usually always a long wait, so make sure to go during non rush hour times!", "rating": 4, "date": "2/7/2014"}, {"text": "More like 2 1/2/stars.  Idk why but this location is not as crowded.  Maybe its the massive food court down the way but its easy to get a table.  I like this location better then Murray because how tall the ceilings are and it feels like Vegas.  Service is hit and miss.  Today Jessica was great and handled our salty soup problems.  For lunch I always order the Renne&amp;#39;s Special.  It comes with half a sandwich, salad, and soup.  Today the soup was french onion.  It came out luke warm and like a bucket of salt had been dumped in to it.  Jessica told us it was her least favorite soup because of that reason.  Wanting soup real bad i was disappointed in lunch and for $35 without tip, I too should have gone to the food court.  I ordered a pizza for my son in which he didn&amp;#39;t eat.  The pepperoni&amp;#39;s are like linguisa and have a strong smell and taste, i could see why a 3 year old would have a problem eating it.  Jessica didn&amp;#39;t ask how the pizza was as it hadn&amp;#39;t been touched.  Im surprised a manager didn&amp;#39;t come by and apologize.  I had 3 containers of food to go, obviously our food sucked.  Overall, this place isn&amp;#39;t cheap, food portions are huge, but you never know service wise what your going to get.  If you feel like dropping some doe for average, this is the place!", "rating": 2, "date": "11/13/2017"}, {"text": "We only came here for the desserts after shopping in the City Creek mall.<br&gt;<br&gt;The location is nice, which is very closed to the mall and when we came, we requested to seat in the bar, as we&amp;#39;re only getting desserts.<br&gt;<br&gt;The waiter provided us with bread and butter, which is OK and serve our drinks.<br&gt;<br&gt;As I came here before, I knew that their &amp;#34;Deuce de Leuce&amp;#34; (something sounds like this, basically, it is caramel type) cheesecake is delicious, so I ordered this ... we also added with Tiramisu cheesecake.<br&gt;<br&gt;We like the caramel one better (5 stars) ... it is just tasty &amp;amp; delicious while the Tiramisu-one is average (3 stars), nothing really special.<br&gt;<br&gt;Their service is good and attentive, she made some short conversation that entertained us.", "rating": 4, "date": "3/28/2014"}, {"text": "City Creek Cheesecake factory has great food. Enjoyed their service. My daughter cannot have gluten and it&amp;#39;s frustrating trying to find a restaurant that works for us. Their menu is great for that. It shows all the Gluten Free items.. Great choice for us!", "rating": 4, "date": "4/8/2016"}, {"text": "Pretty disappointed in today&amp;#39;s visit. Me and my boyfriend came here as a late birthday dinner. I ordered the chicken Madeira and the other dish ordered was the pasta with shrimp and sausage. The chicken Madeira, when I first tasted it, the temperature of the food felt like it was sitting out for 10 minutes or so. It was not even warm, and my chicken barely had the wine sauce. With the pasta, it was was undercooked and it came out with chicken instead of the shrimp so we had it sent back. I&amp;#39;m sure they took someone else ordered cause they said they made him a &amp;#34;new&amp;#34; plate but it wasn&amp;#39;t even five minutes. I also felt bad because a couple next to us were here first before us and we got our food before then.", "rating": 2, "date": "12/26/2017"}, {"text": "Eating here right now and the service is AWFUL!! The hostesses were rude and non-communicative. Definitely not a great first impression. Then the waiter has the personality of a grinch. I wish I could ask for a new one. <br&gt;I wouldn&amp;#39;t come back to this place even if it was free! Too bad because it&amp;#39;s my daughters b-day. What a HUGE disappointment....", "rating": 1, "date": "3/7/2017"}, {"text": "The food is pretty good. We were told the wait time was 50 minutes but it as closer to 90 minutes. I&amp;#39;ll avoid Cheesecake Factory in the future. It&amp;#39;s over rated.", "rating": 2, "date": "3/3/2018"}, {"text": "For almost $90 for three of us I would have liked the meat (Black Pepper Chicken/Shrimp) not overcooked and fried plantains to be plantains, not bananas. (The sauce was tasty.) And the Steak Diane not to be served overcooked (from med-rare level requested) with a proper dijón-forward Diane sauce--not a derivative of a basic mushroom wine sauce. And the third dish (Asian-style fish) we ordered was so-so. Maybe I&amp;#39;d try again if just making a dessert visit. We liked both cheesecake styles we tried. (German chocolate with vanilla layer and macaroon crust; and a mango key lime.)", "rating": 2, "date": "9/15/2016"}, {"text": "There is something for everyone. No matter what you want they have a little of everything. They excel at cheesecake but don&amp;#39;t forget the fried mac n cheese. Easily the best food they have. Tuxedo cheesecake is my favorite cheesecake.", "rating": 5, "date": "9/15/2016"}, {"text": "I waited at the cheesecake counter for almost ten minutes. There were two employees working back there, one walked back and forth several times as I stood right by the register waiting.  Then four other employees gathered behind the counter. And I still waited... 6 employees ignored me ?", "rating": 1, "date": "3/18/2019"}, {"text": "I have eaten here more times then I would like to admit...and I have had so many different experiences. <br&gt;<br&gt;I will just start by saying that for the most part the food is always decently good. I had the best lettuce wraps I have had here one time. I also had one of the worst cheesecake factory salads I have ever had at this location. <br&gt;<br&gt;But what has been really hot or cold has been the service. <br&gt;<br&gt;On a recent visit our waitress was hardly a waitress at all. It took over 10 minutes for her to come and introduce herself or give us water. After about another 10 minutes, she came by again and said &amp;#34;Sorry I don&amp;#39;t have any time I have other people I have to help that are very needy&amp;#34; so... maybe the Queen of England was also there and we were just chopped liver compared to that? Not really sure what that was about because we were paying customers too. <br&gt;<br&gt;OH WELL. We finally ordered. I ordered a lunch size chicken salad... well they brought out a huge salad and I asked if it was the lunch size and the girl who brought it out assured me that it was the lunch size. Well they forgot the dressing, and it took another 5 minutes to flag down a worker to get dressing. So okay I was a little upset but I got over it. The salad was fine, nothing amazing. I have had better at other locations. Well fast forward to the bills... and they had charged me for a full dinner salad. I told my waitress I only had a lunch, and she said that they gave me a dinner size. I protested and said it was unfair to charge me for something I didn&amp;#39;t order. She eventually agreed and only charged me for the lunch size, but it wasn&amp;#39;t without a big hassle and without her making me feel like I was the most demanding person in the world. I really just wanted to pay the price for what I ordered. So that experience wasn&amp;#39;t good. <br&gt;<br&gt;BUT the next time I came a few days later, I had one of the nicest workers serving me ever. He was so attentive and checked on me the perfect amount of times. He made sure I always had water and that I had all the things I needed. I had the mushroom chicken lettuce wraps and they were simply delicious, fresh, and a great deal. It was about a 100 times better experience. <br&gt;<br&gt;OVERALL..... I mean I think the food is pretty good or I wouldn&amp;#39;t keep coming back. It isn&amp;#39;t the best food ever, but it is open late, and there is a huge menu so it pleases pretty much everyone you come with. I just have trust issues because of the variety of experiences I have had here.", "rating": 3, "date": "11/3/2015"}, {"text": "My family and I checked in to Cheesecake Factory at about 6:25pm. We were there to celebrate family members who were going away for 1.5-2 years, doing service work. The representative told us it would take an hour to get a table (on a Tuesday night), and it was fine. Our ringer notified us at about 7:45pm that our table was ready. <br&gt;<br&gt;We initially asked for a table for 15, but ended up asking for 18. When we got to our table, it was pretty tight, so my brother cleaned a table and a few chairs and added it to ours (so we could fit). We ended up with 20 people. After this happened, one of the waiters came up to our table and told us that we weren&amp;#39;t supposed to do that. Then, he told us how wrong we were to do that. He, then, went to tell a manager named Josh who came out and yelled at us in front of everyone. So embarrassing! He yelled, &amp;#34;You guys said 18 and now there&amp;#39;s 20! What you&amp;#39;re doing is making another family wait longer! You&amp;#39;re also taking a table away that should&amp;#39;ve been cleaned up for someone else!&amp;#34; EVERYONE who was in the restaurant just stared at us. He was so unprofessional at handling a situation under pressure, and both of these guys (Josh and the male waiter with glasses) treated us like we had stolen money out of their cash boxes! <br&gt;<br&gt;I sat there feeling uneasy about the situation, and I went to find the General Manager (Mike). As one of the managers at the restaurant, Josh should&amp;#39;ve felt good that we were bringing in business! We were buying dinner and desserts for over 20 people so we were paying for the service charge as well. Since I don&amp;#39;t believe in paying people (or a business) to treat me like crap, yell at me, and embarrass me in front of other paying customers for a SERVICE (and the GM wasn&amp;#39;t there), I went looking for another manager. I found Cindy and she was amazing! She told us we were ok to sit there. In fact, she cleaned up another table and moved things around so my entire family could all fit. Our waiter (Ethan) was truly kind and easy going. He was aware of the situation and did his best to make it better! He delivered the best possible service that a waiter could offer. If it wasn&amp;#39;t for Ethan or Cindy, the night would&amp;#39;ve been HORRIBLE!<br&gt;<br&gt;Between the horrible interaction we&amp;#39;ve had with Josh and an unknown waiter, and the wonderful help and true customer service from Cindy and Ethan we&amp;#39;re giving this restaurant 2-stars.<br&gt;<br&gt;UPDATE (2 weeks later 8/25)<br&gt;I contacted their GM (the next day) to inform him about Josh&amp;#39;s actions, and he apologized and said he&amp;#39;d send a letter to me as a &amp;#34;formal apology.&amp;#34; Well,  2 weeks later and still no word. Their customer service isn&amp;#39;t about the customer. It&amp;#39;s about their bottom line! Don&amp;#39;t spend your hard earned money here. Their GM doesn&amp;#39;t care so I can see why their manager wouldn&amp;#39;t either.", "rating": 2, "date": "8/8/2017"}, {"text": "This visit was probably the best experience we had. My family was visiting Utah and we decided to play it safe with dinner. The wait on a Saturday night was 65-85 minutes. Thankfully I suggested we eat at the bar area since it&amp;#39;s first come first serve.<br&gt;<br&gt;Our waiter Ron is the highlight of my review.  Ron was very professional,  observant,  and had a great personality. We enjoyed his jokes and his suggestions.  The hibiscus lemonade was &amp;#34;off the hook&amp;#34; as Ron said. During the service he made sure all our drinks were filled. He checked on us when we were eating and also had time to share a few things about himself.<br&gt;<br&gt;We can not wait to go back to cheesecake factory in utah! It was definitely worth the long line.", "rating": 5, "date": "12/1/2015"}, {"text": "I love this place, the food is amazing. I order the shepherd&amp;#39;s Pie and it is terrific. on my last visit with my family we were seated near the door which left us in a breeze each time someone entered the restaurant. Also we were directly behind the waiting area so little children kept peering over the divider at the 6 of us while we ate. Other than the chocolate milk my 11 year old ordered being not very chocolate (it was barely a tan color) the food was exceptional. My 16 year old commented that his burger was the best he had ever eaten. As for the service, it was a little slow, but with the restaurant being crowded I can forgive that. Yes its a little pricey, but if you know that going in there won&amp;#39;t be any surprises.", "rating": 4, "date": "4/12/2017"}, {"text": "The food at every Cheesecake Factory is consistently good but the service here in Salt Lake City was pretty dismal.   Also, the strange thing about almost every one we have been to is that it is a huge hassle when you ask for more bread.    This restaurant was no exception.    They act like it&amp;#39;s a very bi", "rating": 2, "date": "1/30/2018"}, {"text": "Awesome selection of food,  but for the price paid,  the food, while good, wasn&amp;#39;t all that!  We did love the cheesecake though.", "rating": 3, "date": "7/11/2016"}, {"text": "I love this place cheesecake factory is the Ultimate if you want to go have a great meal with your family  just with a Q day every time I come here the customer service is always on point and the food is always on point as well.", "rating": 5, "date": "4/8/2018"}, {"text": "I try to avoid &amp;#34;chain&amp;#34; restaurants when on vacation; but a member of our party wanted to go here, so I caved in.  And was so sorry later.  The best part of this place was the personality of our waiter; however, when the fried shrimp I ordered came out BURNED, he said &amp;#34;Yes, I saw that coming out&amp;#34;.  Okay, if you saw it, why did it come to my table.  After it was taken away, I went to the restroom and the others in my party said the manager came and offered a soup or salad complimentary.  Thank you, but no, I wanted shrimp.  By the time I got it, the rest of my party had almost finished their dinners, so I didn&amp;#39;t finish mine.  <br&gt;This just reaffirms why I avoid chain restaurants.", "rating": 2, "date": "9/5/2015"}, {"text": "Great selections on the menu. Food was good, I got the Fish &amp;amp; Chips and my wife got the Chicken Avocado Sandwich. The fish was cooked well, but the breading was pretty greasy. More so than what I&amp;#39;ve had at other places. <br&gt;<br&gt;The White Chocolate Raspberry Cheesecake was great. My thoughts summed up: Good place to eat, maybe $2-3 overpriced per plate. But I&amp;#39;ll definitely go again.", "rating": 4, "date": "6/26/2016"}, {"text": "The food was mediocre a.k.a okay. Not sure about the service there though because our waitress didn&amp;#39;t seem friendly and too happy to serve us.  She didn&amp;#39;t even bother to ask if we wanted some refill of their complimentary breads and she wasn&amp;#39;t attentive. Not sure if this is typical of their behavior being that it&amp;#39;s a Mormon state therefore pple there seem sort of racist, rude, and very snobby.  We had the same experience at the airport, other restaurants and from Uber drivers.  We&amp;#39;re from California which is more of a diverse cultural state so it was an odd experience for us visiting Salt Lake City, UT with pple&amp;#39;s unfriendly behavioral there.", "rating": 3, "date": "7/9/2018"}, {"text": "This is one of the nicer Cheesecake Factory restos out there. Staff are nice and courteous even if they&amp;#39;re not the ones assigned to your table. Food is excellent. I had a burger with mushrooms and it was delicious. Appetizer salad was huge. Fish taco was yummy. I like how it&amp;#39;s not dark in the restaurant during lunchtime. Bathroom was super clean, too.", "rating": 5, "date": "6/30/2016"}, {"text": "This is a good place to take a break from shopping to eat and relax. There is usually a long wait since they don&amp;#39;t take reservations. But their cheesecake and Parmesan crusted chicken Romano are worth it!! We usually fill up on their hot brown and sourdough breads with butter before our entrees, but we plan on taking some home because you have to get dessert too!", "rating": 4, "date": "10/12/2015"}, {"text": "I love their cheesecakes!!!!<br&gt;<br&gt;Cons: Their menu is huge!!! Makes it hard to go through it all and decide what you want to eat. Their food is also a little bit more on the pricey side, but the food was delicious. I got the Smokehouse BBQ Burger, it was affordable and delicious. They come with your choose of salad or fries. A No-brainer decision for me to choose fries.<br&gt;<br&gt;Their list of cheesecakes are huge. It took me over 5 minutes to decide which one to get. Whichever one you decide, you will love it! But be warned... its about $7-8 a slice and its loaded with calories... I wouldn&amp;#39;t be surprised if we are talking about 1000 calories a slice. But I love it!!!", "rating": 4, "date": "6/23/2013"}, {"text": "I&amp;#39;ve been to Cheescake Factory so many times, I&amp;#39;ve lost count.  This, however, was my first visit to the Salt Lake City downtown location at City Creek.  <br&gt;<br&gt;As with all Cheesecake Factory&amp;#39;s, the setting is nice, the food is good and the overall experience is relatively positive.  I would have to agree here too; however, the service here was below average.  Overbearing waiter at first and then he disappears.  Some things forgotten (i.e. dressing with the salad).  Service issues could definitely be addressed here.<br&gt;<br&gt;Also, minus a star for discontinuing the Salmon Genovese on the menu....that was my favorite thing!  I can&amp;#39;t believe they got rid of it.  Bring it back now!!", "rating": 3, "date": "4/10/2016"}, {"text": "So I&amp;#39;m giving cheesecake factory a 5 star solely because​ I love their cheesecake. I&amp;#39;ve eaten here on several occasions and haven&amp;#39;t been too impressed with their food, but man, their cheesecake is perfect. At this location, their service is really quick and all the waiters and waitresses are friendly and on top of things. If I&amp;#39;m ever craving cheesecake, this is definitely the place that I go to.", "rating": 5, "date": "6/9/2017"}, {"text": "I love the Cheesecake Factory, but I was a bit disappointed with this one. To be fair, we came during Comicon, &amp;amp; the festivities really put a damper on good service in a reasonable amount of time anywhere in downtown SLC. With that being said, the employees here seemed exhausted by anyone that they came in contact with. We opted to grab cheesecake  &amp;amp; some hot chocolate &amp;amp; return to our hotel given the long wait. Considering we had a flight the next morning, it ended up working out for us. Had we wanted to spend some time in downtown SLC, the lack of customer service might have been further disappointing.", "rating": 3, "date": "9/24/2017"}, {"text": "I really like the location of this restaurant, minus the parking!! I don&amp;#39;t know anyone who likes to park in that area,right?!  The customer service is always great at this location, I have always had a great experience at this location.  <br&gt;<br&gt;Food wise, I am a big fan of the Chicken Little&amp;#39;s, although the portion they put is not so little, but who is gonna complain about them putting too much food...NOT me!!! Leftovers are great!!  I have tried different pasta dishes that they have, and I wasn&amp;#39;t wowed, but the chicken little&amp;#39;s always wins with me. The chicken is cooked well, yet moist which wins a lot of points with my belly. haha", "rating": 4, "date": "9/10/2015"}, {"text": "Aloha, <br&gt;Visited Cheescake Factory on the way home form a yellowstone trip June 10th, 2015...It was crowded, and we decided to the 4 of us, My wife, Baby V and Son Dima decided to wait for an outside Table. When we finally were guided to our seats, we found our baby carriage couldn&amp;#39;t be accommodated! We were upset, as we waited 25 minutes for the seat. The manager came, and introduced himself as Michael. He was super professional and accommodating. Listen, problems occur in life. It HOW they are handled that differentiate a good experience from a bad one. Michael is a professional. He was empathetic and got us seated in a location that would accommodate the babies carriage...What can i say. He solved our issue as best as could be done with minimal drama. The meal was fine afterward....<br&gt;Mahalo Michael!!!", "rating": 5, "date": "6/10/2015"}, {"text": "Had a very enjoyable dinner at the cheesecake factory in the city creek this evening. Cody S did an outstanding job regarding service even in an extremely busy weekend environment.", "rating": 5, "date": "11/3/2017"}, {"text": "We came on Dec 24th  around 930pm, there was 6 of us ordering 6 cheesecake, 2 coffee. After 30 finally our server came by, took our order. 20 min later my coffee arrive and and other 21 min our cheese cake arrived . It wasn&amp;#39;t that crazy on that night. We waited for 15 min to have our card swipe . What&amp;#39;s going on cheesecake? I have to pick up our own to go boxes.", "rating": 1, "date": "12/25/2018"}, {"text": "I used to be a fan of this restaurant, especially for a chain. My last few experiences here have been disappointing enough to want to write this review. We went around 8:30 on a Friday night with a larger group (5 adults and 5 kids, two of whom are smaller). We were told the wait would be 45 minutes, which makes sense on a Friday night. We told the hostess we had a party of 10 and needed that to include two high chairs. They gave us our number and we waited....and waited.....and waited. Finally after an hour an a half we asked the hostess how much longer it would be. She told us we were getting close and that a certain party had to leave before we could be seated. All this would have been fine if the service and food had been decent. When we were taken to our seat we were short both chairs and high chairs. The person seating us said our booking had been listed for 8 people. We told him we couldn&amp;#39;t all sit and he shrugged and walked away. We had to flag someone else down who told us we couldn&amp;#39;t scoot the open table next to us over because they were about to use it. They wanted all 10 of us to sit around two four tops scooted together. We finally were able to get someone to allow us to move the additional table and then they had to go pull two high chairs out of a storage closet to get our kids seated. The waiter then brought us water and we ordered drinks. He shorted us a water for one of the kids so I asked him for an additional water and we ordered drinks besides that. We had enough time during the seating wait to know exactly what we wanted to order, but it was almost another 25 minutes before he brought out the drinks and bread and at that point he still forgot the water for the kid he missed in the first place. I asked him for it again and we were able to order our food. We were on two checks and just on our check we ordered well over 100 dollars worth of food (more like $150). Of that only one of the dishes was even half decent, which was the Buffalitos. We ordered factory nachos and they took so long to come out that the entire plate was soggy and cold. We also ordered Chicken Bellagio and one whole breast was nothing but fat and gristle. There was also some weird colored fat on the prosciutto, which is usually quite good. The worst of the meals was the Factory Burrito. It was old and dry and tasted like it had been made and then sat for hours under a heat lamp. The food took so long to come out that this could have been sitting for a long time. The others who were with us also ordered Apple Juices for their kids which came out after two reminders and once we had ordered dessert. The cheesecake itself we took to go because it was so late. The 30th anniversary was half frozen and put into the wrong container so that it was completely squished. Overall what should have been a fun night out that we saved to splurge on was stressful and disappointing. I actually contacted the restaurant directly about these issues before posting my review on yelp. I wanted to give them a chance to respond directly, but this was the second time in a row we&amp;#39;ve had a poor experience and I haven&amp;#39;t heard a word back despite reaching out.", "rating": 2, "date": "4/10/2017"}, {"text": "It was a 30 minute wait on a Monday night. We waited about 20 minutes. Not bad. Our server was training someone, so it took awhile to get our order in. We ordered drinks/food at the same time since we had so much time to look over the menu. The food arrived very fast. In fact, our appetizers and food arrived together which didn&amp;#39;t bother us. All of our food was delicious. My husband said it was the best steak he has eaten in awhile. We had mango/keylime pie cheesecake. It was delicious. We are happy with the service and the food quality.", "rating": 5, "date": "7/18/2017"}, {"text": "I ordered through Grubhub, and boy was I disappointed. I ordered the chicken Madeira. I understand that usually getting food to go from a sit down restaurant isn&amp;#39;t as good, but it&amp;#39;s like they didn&amp;#39;t even finish making my dish. It was barely luke warm, the asparagus was basically raw, not to mention the MADIERA sauce was missing from the chicken MADEIRA. Maybe the food is better if you go in, but I wouldn&amp;#39;t bet on it.", "rating": 1, "date": "5/13/2018"}, {"text": "Terrible experience! Ordered take-out but so many people were congregating in the main area that you cant breathe. I was told 20-25 minutes and it took 45 minutes. The same people serving the cheesecake have to run to the kitchen to check on hot orders. Salad was terrible and not worth the long wait.  Management needs to control the crowd. Its unsanitary for waiters to squeeze between waiting guests and carry desserts. Who wants dropping hair and peoples sweat in their food?", "rating": 1, "date": "8/25/2018"}, {"text": "The food at this specific location and, the wait staff were mediocre to say the least... I thought well, maybe someone has called out or, maybe they aren&amp;#39;t scheduled to the volume of customers they anticipated. I thought this until I noticed our server helping give hugs and creating conversation with several other staff members when, we were still waiting on items we kindly requested multiple times now. Disappointed I wasted a meal at this place. The food was also very &amp;#34;off&amp;#34; the normal flavors of the same items I have ordered at other Cheesecake Factory locations. All around just an unsatisfying experience. Hoping this turns around for other patrons.", "rating": 3, "date": "5/23/2017"}, {"text": "This is always a family favorite restaurant for large groups and birthday celebrations!!<br&gt;<br&gt;Tonight I had the turkey burger-gluten free and sweet potato fries. It was delicious and for our party the food came out fast and hot!!<br&gt;<br&gt;I always have to go with the carrot cake here although it is the cheese cake factory.... The carrot cake is very moist and flavorful that I can&amp;#39;t switch from it!!!  <br&gt;<br&gt;Our waitress had a great attitude and was very personable!!", "rating": 4, "date": "4/6/2015"}, {"text": "Wife and I go to this place occasionally. As an European I must admit it is one of the better restaurants with an wide variety of choices. One day my mom visited and we thought it will be nice to introduce her to the cheesecake factory. She had a good time, until the moment came we asked for the bill. Well we all know how tipping works. Tipping is an American culture. My mom did not understand that as well waitresses really want tips. The point of this is. That out waitress got into a discussion, educating an very smart intelligent person. That she need to tip because that is how they survive. I was so embarrassed for they way my mom got treated.<br&gt;Please don&amp;#39;t get into discussion that you need to be tipped cheesecake factory, that is very low behavior. <br&gt;<br&gt;Hint: we did leave an tip, but much lower we planned after that incident.", "rating": 2, "date": "7/27/2016"}, {"text": "My wife does not think the Caesar salad is good. The dressing is not as tasty. Not enough Parmesan cheese. My grill salmon is average. The restaurant is good, waiter has good customer services.", "rating": 2, "date": "7/7/2018"}, {"text": "In town for business and found a yearn&amp;#39;n for dinner and cheesecake. I&amp;#39;ve been to this location before and was not disappointed. At 5:30pm I was seated within 5 minutes, and had bread and drink in hand in 10min.<br&gt;<br&gt;I went with the chicken stuffed tortillas for a first-time try. A very good dish indeed. Took my favorite slice of healthy super food Godiva Chocolate cheesecake to go as the entree&amp;#39; did me in and there was no room. Great hostess and server!", "rating": 4, "date": "10/23/2017"}, {"text": "Food was average. Not really special. The cheesecake was also not special. We expected more given the name the place had.", "rating": 2, "date": "7/22/2015"}, {"text": "Had lunch here with my wife. We are regular customers at our nearest CCF back in Fairfax, VA. Seated promptly. Ordered the raspberry lemonade. Even with the sugar coated rim it was too tart for me but my wife liked it. I switched to Coke. We split the Lunch Green Salad with mixed greens, tomato and cucumber. I love their balsamic vinaigrette dressing. She ordered the Chicken Bellagio one of her favorites. It was perfectly prepared. She took half home. I ordered the lunch spaghetti carbonara. A little more saucy than I like it but tasty. We were so full we skipped dessert. Will go back.", "rating": 4, "date": "7/21/2017"}, {"text": "Food was very good. 7 people in our party and we each had a different cheesecake and they were all delicious. The only issue was the homeless gentleman sitting next to us who kept begging for our food.", "rating": 4, "date": "5/28/2017"}, {"text": "It&amp;#39;s been awhile since I&amp;#39;ve been to a Cheesecake and oh how much I missed this place.  I had forgotten how good the food is and the portions are humongous but you pay for what you get.  The prices are slightly steep at $12-$18/dish at night but you&amp;#39;ll always have leftovers to take home.<br&gt;<br&gt;The cheesecake is what I come here for and never fails.  The only gripe (or two) are the wait is at least an hour on weekends and the bathroom gets dirty, fast!", "rating": 4, "date": "9/7/2015"}, {"text": "Horrible experience at this location. I called a few days before my birthday to try to secure a spot at one the the large tables in a party room. I had specified that I had a party of about 20 people and they said that it would no problem and practically guaranteed me a spot because &amp;#34;Tuesday nights are always dead.&amp;#34; My party and I arrive to the restaurant and the wait time was TWO HOURS. Very disorganised, and considering it was my birthday was even more disappointing.", "rating": 1, "date": "8/14/2018"}, {"text": "I don&amp;#39;t really like the Cheesecake Factory for regular food - just the cheesecake. We headed on over to this location, because we were walking round the fancy mall, and decided it was time for some sweets. I did order an appetizer of stuffed parmesan mushrooms, a long island iced tea, and a tiramisu cheesecake slice. <br&gt;<br&gt;The mushrooms were good but I&amp;#39;ve had better and the Long Island was good but I&amp;#39;ve also had better. I topped off the meal with their &amp;#34;elegant martini,&amp;#34; which is another word for &amp;#34;dirty martini&amp;#34; and that bastard did not disappoint! It was strong, dirty, and tasty! Unfortunately I was so full that I could not finish the two blue cheese stuffed olives that were in the drink. I was annoyed but it was my own fault. <br&gt;<br&gt;Oh, and the tiramisu cheesecake was to die for. Their cheesecake usually is. <br&gt;<br&gt;I can go for a martini right about now, though.", "rating": 3, "date": "10/16/2014"}, {"text": "We were there for a late lunch on a Monday. Service was very friendly and the menu is more or less the standard Cheesecake Factory menu  - no big surprises, well prepared good value for the money. We like also the new line with dishes below 600 cal.", "rating": 3, "date": "7/28/2015"}, {"text": "Really long wait even after the buzzer went off. Even people after us were seated before us. This is such bad service. Someone should look into it. Manager change possibly?<br&gt;<br&gt;Update: so initially I gave one star, however I think the employees are just having a hard day. Let&amp;#39;s bump this up to 4 stars and give them the benefit of the doubt. Our waiter seems like a nice guy.", "rating": 4, "date": "6/10/2017"}, {"text": "i went shopping with my mom at city creek and she was getting hungry so we came here for lunch.  i was worried it&amp;#39;d be packed at lunch time, but surprisingly we were immediately seated.  it&amp;#39;s a large restaurant and they also have outdoor seating which is nice.  our server was okay and i wasn&amp;#39;t too impressed.  i felt like he was rushing us the whole time and he didn&amp;#39;t come back to check on our food.  he also brought our bill out immediately without even asking us if we wanted dessert or needed anything else.  <br&gt;<br&gt;the food itself was okay.  we got the guacamole and herb crusted salmon salad to share.  the guacamole was okay and there was no kick to it at all, very mild.  i don&amp;#39;t even like spicy, but this guacamole was boring and very bland.  it needed at least more lime juice.  the salmon salad was also just okay.  it was a good portion for two people, but the flavor didn&amp;#39;t really stand out to me.  vinaigrette dressing was too oily and we didn&amp;#39;t even finish our salad.  <br&gt;<br&gt;overall i&amp;#39;d skip this place next time.  there are lots of places to eat downtown and next time i&amp;#39;ll convince my mom to go eat outside of city creek.", "rating": 3, "date": "7/19/2015"}, {"text": "My family loves this place. The inside is very interesting. My husband only likes the filet mignon, which is actually really good, I&amp;#39;d choose this as well. I usually get the eggplant Parmesan which tastes really good, but it&amp;#39;s pretty popular, so try to find something else just in case they don&amp;#39;t have it that day. Even though their menu is big, there aren&amp;#39;t a lot of good menu items. I&amp;#39;ve tried many things here, and I only like three things. Filet mignon, eggplant Parmesan, and super antioxidant salad. The flavors of the other items are pretty mediocre for how much the food costs. I suggest asking the server more detail of their food. It can be either really good or really disappointing.", "rating": 3, "date": "1/3/2016"}, {"text": "The Cheesecake Factory is always a great choice because of several reasons; nice decor, fun ambiance, huge selection for the menu and gigantic portions. We went on July 24th in the evening, we started off and ordered the crab cakes for an appetizer, Wow it was crunchy on the outside and moist on the inside for 13.95 for 3 patties, it was justified. I had the Cajon jumbolya pasta and it was massive with plenty of seafood on top of a hearty pasta noodle. My wife had gumbo over brown rice, it was flavorful and plenty of authentic flavor the gumbo was chunky, full of sausage, lean chicken and spicy . Never would&amp;#39;ve guessed cheesecake would have good soul food. You really can&amp;#39;t go wrong with Cheesecake factory.", "rating": 5, "date": "7/24/2015"}, {"text": "My last two times dining here have been terrible. This location is going downhill fast! I wish I took a picture of our food, the portions were so small! It was pathetic. AND our waiter was the worst, very bad at his job! I need to call in about him, because I did not get his name. I used to love Cheesecake Factory, but now I will have to stay away :( I am sad about this, but I guess now I can explore other restaurants instead of always choosing this restaurant first.", "rating": 1, "date": "12/26/2016"}, {"text": "I love the City Creek Cheesecake Factory. The staff is so friendly and the food is amazing. 5 star restaurant", "rating": 5, "date": "9/8/2018"}, {"text": "Two hour wait and I can&amp;#39;t  order a cocktail... No bar and can&amp;#39;t order from anyone to make the wait a little more enjoyable. Yeah, will never ever come back here.", "rating": 1, "date": "12/3/2016"}, {"text": "My grandson loved it here, especially the Hershey cheesecake. I love the mango lime. Main courses are fine", "rating": 4, "date": "7/6/2018"}, {"text": "Wow talk about bad service. Our waiter checked on us once but checked on his buddy sitting at the next table about 20 times. Never got a refill on water or bread and waited 20 minutes to get our check. Oh wait we didn&amp;#39;t we had to snag him when he was talking to his buddy and just give him our card with no bill. Talk about ridiculous", "rating": 1, "date": "10/6/2016"}, {"text": "Everyone raves about this place, but it&amp;#39;s not that great.  The service isn&amp;#39;t that good - when my shrimp came out it was frozen, so they brought me out some more shrimp that was just nasty.  I&amp;#39;m not going to lie, some plates are delicious.  I just think it&amp;#39;s over-rated.", "rating": 2, "date": "3/8/2017"}, {"text": "I ordered curbside pickup, and they forgot the cheesecake in my order. So, thanks I guess?", "rating": 1, "date": "2/25/2018"}, {"text": "Food and service excellent, large portions. Had healthy offerings at a restaurant that you might think of as just calorie-laden. Very clean restrooms. Enjoyed sitting on the patio and experiencing downtown Salt Lake City. And of course the cheesecake was to die for .", "rating": 5, "date": "6/15/2018"}, {"text": "Our expectations were very low.  We visited at 10 at night on Thursday and the only reason we chose CF was because it was one of the only places still open.  We were pleasantly surprised.  The service was great!  We ordered a bunch of appetizers: stuffed mushrooms, parmesan cheesy garlic bread, shrimp spring rolls, potato tots, Greek salad, and warm asparagus salad.   <br&gt;<br&gt;We liked all the dishes but the shrimp spring rolls which were a disappointment because we couldn&amp;#39;t taste any shrimp.  The Greek salad was the best I&amp;#39;ve had and Greek salad is one of my favorites. The produce seemed fresh and high quality.  We also liked the chocolate tuxedo cheesecake we had for dessert.  Thanks CF for hitting the spot when we needed it!", "rating": 4, "date": "10/17/2014"}, {"text": "So I went to the Cheesecake factory but didn&amp;#39;t try any cheesecake. It was Valentine&amp;#39;s day at about 4:30pm. When we went in, there was about a 5 minute wait. As time went on, I was sure that became at least a 30 minute wait. It was getting packed!<br&gt;<br&gt;Anyway, I got the filet mignon. This was actually the first filet mignon I&amp;#39;ve ever had. It was delicious! Such a tender and big cut of meat. It was well prepared. The service here was excellent. Our waiter kept on constantly checking on us by filling our drinks and just asking how everything&amp;#39;s going.<br&gt;<br&gt;This place was pretty pricy. I think I&amp;#39;d save it for more special occasions. But I know when I do go here, it&amp;#39;ll be well worth it!", "rating": 4, "date": "5/8/2013"}, {"text": "I normally love Cheesecake Factory but our experience at this one was maddening. We went in at about 4:30 or so today (Thursday). We had to wait a few minutes to be seated even though it was not busy at all. But that was no big deal, it was only a few minutes. <br&gt;After being seated in an area where the were no other customers we waited for a server, there were plenty around and, like I said, it was not busy at all. <br&gt;Anyway, we waited...and waited...and waited to be at least acknowledged. But nope. Nothing. Nada. Zip. Tried to politely get someone&amp;#39;s attention, but it was like we were ghosts.  <br&gt;I&amp;#39;m usually pretty patient but this was ridiculous. As I said before, the place was not busy, there were plenty of servers walking around or chatting with each other. If someone would have at least acknowledged us in some fashion, we wouldn&amp;#39;t have been so infuriated.  <br&gt;But we were. <br&gt;Finally, we just got up and left, mentioning that we had been ignored. <br&gt;No excuse for such bad service.", "rating": 1, "date": "5/19/2016"}, {"text": "Very good experience, especially if you eat here on a Sunday! There was no wait and the service was efficient and friendly. I ordered the salmon special which was extremely good and reasonable for what you get. It had a sort of plumb glaze and was served atop a bed of rice with a relish of vegetables and a delicious chimi churi type sauce.", "rating": 4, "date": "6/22/2014"}, {"text": "We went for dinner before a concert and had a great experience! Our meal was delicious and the service was exceptional. The restaurant was extremely busy but our server McKay was very attentive and friendly.  We placed our order and a short time later found out that the kitchen was having trouble with one of the ingredients in our dish. McKay was very nice and explained it to us. He gave us some great options and even Discounted our meal for the trouble. He was one of THE BEST servers I have ever had. We&amp;#39;ll definitely be back. Thanks for making it a great evening.", "rating": 5, "date": "4/9/2017"}, {"text": "My favorite chain.  I&amp;#39;ll admit it, I&amp;#39;m a sucker for this stuff.  Great (albeit extremely caloric) cheesecake.  Huge portions.  The best veggie burger I&amp;#39;ve had at a chain.  Yes, long waits, huge menu, overpriced steak (for the quality).  <br&gt;<br&gt;I also don&amp;#39;t get the fascination with the chicken madeira.  You can buy a good madeira wine from the liquor store for $10 and make several servings of the stuff.  Buy quality chicken and brine it and you&amp;#39;re in business.  <br&gt;<br&gt;Anyway, it&amp;#39;s not Copper Onion and certainly not Forage, but it&amp;#39;s my guilty pleasure.  I do try to support the local places / Mom and Pop dives, but CCF has always been a favorite.", "rating": 4, "date": "2/25/2013"}, {"text": "I got a slice of the Chocolate and hazelnut cheesecake. It was really good, especially with the Nutella on top! <br&gt;My California cheesesteak was instead really really dry...I was VERY DISAPPOINTED.<br&gt;The place is nice and elegant, but I think that they are really overrated and overpriced.<br&gt;$27,87 for a piece of cheesecake and a cheesesteak?!?!? C&amp;#39;mon...", "rating": 3, "date": "7/2/2017"}, {"text": "Had dinner here on a Saturday night. It took about 30--40 minutes wait.<br&gt;<br&gt;Pros:<br&gt;-pizza--chicken, delicious!<br&gt;-Cajun Jambayan pasta--3/5, could use a bit of spice. Chicken was tender and good<br&gt;-mushroom lettuce wrap--good<br&gt;-complimentary brown bread--reason why I went here--yay---coming back just for it. <br&gt;-decor--inside and outside are great!<br&gt;-family friendly<br&gt;<br&gt;Cons:<br&gt;-wait was too long but they have a good system. It&amp;#39;s next to a lot of shops so my friend and I went shopping while the rest of the team waited :)<br&gt;- 1 for the Jambalayn pasta--need more spice for it to be called Cajun! <br&gt;<br&gt;Recommend this place for<br&gt;-dates-", "rating": 4, "date": "5/19/2014"}, {"text": "Consistently good food and service.  Am knocking down one star for their inability to seat a party of 8 together.  We are talking Salt Lake and Mormans and large families.  Took a group for lunch and without a reservation we had to sit at a table and a booth near each other.", "rating": 3, "date": "11/6/2014"}, {"text": "When you have been to one Cheesecake Factory, you&amp;#39;ve been to them all, but I did have a nice dinner experience here on my last night in Salt Lake City.  All of the staff members were polite, our food came out in a reasonable amount of time given it was a Saturday night, and we thoroughly enjoyed our meal.  I would visit this Cheesecake Factory again if I were in SLC.", "rating": 3, "date": "10/31/2016"}, {"text": "You can always count on cheese cake factory to do all the things right. Staff at this location is always really nice!", "rating": 3, "date": "8/19/2016"}, {"text": "WOW...a ton of negative reviews....  But as far as chain restaurants go... I liked it.  <br&gt;<br&gt;The food did come out a little slow, but the server informed me that they had a party of 75 upstairs and it was taking a little longer that expected.  We didn&amp;#39;t mind, we had time (and the manager did come over and inform us as well).<br&gt;<br&gt;The crab cakes could have been cooked just a little more (not crispy enough).  The pasta was yummy and I am glad that we have a cheesecake factory closer to my home.<br&gt;<br&gt;It won&amp;#39;t be a destination restaurant for me, but when I&amp;#39;m kicking around the mall it will always be one of those places I consider... just because you know what you will get...", "rating": 3, "date": "7/11/2012"}, {"text": "Not a fan of chains, but while in the City Creek Center area, we were starving and decided that this looked appealing so we ventured in.<br&gt;<br&gt;If you&amp;#39;ve been to Cheesecake Factory before, you&amp;#39;ve been to this one. The one addition I will add that was a plus was that it had more of an elegant atmosphere, less family style atmosphere, which I can appreciate. <br&gt;<br&gt;I had the veggie burger, which I had not ever ordered from Cheesecake before. It came with a side of fries, and I ordered a margarita which were all wonderful! The veggie burger was firm, not too mushy, but perhaps the best part of it was the side of spicy mayo that came with it. Holy crap, this was like crack in a ramekin! <br&gt;<br&gt;Our server was awesome, on top of his game, without being pushy or cheesy. We got cheesecake to-go to eat later at the hotel. I got my fave, the Godiva cheesecake, but there are a million options to choose from. I&amp;#39;ve never met a cheesecake I didn&amp;#39;t like.", "rating": 4, "date": "3/5/2014"}, {"text": "We went on a Saturday night at 9:30. The line was out the door. You should probably plan on dinner somewhere else in SLC. I usually love this place, but go to another location.", "rating": 2, "date": "3/24/2018"}, {"text": "This is the pinnacle of chain restaurant hell. I am humiliated that I have to eat here. No restaurant should be frequented that tries to serve every style food under the sun.", "rating": 1, "date": "12/29/2015"}, {"text": "I&amp;#39;ve never gotten something from Cheesecake Factory I didn&amp;#39;t enjoy. That was until last night. We told our waiter we didn&amp;#39;t like our meal and he was very kind and quick to bring us something else. I&amp;#39;ve never experienced bad customer service AT THIS LOCATION. Cheesecakes are all wonderful.", "rating": 5, "date": "11/13/2016"}, {"text": "Vomit in the urinal. I watched a table stay dirty for 15 minutes after guests got up. Male host was incredibly rude. I left.", "rating": 1, "date": "9/1/2016"}, {"text": "Horrible Service!!! We waited at least 45 mins to be seated then we sat for another 30mins before we got our drinks and it was 50mins from when we were seated before we had bread. Finally 30 mins later we had our food. The food was cold and multiple orders were wrong. When we talked to the manager all he could do was make excuses and defend his cook. Total lack of customer service!!! The manager finally took one item of our bill after a 10min discussion of why it wasn&amp;#39;t his fault!! I guess they don&amp;#39;t want my business!  I highly suggest finding a different restaurant that has good food, warm food and who cares about their customers!!!", "rating": 1, "date": "1/30/2016"}, {"text": "The chicken madeira is exceptional. With all the variety of food on the menu I wish I could try everything but I feel as though I am cheating on perfection if I choose something else!", "rating": 5, "date": "1/22/2017"}, {"text": "Went on a Friday night close to Christmas.  Fagettabout the Line.  Way too long of a wait.  I hear it is typical on the weekends at this location so we went elsewhere.  Since we were staying at a hotel at City Creek we tried again on Sunday.  One of the only restaurants downtown that was open.  No line!  We were seated promptly and had a great server.  The meal was to die for.  I had steak and chicken that was incredibly delicious. Mashed potatoes oh soooooo good.  You can&amp;#39;t leave the place without having a slice of cheesecake.  The best on the planet!  Server, Gabriel is outstanding!", "rating": 5, "date": "12/12/2016"}, {"text": "We went to dinner with friends and always enjoy the decor and atmosphere is fine, except it is always crowded and loud.  Make sure to request a booth as the tables are so close to each other it would be hard to have a halfway private conversation.   Our server was pleasant and attentive.  The menu is so extensive and they were able to accommodate my special requests with food choice.  I think for the price, there are many other local restaurants that deserve your business.  But after a day of shopping with the family or a few friends, this is a good choice.  Just go early and put your name in as a typical wait time after 6pm is 45 min on the weekend.", "rating": 3, "date": "11/6/2016"}, {"text": "We always enjoy CF when we have the chance to eat at one... Especially with the kids. <br&gt;<br&gt;Everything started off great until we ordered, then the wait began. And we waited... Waited... 20 minutes later our drinks arrived. Another 20 minutes went by, and we called our waiter over to inquire about our starter. &amp;#34;Oops, I forgot to put it in&amp;#34;. ::sigh:: &amp;#34;Ok, forget it we will wait for the mains, but can you put another drink order in for us?. 20 minutes later the mains show up and the drinks have not come yet. Oh, and the kids food was forgotten as well. ::sigh:: guess we won&amp;#39;t try to wait for dessert, which is half the reason we came. Let&amp;#39;s go hit the frozen yogurt stand instead so we can get to bed before sunrise.", "rating": 2, "date": "7/12/2014"}, {"text": "Last night we were told our wait would be 50 minutes. It turned out to be about 70. The manager apologized about that without us even mentioning it so that was cool.<br&gt;<br&gt;I do love their bread, and the fact that they refill it. I&amp;#39;ve had their pizza, nachos, burgers, and pasta in the past. This still I tried the macaroni and cheese burger. Just average. Buns were toasted almost to a burnt point. The meat patty didn&amp;#39;t have much flavor or juiciness to it. <br&gt;<br&gt;I think the main thing you gotta do is stick with the pasta dishes. I feel like their tastiest meals are on the pasta menu. Cheesecake is awesome.", "rating": 4, "date": "10/12/2014"}, {"text": "The most awful place to go to. <br&gt;The host was rude and dishonest. <br&gt;I do not recommend you to go to the city creek location. <br&gt;<br&gt;It is not the same experience I had in fashion place. It was much better experience. <br&gt;<br&gt;I will never ever ever come back. <br&gt;<br&gt;I wish you chapter 11.", "rating": 1, "date": "4/15/2017"}, {"text": "TL;DR <br&gt;*Service 5/5<br&gt;*Atmosphere 4/5<br&gt;*Food 1/5<br&gt;This may have been my last time.<br&gt;<br&gt;Went last night. My date and I came hungry. In fact we planned on going to another restaurant but the power was out in their area so we decided on the Cheesecake Factory.<br&gt;<br&gt;*Service was great, 5/5<br&gt;We arrived a little after 8pm and despite seeing several large groups waiting in the lobby they were able to seat the two of us in just a couple of minutes.<br&gt;<br&gt;Our waiter was there when we needed and allowed us space to talk and eat.<br&gt;<br&gt;*Atmosphere was good, 4/5<br&gt;Our placement wasn&amp;#39;t the greatest but I can&amp;#39;t complain. It would&amp;#39;ve been nice to have a little more room between our table and the other patrons. The dim lighting was on the dark side, but I can see that they were setting it up to be more of an intimate dining experience.<br&gt;<br&gt;*Food, 1/5<br&gt;The free bread before the meal was better than the chicken carbonara. Before I ordered I asked our waiter to weigh in on a couple of dishes I was deciding between, they recommend the chicken carbonara.<br&gt;<br&gt;The presentation was bad. Before I even tried it I could tell it must&amp;#39;ve been sitting in the window for 20min. It&amp;#39;s possible this was ordered by someone else and sent back.<br&gt;<br&gt;The dish lacked flavor, was stale and old, lukewarm at best, and extremely oily. Even if the food had come straight from the kitchen it wouldn&amp;#39;t have made up for the lack of taste. Nothing about the food was fresh, from the pasta to the peas.<br&gt;<br&gt;*Wrap-Up<br&gt;I&amp;#39;ve been several times before, generally with a big group. Usually I&amp;#39;m excited to go back and try something else, but this time I left thinking it was my last.<br&gt;<br&gt;It was bad enough that after getting home I hunted for food from the fridge and cupboards.<br&gt;<br&gt;What happened to the quality of food? Where did the freshness go? Where are the spices and flavor?", "rating": 2, "date": "4/14/2017"}, {"text": "Other than being a popular place with a little bit of wait at times we loved the experience and the food and had great service.", "rating": 5, "date": "2/6/2017"}, {"text": "Pretty disappointed with this location. Typically the Cheesecake Factory is always at least 4 or 5 stars. But this one really disappointed me.<br&gt;We were seated in the most awkward location. It was just two of us, we were pushed up against a wall and one foot away from us was another table of 4 really loud and obnoxious people.<br&gt;When there was obviously plenty of other open tables.<br&gt;Next, our food was cold! I ordered gf pasta which is normally outstanding. What I think happened was it was made, and then left out. And it cooled, a lot. The only reason we kept it to eat was because we were in a hurry.<br&gt;Our server seemed like he didn&amp;#39;t quite care, once we mentioned we were in a hurry he stopped making eye contact.<br&gt;We also did not get any bread before our meal. Not that I could eat it anyway, but my husband was missing it. Especially when everyone around us had some.<br&gt;Also, our check didn&amp;#39;t come in a booklet. He just handed us this slip of paper and we were kind of confused why everyone around us got booklets but not us.<br&gt;This was probably the worst customer service we&amp;#39;ve ever received from a Cheesecake Factory.", "rating": 2, "date": "6/4/2016"}, {"text": "My husband and I both got food poisoning from the food we ordered on New Year&amp;#39;s Eve. The server did not follow the health code and our food was cold. Spoke with the supervisor, he is absolutely rude. Go to other Cheesecake Factory and stay away from this location. Horrible service and horrible food.", "rating": 1, "date": "1/2/2018"}, {"text": "I&amp;#39;ve been to this location multiple times and I&amp;#39;m always disappointed. Tonight I order curbside to go. Ordered an appetizer and the shrimp and angel hair pasta. Was about 5 minutes away when they called me to tell me that they were out of the appetizer and offered to make something else which was nice. I get there and food is ready. I get home to find out the pasta was way over cooked. I decided not to suffer through it and I had to make dinner. Looks like I paid 18 bucks for 5 pieces of shrimp and some bread. This was the last time I tried this place. The quality of the food is not worth the price. Gave it two stars because the girl working there was nice and helpful.", "rating": 2, "date": "4/1/2017"}, {"text": "The nachos tasted were good and then I felt sick for 2 1/2 days, the Kobe burger wasn&amp;#39;t good either, ordered it medium and it was bloody and very red. Ordered 1/2 sweet potato fries and 1/2 regular fries,  5 minutes after the burger came out the regular fries arrived and were really, really bland and boring and the sweet potato fries kept &amp;#34;being almost done&amp;#34; but never came.<br&gt;Won&amp;#39;t go back, we had a gift card and even for a free meal it sucked", "rating": 2, "date": "5/6/2014"}, {"text": "I&amp;#39;m pretty against chain/franchise restaurants... But I can&amp;#39;t be against something that is legitimately good, and tasty, and SO MUCH FOOD IN A PLATE.<br&gt;<br&gt;Their location first of all is gold, with not only perfect downtown location, but also in the City Creek Mall. Good deal to go there after shopping, or walking around downtown.<br&gt;<br&gt;Their service is always great. Their food is always well prepared, and always impressing with their cheesecakes, which truly are a joy to any human being that likes cheesecake (Which should be everyone).<br&gt;<br&gt;I love their nachos with the chicken. The presentation for the nachos is great, but the flavor, the texture... the toppings...! the actual chips!!! Thick and crunchy, but not annoying. Great Guacamole, jalapenos, cheese, creamy cheese, onions. sour cream... and the chicken. SHIIIIIIIII. The chicken is so well made. Perfect seasoning, perfect texture... ahh... I&amp;#39;m pretty in love with these nachos.<br&gt;<br&gt;One nice disclosure: They do not validate parking for City Creek. So don&amp;#39;t expect to get your parking paid. They do have a good valet system right beside the restaurant.<br&gt;Also, lots of seating, and nice outside seating too.<br&gt;<br&gt;Chessecake Factory is always a safe choice, since their menu is HUGE. And their quality is pretty good for the most part. But it&amp;#39;s not a magical local experience. Or an organic heaven. It&amp;#39;s a multistate establishment, like chili&amp;#39;s and restaurants of that sort, with a bigger menu and &amp;#34;nicer&amp;#34; food.<br&gt;<br&gt;ALSO, I would definitely stay away from their lemonades/limeades. They are extremely terrible. But that&amp;#39;s it. Also, Chicken Bellagio is quite the plate.", "rating": 4, "date": "7/23/2014"}, {"text": "Honestly i would gave them a zero star if i could. please let me gave you a little background. This was Wednesday, 09/09/2015. my boyfriend and i went there around 5pm, the restaurant had some customers but not like dinner hours packed.<br&gt;<br&gt;Let&amp;#39;s just start off with the server. We got a guy server, after we ordered our drinks and food he never came back to us for good 10-15 minutes. then a lady showed up say she&amp;#39;s gonna be our server. I asked her to bring us some fresh bread because the ones that the pervious server brought to us was bit cold and hard to chew. She started to &amp;#34;explain&amp;#34; (in a harsh tone): &amp;#34; all our bread are like that, i mean i could if you really want to but it&amp;#39;s gonna be the same.&amp;#34; i was like, &amp;#34;the bread is very hard and i would like to have some fresh ones. please do so.&amp;#34; She said, &amp;#34; okay fine, i will bring you some!&amp;#34; seriously, your job is to bring what customers want, not to argue with me how i want my bread!!<br&gt;<br&gt;Then we got our food, till we finished our food, she never come by refill water/check on us/ anything. few minutes after we finished, she brought us the dessert menu but we decided to just skip it and asked her to bring us the check.<br&gt;<br&gt;When my boyfriend got the check, he asked me, &amp;#34; please tell me what does she mean?!&amp;#34; he handed me the bill, the server circled the tips section and wrote a big &amp;#34;thank you!&amp;#34; right next to it. we both felt confused and uncomfortable, &amp;#34;who would just circle the tips section? for what? to tell/ remind us that we need to tip her????&amp;#34; <br&gt;<br&gt;so my boyfriend went to talk to the manager, the manager of that night was a hispanic lady, she explained that the server circled it because not everyone knows to pay the tips, they circle tips on every single customers bill. my boyfriend said, &amp;#34; did you check? because i really don&amp;#39;t think she will circle the tips section on American customers&amp;#39; bills.&amp;#34; by the way, my boyfriend and i are both international college students (asians) but i don&amp;#39;t think there&amp;#39;s any communication/ language barriers that we had with the server or the manager. my boyfriend said to her, &amp;#34; well this is not a comfortable situation, i felt that she is asking and reminding me for the tips.&amp;#34; The manager just acted like it&amp;#39;s not a big deal and said, &amp;#34;oh sorry you felt offended, i will talk to her. you don&amp;#39;t have to pay the tips if you don&amp;#39;t want to.&amp;#34;<br&gt;<br&gt;We both live in the US for over 5 years, and this is the first time i learned that &amp;#34;it&amp;#39;s a common thing that servers circle tips section to remind customers to pay the tips.&amp;#34; We left the restaurant that night so upset and pissed, not only because of the server but more the manager. Just because we don&amp;#39;t look like &amp;#34;American&amp;#34;, so you just assumed that we don&amp;#39;t know &amp;#34;American culture&amp;#34;?!!!!!!<br&gt;<br&gt;WOW I AM SPEECHLESS!!", "rating": 1, "date": "9/12/2015"}, {"text": "There were 6 adults, a toddler and an infant in our party.  Hostess said it would be a 20 minute wait to be seated if we would sit in a booth.  Otherwise it would be a 40 minute wait.  We chose the booth.  The booth was<br&gt;in the back of the restaurant which was fine as it provided more room for a toddler and an infant in a stroller.  The hostess then told us we could not keep the infant in the stroller.  When we questioned why as there were other infants in strollers, the hostess said those infants were sleeping!  She said it was restaurant policy.  Had we not already waited 20 minutes we probably would have left.  Service was very slow, but the food was good.  When the infant fell asleep we retrieved the stroller from the front of the restaurant and put the sleeping infant in the stroller.  I would like to add that the sleeping infant and the toddler did not block the way of the staff or patrons.  We won&amp;#39;t go back again!  I gave two stars for the food and cheesecake.", "rating": 2, "date": "3/13/2018"}, {"text": "First if all the cheesecakes are great, hence the name of the restaurant. I waited 2 hours to be seated which is reasonable because it was super busy. Once seated, I ordered a filet mignon. Keep in mind this particular filet is the most tender and most expensive as well. Our waiter was great, especially for the restaurant being so busy,  Basically the only reason I don&amp;#39;t give this place one star. After waiting another 40 minutes just to get my food, my filet arrived. First of all, it was super burnt, cut in half, and not even juicy or tender at all!!! 30 dollars for what literally looked like a meteor that hit my plate.  Not even exaggerating.  First sign that the chef sucked was the filet being cut in half. Second sign was the fact that it was already easy to cook since it was cut in half but even then, chef manages to burn the filet still!  One half of the  filet was literally charcoal black. Even a piece I kept staring at because it was just so black and hard that even a starving child in Africa wouldn&amp;#39;t even eat it, not even look at it! The other half of the filet was barely even edible but still dry and had a taste that was 1 dollar worth. Not to be mean but I would bet all my money on McDonald&amp;#39;s, because hell I&amp;#39;m sure they can make a better filet and price it at 1 dollar. So not worth a 30 dollar price tag. I should have been refunded for this pathetic plate", "rating": 2, "date": "12/10/2017"}, {"text": "When she told us 45 minutes to an hour wait, she meant to say &amp;#34;we have no clue when you&amp;#39;ll be sat.&amp;#34; this place was good back in the early 2000s. seems like a fancy applebees. i wasn&amp;#39;t impressed. I have a hard time blaming the servers, because I understand how difficult that job can be, and those servers are BUSY! Too busy to give great service, but not too busy to give mediocre service.<br&gt;<br&gt;i&amp;#39;ll come back for a takeout slice of cake.", "rating": 2, "date": "4/13/2014"}, {"text": "The greeters in the front are especially rude here. But I&amp;#39;m used to it I go to the cheese lake factory in California. The wait staff is always nice and the food is always great. But those front people are always  nasty. If there is a long wait I get my name in and then leave. Maybe they don&amp;#39;t get enough tips. I dunt know", "rating": 2, "date": "8/18/2016"}, {"text": "My wife and I with son and daughter in law and one year old grandson went to Cheesecake Factory in City Creek, SLC last night Feb 20, 2017 for dinner. Food was stupendous and I&amp;#39;m a very picky eater. Server was very patient and attentive. I had the Steak Diane. OMG. To die for honestly. And at around $19.95 not even overpriced. Location in City Creek is very busy, but not too bad. The wait was 20 minutes I think, not bad for a busy President&amp;#39;s Day weekend. Wish I could remember our servers name he was really good. Leave time for a wait, food unquestionably worth it. Parking was free for the first two hours but they validate a third hour so really that&amp;#39;s plenty of time. I will definitely be back. - Paul L.", "rating": 5, "date": "2/21/2017"}, {"text": "Second time here and terrible service. They were out of bread and understaffed for a Sunday night a week before Christmas. I used to be a big fan of Cheesecake Factory but my experiences with it in Utah have led me to the inevitable conclusion that they can&amp;#39;t handle crowds. I chalk it up to management sucking big time. We weren&amp;#39;t even given water until our appetizer arrived. I will probably never eat here again.", "rating": 1, "date": "12/20/2015"}, {"text": "As a generic name, they have nothing special to offer. <br&gt;<br&gt;Includes the same dim lighting, same cubicle like seating, trying-to-be-chirpy waiters and their long wait lines. On the flip side,  Service was fast, portions enough for 2 meals, pricey ( dinner for 2-$50). <br&gt;<br&gt;Will be a long time before I go there agin. May try, if this is the only place that is open and you are starving for a week. At least you feel a sense of satiety for sure.", "rating": 3, "date": "1/2/2014"}, {"text": "Came to this location once before about two years ago and the service was horrible. I thought we would give it another shot and guess what? It&amp;#39;s STILL horrible. The soup was brought out cold; almost as if they opened a can and threw it in a bowl. The food was SUPER bland and after waiting for about 30 minutes for some damn cheese.... We decided to just pack up our bland ass food and leave. Never again. (Not to mention the waitress kept dropping our silverware)", "rating": 1, "date": "6/5/2016"}, {"text": "Food was great wait was awful. We were seated quickly, but wait for our food was almost an hour. Then another hour after we were done eating to get our cheesecake slice (which was to go by the way) and ch", "rating": 2, "date": "10/6/2016"}, {"text": "Great experience on a Saturday night. New general manager John, seated Us in the newly-appointed open seating in the bar area. The food was as consistently good as everywhere else and the service was outstanding. Cheesecake Factory has a standard from sea to shining sea.", "rating": 5, "date": "1/27/2018"}, {"text": "Typical CCF,   but an awesome location ... <br&gt;Right next a great mall.  Great layout and helpful polite staff", "rating": 4, "date": "9/25/2014"}, {"text": "Inept service. Every table around us is waiting on something, a check, to go boxes, water, effing bread.", "rating": 1, "date": "5/25/2015"}, {"text": "Wow!  What a poor experience!  The server was so incredibly rude,  interrupting our conversations to butt in and try to be a part of them,  thinking he was funny.  He asked a friend of ours if another one of our friends was drunk after one drink!  The food came out after sitting there for at least a half hour.  Crusty and overheated.  The service was slow and we ended up spending more than 3 hours there.", "rating": 2, "date": "7/19/2016"}, {"text": "I had arrived at the Cheesecake Factory with my co-worker around 9:30pm. There was a good amount of people waiting to be seated. Luckily for us, since it was just two the wait was 10-15 minutes. I eyed the massive deserts and thought I had died and gone to heaven. The hostess seated us and the waitress greeted us warmly. She brought  warm pumpernickel bread which I gobbled quickly with butter. My co worker ordered the fried chicken sliders and I opted for the chicken Tucson. Grilled chicken with tomatoes, asparagus, broccoli doused with balsamic vinaigrette. The taste was lovely and the flavors married well together. The meal was quite massive for an entree which is normal at the factory. When his order came out he looked surprise as he picked it off the appetizer menu. It was a decent size for an entree ha ha. Any way we left there happy and stuffed. Did not have room for any dessert, and I have a huge sweet tooth:)  I will be back the atmosphere and ambience of the establishment was immensely inviting!!!", "rating": 3, "date": "2/22/2014"}, {"text": "Very good service. We had a party of 26(ish) and they were all very attentive, and we got our food (allacard) very very quickly. They even put my ice cream in a separate to-go container so I could eat it then and for easy accessibility. Very,very good and friendly service.", "rating": 4, "date": "12/21/2016"}, {"text": "So my wife and I and some friends had a horrible experience at brunch here a few months ago. I thought to myself that I would never come here again...at least for brunch. After some time my memory of how bad it was has faded. Today we gave it another try and SURPRISE it has been awful, the service surprisingly has been pretty good but the food was horrid. My pancakes were runny doe inside that was discussing. Our server asked if I wanted some French toast instead and I agreed, the French toast was bad at best and then when he gave me the bill he told me he went ahead and dropped the French toast off the bill for us...I only got the French Toast because you offered it me to attempt to make up for the nasty pancakes....thanks for dropping it off the bill. Of course the cheesecake is always delicious and we will continue to come here for that tasty treat but as far as brunch goes...run away.", "rating": 1, "date": "5/12/2015"}, {"text": "So I was looking for a good place to eat but found everywhere to be up the ying yang busy. The cheesecake factory wait was 10 minutes! Fantastic if you ask me. <br&gt;<br&gt;The staff was great. Very friendly and attentive. <br&gt;<br&gt;I ordered the Mexican chicken lettuce wraps. The chicken was grilled, it had diced tomatoes, avocado, sour cream and salsa. The food was fresh and delicious. <br&gt;<br&gt;Very good especially because it is a chain restaurant.", "rating": 4, "date": "12/17/2013"}, {"text": "Having to wait for a table for 1 at 9pm? Sounds strange but ok.. 10min to order ok getting irritated.. 20min for Burger and fries to come out only for the Burger to come out pink when I said Well Done!!  I&amp;#39;m done with this place.", "rating": 1, "date": "6/21/2017"}, {"text": "Would you like garlic with a side of noodles?? Then get the fettuccine Alfredo. The dish looked wonderful and the noodles looked fresh. Unfortunately, the sauce was so heavily saturated with garlic I could not taste literally anything else. I ate about 5 bites of my 16 dollar pasta and my stomach was churning from the pungent garlic smell. I love garlic as much as the next person, but I could not stomach this. <br&gt;Why not tell the waiter, you ask? Because he rarely showed up. It took him 15 minutes to fill our drinks. He asked for boxes and I told him I didn&amp;#39;t care for dish and I did not want to take home. He completely ignored my statement and offered dessert. I would have if my appetite and patience were still intact. <br&gt;I have never received good service here. But I continue to go because most of the food is great. However, this just tipped it for me. I don&amp;#39;t think I can return to this establishment.", "rating": 2, "date": "11/3/2017"}, {"text": "I will eat here but only if someone else is buying and I have nothing else to do that night. I always get the chicken madeira which is actually amazing, but the long wait times, very poorly lit and lout atmosphere, and poor customer service makes this place such a hassle. One of the worst things about it here is that they are constantly changing the menu. They will introduce really yummy entrees then take them away a few months later, and you dont know its gone until you have waited an hour for your table and have to ask the waiter why its not on the menu. The chessecake is good, and for that I would just order a slice to go and eat it at home where I can actually see what I&amp;#39;m doing and hear the people talking to me.", "rating": 2, "date": "10/7/2015"}, {"text": "This review is tough because I actually love cheesecake factory. This location is just sub par compared to other locations. Ordered takeout last night while passing through salt lake city. I ordered the chicken Madeira and a goat cheese and beet salad. Everything was just ok....bland and soggy. About 3 bites into my meal, I found a curly blonde hair....yup....wrapped around the asparagus. I completely lost my appetite and threw everything away. I wouldn&amp;#39;t come back.", "rating": 2, "date": "5/13/2015"}, {"text": "I kinda laugh at the notion that Cheesecake Factory is unique fine dining, but I also laugh at the thought that CF is the devil incarnate.  <br&gt;<br&gt;The pros:<br&gt;Beautiful atmosphere<br&gt;Conveniently located<br&gt;Excellent waitstaff<br&gt;Huge portions<br&gt;<br&gt;The cons:<br&gt;Menu is too extensive<br&gt;Horrible hosts<br&gt;Quantity rules over quality<br&gt;Tables are too close together in certain sections, making private conversation impossible<br&gt;<br&gt;To me, CF is on par with Chili&amp;#39;s or Applebee&amp;#39;s. It&amp;#39;s just there, I never crave it, and it&amp;#39;s simply not worth waiting more than 5 minutes to be seated.", "rating": 3, "date": "11/15/2013"}, {"text": "Food was good, can out cold.  Waiter seemed very stressed and was not conversational.  Getting drinks refilled was a hassle.  Waiter said Brad was out, but tables next to us with different waiter had several servings of bread.  Bad service.", "rating": 1, "date": "12/23/2017"}, {"text": "I&amp;#39;ve never felt compelled to leave a bad review on a business before but I thought I would give a heads up to anyone thinking about ordering to go from here. Don&amp;#39;t waste your time and $$. Ordered from their website online at 6:30 for pickup at 7:20. 50 min seemed reasonable for the dinner rush. Ordered the chicken piccata, kids quesadilla and a slice of cheesecake. Arrived and called the phone number as directed. Was told it would be right out. Patiently waited 20 min, called back and was told that no one had informed them and that it would be right out. Waited another 15 min. Obviously I would of gotten out and got it myself but since I was told it was on its way, I didn&amp;#39;t want to miss them and waste more time. I got my food which was obviously ice cold at this point. The piccata had the lunch size serving of pasta. I specified extra sauce on the side and they gave me a tiny container of a tablespoon of sauce. They did give me the extra capers and lemon though. But the real kicker here is after all of that, I found a long blonde hair in my food. I have dark hair..", "rating": 1, "date": "12/21/2018"}, {"text": "Great! Service was good, atmosphere is fun, and the meal is always yummy; I think I get something different every time I go, and I&amp;#39;m always impressed with what I ordered. AND UM LET&amp;#39;S NOT FORGET ABOUT THE CHEESECAKE. The best around town. I am a huge fan of the white chocolate raspberry and their peanut butter one. Seriously y&amp;#39;all, it is the best. It&amp;#39;s fun to just go for dessert or both dessert and dinner. But mostly just dessert;) My only complaint is the times I&amp;#39;ve had reservations, they hardly ever seat right you at your reservation time. When I check in 10 minutes prior to my reservation, often I still have to wait 20-30 minutes from that check in point. So make sure you reserve earlier than you think you&amp;#39;ll need, especially if you have somewhere to go after! It&amp;#39;s also nice that&amp;#39;s it&amp;#39;s so close to Temple Square and other popular destinations in Salt Lake. They validate City Creek parking!", "rating": 4, "date": "4/17/2017"}, {"text": "Ok first off, I understand that super big restaurants like this can get super busy especially on the weekends. Me and my husband came in on a Saturday night at about 7 knowing it would be crowded, they said it was about a 50 minute wait and we were totally fine with that. We went shopping, came back 50 min later, and they sat us around 8:15. Our waiter was HORRIBLE....I get that it&amp;#39;s busy and a weekend, but cmon put in some effort girl. She took about 10 min to even come give us some water, we ordered, food came about 30 min later and my rice was not cooked at all and the chicken was pink. So I waited about 20 min for her to come check on us and I returned the meal and got something else and yeah just overall really bad service.", "rating": 1, "date": "10/8/2016"}, {"text": "Yummy, but servers forgot about us and half our food. They also didn&amp;#39;t have enough place settings when we sat down. We were outside, so maybe that&amp;#39;s why they forgot about us. Food was also cold.", "rating": 2, "date": "12/4/2017"}, {"text": "We had reservations for a wedding luncheon at the Cheesecake Factory in City Creek. As we are waiting right now, the luncheon is supposed to start in five minutes and they haven&amp;#39;t even started setting up. We have many guests coming and they don&amp;#39;t even seem concerned! Never going through them again. So disappointed.", "rating": 1, "date": "8/28/2015"}, {"text": "After eating here yesterday I will read review regardless of a restaurant being a chain or not.  Every location is different even with identical menus and this is definitely no exception.  Came between lunch and dinner.  Chose this over Twigs as there was zero wait when we cane in.  And thats where the inly star comes from.  Our party was myself, wife , and two little boys.  After ordering waited over a half hour for food which honestly I expect on a busy Friday night but definitely not at 3:30 on a Sunday.  The table was so sticky needed to put a napkin over it to rest an elbow.  oWaitress changed hands right before food came out (thats new)  all food had obviously been sitting for quite awhile as it was either soggy or rick hard.  My little boys were starving and ate(ish) i had tried something new and decided that was my bad ..my wife&amp;#39;s was so bad she just asked the server to please take it off the bill as she could not eat it.. between oil over the top to the bread so hard she could hardly bite it.  Server asked if she wanted to reorder... we had been there over 45 min at that point ...why wait another 1/2 hr till we were all done so she could get another iffy meal.  I found it interesting in reading review the response from the restaurant was basically say something while you are there..well first why should you have to bring so many obvious issues to their attention and secondly we did and the solution was not impressive... oh and to top it off the only one who didn&amp;#39;t get sick after was my wife... who didn&amp;#39;t eat ...", "rating": 1, "date": "10/1/2018"}, {"text": "Just OK. The food was generally speaking ok- not bad but also not good. The pastas we had mostly relied on cream for the flavor. I had to add salt to mine, which is the first time ever I had to do this at a restaurant. The avocado egg roll appetizer was the highlight of the meal. The drink I got was exceedingly weak. The dessert was not that amazing either- got the tower cake. It tasted like a cake mix cake. My husband&amp;#39;s cheesecake was good. The service was good but the timing of bringing dishes to the table was off- everything was rushed. Overall- overpriced for the quality.", "rating": 3, "date": "7/12/2015"}, {"text": "We had 8 people over last night to watch TV and thought The Cheesecake Factory would be the perfect choice for appetizers. Using Door Dash delivery, I ordered almost $260 worth of food (6 orders of roadside sliders, 6 orders of southern fried chicken sliders, 2 Asian chicken salads, and 2 BBQ Ranch chicken salads + tax and delivery). There was nothing wrong with the delivery. It was on time. However, when we opened the containers with the sliders, they were on regular size buns, one extremely thin hamburger patty had been cut into quarters, and the chicken was no larger than a quarter (like a very small nugget - completely lost on that huge bun). We had to combine the meat off 4 sliders to make a decent 1.  I was so embarrassed! I doubt any of our friends ever order from there again.  I won&amp;#39;t. I&amp;#39;m furious that my experience, as a hostess among friends trying to do something really nice, cost me $260. We all agreed it equated to about a $20 value meal. Thank goodness for the salads!", "rating": 1, "date": "11/6/2018"}, {"text": "It&amp;#39;s just your regular chain restaurant but we had a really good experience here. Our waiter was nice and very attentive. I got a spicy Cajun pasta dish off their huge menu and a mojito and both were really good. I thought their food would be worse since it&amp;#39;s difficult to make every dish superb with such a huge variety on the menu, but I was pleasantly surprised. Of course, the cheesecake for dessert (we shared a piece of peanut butter chocolate) was delicious, but who can really mess up cheesecake? Obviously there are more unique spots to check out in the downtown Salt Lake area but we had a good time at this Cheesecake Factory location!", "rating": 4, "date": "12/6/2015"}, {"text": "Poor service. Two of the orders were messed up originally even after the food took a long time to come out. Some of the dishes, such as the salads, were pretty good once corrected but the chicken salad sandwich was not anywhere near its usual quality and the other food was just okay.", "rating": 2, "date": "7/31/2016"}, {"text": "I had a great experience here! The staff was friendly and forthright. As always, the food was delicious.<br&gt;<br&gt;I ordered a drink that was god awful though. It was some strawberry thing that sounded good on paper, but looked (and tasted) like my little pony princess vomit.<br&gt;<br&gt;The manager came over, apologized, and got me a different beverage!<br&gt;<br&gt;All and all I was super satisfied!", "rating": 5, "date": "11/7/2013"}, {"text": "A laughable attempt at upscale chain dining in Utah.", "rating": 1, "date": "6/18/2015"}, {"text": "After a 2.5 hour wait, my food sucked and the waitress didn&amp;#39;t offer to do anything about it. I took one bite, didn&amp;#39;t like it. She asked me how it was, I said I didn&amp;#39;t like it and she said, &amp;#34;oh, okay.&amp;#34; This entree was only chosen after I was told that my first choice was sold out. <br&gt;<br&gt;My husband&amp;#39;s entree, on the other hand, was awesome. Good thing the portions are huge because I ate half of his. <br&gt;<br&gt;Not worth the wait for sub-par food.", "rating": 2, "date": "6/27/2013"}, {"text": "Went with a friend and our three kids. Had good service. Waitress was amazing. I had the shrimp tacos. Although I enjoyed them, I didn&amp;#39;t like that there was very little shrimp, and small chunks of chicken in the mix. Also, I felt like the lighting was to dark and made the environment somewhat unpleasant.", "rating": 3, "date": "2/17/2015"}, {"text": "Wonderful service and great food. We had the Farfalle with Chicken and Roasted Garlic and the Bang Bang chicken and shrimp. So far the best thing I&amp;#39;ve had at The Cheesecake Factory. Great dining experience. Tons of food for the price. Cheesecake (Adams PB &amp;amp; Chocolate) was to die for.", "rating": 5, "date": "1/3/2013"}, {"text": "Tried their steak tacos for the first time and they are unbelievable!!! I would definitely suggest you get those !!  I really didn&amp;#39;t care for their food that much and that I was a little overrated for the weight but the steak tacos would definitely be worth it!!  If you take a seat at the little round tables (the bar) you don&amp;#39;t have to wait.", "rating": 5, "date": "9/26/2015"}, {"text": "This is the worst restaurant I&amp;#39;ve ever been to especially for the price. The food is just simply tastes terrible. Don&amp;#39;t go here you will be disappointed and waste your money. Honestly don&amp;#39;t know how a restaurant with this poor of food is still in business.", "rating": 1, "date": "9/28/2017"}, {"text": "Amazing food bread is good and the cheesecake itself is good.  I do some problems with a long wait and some of the waiters at times can be pushy.  Other than that I would recommend this place to anyone who enjoys some good food and cheesecake", "rating": 4, "date": "4/5/2015"}, {"text": "I ordered the Cajun shrimp pasta. It was cooked perfectly with the right amount of heat.   The hostess and waiter was great.  No complaints here.", "rating": 5, "date": "6/13/2015"}, {"text": "I normally try not to dine at many large food chains if I could help it. But being invited to one, you can&amp;#39;t avoid not going but to make the best of it. With a party of about 10, this particular Cheesecake Factory was near a newly builded shopping mall in downtown Salted Lake City. Actually a Very Nice shopping mall in fact.<br&gt;<br&gt;The waiting was average for our party, but we enjoy the out of town guest and in no time, we were seated. I know that almost all entrees are serve in very large portions as well as being high in calories. <br&gt;<br&gt;I decided to just stay with the small plates and snacks instead. The Santorini Farro Salad was just right as it had fresh chunky tomatoes, cucumbers, beets, red onions, farro and feta cheese in a vinaigrette. A healthy choice and was to my liking. My second small plate I had was Parmesan polenta fries. It was a decent order of about 9 crispy fried polenta sticks. I didn&amp;#39;t care for the luke warm marinara sauce. I also just share  different cheesecakes between 4-5 other guest. Overall, not bad service, attentive and refills constantly.", "rating": 3, "date": "8/17/2013"}, {"text": "If you&amp;#39;re traveling in large groups you may want to chose another restaurant who could handle your party. We were celebrating a birthday and unfortunately for both us and the staff they do NOT take reservations. Obviously this put everyone in a bind. Are party was to large and  clearly they were understaffed. We  had two waiters waiting on us. One whom was pregnant and looked like she was due any minute. Her attitude was not the nicest, but this is to be expected when your 32 weeks and assigned to a party of 40. Clearly my heart went out to her b/c she simply she was struggling. The other waiter seemed overwhelmed and you could tell immediately he was not up for the task. He was all over the place. The drinks, food, checks got mixed up and at the end he was just so rude and not once apologized for all the mixed up. Finally it was dessert time and when  the dessert came out it was placed in a togo box without our request, we knew that was a hint. Lol! Thankfully everyone had a good time and didn&amp;#39;t care about the crappy service we received or the empty drinks that were never refilled, or the snappy waitress who looked like she just wanted her baby out NOW. I was hoping to expect more this time, but yet again I was disappointed with Cheesecake Factory. Sometimes you have to let go and move on. <br&gt;<br&gt;P.S. Our wait time went from 1 hour, 1 20 mins to 1 hour 50. This is why you do reservations to eliminate this.<br&gt;<br&gt;Tip: Don&amp;#39;t come in large groups because they don&amp;#39;t do reservations. Better yet go to BRIOS next door.", "rating": 1, "date": "8/25/2014"}, {"text": "Wow. I think there are tons of people used to having their rears wiped by &amp;#34;the help&amp;#34; writing some of these reviews... <br&gt;Let&amp;#39;s be fair: this place is popular and has consistently tasty food and a menu rivaled by no other restaurant. They honestly have a little of everything you can imagine. Seriously, I challenge anyone to find a better spot downtown which has such a variety! <br&gt;This is also a NEW LOCATION - which people obviously can&amp;#39;t empathize with. Having served tables at three restaurants in my past lives, I can tell you that running a new restaurant location is super challenging - much less one of this size and magnitude. <br&gt;I&amp;#39;ve been here several times since they opened and have had phenomenal service and wonderful food. Wait times for tables have been less than I was quoted, and service was fast and friendly. A hostess even recognized me from two months earlier. I mean, come on people..... If you want it fast, go to Crown Burger. Or better yet, the Mc Donalds inside your WalMart. Otherwise, give it another go and you&amp;#39;ll be pleasantly surprised.<br&gt;I&amp;#39;ll be back here every time I&amp;#39;m in SLC. Guaranteed.", "rating": 5, "date": "8/4/2012"}, {"text": "Do you like to read?  The Cheesecake Factory Menu is lengthy...I mean pages and pages of shit.  It&amp;#39;s hard to believe that they have a zillion items on their menu, and people actually pay to advertise in the menu.  You feel like you are looking at a magazine, and cannot decide what to eat.<br&gt;<br&gt;I have been to the Cheesecake Factory a number of times, I always order something different...and it&amp;#39;s always mediocre.  It tastes as if it&amp;#39;s pulled out of the freezer and thrown into a microwave.<br&gt;<br&gt;With that said, they have a vast array of mixed drink options.<br&gt;<br&gt;Today we decided to order a number of appetizers - Crab Artichoke Cheesy Dip, Fried Zucchini, and Firecracker Salmon.  My favorite was the Crab Artichoke Dip.  They rest tasted mass produced and not made &amp;#34;to order&amp;#34;<br&gt;<br&gt;My husband ordered a Blueberry Mojito, and our kids both had lemonade.<br&gt;<br&gt;3 appetizers, a mixed drink, and 2 kiddie lemonades cost around $40.  Not bad.  But, I could have easily picked up a few things in the frozen section of our grocery store, and made drinks at home for less. - And it probably would&amp;#39;ve tasted better too.<br&gt;<br&gt;No kiddie menus (not with crayons, etc.) - and a 55 minute wait. <br&gt;<br&gt;For whatever reason I continue to eat here...and I am always disappointed when I leave.", "rating": 3, "date": "3/29/2013"}, {"text": "Disappointing chicken n biscuits... biscuits over cooked, skin on the gravy and a crunch on top of the mashed potatoes.  Flavor was ok but the strang part was the server kept reaching over the wall", "rating": 2, "date": "8/31/2017"}, {"text": "LOVE LOVE LOVE LOVE LOVE LOVE LOVE. <br&gt;My family and I were visiting my sister for her college graduation back in 2014 and we all decided to go to The Cheesecake Factory for celebratory dinner. This was my first time and I was really excited to go. <br&gt;It&amp;#39;s in downtown Salt Lake and was PACKED, but we got in pretty quickly. Our server was phenomenal. She was very friendly, funny, didn&amp;#39;t have a problem explaining menu items to us newbs, and everything came out quickly, considering the rush. <br&gt;The food was spectacular. The Steak Diane was probably the best steak dish I&amp;#39;ve ever had in my life. It was cooked perfectly, the mashed potatoes were AMAZING, and the flavor just can&amp;#39;t be duplicated (I&amp;#39;ve tried, thanks Pinterest). Their coffee is superb as well. I nearly stole my hubby&amp;#39;s caramel macchiato because it was THAT good. <br&gt;Of course, the cheesecake is to die for as well. I mean, it better be, it&amp;#39;s the CHEESECAKE factory. The hardest part is picking which slice to go for. My all time favorite is the Godiva Chocolate cheesecake. It is really rich, so pair it with a latte and you have found heaven. <br&gt;I can&amp;#39;t wait to go back.", "rating": 5, "date": "9/17/2015"}, {"text": "Decent spot. My waitress was real nice and I had the Jamaican pepper shrimp and the red velvet cheesecake. I would have made the sauce spicier and served the shrimp over a bed of fried plantains and mango salsa instead of rice and beans. I would have made the bottom layer of cheesecake red velvet instead of chocolate.", "rating": 3, "date": "11/19/2015"}, {"text": "Really good!! We had an awesome server and food was very filling!! And the best part was having that big piece of cheesecake with some Sangria!!", "rating": 5, "date": "10/19/2015"}, {"text": "We have gone to this Cheesecake several times and not had too many issues. We like the food and the Cheesecake is an obvious. We haven&amp;#39;t ever had amazing service though and tonight was the straw that broke the camels back. We were waiting in line to sit in the self seating bar area behind 2 other couples. One of them got a table after about ten minutes. The couple in front of us continued waiting for a while. Then we noticed 2 girls that had walked in front of us all and looked like they were going to sit in the bar area so the gentleman in front of us let them know that there was a line for the tables and they told him that the restaurant had told them there is no line and that it was first come first serve. I then stepped in and explained that yes it is first come first serve but we were all there before they were. They said they weren&amp;#39;t looking for a fight and it was ok. When a table came open the couple in front of us beat the girls too it. So the girls sat at a table where two people had not even stood to leave yet. I asked the girls to allow my wife and I (who were holding a baby this whole time) to have the table because as we discussed earlier we had been waiting for a good half hour longer than the girls had. They refused to move and told me to talk to the restaurant if I wanted anything to be done. So I talked to a server who basically said tough shit to me and I asked for the manager. Manager came out and said although he agreed it wasn&amp;#39;t right that the girls did that there was no way for him to ask them to wait and that the &amp;#34;corporate&amp;#34; policy was whoever sat in the table first got it. I asked if he really wanted people acting like animals to get tables and he said no but there is nothing he can do about it. Preceded to tell me how I was in the wrong and when my wife realized they were about to kick us out for &amp;#34;making a scene&amp;#34; we ended up just leaving. The management could have done a much better job and should have some sort of &amp;#34;line&amp;#34; for the area they are going to let patrons self govern. I never thought they needed that before because I didn&amp;#39;t realize people would be so indecent but manager acted like it was normal and happened all the time.", "rating": 1, "date": "1/20/2017"}, {"text": "I am a big fan of the Cheesecake Factory on State Street, Murray. Last weekend during shopping at City Creek center, my boyfriend and I decided to have dinner at this restaurant at City Creek. I ordered Steak Diane and my boyfriend ordered tenderloin steak. My food is yum but my boyfriend got a bad luck. There were a lot of fat in his tenderloin steak and overcooked for rare medium. It was expensive dinner and he was so disappointed. We won&amp;#39;t come back to this location.", "rating": 3, "date": "2/1/2016"}, {"text": "Thank you for being true to the Cheesecake Factory brand! I had such a bad experience with your Murray location that I stopped going to Cheesecake Factory unless I was out of town. But I had a really good experience at city creek and will continue coming here. Beautiful decor, very different from the others ones I&amp;#39;ve been to. Excellent service, fast friendly and attentive. Even your curbside to go was great. I&amp;#39;ve been here a few times and will continue driving all the way here because of it. My favorite dish is the factory combination chicken Madeira and shrimp scampi. My husband loves the steak Diane. Bring back the crispy taquitos please! Great stuffed mushrooms, sweet corn tamales (minus the spicy sauce), orange chicken, banana cream cheesecake, red velvet cheesecake, sourdough bread, fried Mac &amp;amp; cheese. I can go on and on, I love this place!", "rating": 5, "date": "4/16/2014"}, {"text": "The food here is good, but pricey. You could probably find cheaper, better food at lots of places nearby.", "rating": 3, "date": "5/2/2015"}, {"text": "From reading the Reviews I knew a Saturday would be crazy busy.  I set it up to show up, Put our name down at 3pm.  At that time I was told there was a 2 and a half hour wait for a table of 12.  I totally get it.<br&gt;<br&gt;Our group showed up at 5:45.  Still not ready for our group.  Even down sized our group from 12 to 7.  We waited for another 45 minutes before we were seated.  Leaving our wait for 3 and half hours.  <br&gt;<br&gt;We sat We decided what we wanted to eat.  We ordered.  1 hour later everyone in our groups food comes.  1 HOUR.  Still leaving 2 people in our group with out food. We had to wait another 20 minutes before our sever showed back up to see how the food was and get the rest of our plates. Which one of the plates were for a Pregnant woman.  You don&amp;#39;t come between a pregnant woman and her food.  <br&gt;<br&gt;As we ate we not once saw our server.  The food was amazing.  Our drinks were empty we had to stop the manager just to get water. she finally showed up 45 minutes later asked how our food was and if we wanted dessert.  We ordered a cheese cake and a birthday celebration cheese cake and asked for the checks.  She showed up with the birthday celebration cake and the full cake 10 minutes later (good timing due to the rest of the time was way to long)<br&gt;<br&gt;We then waited for another 40 minutes for our checks.  We almost walked out due to the time it was taking to just get anything.  As we sat there we looked around and noticed tables that were seated after us were leaving before us.  in some cases we even saw tables that were seated for the 3rd time.  We had a prior reservation for 8:30 and we lost that due the time it took there.  <br&gt;<br&gt;I grabbed the manager and told them of how I felt my first experience was there and all he said was Well I wished you grabbed me sooner.  <br&gt;<br&gt;I do not recommend this place at all.  The food might have been great but the wait and service was awful!!", "rating": 1, "date": "4/30/2012"}, {"text": "I&amp;#39;ve never been a huge fan of The Cheesecake Factory, but I had to try the new one at City Creek. We went on a Sunday morning and decided to get brunch. I was actually pretty surprised with the prices. With a drink we were looking at just over 20 which from what I was used to from their dinners, was pretty fantastic. I got a normal breakfast with eggs bacon and toast and my gf got lemon pancakes. The lemon pancakes were pretty good, but didn&amp;#39;t come with anything other than 3 pancakes. My breakfast was nothing to rave about, but it was fine. The server was brand new and had no clue what he was doing. Can&amp;#39;t really give him to hard of a time as we all have to start somewhere. I&amp;#39;d recommend trying the brunch if you are downtown on a Sunday, but there are better places in the area.", "rating": 2, "date": "5/2/2012"}, {"text": "The manager was less than accomadating and kind of rude. The service was slow, but the serving staff was friendly at least", "rating": 1, "date": "9/27/2014"}, {"text": "Just love the cheesecake factory went there yesterday to city Creek in Salt Lake. Very glad they have valet parking, just wish we had one up near Farmington Utah", "rating": 5, "date": "4/1/2017"}, {"text": "As always excellent cheesecake.  Slav our waiter was awesome. He was attentive, efficient and pleasant.", "rating": 5, "date": "7/26/2015"}, {"text": "Lunch was amazing! I had the avocado egg rolls and a heavenly piece of lemon-raspberry cheesecake! <br&gt;Tip: Take a seat in the bar area to avoid waiting.", "rating": 4, "date": "7/13/2012"}, {"text": "Word to the wise...show up BEFORE 11:30 for lunch!!!  I showed up right at 11:30 and was able to get a table immediately.  Within 10-20 minutes the whole restaurant was full with a line out the door!  YIKES!<br&gt;<br&gt;Ambiance --  It looks like every other CF that I have ever been to.  Nice decor, warm and inviting throughout.<br&gt;<br&gt;Food -- I wouldn&amp;#39;t say that they have the best food but it is consistently good and pretty quick for a sit down place.  The Red Velvet Cheesecake is always a standout for me.  It is insanely good!<br&gt;<br&gt;Service --  Our server was Jarret and he was honestly one of the best servers I have ever had!  This is a high compliment considering the amount of times that I have dined out!  He was sincere and attentive without being intrusive.  He cleared plates and refilled drinks frequently throughout our lunch.  Bravo to Jarret for doing such a great job!", "rating": 4, "date": "4/6/2012"}, {"text": "Went there with my husband for our 1st year anniversary...definitely not the greatest impression for my first time at any Cheesecake Factory. It started out ok because as for any nice restaurant on a Saturday night we had to wait about 25 mins to be seated. Our primary waiter was nice &amp;amp; took our beverage order &amp;amp; followed though in giving us time before coming back while we decide on an appetizer &amp;amp; any other beverages we may like. It all went down hill as soon as the server who brought us our appetizer came by. The table was really small for 2ppl &amp;amp; it was already crowed from our large menus &amp;amp; bread basket &amp;amp; two side plates. This particular server, whom I didn&amp;#39;t catch the name of, was obviously in a rush &amp;amp; discourteous as he kept telling me to move the items around to accommodate the large platter so he could put it down. He even was telling my husband to move the items as well. I was trying to tell him that without sweeping the plates &amp;amp; beer bottle off the table that I had no where else to put the items id already stacked &amp;amp; scooted to the side. He hastily plopped the platter down &amp;amp; took off, but not before I had asked him to take the beer bottle to toss as I didn&amp;#39;t want to accidentally knock it off &amp;amp; shatter it. He yanked it out of my hand &amp;amp; said, &amp;#34;yeah, it&amp;#39;s that kind of a night.&amp;#34;<br&gt;I work in customer service &amp;amp; that was just uncalled for! When our original waiter came around to take our order we placed our order to go- he was a bit surprised. We explained we did not want to spend our anniversary in an already crowded place if we were just going to be treated like that. My husband said that in the many times he&amp;#39;d been there he&amp;#39;s never had service such as that. The manager was informed &amp;amp; very apologetic &amp;amp; even went as far as paying for our entrees and getting us dessert. I appreciated our original waiter &amp;amp; the manager, Tyler. I feel bad that one servers customer service skills were lacking &amp;amp; that it effected the waiter, so we left a small tip anyhow. <br&gt;Overall it was a sad evening for dining out. Too small of tables, too loud &amp;amp; crowded &amp;amp; the menu is SO big that it takes quite some time to review &amp;amp; decide- it has way too many options. And they really should accept reservations on the weekend. Although it was a rough first experience for me I think I&amp;#39;ll give it some time &amp;amp; try it again on a weekday with a reservation.", "rating": 2, "date": "7/18/2015"}, {"text": "Very crowded location with too small of a waiting area. Even at 5:00pm there was already an hour wait. Dim lighting makes it hard to read the menu. The restaurant is 1 floor with the highest ceiling I have ever seen. Seems like they could have made a second floor for more seating, and to increase the size of the waiting area. Tables are all very close so there isn&amp;#39;t any privacy. Good variety of food as is at any Cheesecake Factory. My wife and I shared and enjoyed the bang bang chicken and shrimp. It is made with curry so it has a mild spice to it. Unfortunately there is no raspberry chocolate cheesecake option (only white chocolate which we don&amp;#39;t prefer), so we went with lemon raspberry with fudge on the side. It cost a whopping $9.90. The piece was pretty small and wasn&amp;#39;t anything to smack our lips about. My wife can make way better cheesecake at less than $10 a slice.", "rating": 3, "date": "11/21/2014"}, {"text": "They were amazing!!!! The waiter was so nice and are drinks were always full. One meal was not the best so they refunded us. The cheese cake was delicious. This is 5 stars because it was awesome!!!!!", "rating": 5, "date": "4/7/2017"}, {"text": "I could not believe the wait we had AFTER our buzzer went off indicating our table was ready. We were a party of 5 hanging out outside, with my rambunctious and tired one year old, when the buzzer went off indicating our table was ready. We went in and was told to stand at the hostess table as we would be seated shortly. It was super cramped at the hostess table but we were expecting to be seated shortly so it wasn&amp;#39;t a big deal. Unfortunately, that was not remotely the case! We waited another 20minutes while other parties (same size as ours, some larger, some smaller) were all seated. It was so incredibly uncomfortable. We kept getting bumped into by both staff and patrons. We asked multiple times when we would be seated and we kept receiving the same answer &amp;#34;soon&amp;#34;. Mind you, we had already waited 45minutes for our buzzer to go off. Needless to say I was not very happy with any of the hosts or the managers who were foreseeing this fiasco with us and with the giant crowd growing inside at the host stand. However, the best part about our visit was our waitress. She was absolutely fantastic, I wish I knew her name so I could give her credit. She did an amazing job regardless of how busy she was. Thank you! Oh and the food was ok--some of us loved ours, others of us, not so much.", "rating": 2, "date": "12/13/2016"}, {"text": "Who doesn&amp;#39;t love cheesecake factory? Bang, bang chicken and shrimp, crispy chicken costoletta, cajun pasta jambalaya, and the cheesecake... I could go on. Something for everyone here. If you&amp;#39;ve never been, I recommend it.", "rating": 5, "date": "12/12/2014"}, {"text": "I love the food at Cheesecake Factory! This review is more about the service. I give the service 0 but the food 4 so this is in between. We were seated about 6:45 last night and we honestly didn&amp;#39;t have a waitress even talk to us until about 7:15. That&amp;#39;s ridiculous. The manager needs to do his\\her job and train these kids. I will not return to this location. MANAGER TRAIN YOUR STAFF! I should be asked for my drink selection within a couple minutes of sitting down not 30.", "rating": 2, "date": "6/21/2014"}, {"text": "big portions, mediocre food. nice staff, had us wait for a table even though the place was empty at 5pm on a Sunday! I can&amp;#39;t believe they use plastic cups for water, cheap plastic mugs. come on, I&amp;#39;m paying $17 for an entree. good cheesecake of course.", "rating": 3, "date": "5/6/2017"}, {"text": "Haters be hatein.  This place is always a classic fall back. Always good. Great Food. Big portions.  Delicious cheese cake. Stop complaining its a good time.  Go early on weekends long wait times!", "rating": 5, "date": "6/5/2014"}, {"text": "I think I have just burned out of this place a long time ago. I really don&amp;#39;t like to wait for an hour or more just to eat at a chain restaurant. But you really can&amp;#39;t go wrong with one plate of food that could feed a small family. I will never understand anyone that eat a huge piece of cheesecake after that much food. But you can definitely get it to go. I am sure I will be back at some location.", "rating": 3, "date": "3/24/2014"}, {"text": "That was awful!  My streak was small and ice cold.  Service never came around to refill drinks.  If you want bread it comes after the meal.  Desert maybe if you want to pay $9 for a piece of cake.  Would not eat there.  Over price and small.", "rating": 1, "date": "4/4/2017"}, {"text": "The cheesecake is pretty good, I&amp;#39;ll admit. But that&amp;#39;s where it stops. Generic chain food in a shiny package. Also, they accidentally erased our order while we were there so that we had to wait about an hour for our food. Luckily we got free cheesecake.", "rating": 2, "date": "8/20/2014"}, {"text": "The food in general is pretty good here, but the service is always less than I expect. I definitely wouldn&amp;#39;t say awful, but the seating and food wait times can be ridiculous. In most of my visits, all my waiters say they&amp;#39;ll be right back with something and it takes close to 5 - 10 minutes, even for something as simple as getting me a steak knife. It might be that they&amp;#39;re always understaffed, whatever it is, it&amp;#39;s frustrating. I tried the Ribeye last week, and after sending it back once for being extremely overcooked, it came back undercooked and it just wasn&amp;#39;t that good. I&amp;#39;ll probably give this CF another try, because it&amp;#39;s right there at City Creek and is convenient when you&amp;#39;re they&amp;#39;re shopping, so hopefully it turns out better.", "rating": 3, "date": "5/28/2015"}, {"text": "I have dined at numerous Cheesecake Factory Restaurants across the U.S. and the service has been consistently good and the food has always been of the highest quality. This location was another fine example of the well-developed Cheesecake Factory brand. <br&gt;<br&gt;The location of this restaurant was great, right in the middle of the pretty shopping mall and the restaurant itself had beautiful high ceilings and low ambient lighting. We had to wait about 15 minutes for a table, but the weather was nice and we enjoyed a bench near the fountain. <br&gt;<br&gt;Our server was a top-notch professional who quickly greeted us and took our drink order. Thankfully, we know how large their portions are and skipped ordering an appetizer. Unfortunately, they ran out of salmon so I couldn&amp;#39;t enjoy my favorite Miso Salmon dinner, but I stepped outside my comfort zone and was pleasantly surprised by the Oven Baked Herb &amp;amp; Lemon Chicken. I would&amp;#39;ve preferred a green vegetable instead of cooked carrots but the Mashed potatoes were yummy and our drinks from the bar were really good too. After dinner, I decided to splurge and order the Strawberry Shortcake a la mode and a cup of coffee. I expected a moist slice of cake but it was more like a biscuit topped with berries, whipped cream and ice cream. The cake was a little on the dry/hard side but still yummy. Perhaps I should&amp;#39;ve stuck with cheesecake, Lol. <br&gt;<br&gt;This is where things got bad, hence the 3-star rating. I added the cream and sugar to my coffee and used my unused spoon to stir it up. I then took a sip of coffee from the spoon and licked it, only to discover with my tongue, chunks of dried food on the spoon!!!! YUCK!!! I politely told the server about my surprise discovery and his reaction was honest and professional. He acknowledged the problem and immediately apologized. I asked for a new coffee and he promptly returned with one, along with the manager who also apologized and offered anything to rectify the situation. I&amp;#39;m really not one to try and get free stuff or discounts unless something is really really bad, so I just accepted the apology and finished my coffee. The server returned and once again apologized, and seemed visibly upset about the whole situation. He said that if it were him, he wouldn&amp;#39;t have been as nice as I was.  He returned with the bill and said that he just couldn&amp;#39;t accept my reluctance to ask for compensation, and in order for him to feel good about it, he insisted on at least comping the dessert. What a nice gesture. <br&gt;<br&gt;We enjoyed our dinner and the truly professional level of customer service from the server and management, but I guess the dish washing and table setting staff members need to pay closer attention to their jobs. <br&gt;<br&gt;Thanks to this experience, I will now closely inspect my silverware before digging in at any restaurant.", "rating": 3, "date": "7/29/2014"}, {"text": "this brand new location located in downtown Salt Lake is fantastic.  We started the evening with Chicken lettuce wraps, that would put PF Chang&amp;#39;s to shame.  My main course was the spicy cashew chicken with the sauce on the side and it was delicious.  I am usually not a fan of chains, but I love this place", "rating": 5, "date": "9/27/2012"}, {"text": "The service was fantastic and extremely helpful.  Well done Scott!  Food seemed slightly undercooked but probably rushed because we arrived late in the evening.  Great experience overall.", "rating": 4, "date": "8/1/2015"}, {"text": "Worst Cheesecake Factory experience I&amp;#39;ve ever had. I&amp;#39;ve been to half a dozen different Cheesecake Factory locations in California, and I&amp;#39;ve always had a positive experience. This location sucks. It took forever to get a glass of iced tea. Right when I was wondering what was taking so long with the tea, our server walks by with a half full glass of iced tea saying he&amp;#39;s looking for more tea. A few minutes later he finally found some and drops it off at the table. As I&amp;#39;m stirring in the sugar I noticed dozens of black specks floating around in my glass. I assumed (and hoped) they were little bits if tea leaves. The glass was also dirty, it had bits of caked on particles. <br&gt;Our server brought us bread, it must have been sitting under a warmer for hours because it was incredibly dry and crusty. No amount of butter could save it. <br&gt;The main course was ok. I had a pasta dish, the pasta was very oily but it tasted ok. <br&gt;The service was also incredibly slow. I think we were there over an hour just for lunch. Our server seemed to want to be our buddy and kept saying things like &amp;#34;cool man&amp;#34; and &amp;#34;whatever you want man&amp;#34;. He even patted my husband on the back as he was leaving the table once. Not very professional at all. <br&gt;We skipped dessert. Normally I love cheesecake, but I just wanted to get out of there ASAP.", "rating": 1, "date": "9/25/2013"}, {"text": "My wife and I went to the Cheesecake Factory on a Monday afternoon around 5 pm. While the place was pretty empty we were asked to wait to be seated. That process was extremely slow. It looked like one party was seated every five minutes. So we waited more than 15 minutes for a table in an almost empty restaurant. We asked for an outside table which we got. Unfortunately nobody had closed the sun umbrellas (there was no sun anymore), so getting to a table required some careful maneuvering for people taller than six feet (which included some of the waiters. The service was slow, the food was okay, but nothing special. Overall a very disappointing experience.", "rating": 2, "date": "10/3/2016"}, {"text": "This CF is on par with the chain. If you like CF in general, you will not be disappointed. Wait staff is top shelf!", "rating": 5, "date": "7/6/2014"}, {"text": "I feel like the Cheesecake Factory&amp;#39;s menu is far to big. But then again, that&amp;#39;s probably why they are as popular as they are. But this location is really awesome. I hadn&amp;#39;t been here before or realized how absolutely HUGE it is. The ceilings must be 30 feet high. It reminded me of being at a Vegas casino honestly. Our server was good. The food is above average like most Cheesecake Factory items. Large wine and liquor selection. Foot rubs offered in the bathroom. But they kicked my gay friend out because he was gay...I&amp;#39;m kidding, I just hear people say City Creek is judgmental and I don&amp;#39;t understand how a building with a bunch of stores in it can be judgmental. In any case, there was no wait, we were let right in, and I&amp;#39;m impressed. I say come here if you&amp;#39;re right between Fashion Place and City Creek, this will probably be a slightly better experience.", "rating": 5, "date": "11/16/2013"}, {"text": "Delicious. Good service. Wide variety of food if your group cannot agree on one type of restaurant. Beautiful interior. Smooth operation. Yes restaurants do get busy people, what did you expect? Everyone from the hostess to the chef was efficient. And it was yummy.", "rating": 5, "date": "11/30/2012"}, {"text": "Great service, great choices,  the Cajun pasta was awesome and enough food for multiple people. Cheese cake is a must have although you will prob take it to go", "rating": 4, "date": "9/25/2014"}, {"text": "the food and service was better couple years ago, but last time i was there our food was late and when i asked the waiter about the reason, he said &amp;#39;&amp;#39;&amp;#39; if you don&amp;#39;t want it ill take it back&amp;#39;&amp;#39;, so rude.<br&gt;<br&gt;the two stars because i love their cheesecake", "rating": 2, "date": "1/28/2016"}, {"text": "Don&amp;#39;t trust their claims of &amp;#34;a short wait&amp;#34;. That was over an hour. Not cool.<br&gt;The waitress was nice. But the servers helping put a ridiculously hot kids plate of Mac and cheese in front of my 3 year old. I had a burger, it wasn&amp;#39;t very good. <br&gt;I wasn&amp;#39;t terribly impressed with the place. It&amp;#39;s a good things it&amp;#39;s relatively cheap.", "rating": 1, "date": "12/27/2013"}, {"text": "DONT USE CURBSIDE SERVICE. I normally love Cheesecake Factory and decided to pick some up after work to take home. I called it in and they offered me curbside service. I had never used it but loved the idea so I agreed. They asked me what kind of car I drove and said nothing about calling when I got there so I assumed they would just look for my car. They told me it would be ready in 30-35 minutes. I showed up at 40 minutes and sat there for 10 minutes watching staff approach all the cars but mine. I finally got out and learned I had to call and tell them I was there. The first staff member approached me thought I was someone else and informed me my order wasn&amp;#39;t ready. By the time I got my order it was over an hour when they said it would be ready in 30-35 minutes. I tried to be patient about it but when I got home I realized they had left out the sides to my entrees. If it&amp;#39;s going to take an extra 25 minutes, the least I expect is my correct order.", "rating": 1, "date": "2/14/2018"}, {"text": "We had heard how great Cheesecake Factory was but this was our first time finding out for ourselves. The food was as good as we hoped it would be and then some. <br&gt;I got one of the Skinnylicious Salads on the supplemental menu and it was loaded with yummy beets, asparagus, goat cheese and healthy options. I was going to get the skinny balsamic too but the server brought my husband his ranch dressing early and I had to taste it. It had a stronger that usual garlic flavor, obviously homemade and was fantastic on my salad. <br&gt;Hubby got the Skinnylicious Turkey and Avocado sandwich and he loved it! My daughter ordered the bowties, butter and Parmesan which she practically inhaled. From the fresh, soft bread to the end of the meal, it was all terrific. We unfortunately left no room for the actual dessert but that was okay. <br&gt;Our server was also fantastic, quick to take care of our needs despite the fact that the place was slammed, gave us helpful information and where to go within walking distance and how to get there too. <br&gt;We can&amp;#39;t wait for the one to open in Reno now!", "rating": 5, "date": "6/23/2014"}, {"text": "A little overpriced, but still a good meal. Only suggestion I could make would be to fix the soap dispensers in the men&amp;#39;s restroom.", "rating": 3, "date": "1/9/2015"}, {"text": "I don&amp;#39;t want to give this place a bad rating, nor do I want to give it a good one. Service is a lot faster than my hometown Cheesecake Factory, but that was pretty much the only good part. I got the soup and salad lunch combo, seeing as most of their portions are huge and smothered in buttery sauces. The texture of the tortilla soup was nasty, and the salad was just a pile of spring mix with a couple tomatoes floating around. Their blue cheese dressing is amazing, I&amp;#39;ll give them that. I don&amp;#39;t go to Cheesecake Factory very often and this was just another reminder of why that is.", "rating": 3, "date": "9/4/2013"}, {"text": "I know, I know. It&amp;#39;s a generic, chain restaurant. Hate it! Burn it! Harass the staff for their negligence! Here&amp;#39;s the catch to this review: I ordered to slices of cheesecake to go from their to-go counter by the door. The cashier was helpful and prompt, the slices of cheesecake were delicious, and I didn&amp;#39;t have to wait that long even though people were overflowing out of the lobby to be seated AND to get to-go cheesecake. So, all of those add up to a very pleasant experience and positive review. Naturally I reserve the right to update if I ever dine in at the actual restaurant, but we&amp;#39;ll cross that bridge when we get there.", "rating": 4, "date": "12/23/2013"}, {"text": "Great food and atmosphere,  we did have to wait a little while before being sat down. Other than that love it here", "rating": 5, "date": "3/27/2015"}, {"text": "Make sure you have your sneakers on before you get here because you will be running from here.  Hour and 1/2 lunch ?  Really?  slow slow ssllooww  ssslllooowww.   Food was slow slow..I mean so so..  Spend your hard earned money at many local better server eateries in the area.  This lunch was a sh*&amp;amp; show", "rating": 1, "date": "4/26/2013"}, {"text": "Nasty dirty glass and hair in my food. They didn&amp;#39;t comp my food. I&amp;#39;ve worked in restaurants and never seen that before. Went to celebrate my sons bday, but our waiter wasn&amp;#39;t the most attentive and felt like we were waiting a lot more than necessary. Not a fun place to celebrate a bday. Nothing special done. I would give 1 star but our cheesecake was good. Food was good before finding hair.", "rating": 2, "date": "6/25/2016"}, {"text": "Came in with a group of friends around 5pm. The host upon entering rude and made us feel like we were a burden for entering the restaurant.  She may have been the manager come to think about it. Anyway, we were quoted 20 minutes. Five minutes into out wait and after seeing this same host/manager running back and forth from the front without smiling and continuing on with her bad attitude with others we decided to leave.", "rating": 1, "date": "10/18/2014"}, {"text": "Pretty good and fast service. I came for a business lunch and ordered a fried chicken salad. It&amp;#39;s lunch menu item but there was plenty of food and I actually didn&amp;#39;t finish it all. Overall for a quick fix for lunch, not a bad choice.", "rating": 4, "date": "2/7/2014"}, {"text": "Generic.  Formulaic.  Same in all Cheesecake Factories.  Decent and plentiful food portions.  Pricey slice of cheesecake.  You know what you get before you  go in, and I guess that&amp;#39;s good.  Not a place for gourmands or those wanting an epicurean experience.  More for younger crowds wanting to go where younger crowds go.", "rating": 3, "date": "4/3/2013"}, {"text": "Service was poor. Moments after we sat down the waitress tried to hurry us to order  without giving us time to look at menu. She stated there was a huge table next to us and wanted to get our order going. Order a salad without tomatoes and a chicken dish. Salad came with tomatoes and chicken was super cold. I let them know and the took it back to heat it up. Instead of new plate they tried to just heat up my plate but was still cold on bottom.  Attitude of staff was poor and food was terrible.", "rating": 1, "date": "7/18/2015"}, {"text": "We experienced the best customer service ever last week while visiting this place. We got there and realized we needed to leave quick so we didn&amp;#39;t miss the train home. We asked the server to just box our food as it came out for a to go order.  The manager swooped in and helped and made it happen. They were so nice and even threw in some free cheesecake and free extra bread! I&amp;#39;ll continue to come here every time I&amp;#39;m in town and in city creek! Thank you to the server with &amp;#34;t Rex&amp;#34; arms and to the manager that night!", "rating": 5, "date": "7/25/2016"}, {"text": "I have to say that I have never been disappointed in this place! I went about a week ago for a friends birthdays dinner at the Murray location and now came to the City Creek for my own birthday dinner with my husband and son! We were seated fairly quickly on a busy Saturday afternoon and the patio view was perfect on a cloudy, but warm day! The waitress was super nice and friendly and we received our orders in perfect time. I always order the avocado egg rolls appetizer cause with the tamarind-cashew sauce they are just to die for with the perfect amount of flavoring. I also love the ahi tuna tartare which has the perfect mix of tuna and avocado with wonton crisp used as a chip. My husband got the hibachi steak which is made up of certified Angus steak and shiitake mushrooms, onions, bean sprouts and wasabi mashed potatoes and tempura asparagus will make your Mama drool! To celebrate my old age, I decided to take to-go the Blackout Chocolate cake with a side of Carmel sauce because it has almonds on the outside and I must say I was impressed by how rich it tasted! (And it was a huge slice to share!) love this place!!!!!!!", "rating": 5, "date": "8/31/2013"}, {"text": "They get one star only because the cheesecake was delicious. That&amp;#39;s it! I ordered a popcorn shrimp appetizer and about 3/4 the way through, I bit into a piece and it was basically battered and fried fish bones. No joke!! I nearly swallowed 6 bones! (Counted) the waitress walked up just as it happened to ask how they were ironically as I was pulling bone after bone out of my mouth attractively on our wedding anniversary. They didn&amp;#39;t comp the appetizer but brought out something we didn&amp;#39;t ask for and the manager came over to tell me that it was so &amp;#34;weird!&amp;#34; Uh... no shit. I wasn&amp;#39;t there for any of that. I was there to spend time with my husband. Totally horrible experience.", "rating": 1, "date": "10/23/2013"}, {"text": "Pros:<br&gt;- nice atmosphere<br&gt;- good location<br&gt;- open Sunday<br&gt;<br&gt;Cons:<br&gt;- parking difficult on Sunday<br&gt;- service was delayed<br&gt;<br&gt;My experiences at the Cheesecake Factory culminate in epic failures on the most basic entrees. This experience ordered fried Mac and cheese balls, they had a burned fry oil taste. The entree fet Alfredo was lacking any flavor (butter, garlic or cheese). <br&gt;<br&gt;However the cheesecake was excellent.", "rating": 2, "date": "12/15/2013"}, {"text": "My husband and I drive one hour to go to Salt Lake, for the past two years we have been going to this cheesecake factory every couple months, December 9 was a very important day for me and decided to bring some friends with me, the food is always excellent very consistent on the portion and the taste. However the service was horrible the server was not pleasant and she didn&amp;#39;t do any efforts to make it better, so we decided to drive a bit further and to go to Murray, however tonight we needed to go to city creek  and I was craving for cheesecake factory. I am so happy we came back to our restaurant, William was our server he is very professional,  great recommendations excellent service, attention to details without being pushy, so glad. We came back and even decided to go back as early as  next Monday. Thank you for hiring such a great asset to your company. M&amp;amp;M", "rating": 5, "date": "6/2/2014"}, {"text": "I&amp;#39;ve decided that for chain restaurants in Utah, The Cheesecake Factory (but only this location; the one at Fashion Place definitely plays second fiddle to this one) is #1.  Great food, great cheesecake, good service, and I&amp;#39;ve finally figured out that you can easily split an entree and a cheesecake if you want to save a few bucks;  yes, they give you that much food!", "rating": 5, "date": "4/19/2014"}, {"text": "Cheesecake Factory food is always good. But the waiter ignored me the entire time and directed his attention to my two colleagues. Even they noticed. When the food arrived, mine came out about 20 mins after my colleagues. Mine probably should have been the first since I ordered only a salad. Anyway, the manager came to our table to personally deliver my food, apologized for the delay, and said it was on the house. The waiter still came back with the check. LOL! But my colleagues explained to him since he was ignoring me. I would have given it a 1 but the 2 additional stars are for the manager.", "rating": 3, "date": "12/20/2015"}, {"text": "DISASTER EXPERIENCE FROM HELL<br&gt;Long insulting wait to be served Prepackaged not FRESH Food!<br&gt;We were so excited to go to the CF.  Well may I say this was my first and last visit!<br&gt;The greeting and seating!  We were greeted with pleasantly with &amp;#34;we have immediate seating outside (outside temp 98) or it is a 20 minute wait for inside.  We choose to wait and were given a pager and about 20 minutes later the pager alerted us and handed it to the a hostess.  She took another party to their table and overhead the same greeting &amp;#34;we have immediate seating outside...&amp;#34; to a family that just walked in.  They choose to go outside but the hostess and our hostess now escorted us behind the new family.  To our shock their hostess said oh look we have an empty table and sat them at our table right in front of us!  Our hostess apologized and we stood another 10 min in the dining area waiting for a new table to open. <br&gt;We ordered drinks including wine and they came to the table promptly.  We then placed our orders.  Ten minutes later the waitress comes back to inform my niece they just ran out of the small lunch pizza she ordered and said she could order the larger dinner version but it would cost more and would not come with salad.  What does this mean!  Two things come to mind:  1. if the really cared about us they would have just brought the bigger pizza after our disastrous seating experience,  2. that obviously they are serving frozen prepackaged food - otherwise if they had dough to make a large pizza then why would they not have the same dough to make a small pizza!<br&gt;The wait - it was over an hour after my niece graciously said she we would have something else off the menu that our food came and over 1.5 hours after we were seated before we were served!  No drink refills (we had to ask).<br&gt;The disaster!  We had a small catastrophe before we were served in that an ice tea glass was knocked over and broke and glass and ice tea were everywhere.  We managed to clean it up the best we could but sat there in broken glass and tea all over the place with no assistance (although two employees acknowledged the breakage - but did not assist - other than handing us a towel).  We piled up the larger pieces of glass and ice on a spare plate with the towel.  The waitress never took away the mess and we sat and had to eat our lunch in broken glass and water.  She took our lunch plates away but never took the mess away nor called for assistance.  <br&gt;Bottom line!  NEVER AGAIN!  The worst service ever!  Mediocre prepackaged food, long waits and totally insulting experience!  <br&gt;Shame on you Cheesecake Factory!", "rating": 1, "date": "7/4/2012"}, {"text": "Awesome food and we had a great waitress she was amazing!! The only reason it is not 5 stars is because the lighting was terrible it was so dark we could not see the menus we had to use the flashlights on our phones to order", "rating": 4, "date": "1/23/2016"}, {"text": "McKay is the best waiter we&amp;#39;ve ever had! We&amp;#39;ve eaten at Cheese Cake Factory&amp;#39;s since my daughter was 3 all over the country and we came here for her 18th birthday.  BEST BIRTHDAY DINNER EVER! Thanks to McKay! He went above &amp;amp; beyond by far!", "rating": 5, "date": "1/20/2016"}, {"text": "Didn&amp;#39;t care that there is always a wait for tables. Cheesecake a bit pricey and didn&amp;#39;t care to much for it some to sweet and the price for one eh... I can go to Marie Calenders for better cheesecake! An okay restaurant! Cheesecake was a small serving!", "rating": 2, "date": "6/18/2012"}, {"text": "Great food, horrible experience. My boyfriend ordered the Cuban sandwhich, his regular, but this time it was horrible. The bottom of the sandwhich was burnt black. So we sent it back. After waiting about ten minutes the new one comes out. Still burnt on the bottom but just a little bit better than the first. Still burnt though! Like seriously?! We were waiting for a new sandwhich so not only did they burn it again, but they could have taken it off the press and we could have gotten it faster as well and we would have been a lot happier. They didn&amp;#39;t take the sandwhich off the bill, but I disputed it. First of all, the second sandwhich came out burnt again and we waited 10 minutes. Second, the manager never came to apologize. Third, they wanted to charge us and the waiter got all snarky when we wanted to talk to a manager about it. They ended up taking the sandwhich off but they were rude about it. Also, he said he took off the &amp;#34;first&amp;#34; sandwhich just not the second. He&amp;#39;s all, &amp;#34;so we took off one sandwhich now you want two sandwhiches taken off?&amp;#34; it&amp;#39;s like uhh we should have never had two to begin with if the cooks made it right the first time. So we order one sandwhich not two. A remake of a horrible sandwhich does not count as two? And if the second sandwhich that came out after 10 minutes of waiting was yummy and perfect -NOT BURNT AGAIN- then we would have nooo problem paying! But $13 for a sandwhich that came back bad again? No way. We used to love going here but never again.", "rating": 1, "date": "6/25/2014"}, {"text": "Called for take out and was put on hold for 10 minutes.  Called back and was once again put on hold for 8 minutes.  Called again and told them I had been holding with no answer, and the girl walked over to the bakery to let them know someone was holding.  Finally placed my order.  Received a call back 2 minutes later and missed the call.  Tried calling back to see if everything was fine with my order and they once again put me on hold for 8 minutes.  Called AGAIN and asked to speak to a manager and was on hold for ten minutes.  FML.", "rating": 1, "date": "4/5/2012"}, {"text": "Very nice decor, poorly run.  The hostess was quite full of herself.  They told me it would be a 20 min wait.  I was fine with that, so my cranky daughter could run around outside for awhile.  They called us in 5 minutes...  And made us wait by the hostess stand for 10 minutes, with 7 other parties, &amp;#34;waiting for tables to be bussed.&amp;#34;. Meanwhile, my daughter was screaming.  Stuffed mushrooms were dry, server was good.  The food was just mediocre.  The Cheesecake Factory in Thousand Oaks, CA spoiled us, I guess...  Much, much better.", "rating": 2, "date": "7/4/2012"}, {"text": "This place is good, they have good food. They also sever cheesecake it is not just a creative name. My big issue is they make their waiters and waitresses wear white shirts. When serving food all day I cannot imagine the stress of worrying about all my tables, the kitchen, and staining my shirt. It is too much. However if you are looking for a good place to eat it is a good choice.Eat the egg roles you will love them.", "rating": 3, "date": "6/19/2012"}, {"text": "I usually love the Cheesecake Factory and I&amp;#39;m not typically a harsh critic but my server was an ass. He wouldn&amp;#39;t refill any of our drinks, didn&amp;#39;t get us more bread when we asked and everytime he came to our table he acted annoyed and we would try to joke around with him and thank him for everything and he wouldn&amp;#39;t say anything and just kept a straight face the whole time. The two tables next to him were both talking crap on his horrible customer service skills as well... I got the chopped salad and it tasted horrible... And for dessert I got the Reese cheesecake and it tasted fantastic but I found something blue and gummy in it... (not sure what it was). Very dissatisfied.", "rating": 2, "date": "8/28/2015"}, {"text": "Just stopped in for a slice of the original cheesecake at the dessert bar. Friendly service, restaurant wasn&amp;#39;t too full, and cheesecake amazing!", "rating": 4, "date": "5/16/2012"}, {"text": "Not wasting my money here again. Service was so slow it was insulting. It&amp;#39;s a MONDAY night. Orders were wrong. Took forever to get acknowledged by sever, even longer to order food, get food, get the wrong food and wait for a new order, try to get a drink refill, try to search for server, wait 20 minutes for a check, LEAVE! Ugh. Seriously, I&amp;#39;d rather order my food at a checkout counter and pick up my own food. Cuz you know I didn&amp;#39;t leave a good tip on this shitty visit. Ugh.", "rating": 1, "date": "11/18/2012"}, {"text": "Wow....this was hands down the worst service at a restaurant I have ever had. I&amp;#39;ve been to a number of cheesecake factory&amp;#39;s over the years and understand it is good food with long wait times but the City Creek location took the cake when it comes to poor service. My wife and I expected to have a nice evening while celebrating her birthday and leaving this kids at home but it turned into a terrible evening. We showed up at 7:40 PM and checked in to be told we would need to come back in an hour to view our status in line. We came back precisely one hour later to be told for a party of 2 it would be another 10 minutes before it was our turn. So we sat down next to the front desk only to wait another 35 minutes before we asked again what the status was. We were told that we had already been called and had missed our turn and would need to wait longer. At that point we told them we had been waiting right in front of them the last 35 minutes and our buzzer never went off so they let us up next after complaining. Once we sat at our table our waiter didn&amp;#39;t come for 10 minutes to even greet us. When he finally arrived we told him exactly what we wanted since we had been waiting now to eat for two hours. He said he would bring the bread right out but which took another 15 minutes and then food came out another 10 minutes after that. We ate our whole meal in 15 minutes and did not get checked on once by our waiter for water refills etc. After another 10 minutes of waiting with empty plates the waiter finally came back to ask us if we were done. Another 10 minutes goes by and he finally brings back the check to pay and leave. All in all we showed up at the restaurant at 7:45 PM and didn&amp;#39;t leave until 11:00 at night. If you plan on having a quick meal where someone caters to your needs this is not your place. I&amp;#39;m a frequent diner at many restaurants and we probably would have had a better experience service wise at Taco Bell. Great restaurant, terrible location, and terrible service. I don&amp;#39;t plan on returning.", "rating": 1, "date": "3/24/2016"}, {"text": "First of ALL, I want to say that the managers were SUPER accommodating and was soooo nice to cook my son&amp;#39;s special metabolic diet food for us both days (thats priceless). Our other children&amp;#39;s food that we ordered were PERFECT both times. However, my pasta was still half raw not cooked yet the first day, of course they comp that dish, but it seemed as though our server didnt care for us, I had to take my pasta togo because it took soooo long for new pasta. (My husband&amp;#39;s burger was cooked pefectly). On second day, my husbands chicken burger was soooo burnt, he couldnt eat it. Our Server didnt care much about us, they did finally cook us another one but forgot the sauce to FLAVOR the Chipotle chicken burger (hahaha). He ALSO took his burger togo, because it took sooo long (even though resturant was empty). But, all in ALL, the kids were happy, they DID cook my son&amp;#39;s special food for us (much appreciated) and THE avocado rolls were super yummy. Still 4 stars. ;)", "rating": 4, "date": "7/21/2014"}, {"text": "Updating review.<br&gt;Months later I tried the chiliquiles  again and they were adequate.<br&gt;I will apologize for being so hard on him the first time<br&gt;Previous review:<br&gt;I used curbside to go today,  and ate a few bites and threw it away =Chiliquiles=. It was obvious the man didn&amp;#39;t know how to assemble them", "rating": 3, "date": "3/10/2013"}, {"text": "Love, love, love the Cheesecake Factory. My favorite dish- Louisiana Chicken Pasta. Absolutely amazing. Now if I am trying to be good I go with the Grilled Chicken Tostada Salad which is also amazing and a very generous portion (my husband and I usually split it). The new location downtown is fantastic because it has a lovely outdoor patio - perfect for the summertime.", "rating": 5, "date": "8/17/2012"}, {"text": "I have been to The Cheesecake Factory all over this country and have frequented their other franchise Grand Luxe many times.  This,  by far was the worst experience I have ever had.  The food was horrible and the service was worse than the food. My orders were not complicated. According to my server,  the kitchen failed to adhere to my request for light sour cream on my order.  She stated that not only did they forget, the amount on the order was so much that she ordered me another and the manager comped the item. I did not complain,  or request any accommodation.  I had nothing to do and nowhere to go.  I was enjoying an evening with my daughter who has to have their calamari whenever we see a restaurant and I give the option.  The calamari was extremely salty but she enjoyed.  Back to my situation.  When the check came to the table I was charged twice for the items that were comped but only one item was deducted. Basic math suggests that 2-1=1. The tally for the messed up entree should have been 2-2=0. When I pointed this out,  the waitress promptly engaged in a back and forth that included every thing from the kitchen messed up,  to the manager messed up.  Somewhere in the back and forth this sorry excuse for a hospitality industry employee made the mistake of saying. &amp;#34;Well you ate it...&amp;#34;  Zero to 100 real quick. Go get your manager.  Somewhere in there,  there was an offer to fix it and an admission that she had made a mistake by not reviewIng the check.  Too late!  You really messed up when you chastised me for eating the dish I came in to purchase that you charged me twice for after extending the offer to comp the item. Sadly the table next to me had a different problem with the quality of her order.  The waitress reordered the dish.  When the waitress looped back around,  the other patron explained she might just be interested in something else.  In a huff the waitresses tells the lady,  to basically make up her mind because if she doesn&amp;#39;t want the replacement dish she needs to hurry up and cancel the order she submitted. Thanks a bunch.  On a first time trip to Salt Lake City and the state of Utah,  my daughter and I now have a miserable experience to remember. I tried to use it as a teaching experience. I explained to her that this young lady either was really bad at her job or was really having a bad day.  I went on to share almost by default I tip 20% of the check amount.  In cases where the kitchen messes up I don&amp;#39;t penalize the server.  In this case I explained that on the little check we had of $30 and some change I paid $31. When the manager asked did I need change I said no.  #unbelievable We should have gone to IN and Out Burger.", "rating": 1, "date": "2/19/2016"}, {"text": "I like the location and ambiance but every time I come here I leave disappointed in the food. It&amp;#39;s just not that good. This is the place to go for a late-night cheesecake and coffee, but the entrees are entirely too bland.", "rating": 2, "date": "7/16/2012"}, {"text": "Treated badly by Michael the manager.  Called two days ahead for reservations for our group of 8.  We were all set.  Called again 3 hours before arriving to confirm the reservation, and they told me &amp;#34;Sorry we don&amp;#39;t do reservations on Saturday&amp;#34;.   OK, somebody messed up, what are our options I asked.  Just come on in and if you are here before 4 there will probably not be much of a wait.  So we got there at 3:40. Large group manager (Michael) said &amp;#34;Sorry but there is a three hour wait&amp;#34;.  I explained to Michael all that had happened, but his response was &amp;#34;. . . corporate policy blah, blah&amp;#34;.  Michael was extremely rude.  Michael did not care.  We left.  Their incompetence was superceded only by their rudeness.", "rating": 1, "date": "11/29/2014"}, {"text": "This place is over rated. I&amp;#39;ve had three meals at three different locations and I&amp;#39;ve always been disappointed. The food is over priced and the service is marginal. I never complain about food when I eat out and have never sent food back, but I did this time and I will not give this chain a forth try. They have struck out with me.", "rating": 1, "date": "10/7/2013"}, {"text": "It was a nightmare! The service is good, but the food is intolerable!<br&gt;First, the shrimp scampi was deep-fried, my first-ever deep-fried shrimp scampi!<br&gt;And shrimp was not processed well, it tasted like shit still inside.<br&gt;For desert, I ordered tiramisu, it came with Five cream flowers, Five! They are much bigger than tiramisu itself.<br&gt;For tiramisu, the lady fingers were soaked up, probably because it had already been made millions years ago.", "rating": 1, "date": "10/23/2012"}, {"text": "Love this place! The cheesecake is soooo good! You can walk in to tables they have set up, seat yourself, and get a piece of cake!", "rating": 5, "date": "10/11/2012"}, {"text": "I indicated that I wanted seating for eight. I was told this was a large party and that I would have to wait for a manager to &amp;#34;negotiate&amp;#34; for a table. We were kept waiting for nearly ten min (while five other groups were allowed into the queue, one which was for six people) until she arrived at the front and promptly ignored us. When she finally saw fit to acknowledge us there was no apology for the wait she simply curtly asked if there were any children. When I indicated no she replied one min and began ignoring us again. We walked out and were promptly and politely seated at Brio moments later.", "rating": 1, "date": "5/9/2014"}, {"text": "This place was great! The food was great, the service was great, the environment was great. They were taking a little longer than usual on my meal so they gave me a complimentary soup. Then 2 minutes later, my meal came out and that was complimentary too! I&amp;#39;ll definitely be back!", "rating": 5, "date": "4/5/2014"}, {"text": "I enjoyed my first visit to the City Creek Cheesecake Factory. We ate lunch here around 1:30 pm on a Saturday and there was a 20 minute wait. The server was slow to take our order and slow to bring our check, but the food came quickly and it was prepared well. I enjoyed the cold summer rolls which contained shrimp and asparagus in a rice wrapper as an appetizer. I ordered Sheila&amp;#39;s cashew chicken salad (lunch size) and it turned out to be a very large portion. I wish they used more salad dressing, but the quality of chicken strips was very fresh and tasty. I liked the amount of cashews in the dish. My husband ordered two excellent alcoholic beverages--a mai tai was his favorite as it was large and boozy. The second drink, a margarita, was ok but the mixer tasted of artificial lime powder. I enjoyed a strawberry lemonade, which was decent, but nothing special. My husband&amp;#39;s entree, the lunch-sized shepherd&amp;#39;s pie was too salty. Tasted like it was made with french onion soup mix. We took home half and diluted the leftover with more potatoes so it was more edible. Otherwise, the ambience was nice and we enjoyed the outdoor seating on a warm fall day. Also, beware that Cheesecake Factory does NOT validate parking.", "rating": 3, "date": "9/18/2012"}, {"text": "Typical Cheesecake factory fare. Quite a few veggie options. The veggie burger was OK but fries were quite good.", "rating": 3, "date": "7/16/2013"}, {"text": "Visited SLC on business recently, and a group of us went to the cheesecake factory for dinner. What a horrible experience that turned out to be! First off, they bought 2 of us at the table, the wrong order, and then when it was corrected, I found a rotten lettuce leaf in my salad! I pointed it out to the manager whose response was, &amp;#34;Well it&amp;#39;s only the tip of the leaf that was rotten&amp;#34;. Really!!!!! What about the rest of the salad I had already eaten! I don&amp;#39;t normallt go to chain restaurants like that....and certainly wont be going back there at all!", "rating": 1, "date": "7/20/2012"}, {"text": "Factory food is so accurate! Everything here looks and tastes like it came from the factory to the microwave to the table.  The ridiculous menu is too long; a give away that almost everything is prepared somewhere else and re-heated on site.  Frozen TV dinners probably taste better and cost  a hell of a lot less.  Trying to avoid the microwaveable menu my wife and I ordered egg dishes for lunch.  Her omelet looked like &amp;#34;something special&amp;#34; from the Costco frozen foods section, only it wasn&amp;#39;t as good.  My huevos racnheros also had the unmistakable  texture and taste of a frozen meal.  The over easy eggs might have been cooked on site but the corn tortillas went straight from the package onto the plate and the black beans tasted like they were over microwaved and turned into rabbit pellets.  Our son-in-law had a pizza that was obviously underdone.  Service was marginal.   Never again.", "rating": 1, "date": "8/11/2013"}, {"text": "Expect a long wait, slow service and horrible food.  Get the cheesecake to go and choose another restaurant.", "rating": 1, "date": "3/26/2013"}]}