{"address": ["6600 Menaul Blvd NE", "Space 600", "Albuquerque, NM 87110"], "monthly_reviews": {"2019": [[0, 3.5], [1, 2.0], [2, 2.5], [3, 3.5], [4, 3.5], [5, 3.0], [6, 3.0], [7, 4.0], [8, 4.5], [9, 4.0], [10, 4.0], [11, 3.5]], "2017": [[0, 3.0], [1, 3.0], [2, 2.0], [3, 2.5], [4, 3.5], [5, 3.0], [6, 2.5], [7, 2.5], [8, 3.0], [9, 3.5], [10, 4.0], [11, 3.5]], "2020": [[0, 3.0], [1, 3.5], [2, 3.5], [3, 3.0], [4, 3.5], [5, 3.0], [6, 2.5], [7, 2.5], [8, 2.5], [9, 2.5], [10, 2.5], [11, 2.5]], "2018": [[0, 3.0], [1, 3.5], [2, 3.0], [3, 3.0], [4, 3.0], [5, 4.0], [6, 2.5], [7, 4.0], [8, 3.5], [9, 3.0], [10, 3.5], [11, 3.5]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "I&amp;#39;ve been here twice now, and this place is always packed. So be expected to wait a bit, and don&amp;#39;t count on sitting down while you wait since everyone seems to stand in the entryway.  <br&gt;<br&gt;I must admit for being such a big establishment their food is excellent! Full of flavor and a huge serving, I always make a mistake of ordering something for myself instead then sharing with my girlfriend. Oh well, they will pack it up to go for you kc you ask for a do go box. It is convenient for me since I always worry about spilling my food on the transition from plate to box. <br&gt;This place is on the pricey side, but as mentioned before you get a pretty big serving, it&amp;#39;s almost like you&amp;#39;re getting dinner and lunch for the next day. <br&gt;<br&gt;The wait staff tries their best to keep up with the massive volume of people that are here at any given time. So keep that in mind. If you&amp;#39;re in a hurry, you might consider someplace else. Or if you&amp;#39;re easily annoyed, then work on it. Lol! <br&gt;<br&gt;Overall I&amp;#39;d recommend this place, with a disclaimer of the cost and the wait. But the fold is pretty good! Do I even need to mention their Cheesecake, I mean its on the name!<br&gt;<br&gt;​", "rating": 3, "date": "10/11/2019"}, {"text": "This specific location holds a special place in my heart. I met one of my good writer friends here some years back. We had a great time talking about our writing plans and life in general. I miss my friend. She passed away almost three years ago. May she rest in peace. She was amazing and I learned so much from her.    <br&gt;I haven&amp;#39;t been here in awhile but I&amp;#39;ve enjoyed it every time. The service has always been great. There&amp;#39;s many options on the menu. My favorite item out of everything is the mango key lime cheesecake. It&amp;#39;s wonderful! The mango mousse, whipped cream and crust are all perfect together! My second favorite cheesecake is the chocolate mousse. Delicious! I understand The Cheesecake Facory has 250 items on their menu! Talk about variety! I&amp;#39;ve also tried their fettuccine alfredo and it&amp;#39;s great too! It tasted creamy and fresh. Their salads are also tasty and fresh. There&amp;#39;s been talk of one opening up in El Paso but I doubt it. I think the prices are too steep for this market.", "rating": 4, "date": "1/14/2020"}, {"text": "As always never disappointed when I eat at the Cheesecake Factory. My boyfriend, daughter and I all had delicious dinner. I of course had to have the pumpkin cheesecake which was to die for.", "rating": 5, "date": "9/7/2020"}, {"text": "THIS PLACE BLOWS.  Our waitress was a complete B and was quite sarcastic and condescending to us when we didn&amp;#39;t realize the 2 for 2O deal on the hamburgers was to go only.  We had no time for her crap and Walked out never to return. <br&gt;<br&gt;Shame on you Cheesecake Factory!", "rating": 1, "date": "7/2/2020"}, {"text": "Arrived at 7:50pm on a Friday, I expected it to be busy. I was told a wait time of an hour, that was my limit so I figured I could wait. I didn&amp;#39;t receive a call, so at 8:50 I walked back up to the hostess to just double check. She said it would be another 30 minutes. How could your estimate be so far off? Your only job is to figure out wait times. Nothing new is going on, covid has been a thing for a while, you should be able to take that into account by now. So I&amp;#39;m supposed to go sit down 30 minutes before closing? This was my favorite restaurant and I&amp;#39;m so soured I won&amp;#39;t be back.", "rating": 1, "date": "9/18/2020"}, {"text": "I had not been to a Cheesecake Factory in over 10 years. Every since I moved to New Mexico from Florida. My grandson and I just got back from having lunch and I am absolutely pleased with the quality and quantity of food served. The service was even better. I had the Chicken Piccata. Absolutely delicious. It was perfectly prepared. There isn&amp;#39;t an Italian restaurant in ABQ or Rio Rancho that can compare. Very impressed. My Grandson had their Bacon Bacon Burger and he says it is the best bacon burger he has ever had. We ordered 3 slices of cheesecakes to go. Will be eating them this evening. I will be returning to Cheesecake Factory very soon.", "rating": 5, "date": "9/16/2020"}, {"text": "Came in with my 4 kids in tow. They enjoyed the food and the waitress was great with their craziness (thankfully no spills). My herb encrusted salmon was cooked perfectly and the mashed potato&amp;#39;s were delicious. Really enjoyed the lunch. Was really interested in the brunch, we will be back to try those cinnamon pancakes!", "rating": 5, "date": "2/15/2020"}, {"text": "The service is always a hit or miss at this place, today was better than last time.  Food is always great so we keep coming back. Unfortunately one of the entrees we wanted was already sold out. Thankfully there are lots of other options. The place was clean and moderate noise as usual. This is the 2nd time we had a birthday party here. Unfortunately being the Cheesecake Factory they don&amp;#39;t have  a free slice to give you on your birthday.  Better luck neck time. I&amp;#39;m probably going back again and maybe the review will be better.", "rating": 3, "date": "1/22/2020"}, {"text": "The Cheesecake Factory is always pretty good. Even when the food it bad, it&amp;#39;s still pretty good. My favorite is the macaroni and cheese burger which should lowkey be illegal because of how many calories are in it. But it is the most delicious indulgence ever and I try to consume food here in moderation. A meal with cheesecake and an entree can be well into 2000 calories. Everything good here comes with a price when it comes to health so if you&amp;#39;re trying to eat healthy, this is never the place to come. It is a great treat every now and then! This time we also got the strawberry cheesecake which is my personal favorite. I find the other cheesecakes have way too much going on and are too sweet to enjoy. The strawberry has the perfect balance!", "rating": 5, "date": "7/13/2019"}, {"text": "Why do people think gloves are magic?  Touching/making change with them and then grabbing a slice of carrot cake from display plate and placing into container does not have any logic to me. What&amp;#39;s the thought process in ones head. It&amp;#39;s actually gross to think about what&amp;#39;s on my cake now", "rating": 2, "date": "11/17/2020"}, {"text": "We visited The Cheesecake Factory yesterday for the first time since it opened here, although we&amp;#39;ve eaten at other locations in the past. <br&gt;<br&gt;We wanted breakfast since it was around 10:15 a.m. and they didn&amp;#39;t disappoint. My husband had chicken and waffles while I had the create your own omelet and a side of bacon. <br&gt;<br&gt;I always order my omelets well done because I don&amp;#39;t like them wet or loose in the middle and very crispy bacon. At many restaurants we&amp;#39;ve been to, the bacon has to go back to be crisped up, but not here. Everything was cooked just as I asked and was delicious. <br&gt;<br&gt;We were impressed by not only our breakfast, but in how the entire staff worked to support each other, making sure guests were well taken care of. We never had an empty glass or dirty plates sitting on the table. It was a wonderful visit and a little slice of specialness to start a busy weekend and if you haven&amp;#39;t tried breakfast or brunch here, I&amp;#39;d recommend you do.", "rating": 5, "date": "4/28/2019"}, {"text": "Food is good and service is good. So far the couple of times I have went I have tried a new cheesecake but the tiramisu cheesecake was ok it didn&amp;#39;t meet my expectations. The pineapple upside down cheesecake cake has been by far my favorite. I haven&amp;#39;t tried them all but so far the one of my choice is the pineapple upside down cheesecake.", "rating": 4, "date": "12/19/2019"}, {"text": "I grew up in Orange County, CA, so I&amp;#39;ve always been a fan of The Cheesecake Factory.  I don&amp;#39;t go to the Abq location often at all because I try to support local and what not.  However, I was craaaaving my favorite dish - Cashew Chicken with rice.  Honestly, I can never go wrong with this dish.  Oftentimes, you know how takeout/delivery can be questionable or &amp;#34;it&amp;#39;s just not the same when you order takeout and then eat it at home&amp;#34;? Well, I was so pleased with it all! YUM! <br&gt;<br&gt;Huge shoutout to the employee who took my order on the phone and ran it out to my car upon pickup.  I really wish I remembered his name, but it was a Saturday night and I just want to give him big props for his clarity and patience on the phone and friendly service in person. Working in the service industry myself, I truly appreciate these qualities when ordering food/drinks (from the customer and the employee). Good job, dude, and thanks Cheesecake Factory!", "rating": 4, "date": "6/21/2019"}, {"text": "Always good food and Great Service. Would give 5 Stars but they did away with customized guacamole.  Wonderful salads especially the Cobb salad with Chicken", "rating": 4, "date": "6/20/2020"}, {"text": "Waited for a table for 6 for 2 hours. No big deal...6 is the maximum number allowed. When we&amp;#39;re finally seated we get 2 tables for 3 and are told there are no other options. Really screwed up my friend&amp;#39;s birthday. We were repeatedly told they had tables for 6. Why lie about it?", "rating": 1, "date": "8/5/2020"}, {"text": "Thank you Cheesecake Factory for making things right. We did visit the Cheesecake Factory again... on your dime :). While my first two menu choices were sold out (disappointing)...  third time&amp;#39;s a charm- and I got to enjoy pretzel bites with fondue- just the right mix of my two favorite food groups- Cheese &amp;amp; Bread.  Our server really made the whole experience worth it: he was a great sport, and a super nice kid (his mother must be proud!!!). Thanks again Cheesecake Factory!", "rating": 4, "date": "10/29/2019"}, {"text": "Went there for lunch...first time! It is very beautiful and elegant in there.  I had the Truffle honey chicken and the stuffed mushrooms.  The chicken was juicy, asparagus perfectly grilled and the mashed potatoes were delicious.  The stuffed mushrooms were very nice! My friend got the avocado beet salad and the egg roll sampler. Both were very delicious also!! The sauces on the sampler were very interesting and different.   We shared a mango key lime cheesecake...it was amazing! The crust has a macadamia coconut mixture.  I will be back! It is a bit pricey but they give you huge portions and our waiter Alberto was wonderful!! The presentation on the food was beautiful..you hated to eat it!", "rating": 5, "date": "3/12/2019"}, {"text": "Stuck in hospital with horrible hospital food, decided to treat myself to a decent meal, whatever the price.  Cheesecake is a chain but I&amp;#39;ve eaten in this restaurant in other cities and experience was pretty good.  Photos were appetizing.  Entree - almond-crusted salmon over greens for 16.95 - and beet and avocado salad  for $8.50 - looked NOTHING like the photos when order arrived.  Really skimpy salad, with a few tiny pieces of avocado and beets. Small salmon slice over lots and lots and lots of parsley, maybe 4 cranberries.  It was nice to see the included bread, but they included 2 small pats of butter for 6 slices of bread. AND NO KNIFE, FORK OR SPOON, even though I indicated that I needed utensils.  All of this for $36.47.<br&gt;This site is closed for indoor dining - you would think they would put some effort into their take-out to generate revenue.<br&gt;<br&gt;A real rip-off. Will never order from them again.", "rating": 2, "date": "7/17/2020"}, {"text": "Lol I got ripped the PHU off  so like can I get a free slice or something. Because wtf I was better off going to get a Cinnabon instead of a half ass slice of really expensive cheesecake. My slice vs. my bf&amp;#39;s slice, like what the heck. Furious", "rating": 1, "date": "7/1/2020"}, {"text": "I love this place, not just good for cheesecake. They have an amazing selection of food and alchohol. I forgot the name of my favorite dish because this is being written after I had my visit. The dish was a marinated steak with wasabi mash potatoes and asparagus. It is so good, though the asparagus could be better. Next time I go I will probably tade those out for a different side. The alcohol is always amazing, I never get the same thing twice, yet still impressed. Plus I can easily say that the cheesecake is close to perfection.", "rating": 4, "date": "3/6/2020"}, {"text": "For many years I have been told that this place was one I had to go too. I recently went with a friend for dinner.  The food was average and nothing special.  There was nothing that made it stand out for me.  The cheesecake was good the interesting thing is that there is no prices on the different options.  You are given a price range rather than an actual price.  Service was okay again nothing special.  For all the hype I have heard it did not hit the mark.", "rating": 2, "date": "7/24/2019"}, {"text": "I hate to be negative, but meh, I&amp;#39;ve experienced better pretty much sums this place up.  The food is averagely tasty, and I haven&amp;#39;t been overly disappointed with the taste at the time of dining, but the prices are outrageous. Three of us dined here for almost $80.  I think that $27 a person for chicken, burgers, and one slice of cheesecake is crazy.  The food is aveerage, but it&amp;#39;s not that good.  <br&gt;<br&gt;I ordered a honey chicken and it was relatively tasty.  The pre-dinner bread that is offered is pretty good (honestly the best part of the dining experience), and the iced teas are flavorful.  I just can&amp;#39;t say that I would recommend this place to anyone.  The place is beautiful inside.  The cheesecakes are okay if you are into them, but honestly, they are very heavy (along with being very expensive).  All the food, even the lighter objects are very heavy.  Also, just to say, in regard to the food that I ordered, the honey chicken is only good on the first day, but don&amp;#39;t plan to reheat it in the microwave the next day because it gets soggy and un-flavorful (unfortunately the honey flavor seems to get overpowered by the greasiness). On a better note, I think another favorite part to my meal was the asparagus, because you can&amp;#39;t really mess that one up...  <br&gt;<br&gt;I guess if you are having a special event, or if you really want to splurge on your dining, give this place a run...  However, with the high food prices, the lacking waitstaff, and the semi-long wait times, I would suggest trying something more memorable.", "rating": 2, "date": "2/18/2018"}, {"text": "My husband and I came to celebrate him getting a promotion, and we were seated almost immediately.  Our waitress was friendly and knowledgeable.  She answered any questions we might have and even anticipated some.   Our food was brought out and everything was correct (we both made modifications to our order).  The food itself was cooked really well and we both loved our food.  The portions here are huge so we ended up taking our cheesecake home, but we loved that too. It was a really nice experience, and if we are going to eat at a chain restaurant again, it&amp;#39;s definitely still on the list ;) great service, good food, and cheesecake. Can&amp;#39;t argue with that ;)", "rating": 5, "date": "1/10/2019"}, {"text": "Food is goos. Wait is often ridiculously long unless you go during off peak times. Food was very salty during my last visit and wait staff was mediocre. I do love the many options and the dessert. We go for the many dinner options available.", "rating": 2, "date": "2/15/2019"}, {"text": "I think The Cheesecake Factory is one of the must visit restaurants when in town. It&amp;#39;s a beautiful place with high ceilings and elegant decorations. Their menu is overwhelming- they have pages and pages of items with a variety of cuisines. This is my second time being here within 3 years. Our server Emmet was very sweet and did a great job taking care of us. We started off with the macaroni and cheese balls. They were bigger than anticipated; about the size of an extra large meatball. They were okay but mine was slightly cold in the center. The complimentary bread is always so delicious. I ordered the chicken piccata and was given a big portion. One thing about this place is that it is more on the expensive side but they dishes are a decent size. This dish set me back about $17. The taste was good but needed more lemon. There was a lot of butter coming through and not much else. We ended our meal with the mango key lime cheesecake- delicious but so decedent and overly sweet. This is definitely a place to go every once in a while due to the heavy portions and hefty calories in each dish. I&amp;#39;ll definitely be back later on to try some different menu items and deliver and overall verdict.", "rating": 4, "date": "8/17/2019"}, {"text": "I&amp;#39;ve visited The Cheesecake Factory in many different cities and states and I&amp;#39;m never disappointed. One of my favorites are the fried macaroni and cheese ball appetizers. Sooooo delicious. <br&gt;<br&gt;In all the times I&amp;#39;ve gone I&amp;#39;ve never ordered a burger. Tonight I ordered a Hickory Smoked BBQ burger and it was really tasty. The burger meat was cooked perfectly to my liking (slightly pink) and the bacon on it was thick and slightly sweet... maybe some syrup or maple on it? It was piled high with onion rings. The BBQ sauce was uber sweet and a tad of spice. So good. <br&gt;<br&gt;I order the sweet potato fries with it and they were salty and presented well. They were crunchy on the outside and soft on the inside. Very good! <br&gt;<br&gt;Our server seemed pretty rushed. She was nice enough and on top of our order but I hope she does stop and smell the cheesecake occasionally. <br&gt;<br&gt;I ordered cheesecake to go but I only ate half my burger and am too full for it tonight. I suppose I&amp;#39;ll have to have chocolate mousse cheesecake for breakfast. DARN! Haha! <br&gt;<br&gt;Thanks Cheesecake Factory for never letting me down!  <br&gt;<br&gt;Cheers!", "rating": 4, "date": "1/23/2018"}, {"text": "My boyfriend and I visited tonight, food was disgusting very disappointing because the server was great the cheesecake is the only thing worth getting their quesadillas have way to much cheese and greese uneditable...salmon was burnt after the server promised it won&amp;#39;t be and burgers taste like McDonald&amp;#39;s the only thing we enjoyed was the cheesecake that we took home...", "rating": 1, "date": "9/26/2020"}, {"text": "We have been so crazy busy and we come in for a relaxing me and we get the best service, the best food and outstanding customer service! Seriously kudos to Jordan our server who was top notch! Provided great customer interaction and his recommendations were spot on!! Thank you for a great meal and a great fun night!!", "rating": 5, "date": "7/25/2019"}, {"text": "I was excited to get take out for my birthday! We ordered spaghetti and meatballs then for dessert pumpkin cheesecake! I took a bite of the cheesecake first and that was so amazing then I took another bite with some whipping cream BUT this time there was a hair!!!! We could not even eat any of the food because this stray hair ruined our meal and appetite! so gross and during the COVID pandemic!", "rating": 1, "date": "9/8/2020"}, {"text": "We received a $50 gift card for Christmas. So we saved it until we were able to have some sort of a date night. With 4 kids its almost impossible to make that happen especially with COVID-19. We were able to get out parents to watch 3/4 of our kids. So we were stoked about being able to get take out from here. The service was quick, but our food was cold and not the best for 16$ pasta plates. This was my second experience here that wasn&amp;#39;t the best.", "rating": 2, "date": "4/19/2020"}, {"text": "Ah the Cheesecake Factory, home to one of my weaknesses, cheesecake. The day I heard they opened this place here in Albuquerque my home I almost broke down and cried in joy. I&amp;#39;d previously visited the other locations in Denver, and various ones in Texas and it always bummed we out that we didn&amp;#39;t have one. I was so delighted that we finally got it. Sadly this is actually only my second visit to the one at home. In all the time it&amp;#39;s been open. Why? Well let&amp;#39;s start off by saying this place can be pricey. A slice of their own cheesecake can easily run you $8. Wow! Don&amp;#39;t get me wrong the food I&amp;#39;ve had is quite delicious and has not let me down but it&amp;#39;s definitely not somewhere I find myself going on a weekly basis. We had gone during peak hours at 6 in the evening which I was hesitant as I know how busy that place can be. Luckily our wait was about 15 minutes and we were seated in the outdoor patio. We had a little visitor (pigeon) stop by our table and walking around scrounging for food it was funny. Our waitress came about 8 minutes later to take our drink orders and arrived with the drinks 6 minutes later which was enough time to decide what to order. I decided this visit I would change it up and order something different. I tried their fettuccine Alfredo with chicken. I&amp;#39;m a creature of habit and I find myself ordering the same thing that I enjoy at different places. Alfredo is a hit or miss with me. There are only a small handful of places I find to have a good fettuccine Alfredo. I felt bold this go around so when it arrived I could smell the aroma of creamy Alfredo and chicken. The noodles on the top of the dish were a little chewy but the rest of the noodles were pretty soft. The noodles unfortunately did not hold up well when twisted with guidance of the spoon. I found the noodles to break easily and not twist well. The Alfredo itself was very creamy and with the cheese they spread on top it wasn&amp;#39;t watery or too thick. Sometimes I&amp;#39;ve found some places to have a thick Alfredo that doesn&amp;#39;t soak well with the noodles. Cheesecake Factory had it just right. The chicken was good but it did feel a bit tough and dry like chicken you&amp;#39;ll find in a progresso soup can. It as freshly cooked just a little tough. If the chicken had been more softer and juicer I would&amp;#39;ve enjoyed it more. My friend wanted spaghetti and meatballs but our waitress informed us they were out of the meatballs but suggested another dish that was similar with alternative meat. I forgot what is called honestly but my friend gave me taste and it was ok but I&amp;#39;m not much of spaghetti fan. Overall we had great service, and the food was decent. This place can be a bit pricey so be prepared to at least spend anywhere between $15 to $30 a dish depending on what you want so fair warning. I definitely recommend coming least to get the experience and enjoy one of their delicious cheesecakes!", "rating": 4, "date": "5/19/2019"}, {"text": "Okay, so...obviously I&amp;#39;ve been to dozens of these places before. The problem was I wasn&amp;#39;t Yelping back when I lived in Oklahoma and would frequent this place constantly every other weekend when I would drive up to the capitol. If I were, I would tell you guys that they are just as amazing as ever, regardless of which one you go to. But the experience varies based on service. The food is almost always good. Usually.<br&gt;<br&gt;Let&amp;#39;s talk about the first night I went to the Cheesecake Factory here in the land of enchantment. I ordered the shrimp scampi, which is a bistro take on the traditional dish. Basically, it&amp;#39;s deep fried shrimp in a scampi sauce. In this iteration, everything as far as the sauce was spot on. Unfortunately, they took the misstep of burning some of the shrimp. So I thought to myself, &amp;#34;okay...everyone has a bad night. no biggie. I&amp;#39;ll let it pass.&amp;#34;<br&gt;<br&gt;I mean, we were already planning on returning here our last night in Albuquerque, we love the place that much.<br&gt;<br&gt;This second visit, I was determined to try the steak diane. But I didn&amp;#39;t want that to be the only protein I had, just in case I didn&amp;#39;t like it for whatever reason. So I got the factory combo of shrimp scampi (almost everyone deserves a second chance, after all) and the steak diane.<br&gt;<br&gt;Firstly, I am happy to report that the scampi was MUCH better this time around. All the shrimp were cooked perfectly with nothing singed or burnt. The sauce was just like I remember it. Plus it all blended beautifully with the mashed potatoes. Yeah...the combos come with mashed and Cheesecake Factory actually makes a damn good mashed.<br&gt;<br&gt;That said, we can discuss the steak diane. It was....different for me. Took some getting used to because honestly, I have nothing else to compare it to. I&amp;#39;ve never really had a steak diane before, much less know much about it. I know that it&amp;#39;s a recipe generally consisting of a pan seared steak of sorts, tossed in a mushroom-ish sauce with black peppercorn and onions. Only the sauce Cheesecake Factory uses is slightly sweet. Again, not quite what I was expecting. But overall, it wasn&amp;#39;t bad. At least I had the benefit of the mashed potatoes to counterbalance the mild sweetness brought on by the sauce.<br&gt;<br&gt;The steak itself was cooked a perfect medium as requested. But you&amp;#39;ll notice from the pic I took that they serve this steak *almost* hibachi style. That&amp;#39;s what it reminded me of really. Most places just leave the whole piece of steak uncut. This one came in pieces. Not really a deal breaker for me; just....different.<br&gt;<br&gt;I know that some of you will probably scream bloody murder when I confess this. But no...I did not order any cheesecake either visit. The main reason being is I&amp;#39;m not much of a dessert guy. And even when I am, it&amp;#39;s WAY after the fact. The thing is I just genuinely get way too full to consider dessert immediately after dinner. I mean...who, over the age of 12 that isn&amp;#39;t female, eats dessert *immediately* after dinner? Really. Guys...my metabolism isn&amp;#39;t what it used to be.<br&gt;<br&gt;The ultimate takeaway from all this is simple: if you happen to be in a town or near a town that has a Cheesecake Factory in it, you are absolutely CRAZY not to go! They pretty much never miss the mark when it comes to the actual recipes. The only thing that could ruin your experience would be if you got subpar service. So stop on by! It will change your life. I&amp;#39;m giving The Cheesecake Factory in the land of enchantment 4 big juicy scampi shrimp with no burnt pieces out of 5.", "rating": 4, "date": "7/5/2017"}, {"text": "It was a good experience as always. Got meatloaf and it was great - my most favorite dish. Taste is consistent across their national restaurants and encounters which is good and kinda weird at the same time. Cheesecake is good though.", "rating": 4, "date": "12/21/2019"}, {"text": "Never fails to please this happy yelper!! <br&gt;<br&gt;Always brace yourselves for a long period of waiting if you come during the lunch rush and ESPECIALLY dinner!! I was worried about getting a table for 2 when we got there a lil after 6pm.  My husband hates a long wait and i was craving their thai lettuce wraps again for the longest time.  To my luck, only a 30 to 40 min wait! As long as it wasnt an hour or more, he was willing to wait lol. Yay me!<br&gt;<br&gt;My ultimate weakness and what i diet for.... THE BREAD BASKET!! Ugh i could live off their bread and butter basket.  They always have a honey oat and white option and i love tearing into the honey oat.  Luckily its only half the basket so i dont become a complete gluton before my actual meal comes thru.  <br&gt;<br&gt;I always order the thai lettuce wraps and the small plate of chicken somosas.  I just cannot imagine it any other way!! Thru the years, i have tried a bunch of other options. Of course its impossible to try them all but something about the healthy choice and AMAZING flavors from these wraps that just bewitched me! And those somosas? If even my husband goes for it and yet he hates curry usually, then you got something worth while! Lol. He always has a hard time ordering stuff since he is a menu price Nazi, but he ended up choosing the French Dip with sweet potatoe fries. He was actually impressed! hallelujah! Lol <br&gt;<br&gt;And the cheesecakes? Need i say more? Lol the only thing i suggest is order from the front counter. The slices you can get to go from there seem way bigger than ordering from the table.  Either way you do it, quality is top notch!<br&gt;<br&gt;Service is always great because thats whats expected of their staff.  I only had a few problems over the dozen times coming here so there&amp;#39;s always a few bad apples.  Other than that, truly a worth while experience coming here.  Whether you&amp;#39;re feeling fancy or just casual, this factory welcomes all!", "rating": 5, "date": "6/18/2017"}, {"text": "I get to the Points! Horrible! Pasta hard and mushy (stick to your teeth when you bite in it) Tasteless Jambalaya Pasta and Evelyn&amp;#39;s Favorite pasta.  Both taste like someone forgot to put sauce in the pasta compare to CheeseCake Factory in BHM, AL.  Asked for the Kitchen Manager but server just would not get him or her because he was BUSY.  They just lost my vote and more when it comes to suggestion for where to eat with the ladies.  I would not suggest this restaurant because there are much more better restaurants out there and it does not cost you a fortune to have good pasta.  Mine you, the Jambalaya Pasta was US$19.99.", "rating": 1, "date": "2/21/2020"}, {"text": "Cheesecake Factory keeps getting cheaper and cheaper. In past years, half price cheesecake used to be a weekend. Then, they became more strict about having both people there in order to carry out (even though my mom was tired from walking and was sitting on a bench outside and they wouldn&amp;#39;t accept it). Today, my dad drove all the way over to the Factory, only to be turned away and cheesecake-less", "rating": 2, "date": "7/30/2018"}, {"text": "Third time&amp;#39;s a charm? Maybe not. The food (bruleed French toast) was ok at best, so that means overall the food I&amp;#39;ve received at this location has been decidedly &amp;#34;meh&amp;#34;. More curious, we arrived at opening, and with very few customers inside, our party of 8 was refused indoor dining and we were relegated to the patio, even though plenty of seating inside was available. (Wasn&amp;#39;t an issue with reservations because we were told no Mother&amp;#39;s Day reservations were being taken. Confusing to say the least.) <br&gt;<br&gt;So yeah, last time here I think.", "rating": 2, "date": "5/13/2018"}, {"text": "Its four normal restuarant chain. Their menu is somewhat intense and at times overwhelming but if you&amp;#39;re dining with a big and picky group, this is the place. The servings are great for sharing or lunch the next day. I love this place for brunch but they do pack up fast so get there early. Their drink menu is okay but I do like their mimosas. And of course you can&amp;#39;t forget their namesake. They have almost all cheesecake you can imagine. The service seems to be hot or miss when you go but I will say they are fast.", "rating": 4, "date": "4/13/2019"}, {"text": "This was my first visit, a friend took me for some cheesecake we had planned on taking out. The staff heard it was my birthday and insisted I sit down so the staff could sing me Happy birthday! I was in a wheelchair and had no trouble moving around and getting a comfortable spot. I had the Carmel pecan turtle cheesecake! So creamy and good! There presentation was great ! It came on a plate with happy birthday written in chocolate! The staff was so friendly and helpful and did a good job! Thanks everyone! I had a unexpected good time!", "rating": 4, "date": "1/30/2020"}, {"text": "I haven&amp;#39;t dined in here but stopped to get some cheesecake. During the week day when I went, it wasn&amp;#39;t overly crowded and I got my slices of cheesecake really quickly. Only getting a four because Cheesecake Factory is so wrong for their overly priced cheesecake (but they know it is sooo good).", "rating": 4, "date": "3/3/2019"}, {"text": "Anniversary Day. We had to do it again. This time Covid style! It was still so good and fresh. They made it easy curbside! Thanks for the complimentary bread! Chicken and biscuits were super good with the Mac and cheese burger and the green chili cheese burger!", "rating": 5, "date": "5/25/2020"}, {"text": "My mom and I went shopping at the mall. We decided to come to Cheesecake Factory . We sat in Alexis R. area and she was a very friendly &amp;amp; attentive server. <br&gt;<br&gt;Thank you for the enjoyable experience Alexis!!!", "rating": 5, "date": "4/24/2017"}, {"text": "There was 5 of us in this Busy Restaurant. Restaurant appeared clean and nice staff was friendly.Each of us ordered Different food items from the menu ranging from pasta to enchiladas to Pizza....all food items were nastyyyy! We filled up on the bread and butter that they served us. <br&gt;Overpriced not good food Stick to Cheesecake aka Cheesecake Factory which we didn&amp;#39;t even get to due to the disappointment <br&gt;Menu needs pictures Food needs to taste Better.<br&gt;Staff and establishment was fine.", "rating": 2, "date": "6/30/2019"}, {"text": "Behind any fantastic business is stellar management and top notch customer service. That couldn&amp;#39;t be more true of the manager, Kalani, at this location. The amazing service he provided our group of 12 this Mother&amp;#39;s Day morning will never be forgotten.  He is without a doubt the example of what management should be!  <br&gt;Thank you so much Kalani for being a bright light and making our Mom&amp;#39;s day!!!!", "rating": 5, "date": "5/12/2019"}, {"text": "Favorite pasta place in albuquerque for sure. Although a little pricey, the experience is more than worth it. The servers are always nice and on top of it, there&amp;#39;s complimentary bread and butter, and of course the cheesecake is to die for! It&amp;#39;s always packed on the weekends but come for brunch saturday/sunday mornings!! they have great stuff", "rating": 4, "date": "6/11/2018"}, {"text": "If I could give this a zero I would. Ordered online and was told to pick up in 25 minutes. It took 50 minutes to pick up our food. We ate. Food was incorrect and subpar. This is not the first time this has happened at this location. Food was missing ingredients and gave both me and my boyfriend horrible stomach aches. I will not be eating here again. I have only had one good meal here ever and all the others have been very mediocre for a high price tag. This meal tonight was downright horrible.", "rating": 1, "date": "6/22/2020"}, {"text": "I have been to The Cheesecake Factory once before when I traveled to Denver as a child. I remember loving the atmosphere and feeling like a little kid in a candy shop. Fast forward to present day as an adult a lot has changed. The overall decore and set up is pleasing but it does not match the food at all. We had a very delightful server who was prompt and efficient. When I saw the menu pricing I understood because the restaurant screams fancy. I ordered the lunch portion bbq chicken salad at a price of $16.00. I felt that was a bit pricey for a lunch salad but I figured it would be nice. It was a decent size and the flavor was okay but i felt I could have gotten the same salad at a fast food restaurant. My boyfriend got the Chicken Picatta and it had a wonderful flavor and the chicken was cooked well. It just wasn&amp;#39;t anything too special. We shared the banana cheesecake as a dessert  and it was very tasty and I liked that it also came with fresh bananas. It was my favorite part of the lunch but that&amp;#39;s expected with the name of the restaurant. Overall the experience was okay but I felt it was overpriced for what we got. It will be hard for me to return in the future.", "rating": 3, "date": "12/18/2019"}, {"text": "We went in for lunch today (a Monday) and thankfully there was no wait but the place was crowded.  They happily accommodated my dietary needs (no gluten or dairy) and my food was pretty good. I had the lemon roast chicken.  Our waitperson said she told the manager my issues and he modified my plate himself, which I appreciated.    My decaf coffee was on the cold side but figured after my million questions and quirks I&amp;#39;d cut the waitstaff some slack.  My companions loved their food, pasta dishes.  Of course someone in our group finished with cheesecake, Mango Lime, which they said was lighter than they expected and really good.  They don&amp;#39;t take reservations so be prepared to wait during busier times.  This place gets really busy.", "rating": 5, "date": "12/17/2018"}, {"text": "I&amp;#39;ve eaten here a variety of times. The reason what keeps me coming back is the variety of plates they offer and how delicious their food is. This time my boyfriend and I ordered &amp;#34;chicken samosas&amp;#34; off the skinny menu. They were seasoned chicken wrapped in a freshly fried crispy wonton served with a cilantro dipping sauce. So good! <br&gt;<br&gt;As for entrees we always like to try something different. I ordered the fried shrimp platter and my shrimp were butterflied, lightly breaded and perfectly crispy. They were not greasy and were the BEST FRIED SHRIMP I&amp;#39;ve ever had! It came with a garlic tarter sauce, yum! The fries however were dry and over salted. <br&gt;<br&gt;My boyfriend ordered the chicken parmesan sandwich. It came with marinara and he upgraded to sweet potato fries. He was in heaven and once I took a bite of his sandwich so was I! His sweet potato fries were even saltier than mine he didn&amp;#39;t even eat them. They were salt with a side of fries. <br&gt;<br&gt;Every time we&amp;#39;ve been here, the service sucks! On our first date ever we came here and sat on the patio. We had an older man who made us feel like a nuisance. This time we had a middle aged woman who was really slow. She also checked on the table across from us way more than us and we felt slightly neglected. As a server, I know it can get stressful but there was barely anyone in the restaurant. And there&amp;#39;s a way to handle things even when you can&amp;#39;t handle it yourself. <br&gt;<br&gt;If this place had better service it would of gotten 5 stars. (And no salty fries)", "rating": 4, "date": "11/19/2017"}, {"text": "A little late on the review, went here recently for dinner, as always the food was great! Service was good, seemed rushed but we sort of laughed it off, still very enjoyable visit. I love the Skinnylicious menu, my goal is to try all of the options. Got the steak medallions with yummy sauce, mushrooms, asparagus and a little serving of mashed potatoes underneath. Perfect pairing and a decent portion for the reduced calories option. Loved it! My dinner date had a burger with sweet potato fries, which I sampled, super yummy!", "rating": 4, "date": "2/10/2018"}, {"text": "I&amp;#39;m pretty picky when giving 5 star reviews to any place I buy food from. This place, the food and the service deserve 5 stars. Alot of the past reviews I&amp;#39;ve done on food has been just myself. Now most everything will include myself and my woman&amp;#39;s experience as well. Since this was our first actual date, I was hoping everything would be perfect or at least close to it. When we walked in we were told 20-25 minutes on a table. I think it was 18 minutes and the little buzzer thing went off. We were sat, got bread which was good, ordered an appetizer which was good (fried potato something), and ordered our food. She had the orange chicken which I tried and it was amazing for both of us. I ordered the bacon cheddar burger (I think that&amp;#39;s what it was called) and i have to say it was a pretty amazing burger. The place was pretty busy and our food still got to us in a reasonable amount of time. Considering we were talking and whatnot anyways, it was good timing. ALWAYS have to get a piece of cheesecake to go on the way out. We picked out peanut butter and chocolate something. Not the reeces, but a different one. Best cheesecake ever. We will definitely be back and I think both of us are going to try something different on the menu each time we go. Thanks for the great experience.", "rating": 5, "date": "8/5/2019"}, {"text": "We called ahead to see if we needed a reservation. THEY SAID, oh no it&amp;#39;s fine etc anyway we get there, 20 min wait, with 3 tired children  , we&amp;#39;re a party of 6, 3 adults 3 squirmy  hungry small kids. You think the waiter woul have noticed the crying children. Food was great, place was fine, .. my 1st time there, I thought the service could have been a lot better,come on now , server not ever deal with a table with kids , you could have noticed the stress at the table. Be more aware, and give service to the poor parents .", "rating": 2, "date": "11/7/2019"}, {"text": "The Cheesecake Factory lives up to its expectations as always, exceptional corporate food and definitely is a standout to me in comparison to all the other corporate chains that I will not  frequent, but The Cheesecake Factory is the only one that is always my exception. Fresh Food, Friendly Service and modern swanky decor. <br&gt;<br&gt;Anthony our server was friendly &amp;amp; attentive, and yes it was the the Opening day and it was very hectic. I know some people were frustrated about the service and wanna complain about this &amp;amp; that but this a fresh newly opened business and when people who dont even bring there &amp;#34;A&amp;#34; game from appropriate attire, to manners, to proper vocabulary....... have some couth..... and some respect as they are working through the kinks but most important stimulating our economy in the Q.<br&gt;<br&gt;Avocado Egg Rolls is always a must and but of course a slice or two of Cheesecake LVE has me every time.", "rating": 5, "date": "2/26/2016"}, {"text": "Cheesecake Factory, what&amp;#39;s in a name....in this case exactly as it appears.  You come here for stellar cheesecake but when it comes to anything else it really feels like a factory.  People go in and out as quickly as they can seat them, feed them and say have a good day.<br&gt;<br&gt;When we can&amp;#39;t decide on anything to eat and we&amp;#39;re starving, we pick Cheesecake factory.  We go in know it&amp;#39;s going to be loud, friendly, mediocre food, in a quick amount of time.  I can&amp;#39;t say a particular dish sticks out, nothing on my &amp;#34;must have&amp;#34; but I know whatever I get here will be good.<br&gt;<br&gt;I can&amp;#39;t say there is anything great or anything horrible, it really is just a-ok.  You&amp;#39;ll appreciate how it connects to the mall so you can walk off the 1000+ calories consumed.", "rating": 3, "date": "11/16/2018"}, {"text": "They are good service and nice place <br&gt;We ordered Thai letters wrap, pepperoni pizza, pineapple shrimp....<br&gt;Everything taste is really good .", "rating": 4, "date": "3/4/2018"}, {"text": "I love going here for the Skinnylicious options! Highly recommend the Steak Medallions, Lemon Garlic Shrimp, and the Tuscon Chicken!", "rating": 5, "date": "8/3/2019"}, {"text": "Yuck.  It was busy but waited Forever.  The lasagna was cold and really lousy.  They were shooting for a fancy version of a classic and blew it.  Bland, at best.  Daughter wouldn&amp;#39;t send it back but it sure did not get eaten...  The spaghetti with chicken parm was plated sloppily, Georgia Peach drink was watery, coffee was Burned! and our waitress was so hurried flipping tables she picked up the tab next to us, looked right at me and never offered a warmer or refill.  Poor service about clearing plates.       <br&gt;<br&gt;Great decor, good cheesecake. Next time do take out cheesecake only.", "rating": 1, "date": "7/20/2018"}, {"text": "The chicken Parmesan pizza style is literally a huge mashed up chicken deep fried after it&amp;#39;s been frozen is what it tasted like. Would not recommend getting anything with chicken from here", "rating": 2, "date": "9/13/2018"}, {"text": "So sad, use to love this place, I was there the first day it opened and I&amp;#39;ve always tried to support it, this time it was awful, I tried calling hours before, knowing about the whole &amp;#34;covid&amp;#34; so with that in mind I called, like I said before, I asked what kind of wait do you guys usually have, the person on the phone said between 30 minutes to 45 minutes, I thought It would not be a problem... so I took my family, when We get there the hostess tells me &amp;#34;it&amp;#39;s going to be 2 hours&amp;#34; so as you may imagine I was really disappointed, and this is not even the issue, the problems was their terrible attitude and rude service from the hostess, even at that point I said ok we will see if it&amp;#39;s a little faster and we will go ahead and get out name in the list.... we walked around the mall for about 30 minutes and I came back to check, they tell me, in a rude way, you&amp;#39;ve only been waiting 30 minutes and we told you 2 and a half hours... I was like what you said 2 hours! So we just left... right at the hour (by now we have left to farina) they send me a text saying your table is ready.... I mean the hostess should be able to say wether you have an hour or 2 and a half hours!!! Terrible!! I don&amp;#39;t know if I&amp;#39;ll comeback", "rating": 1, "date": "8/21/2020"}, {"text": "The highlight here: KFC.<br&gt;No, not Kentucky Fried Chicken. Korean Fried Cauliflower!<br&gt;At a whopping 1,000+ calories, this small bites plate (about the size of two handfuls) might kill your diet, but not your happiness! Crispy, savory, and flavorful all-in-all. It even won the heart of my sister, who despises cauliflower.<br&gt;<br&gt;Most of the entrée plates here are on the pricier side, but worth the portion, IMO. However, on my most recent visits, I&amp;#39;ve been sticking to the appetizers and shareable plates, as the complimentary bread/butter is rather filling.<br&gt;<br&gt;The service here is either decent or iffy, depending on the day of week and time of day you&amp;#39;re dining I guess. I came here with my family (party of 4) a while ago on Sunday night, and we had to wait so long for our entrees that we needed to flag down our waitress, who said the food was apparently sent to the wrong table. Returned with a friend a couple months later during a weekday afternoon, and we were in and out within an hour. <br&gt;<br&gt;I&amp;#39;m certainly not one who would spend around $7 on a single slice of Cheesecake, but my boyfriend has unashamedly done so many times here. As their signature (hence the chain&amp;#39;s name), they were admittedly quite tasty. I did enjoy the tiramisu cheesecake, but it didn&amp;#39;t blow my mind, to be worth that price tag, and for such a small slice.<br&gt;<br&gt;I will, however, return for that yummy cauliflower!", "rating": 3, "date": "7/24/2017"}, {"text": "Pretty good meal for a chain restaurant.  We were happy with the servers.  The food was above average.  Burgers, pasta, crab dip and salad.  All pretty good.  To full for cheesecake in the end.", "rating": 4, "date": "8/18/2018"}, {"text": "I typically always eat here for lunch or happy hour. Local beers and wine and many mixed drinks to choose from. They offer bread before the meal and have a wide variety menu. Obviously their cheesecake is fantastic. This location is in the Coronado mall so it&amp;#39;s nice to work up an appetite while shopping then enjoy a nice meal afterwards.", "rating": 5, "date": "11/25/2018"}, {"text": "Ok, so Cheesecake Factory is one of the big chain restaurants I really like nowadays.  I know it gets busy, but the food and desserts are pretty darn good with 5 million choices as well.<br&gt;<br&gt;I came here on a Saturday night with a friend.  We had a 15 minute wait to be seated, not bad for a Saturday night at 6:30.  The first thing the waitress did when she came to the table was say how busy it was, and she looked incredibly flustered.  Um, I&amp;#39;m sorry, any other Cheesecake Factory, this would be considered slow.<br&gt;<br&gt;When we ordered, my friend asked if she could keep the menu to look at it for desserts.  The waitress was really pushy saying she wanted it back.  She did let us keep it for a little bit while waiting for her to come back in a few minutes.  When she did come back, she twice asked, &amp;#34;Can I have the menu now?&amp;#34; in a very annoyed tone.  I responded &amp;#34;yes&amp;#34; twice, but she didn&amp;#39;t acknowledge me.  When I looked up, she was giving my friend a death stare and waiting for her to say &amp;#34;yes.&amp;#34;  Apparently, I didn&amp;#39;t count.<br&gt;<br&gt;I asked for more sourdough bread, which took a while to come out, and she dropped it on the table and quickly walked away.  We didn&amp;#39;t even have a chance to ask for more butter.  Really?  You don&amp;#39;t bring bread and butter?<br&gt;<br&gt;The rest of our time there wasn&amp;#39;t as annoying, but if I ever have this person as a waitress again, I&amp;#39;m asking for someone else.  Good thing Cheesecake Factory has a bunch of stuff I like, or I definitely wouldn&amp;#39;t be back.", "rating": 3, "date": "5/25/2017"}, {"text": "Honestly? The best portion of the meal whenever we go to Cheesecake Factory is the appetizer, particularly the delicious nachos they have there. Otherwise, it&amp;#39;s a jack of all trades master of none. They&amp;#39;ve got a gigantic menu, but nothing really stands out. <br&gt;<br&gt;Great atmosphere and nice to sit there occasionally, but not a place we frequent.", "rating": 3, "date": "6/30/2018"}, {"text": "And NOW some of you are realizing the truth about Cheesecake Factory-it really isn&amp;#39;t good food!  And their cheesecakes aren&amp;#39;t great either...I much preferred Dee&amp;#39;s and sadly it&amp;#39;s gone.  Too crowded and wait times are long, menu- although lots of items- has no standout item.", "rating": 1, "date": "7/29/2018"}, {"text": "Went for an early dinner to avoid the crowds around 3pm. It wasn&amp;#39;t that busy and it took about 10 min still to get a table. Our waitress was very polite and was there to answer any questions concerning food allergies of one of our guests. She also gave other recommendations to try and brought us fresh bread. The prices are a little high but the portions depending on the item are large. I got the chicken parmesan pizza it was massive but delicious. I need to visit again to try the many cheesecakes.", "rating": 4, "date": "9/26/2017"}, {"text": "We tried to  call ahead and would not take reservations for a party of 10. When we got there the restaurant was not  that busy and they quoted us a 2 hour wait. We asked to split our table up with 2 booths and they said they would not do that. The hostess was rude about the whole situation.", "rating": 1, "date": "2/8/2020"}, {"text": "I went to cheesecake factory in New Mexico (Albuquerque) with my management for lunch.<br&gt;<br&gt;We ordered Thai lettuce wrap , bbq ranch chicken salad ,chipotle chicken pasta and davinci pasta.<br&gt;<br&gt;Review :<br&gt;<br&gt;Thai lettuce wrap: All the lettuce was dried and dirty. When we mentioned to server about lettuce condition and she brought us 2 piece of lettuces. We have more than 3 people... hello? <br&gt;<br&gt;Bbq ranch chicken salad: It comes with the deep fried onion on top , but i found little piece of calamari and few piece of french fries with the deep fried onions.<br&gt;We  mentioned to our server and she said it happens sometimes.. just like sonic how they cook deep fries all mixed together. (HUH?)<br&gt;How can she compare to Sonic (fast food place) and cheesecake factory (restaurant)like that?<br&gt;<br&gt;I&amp;#39;m not a chef , but i have a common sense.<br&gt;I know they deep fried stuffs in same fryer, but before they deep fried stuffs they need to remove all the pieces from previous time. It was disgusting how she handle customers.<br&gt;<br&gt;Davinci pasta: This is one of my favorite pasta from cheesecake . It came out watery , mushroom wasn&amp;#39;t fully cooked  and no caramelized the onion as well.<br&gt;Manager reached out to us. She says this is how exactly looks like .. we told her pasta sauce suppose to be dark color and she said dinner time restaursnt lights are dark and that&amp;#39;s why pasta color looks dark at night time. I had this pasta day time and night time. I know better!!  I was very speechless  about what she told us. She did not handled the problem in kitchen professionally  as a manager  and rude. The way she look at us I felt  discriminated from her. Because we are asian and hispanic?<br&gt;I will not go there ever again.", "rating": 1, "date": "5/5/2018"}, {"text": "Foods are good enough but feels like customer service gets worse bit by bit every time. <br&gt;<br&gt;It wasn&amp;#39;t busy but I had to wait awhile to be seated and awhile to get my order placed.<br&gt;<br&gt;I constantly had to ask for items when I hadn&amp;#39;t need to before and server never bothered to check up on us for unless it was really obvious that we were trying to get ahold of her. She had no issue checking up on other customers so not sure if she was actually busy or not.<br&gt;<br&gt;Food portion gets smaller as well while price stays same or so (I almost always gets a pasta, no seafood or any special expensive ingredients... so unless price of flour is jumping up every month... I kind of expect portion to stay about same).<br&gt;Pasta I ordered tasted really, really bland this time compare to before which was very disappointing.<br&gt;<br&gt;Extra star because breads taste really good (it was only thing I enjoyed this time).", "rating": 2, "date": "7/25/2019"}, {"text": "Got a 100.00 dollar gift certificate and received 4 cheese certificates back for every 25.00 you spend. IIn all reality spent 60.00.", "rating": 5, "date": "12/24/2018"}, {"text": "I would say that the bread is the best part of the experience at Cheesecake Factory! The service, while providing human contact, does not do much more than that. Not only were we not provided with silverware, but we didn&amp;#39;t even get our food till after all of the tables around us, even the ones that had been seated after us. After we got our food, we had to return it due to the noodles not being fully cooked. I&amp;#39;ve never experienced such horrible service at other Cheesecake Factory&amp;#39;s, I wouldn&amp;#39;t recommend eating here.", "rating": 1, "date": "4/19/2019"}, {"text": "We went to have lunch on our one hour lunch break. We sat at the bar thinking it would be fast service, the bar had no one sitting at it yet. It took a while for the bartender to show up and take our drink order. Then a little more Time to get our food order. Then forever for the kitchen to prepare the food.<br&gt;We ended up taking our food to go and eating it in the car. Not a good experience.<br&gt;Obviously, the dining experience sucked.<br&gt;Food quality was so-so.<br&gt;<br&gt;They did not offer a discount or anything else.", "rating": 1, "date": "3/21/2018"}, {"text": "I give it a 3 and half stars.<br&gt;Atmosphere: Good:<br&gt;Not too many people, nice lighting with big lamp looking things coming from the ceiling, and the way the booths are set up makes the seating very intimate.<br&gt;Food: Good<br&gt;The taste of the entree was decent, but like I said, it felt like it was missing something.  Steak was succulent, mashed potatoes were chunky, the sauce was a little too much salt, and the onions for some reason were hard to eat. The Caramel Cheesecake on the other hand was off-the-hook, lots of layers of flavor and wonderful texture. It is an art form.<br&gt;Price: Not Great<br&gt;Even though you get a big portion size, and you can most likely have a meal or two (or three) I feel like that should be an option. Maybe ask if we would like like a half portion as well for us that don&amp;#39;t want to spend $20 on a plate of spaghetti, when we might as get a damn steak.<br&gt;-Desert Breeze", "rating": 3, "date": "8/25/2017"}, {"text": "The service isn&amp;#39;t that great. As we were being seated at our table there was a hair on the table and as I mentioned it to the hostess she just wiped it off with her hand and walked away. Our waitress was very nice yet she didn&amp;#39;t give us any refills or did she check on us at all. My food came out first and my husbands food came out 5 mins laters first his club sandwich then 10mins later he got his French fries. For being such a big and busy business you would figure that the restroom would be a lot more accommodating. I waited in line to use the restroom ‍. Not impressed at all for the price we paid!!", "rating": 3, "date": "3/30/2019"}, {"text": "Cheesecake factory is a chain restaurant that has promising arrays of delectable burgers, padta, some Asian flares and of course, large amount of variety of desserts", "rating": 4, "date": "12/15/2016"}, {"text": "I don&amp;#39;t even like chain restaurants (normally) and try to support the little guy, but every time I go here I have a good experience. Good service. Good food. Love the kale with grilled salmon salad. So good, and fresh! Some of the cheesecakes flavors really have too much going on, but I am always happy when I order the plain with fresh strawberries.", "rating": 5, "date": "6/11/2018"}, {"text": "Oh the irony of coming to such a wonderful restaurant and not partaking in the item that it receives its name (but maybe sometime soon!). This establishment has extremely fast service and friendly staff, even with may patrons eating Sunday brunch and lunch. The opening act is the bread, which is well worth all the hype that surrounds. As for the overall atmosphere, the layout moves with the restaurant&amp;#39;s design and the lighting compliments the interior decor nicely. The food is rather pleasant considering the sheer number of items that are available. All in all, The Cheesecake Factory is a very solid restaurant which only makes me want to come back again to indulge in the showstopping desserts!", "rating": 5, "date": "7/8/2018"}, {"text": "Only tried the cheesecake. Raspberry lemon and the strawberry were unbelievable..and so was the bill. Be ready to splurge, for both calories and the wallet!", "rating": 4, "date": "8/5/2018"}, {"text": "I felt obligated to write a review about this Cheesecake Factory, because I feel like its current ratings are nowhere close to the experience that I had.  I tried the stuffed mushrooms, and it was one of the best! The steak diane was good, and the chicken madeira was even better. And you can&amp;#39;t leave Cheesecake Factory without some cheesecake! Even though I was already full, the classic strawberry cheesecake didn&amp;#39;t stand a chance.  They really do have the best cheesecake! The service was also good, despite there being so many people during dinner time.", "rating": 4, "date": "1/29/2018"}, {"text": "Just like other quality Cheesecake Factories around the country. I&amp;#39;m certainly impressed with the high standards this place offers on a consistent basis. It&amp;#39;s never failing and ever strong. <br&gt;I love their Long Island ice teas. And avocado egg roll thingys. <br&gt;I love the chicken biscuits, despite its overwhelming white people taste. My little guy loved it too. <br&gt;The service was exceptional as always. These guys are trained beyond your imagination could ....imagine. <br&gt;I love the rye bread and butter. Don&amp;#39;t forget you need a pad of butter per piece of bread. <br&gt;You can not go wrong with dessert. Move out da way Flying Star. Cheesecake Factory still has THE BEST dessert.", "rating": 5, "date": "11/2/2016"}, {"text": "Love the Cheesecake Factory! Usually like to visit local places, but the Cheesecake Factory is a treat. I&amp;#39;ve only experienced good service at this location. One time my husband was given the wrong dish and they immediately brought out the correct one and let us keep the extra meal. I really love the bistro shrimp pasta and the chipotle pasta. The fried Mac and cheese is really tasty but a little pricey because you only get 2 pieces and it costs around $11. Of course the cheese cake is tasty too. We usually need to get it to go. My go to is the s&amp;#39;mores... yum!", "rating": 5, "date": "6/22/2018"}, {"text": "My family and I went here for my birthday. My son had spaghetti and meatballs, my husband and I shared the chicken and shrimp gumbo with brown rice. <br&gt;<br&gt;It was really delicious and perfectly spicy. <br&gt;<br&gt;I ordered a pineapple Moscow mule that tasted like juice, I couldn&amp;#39;t taste the vodka at all. It had very little.<br&gt;<br&gt;For dessert my son had the red velvet cheesecake, my husband had the salted caramel cheesecake and I had the &amp;#34;ultrarageous Chris&amp;#34; cheesecake. My son and I couldn&amp;#39;t finish our cheesecakes, they were really rich and quite overwhelming. Next time we are going to try the plain one. <br&gt;<br&gt;A little bit pricey but it was worth.", "rating": 4, "date": "1/28/2017"}, {"text": "Waiting two hours for any meal is not a pleasant experience. You might just want to eat<br&gt; before you go.", "rating": 2, "date": "7/3/2016"}, {"text": "Came out for an evening meal with my partner to one of my favorites restaurants the Cheesecake Factory which did not disappoint. I ordered the herb crusted filet of salmon and Despite the spider like appearance it&amp;#39;s amazing!", "rating": 5, "date": "11/29/2017"}, {"text": "Let me just start with the service; slow and indifferent to the the fact that were even there. I ordered a glass of wine, but never got it. Halfway thru our meal, the waitress came back with the excuse that the bartender was slammed. Why wasn&amp;#39;t management stepping in to help? He was too busy getting cozy with his staff to make sure things were running as they should. To top things off, we forgot a cell phone on the table. As soon as we realized it, we went back (20 minutes max), they had given to someone else!!! We never did get it back. Our experience didn&amp;#39;t end there; the manager (same one) accused us of being irresponsible for leaving it in the first place. Instead of trying to help, he called security. We&amp;#39;ll never go back. The food is not enough to overcome rotten/indifferent service.", "rating": 1, "date": "10/31/2019"}, {"text": "Service: we sat at the bar area, which is a fCFS deal. However our server was awesome!!!! So sweet and made sure that we were happy!<br&gt;<br&gt;Food: my sister and I shared the chicken Marsala! Holy cow it was delicious! There was for sure enough to share with two adults! Everything was great!", "rating": 5, "date": "7/7/2016"}, {"text": "The DISHES were disgustingly DIRTY. The first two cups had a nasty red sauce on the handle and on the bottom of the cups, both of them. With a few bits of food around the rim. We asked for new cups. She brought back two more cups which still had food gunk stuck to it. One even had something like spinach stuck to the rim. The silverware? Forget about it. They were sticky with food particles caked onto them. Did they even run them through the dish washer? We asked for plastic silverware to eat with. I didn&amp;#39;t want to keep sending the waitress back. Check out the photos.<br&gt;<br&gt;When we spoke to the manager about it, he seemed to not care at all. He was very &amp;#34;as if&amp;#34; about it. So, no help from him. He rolled his eyes as we left the restaurant. <br&gt;<br&gt;I usually love this chain but the Albuquerque one is the worst I have ever been to. I&amp;#39;ve been to 6 different ones in different states. It&amp;#39;s usually my go to. I&amp;#39;ll never go back to the Albuquerque chain. Gross!", "rating": 1, "date": "3/28/2016"}, {"text": "There are lots of flavors of these cheesecakes that they have at the &amp;#34;Cheesecake Factory&amp;#34; alright. Including Low Carb, Strawberry, Chocolate, Salted Caramel, Oreo, Lemon, Cherry, Blueberry, and others.", "rating": 5, "date": "6/28/2018"}, {"text": "We went on our first date night in a LONG time and decided to visit The Cheesecake Factory. We were greeted by our server who rushed to get our order in to make the happy hour prices! The food was incredible and the prices were even better. I would definitely recommend their happy hour to anyone! Great food and drinks at great prices!", "rating": 5, "date": "1/19/2017"}, {"text": "I&amp;#39;m gonna go against the grain here and say the Cheesecake Factory is awesome. I&amp;#39;ve been to the Albuquerque location a few times, but as a well-seasoned patron in other states, this is one of the better locations. We love coming here for appetizers and/or desserts and the service has been superb every time we&amp;#39;ve been here. <br&gt;<br&gt;Recently, I tried the Apple Crisp which was perfect in my book! The &amp;#34;crisp&amp;#34; is more like cobbler served with warm, cinnamon-y apples and ice cold vanilla ice cream. Thanksgiving is around the corner and I could eat this everyday (Fall is here!). This last Friday we sat at the bar. The lady and gentleman who were there were personable and fun!<br&gt;<br&gt;You may wonder why people love eating here, when there are so many other amazing restaurants that rock Albuquerque. It&amp;#39;s the perfect combination of service, location, variety, and setting. The menu is large, but that works for big groups. The plates are generic enough, there&amp;#39;s nothing you can turn down...no... not even the cheesecake!", "rating": 4, "date": "9/4/2016"}, {"text": "Was our first time eating here today. The experience was great and the atmosphere was was very welcoming. We had our baby in a carrier/stroller they placed us very conveniently to the washroom and away from others to enjoy their lunch because our baby can be fussy. We ordered the Louisiana pasta and Steak Dianna ( I think that&amp;#39;s the steak was called) and wings for appetizer. The waitress was very polite and tentative. Was a great experience for us.", "rating": 5, "date": "4/8/2019"}, {"text": "Well we finally tried the cheesecake factory. I&amp;#39;ve been wanting to try this for some time but just never have. while we were on vacation in NM my step-mother treated us to this restaurant. Although we had kinda a difficult time finding this location we eventually did, its in the back of the mall. <br&gt;We went in a Thursday evening around 9pm and we still had a wait. One thing that is nice is if you are able to use a smartphone you can pull up their whole menu online so you already have an idea of what you want when you are seated.<br&gt;We were greeted in a timely manner which I always appreciate.<br&gt;the menu ranges from what I could tell is from $12-30, and there are plenty of apps to choose from. <br&gt;They offer several entrée selections that include but not limited to pasta, steaks , seafood, and salads.<br&gt;I had a ribeye steak for dinner which honestly was cooked like I asked and had a great flavor. <br&gt;My Father opted for the Hibachi steak which he also enjoyed and both our meals came with mashed potatoes and vegetables.<br&gt;My Wife and Stepmother both opted for pasta dishes which were served with fresh grated parmesan cheese, my Son the fried shrimp platter which he didn&amp;#39;t choose to offer me a sample but informed me they were delicious, lol.  and they did look like a nice size of shrimp.<br&gt;All in all we all enjoyed our meals, the only thing we regret is we were all so tired from a day of shopping in Sante fe we didn&amp;#39;t try the cheesecake or other desserts. So that will be on our &amp;#34;bucket list&amp;#34; when we get back to Denver. <br&gt;So I will recommend this location and stay tuned for our review about Denver&amp;#39;s Cheesecake Factory!!", "rating": 5, "date": "8/12/2016"}, {"text": "This is a great place to stop by for drinks before shopping, which is great because I don&amp;#39;t know of any options within the mall. This is a standard cheesecake factory which for ABQ is super high end.", "rating": 5, "date": "11/28/2018"}, {"text": "First of all, I NEVER had to write a bad review, anyways  I took my boyfriend for his birthday this evening, and we approached the hostess  and told her we will be a party of 16 and the  first thing she says is &amp;#34;Are you serious?&amp;#34; And rolled her eyes. Like seriously? I was so disappointed and angry the way they talked to us like we were such a bother and at that point I  really wish we could of gone somewhere else but  we couldn&amp;#39;t because we had  already told our party about eating here. The food was good and our server was great. Our friends really enjoyed dinner other than that, but my goodness they definitely need to hire more professional hostesses. I can&amp;#39;t believe how rude they were to my boyfriend. I hope they don&amp;#39;t treat all customers this way.", "rating": 3, "date": "4/4/2019"}, {"text": "Came in for Sunday brunch and it was perfect! The waiter was attentive and kind. The food and the drinks were also great. Make sure to ask for fresh grated Parmesan on your food.", "rating": 4, "date": "3/5/2018"}, {"text": "We usually eat here when we come to Albuquerque and enjoy the experience. Tonight however, we came in at 945 pm, they don&amp;#39;t close until 11pm. They were not busy but it took too long to be waited on for our food order it was 50 minutes before the waitress took our food order. It took forever to get a refill on my drink, the waitress was upset because we wanted lemon for my wife&amp;#39;s tea, and we had to call her over several times as she would check on the table across from us and would not check on us. <br&gt;<br&gt;The first time we ate here we had a bad waiter but he was better than tonight, by far. My wife&amp;#39;s food was good she said but my steak was somewhat over cooked. I ate it anyway because I didn&amp;#39;t want to wait for them to recook it. Very disappointed with this visit.", "rating": 3, "date": "5/27/2018"}, {"text": "I love coming to this restaurant! Besides Pappadeaux this is one of my hands down favorite places to go. Tons of menu options everything you could imagine for the whole family so everyone will be happy. The food is good quality with big portions for you big eaters like myself. I&amp;#39;m lactose intolerant so my allergy to dairy is always something I&amp;#39;m concerned about and my server Nico made sure that all my food was cooked with olive oil instead of butter. Even went back to the kitchen and triple checked for me when I was unsure just because I&amp;#39;ve had a lot of bad experiences at restaurants with the servers just not really caring before, but he made me feel comfortable and confident that I&amp;#39;d be fine. I started with the fire grilled artichoke which is my favorite appetizer especially with that mayo dipping sauce. The salmon was great and my friend loved his factory burrito. My drink was a whiskey martini hybrid mixed with some honey for a light refreshing taste. You can tell the people that work here really enjoy their job which makes the experience of being served my happy people that much better.", "rating": 5, "date": "8/13/2018"}, {"text": "Had the worst customer service here. We got seated pretty quickly but then everything else took forever. The server was all over the place. It was a nightmare. Never going to this place again.", "rating": 1, "date": "2/28/2019"}, {"text": "Takeout order review:<br&gt;-Lemon Meringue Cheesecake: Yum!<br&gt;-Sunday Brunch Chicken &amp;amp; Waffles Benedict:  Waste of money! Flavorless. Small portion. Chicken tenders rather than whole portion chicken. And they forgot the syrup! <br&gt;-Mashed Potatoes:  Good.<br&gt;Results: Go for the cheesecake only. Overpriced, under-flavored everything else. This is our third visit. We wanted to love it. We&amp;#39;re done w/the place.", "rating": 3, "date": "3/25/2018"}, {"text": "50 minutes to get our food. 10 minutes to get our drinks. Waiter was nice but we had no idea what he was saying. He talked low and mumbled. My food and wife&amp;#39;s was pretty good once we got it. The kid&amp;#39;s was disgusting. Corn dogs had no flavor and mac and cheese was watered down cheese powder that had solidified.  Also no flavor, I felt bad getting upset with him for not wanting to eat it until I tried it. Worst mac and cheese ever. <br&gt;Horrible service, never got water refills, took long getting food/drink, ants were all over the patio under our table, not once did we see a manager walk by to check on anyone.  I&amp;#39;ve been to many other CFs around country (3rd time at this location) and this one is the worst i personally have seen.  Way to go Albuquerque. Corporate needs to come in and retrain and do an overhaul on this place.", "rating": 1, "date": "5/20/2018"}, {"text": "This place is absolutely fantastic! The food selection, the drinks, the Happy Hour menu, and, of course, the desserts! To top it off, the atmosphere is lively. My husband and I love the bar area. This place is super popular and, therefore, super busy on the weekends so expect to wait. It&amp;#39;s worth it!<br&gt;<br&gt;Recommendations:<br&gt;* Tamale corn cakes (appetizer)<br&gt;*Avocado eggrolls (appetizer)", "rating": 5, "date": "3/6/2016"}, {"text": "Who knew this place served more than just cheesecake! ?!!  What a fun and hip place to eat while enjoying the company of  family and friends.  Everyone was genuinely happy to help and work.   Loved the music and the decor. <br&gt;<br&gt;It was non stop from the time we arrived to the time we left.  Not a whole lot of space to sit and wait for extended periods but the buzzers have a pretty decent range so you can check out  near by shops as you wait.  We were fortunate enough to snag a bar table which was a major SCORE!   Our waitress Katie was very sweet and made our experience well worth the wait. <br&gt;<br&gt;I had the pleasure of eating the avocado eggrolls, Cajun Jumbolya along with a Cosmo what a treat! Kaluha cheese cake to go please it&amp;#39;s a wrap!", "rating": 5, "date": "3/6/2016"}, {"text": "Our first time here, meeting friends for lunch. The five of us were seated immediately in the large, open, nicely decorated restaurant and given baskets of different breads and butter. Looking through the expansive menu, And the additional other lunch? menu, I ordered the green chile Cheeseburger with French fries. I asked for the condiments on the side and mid rare. The cheeseburger arrived with some, what looked like pico de gallo and slivers of something crunchy, and a small dish of jalapenos and ketchup for the fries. The bun was nicely toasted and the right size for the burger. I didn&amp;#39;t taste green chile at all sadly. The burger was cooked alright. My husbands meatloaf was ok, but my friends Thai dish lacked not only flavor, but spice. I guess we should have stuck with cheesecake, seeing as that&amp;#39;s the name of the place and both of our slices of cheesecake, my lemon raspberry and his Chocolate cherry, were the best things we tasted. For the three of us, with drinks, almost a hundred bucks. I&amp;#39;d probably only go back for cheesecake.", "rating": 3, "date": "1/4/2019"}, {"text": "At least NM now has a Cheesecake Factory.. after a long enough wait.<br&gt;<br&gt;I&amp;#39;ve been in twice -- once for an actual sit down meal &amp;amp; once to pick up a slice of cheesecake (only because I was craving it).<br&gt;<br&gt;Both times have been quite pleasant -- although the wait was quite longer than expected.<br&gt;<br&gt;The first time I went in w/ a friend around like 430pm on a weekday... I got there first to reserve our spot in line which resulted in a 30-45min wait. I mean, it&amp;#39;s cool because I could get in some shopping in the meantime. I came back 30-45min to get seated at a table near the bar. The waitress waiting on my table was very attentive &amp;amp; got us our food in a reasonable amount of time. I got the mac &amp;amp; cheese burger &amp;amp; it was pretty filling. The amount of food you get for the price is pretty good. I also got the white chocolate raspberry truffle cheesecake to go &amp;amp; that was a pretty good decision.<br&gt;<br&gt;The second time I came in was for a cheesecake run... at like 10pm on a weekday night. I was literally the only one in the cheesecake pick up line -- but had to wait like 5min before someone actually helped me. This time, I got the white chocolate caramel macadamia nut one &amp;amp; it&amp;#39;s def one of my faves.<br&gt;<br&gt;I look forward to coming back here again to try other menu items as well as other cheesecakes.", "rating": 4, "date": "5/16/2016"}, {"text": "Very rarely do I give a restaurant a five star review.  Today I experienced 5 star service and 5 star food at Albuquerque&amp;#39;s new Cheesecake Factory.  <br&gt;We arrived at opening time,  (11:00 a.m.  Saturday morning)... <br&gt;<br&gt;Since opening a few months ago, the location  has been overwhelmed with business and it  has been almost impossible to secure a table.<br&gt;I was reluctant to patronize this location after having read several &amp;#34;negative&amp;#34;  reviews here on Yelp.  <br&gt;But like anything else, food and service is very subjective.    My dining guest  and I decided to experience it firsthand and reach our own conclusion. <br&gt;Given the fact they have only been open a couple of months, I expected there to be &amp;#34;opening month&amp;#34;  blunders and lots of them. <br&gt;That in fact did happen.   Now that Albuquerque&amp;#39;s  Cheesecake Factory has had a few months to find their way,  they&amp;#39;re ready for &amp;#34;prime time&amp;#34;. <br&gt;<br&gt;Bear in mind that I am one of the harshest restaurant critics on the planet earth... Having said that, I must share with you my dining  experience.  <br&gt;<br&gt;We were greeted by a pleasant young man &amp;#34;DANNY&amp;#34; , our server.  He was quite knowledgeable about the menu and was personable and friendly.<br&gt;We started with a couple of appetizers. ... Fried Zucchini and Guacamole and chips... They were delivered promptly.   What a pleasant surprise...  The Guacamole was made up of<br&gt; giant chunks of fresh cut up avocados,  tomatoes and onions and a nice blend of spices,  unlike the usual mish mash you get at other restaurants .<br&gt; Indeed, the best Guacamole I&amp;#39;ve ever had in Albuquerque. <br&gt;<br&gt;My lunch guest ordered fish and chips... I ordered their pit beef sandwich which is a roast beef au jus sandwich which came with a cup of  natural beef dipping  juices <br&gt;and horseradish on the side. <br&gt;<br&gt;The fish and chips were  hot and crisp served with tartar sauce.  My hot roast beef sandwich was absolutely delicious... <br&gt;The beef was  thinly sliced, very tender and  cooked perfectly to a medium and was served with a  slice of cheese and caramelized onions on a delicious seeded roll<br&gt;along with sweet potato fries. The portion was quite generous and filling.  The service provided by Danny was very professional and exemplary.<br&gt;The restaurant&amp;#39;s manager, JOHN GARCIA,   came by our table to ensure everything was satisfactory.  Indeed it was and then some.<br&gt;<br&gt;We thoroughly enjoyed our visit to Albuquerque&amp;#39;s new Cheesecake Factory... This is a &amp;#39;must visit&amp;#39; .   I highly recommend it and proudly give it 5 stars !!! <br&gt;<br&gt;Mike Santullo<br&gt;Albuquerque,  New Mexico", "rating": 5, "date": "7/9/2016"}, {"text": "Great food, great service, clean and nice. Meets all my criteria for 5 stars . Got an awesome fresh salad. Kids were happy with a quesadilla. Went home with some cheesecake.", "rating": 5, "date": "12/29/2018"}, {"text": "Save your time and money and go somewhere that won&amp;#39;t take 40 mins to serve you a cold hamburger and then forget your spouses entree. No meal should take that long at a restaurant and then come cold. To top it off we had to wait another several mins for them to bring my fiancé&amp;#39; dish which was also cold and tasted like plastic. I&amp;#39;m pretty sure they forgot about his plate. Now I remember why I never go to this location. Our waiter didn&amp;#39;t even check on us. I hate bad service and here you get the bad service with the bad food. Should have known by reading all the other bad reviews. I don&amp;#39;t recommend this place at all!! Fix your service, it&amp;#39;s a Wednesday night it&amp;#39;s not even busy.", "rating": 1, "date": "9/5/2018"}, {"text": "The Cheesecake Factory- it&amp;#39;s the same everywhere you go. The food is good, the cheesecake is yummy!! We had the tiramisu cheesecake, very very good!<br&gt;<br&gt;The service- sooo slowww. Our waitress kept forgetting us, our party of 6 couldn&amp;#39;t get a refill. We had to ask other servers for silverware, straws, refills, missing food,ect. Very disappointed with the service. <br&gt;<br&gt;If I come back, it will be for a slice of cheesecake to go! :)", "rating": 3, "date": "3/28/2016"}, {"text": "I so want to give 5 stars but it&amp;#39;s just not possible. We decided to order to go so we called the main number to place our order. It took over 15 minutes just for someone to pick up the phone, and we were calling around 330.....so once they finally answered the phone we placed our order. <br&gt;<br&gt;We ordered the Buffalo blasters and pot stickers for appetizers. I ordered the spicy chicken Chipotle pasta and my husband ordered the jambalaya. The girl on the phone asked if we wanted lunch or dinner portions and we ordered dinner. We ordered extra orders of bread and 2 slices of cheesecake. <br&gt;<br&gt;The girl was fast coming out curbside with our food and was nice. Once we looked at our order though things were clearly wrong.<br&gt;<br&gt;They did not give us the extra bread and our portions were lunch size yet they charged us for dinner size. My pasta had maybe 3 chicken nugget sized pieces of chicken. Don&amp;#39;t get me wrong it tasted amazing but it was extremely disappointing when you pay good money for a messed up order. Clearly they need to improve curbside and correctly making orders.", "rating": 3, "date": "3/23/2017"}, {"text": "This place sucks.  My friend and I went to eat tonight, we got seated right away, but it went downhill from there.  It took over ten minutes to be greeted.  Then the server shows up to take our drink order and asks us if we want bread.  Yes of course.  He goes and comes back with drinks, to then takes our order.  No bread.  He doesn&amp;#39;t ask what I want for a side, I had to stop him to tell him.  We don&amp;#39;t see him for about 20 minute.  Our drinks have been empty for ten, still no bread.  I talk to a manager, who is very apologetic, gets us refills and a new server.  The new server tries her best but we get our bread with just enough time to inhale it before the food shows up.  The food is fine.  Then we order cheesecake, because who doesn&amp;#39;t there?   They don&amp;#39;t have the cherry cheesecake anymore, WTF Cheesecake Factory?  <br&gt;<br&gt;But then she brings the check and there are no discounts, no coupons, not even a simple dessert comp.  I sat in your damn restaurant for over an hour, with the laziest server I have ever had in my life, then you don&amp;#39;t even give me something to make things right.  Sorry, you guys were in service recovery mode AND YOU FAILED.  You should have taken care of things and made it right.  <br&gt;<br&gt;Never coming back.", "rating": 1, "date": "2/25/2019"}, {"text": "We door dash often especially when we have company. We order from the cheesecake factory which have have done numerous times. Our order was apparently canceled for not having an item to fulfill the order. There was not any attempt for us to know which item was not available nor an attempt to ask if we wanted to replace the unavailable item. This does not seem like good customer service.  Our whole order canceled. Lost our repeat business.", "rating": 2, "date": "5/20/2019"}, {"text": "Cheesecake Factory is massively hyped, usually in connection to thousand plus calorie meals. So when they came to ABQ, I gave it a month and then went twice in a week, once with the family and once with a work friend. <br&gt;<br&gt;It was honestly better than I expected. The weekend visit with my husband and son was mixed, as we got shuttled out to a heated patio on a cold, drizzly Saturday. Service was quick, if not terribly polished. I got a burger, my husband got chicken Parm sandwich, and my son got pizza. Burger was surprisingly good, and my husband and son both demolished their lunch as well. Soda refills were sporadic, and honestly it was a half-step above Chili&amp;#39;s. Good but not worth the work of standing in line and shivering on the side patio. <br&gt;<br&gt;The second time was much better, on a noon lunch. My friend had the club salad and I had the ahi tuna salad. Really tasty and fresh, and we had better seats by the bar. The cheesecake is FABULOUS (it was my friend&amp;#39;s birthday so we had to indulge!) We got a variety with caramel on top and finished very last bite. Service was better, too. <br&gt;<br&gt;So averaging a 3 star experience with a 4.5 gives Cheesecake Factory a rounded 4 stars. I highly recommend going on an off time. Just not worth it otherwise. I don&amp;#39;t see this becoming a regular hangout, but I won&amp;#39;t refuse an invite.", "rating": 4, "date": "4/29/2016"}, {"text": "Wife and I came on a Friday night , got a quick seat at the bar. The wait to dine in the dining area was 15-30 minutes but we got lucky at the bar. I had a la cumbre Pilsner which was tasty - I was surprised to see a few local drafts on the menu of a national chain. Wife had a lemon drop and it was a little on the sweet side but still tasty. We skipped right to dinner - i had a simple green chile cheese burger which was pretty darn good. Wife had a pineapple chicken and shrimp dish. She said it was good. We skipped on the cheesecake for dessert since we were full. The cheesecake is the whole attraction and we have had them before - all of them have been tasty. Overall, service and food were solid.", "rating": 4, "date": "10/20/2017"}, {"text": "I come almost every week or at least every other week. The service is fine and I have no problem with that. But the cooking has severely declined and is getting worse and worse. Management was notified and accepted responsibility by offering compensation but I declined. Each visit there&amp;#39;s something wrong to include but not limited to getting orders wrong, sides being severely delayed and come out when you&amp;#39;re pretty much done with your plate; also the green beans aren&amp;#39;t being cut (like every other restaurant) and have the vine still attached.", "rating": 3, "date": "7/11/2018"}, {"text": "The wait was around 45 minutes, which is acceptable since it just opened. I ordered the salmon and it was delicious! Our waitress was a sweetheart and showed knowledge of the menu. I ordered the tuxedo cheesecake and I ate every last bite! I will be returning :)", "rating": 5, "date": "3/8/2016"}, {"text": "To day was my birthday and I called to check the availability for eight people the said  they had seating for eight with in 20 min  so we all came and have been waiting for and hour and a half this place is horrible taking other large groups of 6 and seating the the point is I do not recommend this place and every time I would ask how long the would say ruffle 20 min the food was not that&amp;#39;s great hate a big problem with the staff not being attentive to their paying customers  my whole birthday dinner was ruined thanks to the dumb staff working there and the reason there is one star is because that&amp;#39;s you have to choose at least one star if I could it would be a negative", "rating": 1, "date": "1/18/2019"}, {"text": "I love the Cheesecake Factory. I&amp;#39;ve been to different ones from different states. We had the warm crab and artichoke dip, salted caramel cheesecake, and tuxedo cheesecake.<br&gt;<br&gt;First off, you can&amp;#39;t go wrong with cheesecake. We LOVED the salted caramel and the tuxedo cheesecake.<br&gt;<br&gt;Service was slow and just okay. The food was great.", "rating": 4, "date": "4/10/2016"}, {"text": "Why do people like this place so much? It&amp;#39;s okay, but I don&amp;#39;t think it&amp;#39;s worth waiting 45 minutes for; well actually, I don&amp;#39;t think any national chain is worth waiting for when you have so many great local places without a wait. Anyway, once you are eventually seated you get to sit down and read a good book; sorry I mean the menu. I think it&amp;#39;s possible to have too many choices. Also, bring a flashlight, it gets dark at night. I love the way it is decorated, from what I could see.<br&gt;<br&gt;The food is not bad, but if you want to feel good about yourself don&amp;#39;t read the calories. If you are on a diet with a cheat day this visit counts as 3 cheat days, sorry! :-( The Pasta Carbonara with Chicken is so good and only 2,290 calories! To be fair, if you ask the staff for a to-go box and immediately put half of your meal in it, I guarantee you will be full and still have food for lunch tomorrow. By the way, the cheesecake is awesome.", "rating": 3, "date": "7/25/2017"}, {"text": "I mean it&amp;#39;s the cheesecake factory. The service was pretty good, and the food is ok. I mainly come for the cheesecake though. The selection of cheesecake is great.", "rating": 3, "date": "4/23/2018"}, {"text": "Been here a few times and have yet to figure out why everyone says this is such a good restaurant. <br&gt;<br&gt;Our last trip there seals the deal for why we won&amp;#39;t be back again. Friday night, after waiting for a table we finally sit down. First, they&amp;#39;re &amp;#34;out of beer&amp;#34;--something about being out of CO2.. they&amp;#39;re also out of the artichoke appetizer. The server said it&amp;#39;s because they got a bad shipment last month and they haven&amp;#39;t had them since, which I then posit the question &amp;#34;you only order fresh produce once a month?!&amp;#34; <br&gt;<br&gt;Ordered the crab dip appetizer and waited to order entrees. We specifically told the server we wanted to enjoy our appetizer before the entrees. Even after waiting to order entrees, our appetizer was out only 2 minutes before they flung entrees onto our table as well. I suppose that was a good thing because we had no appetizer plates and had been eating the bread using our menus as plates beforehand. Asked for another bread basket from the food runner that never arrived. Asked for more toast for the crab dip appetizer that took another 15 minutes so the dip was cold by the time that came out. <br&gt;<br&gt;Now on to the entrees-- chicken pasta my friend ordered tasted as if they spilled a cup of sugar on top. The salad, which I had added chicken to came out with a cold leftover-looking piece of dried up chicken. So we don&amp;#39;t cook the chicken fresh to order. Oh but they were able to microwave it up for me to dry it out even more than it already was--how swell. <br&gt;<br&gt;At the end of our meal we asked about desserts but made sure to ask what they were out of first; which I believe it was 3 cheesecake flavors. Mentioned again how crazy it was they didn&amp;#39;t have beer on a Friday night to our server who then said &amp;#34;oh yeah they fixed it&amp;#34; --Awesome, would&amp;#39;ve been great to know that so we could&amp;#39;ve ordered one. <br&gt;<br&gt;The food quality is low, the servers aren&amp;#39;t trained properly, and there&amp;#39;s little reason to come back when with all the mishaps not one manager seemed to be on the floor putting out the fires. Not impressed.", "rating": 1, "date": "3/7/2017"}, {"text": "I&amp;#39;ve been to several Cheesecake Factory restaurants in different states. This one I will have to say is the worse when it comes to customer service. <br&gt;<br&gt;I called an order in for take out. Once I got there is was directed to go to the area for take out. There were 2 employees there behind the chessecake counter. They both saw me but neither one of them acknowledged me. So after a few minutes had passed. I got her attention and told her I was the re rot pick up an order. Her response was the cashier stepped away and should return soon. So after waiting again for another 10 mins. The cashier finally showed out. Since I was about 2 seconds from walking out the door. <br&gt;<br&gt;This location needs to train their employees to acknowledge customers even if you can&amp;#39;t help them.", "rating": 2, "date": "3/9/2017"}, {"text": "I know that this is late.  My friends &amp;amp; I came here for dinner while I was on vacation.  Everything came out just perfect,  from the wine that they served me, our dinners were perfect, even the waitstaff.  Our waiter checked on my party about 4-5 different times to see if everything was to our perfection and it was.  I have not had that type of service in along time.  I&amp;#39;m just sorry that I can&amp;#39;t remember our server&amp;#39;s name.", "rating": 5, "date": "8/13/2018"}, {"text": "Needed a change from the usual places we eat, and at a friend&amp;#39;s suggestion, we met here for lunch. I appreciate an extensive menu, which this place certainly has, and with all the possibilities, ended up deciding to satisfy my craving for a bacon cheeseburger. The beef was done perfectly, and the generous portion of bacon was delicious. I really liked their unsweet tropical tea, too. The service was excellent, attentive without hovering or making us feel rushed. (Thank you, Kevin.) I tend to frequent restaurants that are a lot less noisy, but for today, having a nice long lunch on the patio worked out just fine.", "rating": 4, "date": "4/20/2018"}, {"text": "First off I will say that this is my wife&amp;#39;s favorite restaurant, and we have been several times before with great service.  So here&amp;#39;s where it gets bad.  <br&gt;1. Was given the mandatory pager and a 15 minute wait.  After 35 minutes I asked the hostess the status and she said she realized she gave us the wrong pager, hence reason why 6 groups were sat before our party of 3. <br&gt;2. After being sat we waited 15 more minutes for our server Brian to get our drinks etc.  And 45 minutes for our food. <br&gt;3. Food was horrible, and tasted like it had been reheated in a microwave.  Server messed up order 2x. <br&gt;4. They were Out of wife&amp;#39;s favorite dessert. (isn&amp;#39;t this the &amp;#34;cheesecake factory?&amp;#34;). <br&gt;So overall I was very upset with many aspects of this visit.  The only reason i didn&amp;#39;t complain was that my wife didn&amp;#39;t want me to cause a scene.... She&amp;#39;s more compassionate having worked in the restaurant industry.", "rating": 1, "date": "1/29/2017"}, {"text": "We got sitted in an area with no waiter. Once someone realize we was sitting there, 5 minute have elapsed. Once we got a waiter, the service was good. The food was okay. Could have gotten the same type of food at Applebee. The best thing about the restaurant was the cheese cake.", "rating": 3, "date": "5/19/2018"}, {"text": "We love Cheesecake Factory! We come all the time! The servers are great! The green tea is fantastic! We haven&amp;#39;t had anything on the menu that wasn&amp;#39;t fantastic! Love the our door seating! Love their skinnylicious menu as well! They have a fabulous Brunch menu on Sundays that you DO NOT want to miss!! Over all so so glad that Cheesecake Factory is finally in Albuquerque!", "rating": 5, "date": "5/10/2018"}, {"text": "$9 for a puny slice of cheesecake???  Really?  It wasn&amp;#39;t even worth it.  Tasted like Costco cheesecake but with more sugar.  Service was okay but there was some confusion as to what we ordered so having our food getting passed back and forth from the kitchen wasn&amp;#39;t an ideal start to eating.  Not returning.", "rating": 1, "date": "5/5/2017"}, {"text": "I don&amp;#39;t get it. The Cheesecake Factory sounded like such a great place but our experience was quite the opposite.<br&gt;First, they say they&amp;#39;re open late but what they really mean is that if you come in after 8p maybe you can sit at the bar and maybe someone will be willing to at least take your order at some point but don&amp;#39;t expect drinks or bread or any of the other things you&amp;#39;ll get in the regular dining areas.<br&gt;So, we came in after 8p, 6 of us. The second we walked in the hostess was less than thrilled to see us and everything went downhill from there. We saw at least 4 waiters/waitresses in the area, none of which could be bothered to help the one server that was taking care of all the tables seated in the bar. Needless to say we got no refills, we had to ask for bread a couple times before we actually got some and the food was not only barely warm and tasted &amp;#34;meh&amp;#34;, it wasn&amp;#39;t even correct! One in our party didn&amp;#39;t get his entree until after the rest of us were almost finished. All of that that and then a ridiculously large bill similar to what we would have paid for a nicer dinner somewhere else in the area. I&amp;#39;ve had the opportunity to go back but opt for other places for dinner, if I ever do go back maybe I&amp;#39;ll just have dessert, seems to be the safest bet for my buck.", "rating": 2, "date": "12/22/2016"}, {"text": "Unfortunately, after our most recent visit last night, it will probably be a while before I choose to dine in again.  <br&gt;<br&gt;My husband and I have been here several times now, and the service has continued to be inconsistent.  There have been multiple times when, halfway through our meal, we&amp;#39;ve been told our server is changing.  At first we thought our initial server was due to go off shift or something, but then we would continue to see our initial server serving other tables after being pulled from ours.  After about the third time this happened, we asked why, and we&amp;#39;re given some bizarre explanation about how the servers are required to rotate sections after a certain amount of time or something.  No other restaurant I know of has such a policy, and it&amp;#39;s confusing, especially when it comes time to tip.  Who am I tipping, the first server, the second server, both?  Granted, this does not happen every time, but I don&amp;#39;t understand the concept.  <br&gt;<br&gt;While the service has varied from good, to decent, to kind of lacking on previous visits, last night it was extremely lacking.  Again we had a gift certificate we wanted to use, and when we arrived we were quoted a 40 minute wait.  We were asked if we wanted inside, patio, or first available.  Normally I don&amp;#39;t mind sitting on the patio, and will usually say first available since it can mean being seated faster, but last night it was chilly. I asked the hostess if the patio was heated (I couldn&amp;#39;t remember) and was told yes, so we said first available.  Because of it, we were seated in about half the quoted time on the patio.  However, although it is heated, the heaters are up on the ceiling of the covered patio, and as the patio is not completely enclosed (it&amp;#39;s open on the ends), the heaters didn&amp;#39;t do much to combat the chill in the air.  There were additional floor heaters located OUTSIDE the peremeter of the patio, but they provided no additional heat, as the shades were closed and we were sitting by the opposite wall away from them.  We decided to stick with it because we didn&amp;#39;t want to be put back on the list to wait for another table.  My husband went to the car to get our jackets which helped a bit.  I understand that having the additional patio seating helps with wait times, but if the restaurant can&amp;#39;t provide adequate heat in colder weather on the patio, it shouldn&amp;#39;t be utilized.  On top of that, the service on the patio was pretty inattentive.  Our server was very pleasant, but unfortunately not very efficient.  I&amp;#39;m thinking he was probably having to juggle waiting tables inside as well as the patio, but the service on the patio suffered because of it.  My husband and I ordered iced teas (yes, I know I just said that we were chilly on the patio, but we like the tea here), and we were asked if we wanted bread, which of course we said yes, please.  A while later we get our teas and place our dinner orders.  The server leaves and I go to reach for the sweatener when I realize there is none on the table or any of the surrounding tables that I can see.  Our server came back with the bread some time later, and I asked for some sweetener for the tea, and the server leaves to go fetch some, or so I think, but he must have gotten sidetracked as I don&amp;#39;t see him for a while.  Meanwhile, we have bread and butter, but no bread plates and no silverware.  We start eating it anyway and just scooping up the butter in the dish with the bread as we have no knives to spread it with.  We finish the bread, and eventually our server comes back to let us know our meals should be up soon.  I asked again for some sweetener, which to his credit he did apologize for and returned with.  Our meals come out, everything looks good and is just as we ordered.  We still don&amp;#39;t have silverware, but as we both ordered sandwiches, we didn&amp;#39;t need it.  I did ask for some napkins, which we got after asking.  After we were done eating, the server brings a dessert menu and we each order a different kind of cheesecake.  Our server returns again a while later to let me know that they were out of the cheesecake I ordered.  No biggie, and luckily I had a second choice picked out already and didn&amp;#39;t need to see the menu again.  So he goes off and returns what seems like a rather long time later with our cheesecake and some forks.  I definitely don&amp;#39;t fault the server for being out of one of the desserts, but the amount of time we went without seeing the server seemed long throughout the meal. Another issue is that our drinks were never refilled once during the time we were seated.  One entree, one appetizer (I ordered it as a meal), two slices of cheesecake and literally two glasses of iced tea (since we never got refills on them) came to about $50.00, which is too expensive to eat in the cold and be forgotten.  I will still be inclined to get cheesecake to go on occasion, but for all the fuss surrounding this place, I expected better.", "rating": 2, "date": "1/15/2018"}, {"text": "I&amp;#39;m so disappointed with the food here. I&amp;#39;ve been to cheesecake favorite in Hawaii, Seattle , and Georgia. Something all three of those places have in common they know how to season their food. I thought on my third time I&amp;#39;d be proven wrong , but I was not strike three for me , safe to say I won&amp;#39;t be coming back to this Cheesecake Factory. I ordered a shrimp pasta dish I can&amp;#39;t remember the name but the pasta was so dry , who likes dry pasta ? NOBODY, when I told my waiter my pasta was extremely dry he laughed and said would you like some cheese , which is also dry. I asked for extra sauce and they brought it out in this little tiny dish as if that sprinkle of sauce was enough to coat that dry pasta. My boyfriend had the salmon, which is hard to mess up so good job there. Let&amp;#39;s talk about his sides he had spinach which they probably just threw in the pan , and he was supposed to have oven roasted broccoli with garlic and red pepper flakes, so they said. The broccoli probably spent one second in the oven if that. You&amp;#39;ll see him add seasoning, I only wish I took a picture of that little dish they gave me for the mound of drySo yes I will not be back period. The service however is great and the drinks were on point, I had the Georgia Peach drink it was tasty. That&amp;#39;s about it.", "rating": 2, "date": "5/18/2019"}, {"text": "We had a super great lunch here yesterday, although I have been trying to save money for our credit card.  But O M G, it was well worth every penny.  But D. wouldn&amp;#39;t let me get my usual--spaghetti and meat balls. Instead I got the green chile cheese burger.  It was cooked absolutely perfectly. And the flavor was really good, as if it was ground NY strip steak.  Chile good.  Bun good.  French fries - good.  Service - friendly, thorough, professional!!! D. Had mashed potatoes which were to die for, asparagus, but I can&amp;#39;t remember what his main dish was.  But the bill was pretty reasonable for such good food and what atmosphere! I almost don&amp;#39;t want more people to come here! It is that good. One of the best places in A. At least come here for your birthday. Save up!", "rating": 4, "date": "7/9/2017"}, {"text": "You will be very pleased as you step back in tine to the fancy California classic days with a cheerfully decorated ambiance reminecent of the Golden days. You shall be treated like royalty with impeccable service. The food is also delicious", "rating": 5, "date": "8/17/2018"}, {"text": "Ordered online for takeout. The ordering system was easy. It even asked if I&amp;#39;d like complimentary sourdough and/or the brown bread to add to my order. The bread is one of my favorite parts of dining in, so I&amp;#39;m so glad they made this an option. I ordered the pasta davinci and jambalaya as wel as a strawberry cheese cake. It gave me an expected ready time and instructions for curbside pickup (how convenient!). When I arrived, I parked in the pickup reserved spots and called the number listed. I only waited a few minutes and my order was out to me. The food was delicious; I&amp;#39;ve ordered all these dishes before and wasn&amp;#39;t disappointed. The serving size was large and had leftovers for a few days.", "rating": 4, "date": "5/25/2018"}, {"text": "After a forty five minute wait we were told that a computer glitch was causing such a long delay.  Okay, if that&amp;#39;s the case, maybe let us know.  Three different waitstaff didn&amp;#39;t seem to care.  If any of us had been on a lunch hour it would have been ruined.  We were casual diners, so a bit of a wait would have been okay, Not going to recommend this place.  Indifference shouldn&amp;#39;t be the main entree on the menu", "rating": 2, "date": "3/11/2019"}, {"text": "Just a heads up, my review is quite biased because I have a undeniable weakness for banana cream cheesecake. I first discovered this weakness in my childhood, and rediscover it every time I have a slice at Cheesecake Factory whether it&amp;#39;s in Albuquerque, Phoenix or West Coast. I think I&amp;#39;ll go get one today...", "rating": 5, "date": "8/12/2018"}, {"text": "The Cheesecake Factory deserves 5 stars for the great food and ambiance, however, the staff at this location seem to be doing you a favor by serving you.<br&gt;This location was the first and only time I&amp;#39;ve ever had a CF employee not be helpful and attentive.  I had to find another waiter to get bread, chase my waiter down for more water and, when I was presented with the bill, I had wanted to order cheesecake and the waiter was obviously bothered by this.<br&gt;Despite the waitstaff, the food is outstanding and I will visit CF often - just not this one.", "rating": 3, "date": "8/10/2018"}, {"text": "This was the worst Cheesecake Factory I&amp;#39;ve ever been to. Our server Michael was absolutely terrible. He was very rude, when we needed something he wasn&amp;#39;t around at all.  They took about 15 minutes just to bring out our WATERS and when they brought out our WATERS  there was a cup that was just filled up with ice no water. Also when they brought out our bread it wasn&amp;#39;t fresh. the bread was VERY cold. I had to use the restroom and it was so disgusting that I couldn&amp;#39;t use it. There was no toilet paper there was paper towels all over the floor also there was poop on the seat. I don&amp;#39;t think I&amp;#39;ll be coming back here anytime soon.", "rating": 1, "date": "7/22/2017"}, {"text": "First time there.  Restaurant is so pretty, so inviting.  Had flatbed with goatcheese, arugula, pears and pecans.  Very yum.  Will return", "rating": 5, "date": "9/18/2018"}, {"text": "This place sucks! We&amp;#39;ve eaten at other Cheesecake Factory&amp;#39;s before. This location is terrible. The quality and flavor of the food is more like Furrs Cafeteria quality and flavor. No offense to Furrs. We ordered pizza for 1, tacos and fried shrimp and soft drinks. Of course we all had cheesecake. The tab was over $120. I was shocked. Do yourself a favor and avoid this overrated food spot.", "rating": 1, "date": "5/24/2019"}, {"text": "An overall outstanding visit. Our party of 2 was sat quickly. Our waiter (Joseph/Danny) was very attentive, professional, and cheerful when taking our order, recommending dishes, and following up on our general satisfaction. Our cocktail, entree, and dessert were all delicious! The general atmosphere of the restaurant was very relaxing and added to our overall satisfaction. We could not have had a better experience.", "rating": 5, "date": "5/29/2018"}, {"text": "I can not and will not ever be able to get on the Cheesecake Factory train. <br&gt;<br&gt;Their food is pricy, but that&amp;#39;s not the problem, the problem is it is so incredibly salty I find it barely palatable. Every single time without fail it makes my mouth feel like I have spent an hour licking a salt block. I just can not justify spending that much money for crazy amounts of salt. <br&gt;<br&gt;The cheesecake is eh. It&amp;#39;s good, it&amp;#39;s different, it&amp;#39;s crazy tall with crazy flavors, but I think you can do better. No, I know you can do better.", "rating": 2, "date": "9/12/2016"}, {"text": "Me and my husband went there in weekend for lunch. The ambience was so great and the staff were excellent. In the peak hour, we don&amp;#39;t have to wait in a long time. Both of us ordered burger (forget the name), but it definitely the best burger i&amp;#39;ve ever tried in US. Quite expensive, but the portion also large, complete with side dish. I took salad and my husband had fries. <br&gt;<br&gt;Salad was so good with the dressing (honey mustard) and fries also tasty, even they didn&amp;#39;t put so much salt or other spices. I definitely would come back to try other main course.", "rating": 5, "date": "2/3/2017"}, {"text": "I can understand the long wait to get a table.  I can understand the long wait for the food.  I can forgive the server ending every sentence with &amp;#34;my friend.&amp;#34;<br&gt;<br&gt;HOWEVER, i cannot forgive the luke warm food served.  I cannot forgive the rice served with the miso salmon not cooked all the way.  How do you screw up cooking steamed rice?<br&gt;<br&gt;Please get your kitchen together!", "rating": 2, "date": "8/29/2016"}, {"text": "I was in Albuquerque on business and decided to visit Cheesecake Factory for dinner.  It has always been in the top 5 restaurants until now.  I decided to try the Salmon special (BIG MISTAKE). The food seemed good as usual. However,  I awoke at approximately 2am  with stomach cramping, which shortly turned into excessive vomiting and diarrhea.  All the symptoms of food poisoning.  It was easy to determine that it was the salmon because that was the only food I consumed that day.  Bad thing, I had to give a presentation the following morning with cold sweats, cramping, and severe dehydration.  I had to leave my conference early and spend the next 9hrs in bed.  As I sit here in the ABQ Sunport still feeling the residual effects, I hate to write this review on one of my favorite eateries, but this was a terrible experience.   I gave two stars only because I think this was an isolated incident.  I would caution against ordering seafood in New Mexico without doing your research.", "rating": 2, "date": "3/20/2019"}, {"text": "Absolutely amazing service from Roxanne! Would recommend sitting in her section if you visit this location. She was very attentive and very nice! She greeted our table with a recommendation on the menu, she brought out a salad when my boyfriends food got sent back to the kitchen and while we waited for it to come back out. She brought us out togo drinks. Very good server!", "rating": 5, "date": "5/1/2019"}, {"text": "I can honestly say this was one of the most disappointing dining experiences we&amp;#39;ve had in a very long time. <br&gt;<br&gt;The restaurant itself is nice, and our waitress was very good, but that&amp;#39;s about it. The food was flavorless to be kind. We all tried something different so we could get a range of their menu, and none of us liked what we were served. We finished with the strawberry shortcake dessert, which was also lackluster, and looked quite a bit smaller than the one at the table next to ours.<br&gt;<br&gt;At this point there is no way I could recommend anyone going here. Maybe someday we&amp;#39;ll give it another try, but with so many great local restaurants to choose from, why waste your time with an overrated chain.", "rating": 1, "date": "8/14/2016"}, {"text": "Amidst the few negative reviews let&amp;#39;s take a moment to acknowledge that 50% of the experience is the service and 50% is the food. I have been to this location twice and they gave both been positive. <br&gt;My latest visit our server was Joe G. We were seated at our table with no service for 3-5 minutes initially but I&amp;#39;m ok with that. I like to be able to look at the drink menu before being pounced on. He arrived at our table with a smile and quickly took our drink orders. Mai-Tai for a friend. Classic Mojito for me. Water with lemon all around. My Mojito was on point. Delish. My friend said he wished his Mai-Tai was more fruity than he was given but I didn&amp;#39;t taste it so I can&amp;#39;t judge on that. <br&gt;Joe brought our basket of assorted breads and we placed our orders. One Jambalaya, one chicken and biscuits, one veggie burger and i had the Asian chicken lettuce wraps. I did not taste off of anyone&amp;#39;s plate but my own but I will say that my lettuce wraps were crisp and fresh and yummy. I had the veggie burger in my previous visit and it was very flavorful. Same reviews were given by my friend on this visit with her veggie burger. My husband loved his chicken and biscuits. Just his kind of meal. Hearty and hot. Now my friend that ordered the jambalaya orders this same dish every time he comes to Cheesecake Factory. I think he dreams about it at night. It is by far his absolute favorite. I don&amp;#39;t know why he even looks at the menu. <br&gt;Of course we rounded out the meal with cheesecake. Always fantastic but then again they are the Cheesecake Factory!<br&gt;Joe G did an awesome job with serving us. <br&gt;Our water glasses never ran low and we felt very well taken care of. He was very attentive when our bread basket ran low and very accommodating with our request to be provided wheat bread only. Their wheat bread is mouth watering!  That&amp;#39;s what I dream about at night!", "rating": 5, "date": "10/22/2016"}, {"text": "I love Cheesecake Factory.  So many choices and have never been disappointed in what I have ordered.  Saturday night I ordered the Honey truffle chicken.  It was beyond wonderful!  How can you go wrong in a place that serves so many cheesecakes?  One of my very favorite restaurants.", "rating": 5, "date": "5/14/2018"}, {"text": "There are some nice things here. Pleasant waiter.<br&gt;Nice menu. Nice atmosphere.<br&gt;But there are some problems! The portions are ridiculously huge. It took way too long to get our food. The Hamburger I ordered was way over cooked. Dry.  Could have been good. My grandsons each ordered Orange Chicken. When he found two hairs in the chicken we called our waiter over... this was at about the 2/3s mark during the meal. The waiter said we will just make you another order. I suggested that instead it made sense to just not charge us ... they didn&amp;#39;t listen. And they brought out another when it was time to order dessert. Where is the thought process to this solution? And mostly!!! They should have been mortified!  <br&gt;Get it together Cheesecake Factory!!!", "rating": 2, "date": "4/10/2018"}, {"text": "Cheese Cake Factory is the same no matter where you go except for Albuquerque as everyone knows when something new comes into town everyone has to run out and try it. The wait times are long here I came on a Friday around 4pm to try and beat the rush but there was still an hour + wait. The food is pretty good and they offer a huge selection and have just about everything you can think of. I was told the fish and chips were good so went with that they portions are huge and the food was great. I really enjoyed the avocado egg rolls. But for the amount of wait staff they have running around everywhere you would think the service would be top notch but service was lacking but I figure as time goes on that will improve as this is still a new restaurant. Also prices are a bit steep but overall worth it. Once service improves I will bump up my rating a star.", "rating": 3, "date": "4/26/2016"}, {"text": "Will not accommodate handicap persons! Was quoted 30-40 min wait on the phone by a receptionist. She wouldn&amp;#39;t take my name down unless we were there physically. I said I have a person in a wheelchair I can&amp;#39;t leave them she said I&amp;#39;m sorry  SO I Left my handicap family member alone because she wanted to eat there really bad, while I literally ran to put my name in and was told when I got there which was less than 5 min that it&amp;#39;s 1 and a half hours wait!! Talked to manager who was completely of no help. His response was well we&amp;#39;re learning. Learning what? To misquote people especially handicap. This place isn&amp;#39;t worth that wait! Trust me I grew up in California and have been there before. I&amp;#39;m more appalled at the lack of customer service especially towards people with disabilities! No wonder why their ratings in this new place are so LOW!", "rating": 1, "date": "3/13/2016"}, {"text": "The white bread  we got was really hard compared to the brown bread .  I ordered the lemon-herb roasted chicken and it was really moist, the carrots tasted great, I would definitely order this again. My friend got the cobb salad . Her first salad  was a little wilted  and the MGR was very nice and replaced it for free.   The waitress started off attentive but I think she got overwhelmed with other tables and forgot about us, fortunately another waitress was helpful.", "rating": 4, "date": "2/7/2017"}, {"text": "We&amp;#39;re from out of town.  We came here when they first opened, good food, good service and very clean.  Our second visit, not so good.  Dirty floors, booth seat was torn up, asked for another booth, lettuce in salad looked wilted and brown, turkey burger was mushy, chicken had no flavor.  Service was so, so.  The bathroom trash can was spilling onto the floor.  We&amp;#39;ve eaten at other Cheesecake Factory restaurants.  This one was not up to par.  Hope the management does something to bring it up to Cheesecake Factory standards.", "rating": 2, "date": "6/11/2018"}, {"text": "Nice atmosphere and seating outside was great. Service prompt and attentive. Food was good. Came for brunch and got eggs Benedict and daughter got thai salmon. Pretty good..green sauce that came with salmon had a weird taste. Salmon glaze was super good though! Got salted carmel cheesecake..yum.", "rating": 4, "date": "9/4/2016"}, {"text": "Wow. Unbelievable. If I could do less than one star I would. <br&gt;I bought a slice of red velvet cheesecake to go. I should mention that the young lady at the to go counter was sitting on the counter, the counter the orders are placed on, when I got there. <br&gt;Upon arrival Home, less than an hour later, the cheesecake was stale to the point of being inedible. <br&gt;I called and spoke to John the manager. I told him my issue and he started laughing. Saying he couldn&amp;#39;t believe it could be stale. <br&gt;I told him I wouldn&amp;#39;t take time to call if it wasn&amp;#39;t and his reply restated his position that they sell so much it couldn&amp;#39;t be stale. <br&gt;I don&amp;#39;t take being called a liar easily so I told him I would call his boss on the morning. <br&gt;When your restaurant is called Cheesecake Factory, you should at least get the cheesecake right.", "rating": 1, "date": "12/28/2017"}, {"text": "We have been here a few times and the food is always delicious, but always kind of slow. I always try to change and try new things and it has all been great. The steak Diane is delicious! Also they have really good Sangria here at a nice price! And if you don&amp;#39;t care about the price you&amp;#39;re about to pay for cheesecake....it&amp;#39;s absolutely heavenly! We&amp;#39;ve had a couple servers that have not been very knowledgeable of the menu or bar menu, but our last server Dominic was by far the best! Friendly, knowledgeable, fast, and took care of our large group with ease. Will definitely be returning!", "rating": 4, "date": "6/3/2018"}, {"text": "So excited when they opened up. Place is nice and clean. Kids friendly and good service. Foods and cheesecake is kind of overpriced.", "rating": 3, "date": "11/14/2017"}, {"text": "Great service and great food! This place is amazing! It is always worth the wait. The prices are a tad bit high but it&amp;#39;s what is expected from such a nice place.", "rating": 5, "date": "11/13/2016"}, {"text": "Have never been here before today was going to be my first time. I was at Victoria secret and messaged my mom to get us a table. 5 mins later, I noticed my mom was having a hard time getting attention from the hostess. I went up to the hostess and asked her &amp;#34; how long is the wait?&amp;#34; She replies back snooty &amp;#34; For however long it takes us to seat you&amp;#34; My mouth dropped and I said wow you didn&amp;#39;t have to say it like that I was only asking because I have a dr appointment so wanted to know if I would have time. I said never mind I won&amp;#39;t eat here and I won&amp;#39;t ever go back.", "rating": 1, "date": "12/1/2017"}, {"text": "Attended the mock service on Friday February 19, 2016.  the restaurant is beautiful inside and out.  The owner of all The Cheesecake Factories was in attendance and was mingling with everyone. The buffalo wings were delicious for an appetizer.  I ordered the new to the menu, shrimp sandwich. It was huge and very delicious. My wife had the Sheila&amp;#39;s salad and that was also huge and delicious!  We shared a vanilla bean cheesecake for dessert. Best cheesecake i have ever eaten.  I&amp;#39;m very happy The Cheesecake Factory finally came to Albuquerque, NM.  Totally recommend it!!", "rating": 5, "date": "2/22/2016"}, {"text": "If you come on weekend is a long wait of course but that&amp;#39;s not a big deal, the service was a slow. The food was very delicious and their drinks too. Better be! Is pricy! The have a huge list of cheesecakes and they are good big slices you they can be shared. I had the bacon burger the slice of bacon are big and yummy the meat in the burger is prefect! Overall enjoyed it will return.", "rating": 4, "date": "10/11/2016"}, {"text": "My favorite place for pasta and cheesecake! Delicious food, nice environment, and great service.", "rating": 5, "date": "2/17/2018"}, {"text": "Enormous wait for Im not sure what.  The service was subpar. However This is a chain restaurant and this location is up to par with the other Cheesecake Factory I have had around the country.   However the wait is simply not worth it.  Also it&amp;#39;s is expensive!!!!!!!   Albuquerque offers so many better choices than here.", "rating": 3, "date": "1/22/2018"}, {"text": "I am not to sure why cheesecake factory dosent have a higher rating.<br&gt;We was so excited that Albuquerque finally has a cheesecake factory, we used to live in Tucson and loved CF until it went down hill but I will save that for another review.<br&gt;We have been to CF 3 times now since it has opened and my oh my we haven&amp;#39;t been disappointed both my husband and I have tried something new from the menu each time and everything has been amazing from the pasta, to the steak to the salads and cheesecake oh the cheesecake the choices are far and plenty and the flavors are divine. <br&gt;Cheesecake factory is my go to dinner place when the hubby asks me where I want to go and I don&amp;#39;t foresee that changing. Keep up the good work CF I for one am glad ur here in Albuquerque.", "rating": 5, "date": "6/28/2016"}, {"text": "I have been to Cheesecake Factory&amp;#39;s across the country and this one is by far the worst. They STILL can&amp;#39;t get their recipes right! I have given them sufficient chances going there several times now for dinners and brunch today, which was the last straw. They couldn&amp;#39;t even do a simple Eggs Benedict right. The hollandaise sauce was putrid and inedible. Pancakes are served with their &amp;#34;own syrup&amp;#34; which is basically melted butter with a splash of maple flavoring- gross! So they gave us some cheap Smuckers Lite Syrup packets, like in an IHOP. Pathetic. Their service is like their food, inconsistent and sloppy. No one stands out as exceptional, they are all par for the course, borderline rude since its obvious they are just as frustrated with their kitchen. I always knew that New Mexico could never uphold this company&amp;#39;s culinary or customer service standard and I was right.", "rating": 1, "date": "3/12/2017"}, {"text": "First impression:<br&gt;I thought going on a Sunday night wouldn&amp;#39;t be so bad as far as wait times, and when we put our name down we we&amp;#39;re given a 15-20 minute time frame which was fine with us. We saw about 3 different couples who came in after us get seated before us. And a family of 4 who came in and within 5 minutes of waiting they were sat as well. We ended up waiting 35-45 minutes until we got seated. So that put a damper on the night so far. <br&gt;<br&gt;Server:<br&gt;Once we were seated our server greeted us quickly got our drink orders, and put in our child&amp;#39;s food. When we came back around the second time we asked him about the Crab and spinach dip he said it was amazing its not the fake crab/imitation so we said we would like to try that we also put in our main course during this time. We hadn&amp;#39;t seen our server since we ordered our food but child&amp;#39;s food came shortly after which was brought out by another server.Maybe after 20 minutes or so still no server our main course came out, we didn&amp;#39;t get our appetizer and my sides were wrong on my plate. Finally our server came to check on us to make sure everything was alright I let him know about the app and the sides. I&amp;#39;m assuming he never put in the app because when we asked him about it he tried to play if off like &amp;#34;oh well let me look into that for you.&amp;#34; We told him we didn&amp;#39;t want it now but it think if we were paid attention to more this obviously wouldn&amp;#39;t have happened. After this it seems like he was rushing us to get us out of there. <br&gt;<br&gt;Food:<br&gt;Fish &amp;amp; Chips: More batter than fish, was okay nothing special wont be ordering again. <br&gt;Fettuccine Alfredo w/chicken: Good full of flavor<br&gt;Kids Mac and Cheese: Very cheesy in flavor but good size portion.<br&gt;<br&gt;Overall:<br&gt;We will probably be back again but on a slower day than the weekends. I don&amp;#39;t see why people like this place so much.", "rating": 3, "date": "1/8/2018"}, {"text": "A friend and I waited approximately 20 mins. to be seated, after advising the hostess that the first available table would be fine.  We had to let the hostess know that a table was available 10 minutes after our arrival.<br&gt;<br&gt;Our server was absolutely horrible. His lack of attention to our table was unfortunately painful. We had to waive our server down to let him know we wanted more iced tea and soda. He brought fresh luke warm tea without ice. Again we waived him down to advise that the tea wasn&amp;#39;t &amp;#34;iced tea&amp;#34; as it was missing ice.<br&gt;<br&gt;We finished our meal and waited about 20 minutes before we, again, waived our server down to let him know we wanted our left overs placed in a to-go boxes. Keeping in mind that the restaurant was busy, our server walked passed our table six times prior to our getting his attention.<br&gt;<br&gt;We advised our server we wished to order a couple of slices of cheesecake, also to go. Another 15 minutes went by before we were served our desert on plates. We advised our server that it was supposed to be in to-go boxes.  Our server decided to throw a bit of attitude at us.  I took control of his attitude immediately and respectfully told him of our concerns regarding his serving skills.  Of course this just made him delay with providing our check.  I went to the bar and asked for the manager on duty.  After expressing my concerns to this gentleman, we received our check and were surprised that a discount for our inconvenience was not applied.<br&gt;<br&gt;The server was left with a $2.00 tip and a note suggesting he have a remedial course in proper serving procedures.<br&gt;<br&gt;My review is such: <br&gt;<br&gt;1.  Initial wait time:  Within reason for time of day. <br&gt;2.  Letting the hostess know if the available table unsatisfactory.<br&gt;3.  Food quality and quality:. Excellent<br&gt;4.  Server&amp;#39;s attention to customer&amp;#39;s needs: Completely Unsatisfactory.<br&gt;5.  Discount for inconvenience and Server&amp;#39;s unprofessional attitude:. Unsatisfactory<br&gt;<br&gt;As a General Manager for a Restaurant in Los Lunas, this experience was completely inexcusable and the server should be provided corrective action to correct is serving skills immediately and or be terminated.<br&gt;<br&gt;I do not recommend, at this time, eating here at peak hours.  Go on non-peak hours when service should be excellent.<br&gt;<br&gt;The food was fantastic. Props are due without hesitation. The plates provided plenty of food. It was almost too much.", "rating": 2, "date": "8/3/2016"}, {"text": "Always great service, friendly staff and good food. Usually quite busy so a bit of a wait but it&amp;#39;s expected. Best part is they are always willing to accept special requests on orders. Of course banana cream cheesecake is always a WIN!", "rating": 5, "date": "2/3/2019"}, {"text": "Me and my husband went into the Cheesecake Factory yesterday afternoon around 2:30pm. We were asked to sit on the patio. It was a nice warm day and they had the outside heaters on regardless so we were hot sitting out there. We ordered an appetizer and entrees. We waited 20-25 mins and got our entrees.. Then 5-10 mins later the appetizer came. Our waitress acted like this was no big deal and just offered to box up our uneaten appetizer since we were no longer hungry for it. I paid for the entire meal but I won&amp;#39;t go back! It&amp;#39;s not ok to bring the appetizer after I&amp;#39;ve eaten half my entree!", "rating": 1, "date": "4/9/2016"}, {"text": "The wait was over an hour but if your patient it&amp;#39;s worth the wait ! . most of the bad reviews are from impatient people. The service is good and the food is spectacular!", "rating": 5, "date": "4/17/2016"}, {"text": "I will admit I was skeptical when we decided to come dine but we had a gift card so here we are. Upon entering the restaurant is beautiful and the line for cheesecake is long. To our surprise the bar has a Happy Hour from 4-6 so we decided to have a seat. Service was outstanding and the happy hour menu was generous with diverse choices for anyone&amp;#39;s palate.  The avocado egg rolls were amazing! We finished with the Kahlua cheesecake which was the perfect ending to a delightful experience at a corporate establishment.", "rating": 5, "date": "3/1/2016"}, {"text": "It&amp;#39;s the time of year for Team Celebrations! My manager told us we were going to lunch and then said The Cheesecake Factory and my face fell...I had been here twice before and was not impressed either time so wasn&amp;#39;t really looking forward to our lunch. This time however I was pleasantly surprised by both the service and food!! Our waitress took care of all 12 of us by herself and our glasses were never empty, she smiled the whole time, and didn&amp;#39;t roll her eyes when some of us struggled to figure out what to have from the very large menu. Last time I was there with a party of about 8 and the service was super slow and our waiter seriously huffed when we were a little slow in ordering. I got the Chicken Reisling this time around and it&amp;#39;s was melt in my mouth deliciousness!! Because of our wonderful waitress (wish I had gotten her name) and the yummyness I will give them another chance without being dragged there! Hopefully they can keep this up...", "rating": 4, "date": "12/6/2017"}, {"text": "A good chain restaurant in a good location. My first visit to ABQ&amp;#39;s CF was a hit. Great service, great food quality. You really can&amp;#39;t go wrong with anything on the extensive menu.", "rating": 4, "date": "11/28/2017"}, {"text": "We liked our experience here. Very comparable to a place like elephant bar or an expensive chilis. The menu has like 15 pages so be prepared for lots of choices. Our waiter was great (which is important to us) and the ambiance of the restaurant is very cool. It is a little pricey though and there might be better value found other places. We will be back for dessert for sure though.", "rating": 4, "date": "10/1/2016"}, {"text": "Beautiful restaurant, with the same massive menu that they&amp;#39;re known for. If possible, ask for Jessica, she&amp;#39;s hilarious and such a great server even at the end of a hectic opening day. Also, ask about the Georgia Peach. It&amp;#39;s great.", "rating": 5, "date": "2/23/2016"}, {"text": "Beautiful restaurant great service but the food just was not there to match. We had a mac &amp;amp; cheese burger and it was tasty but just not there. I would give the cheese cake five stars if I could. I would give five stars to all the staff if I could. But the food was not all that hype. But it&amp;#39;s a beautiful place and a wonderful experience", "rating": 3, "date": "4/19/2016"}, {"text": "Drinks are tiny and over priced at best. Margarita&amp;#39;s come half glass full, with mostly ice. The service is good to poor at best. Plenty of better options in Albuquerque that provide better value.", "rating": 1, "date": "6/18/2016"}, {"text": "The food was good and was served warm.  The cheesecake was delicious as one would expect.<br&gt;<br&gt;The service was painfully slow.  I got there after my husband.  He had requested a high chair for our baby but they never brought one so I grabbed one that wasn&amp;#39;t being used.  It was broken and unsafe to use.  The back of the high chair was loose and spinning.  I asked for a different one and this one also was loose and a bit wobbly.  For a restaurant at this price point and being fairly new, I really expected better equipment.<br&gt;<br&gt;The server took a long time to take our order.  It was getting to the point that I was about to walk over to the servers station and ask someone to come take our order.  Then she showed up.  After that our food came promptly and our drinks were refilled but it shouldn&amp;#39;t have taken as long as it did to get the process started.<br&gt;<br&gt;I have been to other locations and this one was the loudest by far.  I may go back but it will be a while before I do.", "rating": 3, "date": "9/2/2016"}, {"text": "Been to cheesecake factory in cali and in phoenix so the expectation is always high and this cheesecake factory didnt disappoint....great atmosphere...got to sit outside under some heat lamps and fires burning...great great ambience.<br&gt;<br&gt;As for the food,cheesecake factor never disappoints.....had steak diane and shrimp scampi...wow!.....yummy!....waitor was super!...even considering its brand new and suoer busy...if youve been to cheesecake factory before this one is just more of the same...great food and great service....location is excellent in uptown center which makes the whole experince great...highly recommend", "rating": 4, "date": "3/10/2016"}, {"text": "I have already become a regular here, because their food is amazing! My 1st dish was Steak Diane. The beef medallions were super tender and flavored with just the right amount of wine. The shiitake mushrooms were a flavorful addition. They paired it with homemade red skin mashed potatoes. My 2nd dish was the Hangar Steak, delicious! It is served with sautéed asparagus and wasabi mashed potatoes. Save room for dessert, because you will have the best cheesecake in the world, hence the name of the restaurant. Stick with the basic cheesecake with the fresh strawberries, pure perfection! The wait time is improving, since when they 1st opened. I&amp;#39;m looking forward to many more tasty meals!", "rating": 5, "date": "6/27/2016"}, {"text": "What a blast! I met my group of girls for my birthday lunch and Katie took great care of us. The avocado rolls were really good. I got the Evelyn&amp;#39;s pasta dish which was yummy. They brought me my choice of cheesecake and sang happy birthday. Very sweet. The red velvet cheesecake is amazing. Go early! We met at 11:30am and there was no wait but it was packed as we were leaving. Long lines to get in.", "rating": 5, "date": "7/24/2016"}, {"text": "Opted to sit out on the heated, &amp;#34;enclosed&amp;#34; patio since it would be a 20-30 min wait for a table of 4. No big deal we thought, until we were sat at the very end which was not enclosed and very cold. Server came and got us our drink orders and brought bread. I asked for small bread plates for my kids so they weren&amp;#39;t setting it down on the table. Never got those. Drinks were empty for most of the dinner. I never got my food. My two kids and husbands food came, served said it would just be a minute for mine. However, both kids and my husband finished their food before the server ever came back. She said she spoke with the manager and they were going to take it off my bill, but would I like to get it now or take it home. I opted to take it home since everyone else had already finished and we weren&amp;#39;t about to wait for dessert now. Got it home and there was absolutely no flavor to the Lemon Garlic shrimp I ordered. Threw over half of it away. Thankfully we used a gift card, but not sure we&amp;#39;ll even be back to use the rest. The manager never came over and no apology from anyone.", "rating": 1, "date": "1/27/2019"}, {"text": "Really good food they have a lot to choose from on the menu staff ideally nice and friendly and sweet!!", "rating": 5, "date": "9/22/2017"}, {"text": "I just had the worst experience here. The customer service was horrible.  My food took 35-40min. And when it finally came they forgot to tell me half my order was out. And be another 20min. And all MANAGER says is that they are not gonna charge me for something I didn&amp;#39;t eat.", "rating": 1, "date": "2/25/2019"}, {"text": "Skip the meals. Go for the desserts.<br&gt;I went with my family on New Years Day and nobody was overwhelmed by the entrees.<br&gt;Very bland and slow to arrive. The quality was no better than any other chain diner.<br&gt;The desserts, on the other hand, were outstanding.<br&gt;Next time, we will go for coffee and the rich dessert items.", "rating": 3, "date": "1/7/2017"}, {"text": "Recommended, food was excellent &amp;amp; the staff was great. Nice portions enough to share one entree.", "rating": 4, "date": "3/20/2018"}, {"text": "Albuquerque is so fortunate to finally get a Cheesecake Factory! Absolutely my favorite restaurant. I hear complaints about the wait but that is to be expected. Once things settle and the staff gets accustomed it will be better. I have never had a bad meal here. And trust me, that is a lot of meals at Cheesecake Factories across the country.", "rating": 4, "date": "3/7/2016"}, {"text": "We enjoyed the dessert but our entree was another story. We ordered the bang bang chicken and shrimp and the teriyaki chicken. The bang bang tasted very strongly of the sweet orange juice concentrate and the teriyaki had several bones and there were fried bananas which still had a produce sticker on it.  We will not be going back there.", "rating": 1, "date": "6/28/2017"}, {"text": "Had a very good experience here for dinner on Black Friday. We had a party of 5 and came in right at 5 pm. Waited less than 2 min for a table and our waitress promptly took our drink order. We&amp;#39;ve been here a few times before and has less than stellar service so I was apprehensive about returning but everyone was craving something different and CKF has a huge menu.  I am glad we came here, the service was great, our food was very good and the ambiance also nice.  We had a great time and will return soon!", "rating": 4, "date": "11/25/2017"}, {"text": "This is the worst cheecake factory I have been to, I have been to many up and down the coast of California and in Arizona. The staff at this location lack training in prompt customer service and screening plates before expo. The food takes twice as long to receive as any other location. Even simple appetizers you&amp;#39;re looking at a minimum of 30 minutes. This is without it being busy. The bread is rarely fresh and the food is always barely passing off as ok. Don&amp;#39;t get your hopes up for the cheesecake factory you know to be, it will disappoint to say the least.", "rating": 2, "date": "6/11/2017"}, {"text": "Beautiful space, good servers, yummy cheesecake, mediocre food. All in all not worth the price. Cheddars is a better choice for my dollars!", "rating": 2, "date": "4/24/2016"}, {"text": "Came here for dinner with a friend. Pretty busy, but said it would be about 20-40min. which was fine because we were able to run into the mall and shop for things and look around. After 30min. we returned and got seated 5min. later. We sat outside in the patio area and it was quite chilly out, but with the heat lamps, it was quite comfortable. I even took my jacket off. Service was good and the food was descent. I ordered the Shrimp Scampi which was not bad. Good portions. I had to take the rest of my food home. I was actually really excited that they had their pumpkin cheesecake, my favorite. I like the more NY style Cheesecake, which is more dense. The CF cheesecake is more light, but they only carry the pumpkin in the fall, so I couldn&amp;#39;t miss out. Good ambiance and sitting outside wasn&amp;#39;t too loud, so it was a pretty enjoyable evening.", "rating": 4, "date": "10/22/2017"}, {"text": "Chinese chicken salad:  It only had about two tablespoons of chicken (which was very bland). The other toppings were very skimpy. The dressing was terrible. The greens were bland. Pretty much a failure all around, and expensive. Even Wendy&amp;#39;s does a better salad for half the cost. They also forgot to send one of the orders so one person did not get their entree, just some bread.", "rating": 1, "date": "2/2/2019"}, {"text": "Amazing! Food was very tasty and came out fast. Not bad considering I waited 90 minutes which is fine and I didn&amp;#39;t  mind specially for day 2 of being open. Waitress was very good and nice and management was great. Very clean! Will be returning soon.", "rating": 5, "date": "2/24/2016"}, {"text": "Have not been to a Cheesecake Factory in years and I was pleasantly surprised! We ordered crab bites to share. For main dishes, my boyfriend ordered the orange chicken and I ordered the shrimp scampi/steak combo. His orange chicken was really good! it tasted like they used fresh orange zest and I didn&amp;#39;t feel like the breading was too thick. Rice was a little dry, but I imagine this is reheated or made in large batches. My food was also good. The scampi was not sopping in butter like at most chain restaurants and the steak was well cooked. No cheesecake this time, but we plan to go back!<br&gt;<br&gt;This last part is more of a personal complaint, but just FYI, the music on the patio was terrible! Very sappy/cheesy pop songs, similar to a soundtrack you&amp;#39;d hear in places like K-mart.", "rating": 4, "date": "7/4/2016"}, {"text": "They do not have drink prices on the menu- someone in my group ordered a skinny cosmo- it was 11.25!!!! <br&gt;That is a ridiculous price for a drink in Albuquerque- the manager came over and blamed corporate - did nothing else!! Terrible customer service!", "rating": 1, "date": "6/27/2017"}, {"text": "First time at the Cheesecake Factory -- had Lauren R. as our waitress and she was AWESOME. Drink orders were taken and brought back extremely quick and she was very knowledgeable when it came to the menu. The avocado egg rolls were to die for and the four cheese pasta was so flavorful! Between the bread, appetizers, and our meals, we were so full but decided to order dessert anyway due to the very informative cheesecake presentation! Overall great experience. We will definitely be back here!", "rating": 5, "date": "9/30/2018"}, {"text": "Food is great. Service on the hand was not so good. We went party of five, our waiter forgot one plate, we had a birthday and failed to tell us the cheesecake menu he provided to the birthday person was not complimentary. Our waiter hardly checked on us. We didn&amp;#39;t get a discount for the missing plate we received late. Our poor guest sat there hungry until she receieved her food. I&amp;#39;m a great tipper for great service, and the service was not great.", "rating": 2, "date": "12/18/2018"}, {"text": "Yummy yummy. Amazing customer service. I had to speak to the manager just to tell him how satisfied I was. Oh and don&amp;#39;t forget to try the salted caramel cheesecake.", "rating": 5, "date": "6/9/2017"}, {"text": "This by far is one of the best Cheese Cake Factory&amp;#39;s I have eaten at. I must admit I originally thought the food would be mediocre being so far from the other locations. Man was I wrong. Keep up the good work guys! I will be back.", "rating": 4, "date": "8/9/2017"}, {"text": "I really like the Cheesecake Factory - the menu, the drinks, and the atmosphere.  We eat there about 3-4 times a year.  Our server on this last visit was not friendly or helpful at all.  She NEVER smiled or made us feel welcome. It was early evening midweek, so they were not super busy.  Jennifer failed to tell us about the specials and so we ordered our meal.  We heard about them from the server at the table next to us.  When Jennifer returned to ask about our drinks, I asked why she didn&amp;#39;t tell me about the special, because it was a pan-seared salmon dish and I had ordered herb<br&gt;-crusted salmon!  She tried to tell me it was the same thing, and then she tried to say what I ordered was better.  After a short back and forth, and never an apology, she finally offered me the special.  Everything turned out fine and our meals were great, but a server who is disinterested in her guests makes the whole dining out experience very unpleasant.", "rating": 3, "date": "8/21/2017"}, {"text": "Gluten-Free - YES!!<br&gt;<br&gt;My best friend and I went to go visit the cheesecake factory in Albuquerque. They&amp;#39;re gluten-free free menu is amazing and their food was generous in portion and absolutely delicious!!  Five-Stars!!!", "rating": 5, "date": "4/24/2016"}, {"text": "This time was not quite as good. I had the Mexican Tortilla Salad with chicken. It was very tasty, but I could count on the fingers of one hand the bites of chicken that were in it. Also, they had some kind of screw up with our order and it was a fairly long wait to get the food. They came over and apologized, and even comp&amp;#39;d a piece of cheesecake for my companion to make amends. None of this would prevent me from returning, but it was a notch below my last visit.", "rating": 3, "date": "2/20/2017"}, {"text": "Place use to be a favorite, but service sucks now. Should be better for price you pay.", "rating": 2, "date": "10/26/2018"}, {"text": "Went in on a Monday night, was quite empty. Walked in was seated right away, ordered something to drink then ordered dinner. Waiter was friendly and helpful, I believe his name was Nicholas. Got the check and left! The food was great was a bit greasy maybe because it was pasta. Overall was a good experience!", "rating": 4, "date": "10/20/2017"}, {"text": "Honestly, I didn&amp;#39;t come here expecting to be wowed. The last time I ate at a Cheesecake Factory, I felt it was overrated. But (!) this experience was great. Service was exceptional. I had the chicken piccata and it was delicious. Later, I had the key lime cheesecake, which was sinfully excellent. Yes, a bit pricey, but I expected that.", "rating": 5, "date": "7/2/2016"}, {"text": "Am I the only one to notice that my review about the racial slur that I was called by one of their employees (off duty)is the only review to go unanswered by management.  After 4 phone calls to Customer Service - none of which they followed up and responded to - they sent me $75 in gift certificates which I will mail back to them.  How about some training in manners and diversity for your staff and management?  Would go a long way............", "rating": 1, "date": "8/16/2018"}, {"text": "This is the worst service possible first time eating here and the meatballs and pasta came out cold and then the pasta was  or has been on the counter to long and was never hot run like you find a restaurant that will want your business and will provide you the customer service you deserve, don&amp;#39;t come here it&amp;#39;s your regret as I had. Received. Will never come back they should close this place and lock the doors. Again don&amp;#39;t come here!!!!the company sent me a message and stated they will talk to the staff I guess they feel there is no problems there as I stated before do waste your time going there to eat  can you imagine paying or being changed 16.99  for the worthless cold meatballs and pasta and all they will do is talk to the staff what a waste of time the cheese cake factory has made fire the true cause the head. Cook and the waitress and the manager . Any questions I didn&amp;#39;t think so I will not ever bring family members to this in professional restaurant  or friends you can dress the building but the food and service is the worst stay away don&amp;#39;t go there I will let any one know of this poor service and the cold food !", "rating": 1, "date": "3/31/2018"}, {"text": "I generally love the Cheesecake Factory and have eaten in almost every one of them across the country; but today our office placed a take out order for lunch and besides the cheesecake someone ordered, almost  everything else was maybe a C-. My toasted sandwich was cold and the bread was soggy. An absorbent mat under it could have kept the moisture from sitting on the bottom of the plastic container. Pizza was cold. Fries were wimpy. Come on, TCF you should know better. Find some &amp;#34;to go&amp;#34; containers that work.", "rating": 1, "date": "10/2/2018"}, {"text": "Let me preface this by saying I had worked for this organization for almost two years and took great pride in the food and customer service. I still work in the customer service industry in another capacity and understand that there are times when things are out of your control. And then there are other times when the experience is made poor because of a lazy or poor server. Unfortunately tonight a one star rating is being quite generous.<br&gt;<br&gt;We had a group of 13 guys out for dinner and drinks to celebrate a day off work. The service was poor at best, our server made no mention of any specials, prefaced by saying bread would take awhile to come out and assumed we all wanted water to drink when he first greeted the table. He simply could have asked our drink order and appetizer order and got the night started. Unprofessional table greet and start. Furthermore when we said we wanted to order some appetizers, he only took our liquor orders and then left. By the time he realized he hadn&amp;#39;t taken the appetizer order (15min or so) we had decided to just place a food order. Instead of taking our food order when we said we weren&amp;#39;t going to order our appetizers and just food, he walked away AGAIN to get our drinks instead of getting our food order. Furthermore upon delivering our drinks he made the comment to one of the guys &amp;#34;that our drinks are strong so pace yourself, I don&amp;#39;t want to have to cut you off&amp;#34;....not sure the reason for this unprofessional comment.<br&gt;<br&gt;After receiving our drinks we assumed the bread that was &amp;#34;still cooking in the oven&amp;#34; (as told to us by our server) would be coming shortly. Another 10 minutes passed. When the bread arrived it wasn&amp;#39;t even hot. So either he was lying to us about the bread cooking or he was lazy. Furthermore he brought us enough bread for a group of 6 people...maybe. He asked for more bread and he only brought it to one end of the table. <br&gt;<br&gt;With our food order in, we decided to have another round of drinks. Our server at this point made the comment that he couldn&amp;#39;t allow us more than one drink per hour because he wouldn&amp;#39;t want to cut us off. We had been here at the restaurant for over an hour and was on our 2nd round. Quite unprofessional and honestly uncalled for. We weren&amp;#39;t even close to intoxicated and if anything super frustrated at the poor service we were receiving and yet STILL ordering $10-14 cocktails for our group.<br&gt;<br&gt;Finally after being told on 2 different occasions that our food would be right out, it arrived about 40min after our order. I can understood a groups long ticket time but instead of an apology for the wait or anything...maybe even a manager stopping by...we got nothing. On top of all of that, the guy who was paying for the entire meal did not get his food until everyone was FINISHED eating their meal. He ordered a burger :/ seriously <br&gt;<br&gt;Our server said he&amp;#39;d try to make it up to us with a slice of cheesecake or something. And yet he didn&amp;#39;t have a manager stop by to say sorry or do anything to make up for it. We had 13 people order dinner and 3 rounds of drinks. You do the math on the tab. Furthermore he didn&amp;#39;t even do a dessert presentation or insist on the cheesecake slice because of his blunder with the burger.<br&gt;<br&gt;Finally after getting the check and getting ready to leave, the gentleman who was paying the tab for our company outing spoke to the manager on our way out the door. Her only response was &amp;#34;I&amp;#39;m sorry.&amp;#34; <br&gt;<br&gt;She offered to do NOTHING to accommodate the poor service and lackluster experience on a MONDAY night. <br&gt;<br&gt;To say the ball was dropped on this experience would be a generously kind way of venting frustration. After having worked for the company in one of the top performing locations in the country for almost two years, I&amp;#39;m somewhat disgusted by the lack of care for the patrons and guest experience. Obviously &amp;#34;ultimate guest satisfaction&amp;#34; was not a core value of the management or staff we encountered. <br&gt;<br&gt;It&amp;#39;s unfortunate from a personal level because of how much time and energy I had given to this organization and yet to have my fellow co workers have this experience.<br&gt;<br&gt;Management please fix this.", "rating": 1, "date": "9/26/2016"}, {"text": "One star because the cheesecake is great! From the greeting at the hostess stand,  the horribly long wait (while table after table needed to be bussed)  to receiving our appetizer with the meal,  the meal had hair particles in the soup and under the plate. Ps don&amp;#39;t order the French dip sandwich-  couldn&amp;#39;t tell what was grizzle and what was cheese!<br&gt;No thanks.....we wont be going back to this place again.", "rating": 1, "date": "7/29/2017"}, {"text": "A little bit of a wait for a large party and no reservations, but: Food . . . Good; cheesecake . . . Good; drinks . . . Good.  I got the filet mignon and it was cooked to perfection.", "rating": 4, "date": "5/14/2016"}, {"text": "I gave it two stars because the good was decent but the service I had was really disappointing. After being greeted and brought drinks and bread, we waited a while for our server to return to ask for plates and silverware. By the time we got them, the bread was cold. They brought us a bloody mary instead of a blood orange margarita. Our order of calamari came with chicken tenders and only half an order of calamari. When I told the server, he took the chicken tenders away to show the kitchen and came back and said &amp;#34;well, you got extra.&amp;#34; No, I didn&amp;#39;t. Nothing replaced the chicken tenders. When I asked for bread after our food came, the server never brought it to us. I finally told him that we didn&amp;#39;t need the bread anymore when he gave us the check and he had the audacity to say I never asked for it. I&amp;#39;ve had better service here but they&amp;#39;ve really slipped. No manager ever came to see us. I don&amp;#39;t know if I&amp;#39;ll be back.", "rating": 2, "date": "7/21/2018"}, {"text": "Perfect place, time, and service for lunch. Our server was very attentive and made sure everything was great every few minutes. From the cucumber lemonade and cucumber mojito, the stuffed mushrooms, and the entrees with salad and pizza and lemon garlic shrimp everything tasted soooo good. Everything was paced perfectly and service was phenomenal. We sat on the patio and even though it was a little chilly they made sure the heaters were on to make it comfortable for us. Definitely returning soon.", "rating": 5, "date": "5/18/2017"}, {"text": "This place is amazing! It had amazing food and the costumer service was awesome! It was lovely! The cheesecake was the highlight of my time there. It was great, and I recommend going there. The only thing was that it was a long wait, but it was totally worth it! My favorite meal is the Thai Lettuce Wraps.", "rating": 5, "date": "9/9/2018"}, {"text": "The food was very good! Well served portions, had great flavor. The wait time was very minimal. The cheesecake was delicious! The service could use some improvement but overall very good!", "rating": 4, "date": "9/3/2018"}, {"text": "There was a bit of a wait but that&amp;#39;s expected of a new restaurant.   The food was great, generous portions.  I recommend the eggplant parm.  Plus the cheesecake was to die for.", "rating": 5, "date": "3/30/2016"}, {"text": "I feel this place is over priced and the food is just okay. Desert is good but not great. Also be prepared to be here a while at least an hour or two.", "rating": 3, "date": "4/28/2017"}, {"text": "The Cheesecake Factory is a hopping place. Sometimes too busy.  But I&amp;#39;ve had three great meals and great service there in a row.  Thumbs up.", "rating": 5, "date": "6/17/2017"}, {"text": "Awful service! Appetizers took forever to come out! Alcohol drinks were served before any fountain drinks. First time going and I will not return.", "rating": 1, "date": "8/14/2017"}, {"text": "I went here for the first time for my birthday, and it was a great experience! The food was awesome even though I thought the menu was a bit much to look at. I managed to catch them for brunch, so I ordered a breakfast version of a jambalaya. It was the best jambalaya I&amp;#39;ve had. The interior of the place is very beautiful, and they have a lot space! The smaller tables are nice a private, so it&amp;#39;s perfect to have a date! The waitress we had was very friendly, and she was pretty! To top it all off, the dessert was amazing! It wouldn&amp;#39;t be called the Cheesecake Factory if it didn&amp;#39;t have awesome cheesecakes. They definitely had lengthy list of different cakes. The one I chose was the carrot cake cheesecake, and it was stellar! It definitely was the best cheesecake as well as the best carrot cake I&amp;#39;ve ever had!", "rating": 4, "date": "8/9/2018"}, {"text": "Man there fish and chip are pretty good but not the best but I&amp;#39;m glad there&amp;#39;s one in Albuquerque there cheese cake is good to", "rating": 5, "date": "7/31/2017"}, {"text": "The most racist and disorganized establishment ever. Waited in line and was so excited on Saturday, May 21 2016 @11:30 am.  We were the first one to sit in the patio, but waitress continued to ignore us for 15 mins and took orders from every other table that came after us and I still stayed patient until it was obvious. The only difference that they happened to be Caucasian. When you charge  outrageous prices for basic food, invest a little class in treating your customers with some respect. Nobody should be purposely made to feel so disrespected. I eat out a lot and this is one restaurant that will never be a place I come back to. Take your greedy racist attitude and get out of my town where we live in harmony and treat everybody with respect regardless of their race. It&amp;#39;s a community built with loving minorities and Cheesecake factory does not fit in here.", "rating": 1, "date": "5/21/2016"}, {"text": "11.25 for one cocktail drink !!! No price for it on the menu either just let you order it totally oblivious to the price gouging. Very disappointed never going back", "rating": 1, "date": "7/15/2017"}, {"text": "We came in today with a party of six and only had to wait 5 minutes for a table. Service was extremely fast and our waiter S.Jerica was amazing. The kids got their food out quickly and we never had to wait for a refill on our drinks. The food was delicious and we had pretty big portions for the price. We will definitely be coming back!", "rating": 5, "date": "7/8/2018"}, {"text": "The service was horrendous. Do not let Alejandra serve you! They forgot our appetizer and when we ordered something they were out of they could not honor our substitution request. They did not reduce the bill or work with us in any way. This was my first and last time at the Cheesecake Factory! Way to bring down our 4th of July dinner!", "rating": 1, "date": "7/4/2018"}, {"text": "We had a large group. They ran out of turkey so two people had to reorder and one of their plates came out long after everyone else&amp;#39;s. None of the food was good. The sandwich I ordered was dry even after I asked for additional sauce. We had a very nice waitress.", "rating": 1, "date": "7/2/2018"}, {"text": "I&amp;#39;ll start off by saying if you don&amp;#39;t have any patience for waiting I highly suggest you save cheesecake factory for another time.  After some shopping me and my girlfriend decide to eat at cheesecake factory because cheesecake!  We knew we would be waiting awhile which wasn&amp;#39;t a big deal.  We got our buzzer and sat outside and chatted.  Our wait time was 25-40 minutes.  Not a big deal we came knowing this.  As time went on it seemed though like we would never be called.  At one point we contemplated going elsewhere but decided since we&amp;#39;ve stuck it out almost 40 minutes it would seem like a waste of time to leave.  At exactly 40 minutes our buzzer went off.  Thank goodness because my tummy was screaming at me!<br&gt;We were sat at a table in the bar area which was nice because it was Saturday night and I got to watch college football.<br&gt;We ordered some appetizers and my girlfriend had a beer while I had just water.  When out waitress came and took our dinner order I orders  I ordered pasta with mushrooms and veggies and my girlfriend ordered a veggie burger.  At this point our waitress asked how she wanted it cooked and we both looked at each other like ummm all the way thank you and my girlfriend said isn&amp;#39;t it fully cooked? The waitress said well I think there is still meat in it at which point we both stared at her like excuse me?! We both told her its a veggie burger there shouldn&amp;#39;t be any meat in it at all.  Our waitress then picked up the menu just to make sure.  She said og your right, I&amp;#39;ll put your order in and have your food out.  After she left we had to sit and think about what she just said.  I&amp;#39;m just saying its a veggie burger not a veggie and meat burger.  She was a nice girl bit the fact that you don&amp;#39;t know that simple is kind of a let down.  Although she was very attentive to us that was her only flaw.  We both and cheesecake and I also had a hot chocolate.  As always the cheesecake was amazing, I had the chocolate chip cookie dough cheesecake which was amazing!!! The hot chocolate was also chocolatly and delish!  Our expierence was good and we will be back again!", "rating": 4, "date": "9/27/2016"}, {"text": "Recently I decided to go gluten-free for health reasons, and that has been a lifechanging experience for me (at least when it comes to eating out ;) ). One of my friends went to eat at the Cheesecake Factory and said &amp;#34;Hey LJ! Guess what? They have a ton of gluten free food!&amp;#34; which of course made me say &amp;#34;Let&amp;#39;s go. NOW.&amp;#34; I got a gluten-free pasta dish and it was sinfully delicious. I was a little sad that there weren&amp;#39;t many gluten-free appetizer options, but the guacamole was delicious. And then...there was a Godiva gluten-free cheesecake. I&amp;#39;m not a big fan of chocolate, but I was desperate for a guilty, sinful, glutenless dessert and my desperation led me to a DELICIOUS slice. Our server was great, the food was good, the ambiance was nice, and I got to stuff my little gluten-free face. Overall, a great experience.", "rating": 4, "date": "4/5/2016"}, {"text": "If you dig a 3 hour wait, only being seated if your full party is present after said 3 hour wait and, finally, crappy food all around, then this place is for you.  A true slice of all that is wrong with chain restaurants. My niece wanted to go for her birthday, otherwise would have never considered it. Proved right. Can I give zero stars?", "rating": 1, "date": "3/20/2016"}, {"text": "We waited for 2 hours and didn&amp;#39;t even get in the building. The hostess kelps telling us the wait would be  2 hours. After talking with some people that were seated they said they had been waiting 1 1/2 hours on the food. What a disappointment .", "rating": 1, "date": "2/27/2016"}, {"text": "Stop overrating ABQ.  Yes, it&amp;#39;s exciting to get a new name in the Q, but the food is simply average.  Service at this point is nice because country wide trainers are here for the hiring expo.  Hopefully the locals will remember the training.", "rating": 2, "date": "2/23/2016"}, {"text": "This was our first time to this location. I&amp;#39;ve been to one in Vegas before. The wait wasn&amp;#39;t too bad, but for it being early afternoon (2:15) it was already starting to get packed. Parking isn&amp;#39;t too bad as you can always park further out or walk through the mall to get there as well. Our waitress, Melissa, was excellent. She was able to suggest different drinks and food options to us. Food portions are huge even if you order off the lunch specials. If you palm on coming make sure you have an appetite or you&amp;#39;ll be taking some home. We had two small snacks, the fried zucchini and cubano rolls. Both excellent options. For our meals we had the lunch meatloaf, the pasta carbonara with chicken and the bacon bacon cheeseburger. You will not be disappointed with any of them. And for the meatloaf and pasta being the smaller portions we were still taking half of it home with us. And don&amp;#39;t even get started on the cheesecake options. Too many to choose from that you will be tempted to take some to go to try later. Overall it was and excellent place to get food and drinks. Only drawback is the price for cocktails drinks. To me $10.50 is way too much though it was very good.", "rating": 4, "date": "1/22/2017"}, {"text": "I have always heard great things about the Cheesecake Factory but never had the privilege to try it. So when I heard that one was opening up in Albuquerque I got a little excited  so going in I had high expectations and I must say I&amp;#39;m not disappointed.", "rating": 5, "date": "7/17/2016"}, {"text": "So, I ate here twice so far; both times very disappointing. A simple hamburger, which was requested to be cooked &amp;#34;medium&amp;#34;, was clearly instead overcooked to &amp;#34;well done&amp;#34;. My friend ordered the vegetable salad, which was fine, but way over-dressed. She couldn&amp;#39;t finish it for this reason, but chose not to say anything to staff. For the second trip, I tried the &amp;#34;Firecracker Salmon&amp;#34; appetizer, which was tasteless and not worth half the cost. <br&gt;I was thinking of trying this place out for its Happy Hour. Now, I think instead I&amp;#39;ll just go someplace else. Not worth the wait, at least not based on these two experiences.", "rating": 2, "date": "3/16/2016"}, {"text": "I don&amp;#39;t mind waiting considering it just opened. I expect it. What I do mind is being told 1:15 minutes...2:10 minutes ago. When I went to see how far down we were on the list, I was told :25 minutes. This was an hour ago. I just asked where we were and was told another 45 minutes. They offer bread and bananas to toddlers--I could have asked for that an hour ago if someone would have just been honest. I&amp;#39;m more concerned about feeding my 3 year old. Or...maybe I could have gone somewhere else to eat.  Whatever your wait time, add an hour. Unfortunately, I can&amp;#39;t comment on the food or the service. My toddler tore up the bananas, though", "rating": 1, "date": "2/26/2016"}, {"text": "I love this place. I&amp;#39;m so glad they built one here in ABQ. Our wait was only 15 minutes. It was so awesome. We went at about 3pm so perfect for after the lunch rush but before the dinner rush. Our server Karen was so amazing and super sweet. Our food came out hot and delicious and in a reasonable ticket time too. We also got cheesecake of course. I got the tiramisu cheesecake and my husband got the carrot cake. We both highly recommend them.", "rating": 5, "date": "3/1/2016"}, {"text": "Reserve a table online. <br&gt;<br&gt;Our server, Dillon C, seemed very upset from the beginning. When he greeted our table, he didn&amp;#39;t make eye contact, he shifted his weight several times, kept checking his watch, and was constantly combing his bangs to the side. Seemed rushed to clear the table as soon as possible. Forgot that it was a birthday dinner and didn&amp;#39;t remember the birthday girl&amp;#39;s name after asking. <br&gt;<br&gt;There are so many selections that it&amp;#39;s really difficult to decide on just one entree or sides. The selections are fantastic! The food is great. The desserts are excellent!<br&gt;<br&gt;Service was a total joke.<br&gt;<br&gt;When we were gathering the funds to pay the bill, money on the table was being accounted for each person. We had boxes and bags on the tabletop, when the server asked, &amp;#34;I can take this right?&amp;#34; and before we could respond he walked off with the money. The server took the money that was apart of the bill fund. We looked at each other in disbelief. Nice right.", "rating": 3, "date": "3/23/2017"}, {"text": "NO!!! Don&amp;#39;t waste your time and money here, and you will spend a lot of money here, this place is super expensive for the type of food you are served. Everything comes from a box!! Please, instead go and support your local restaurants. There are so many great places in Albuquerque and this place unfortunately is not one of them! Yes, the place is huge and it looks great but the food is not tasty, maybe if you want dessert you can come here from time to time but my suggestion will be no and go find another local restaurant! Thanks!", "rating": 1, "date": "4/22/2016"}, {"text": "Really not sure what all the fuss is about, it&amp;#39;s honestly just another chain restaurant.  I have been  here twice and not really wild about the food.  My suggestion, go there for dessert and skip the food.  Oh and be prepared to wait, it doesn&amp;#39;t matter if it&amp;#39;s a week day or weekend you might have to wait up to 70 minutes.", "rating": 2, "date": "1/22/2017"}, {"text": "I have been here twice now and both times have been sat away from other people. Both times I had my service dog with me. He has a vest with proper identification. Thanks for making your disgust towards my service dog even more obvious. It&amp;#39;s hard enough having a disability, but then to get isolated because of it just turns the knife. At least your food was very good. Please improve your training with ADA", "rating": 3, "date": "7/30/2016"}, {"text": "The Cheesecake Factory has been one of my favorite restaurants but I would recommend not going to this location until they get their stuff together. Our waitress was horrible! My husband ordered the Garlic noodles with Shrimp and was sick all night puking! So disappointing", "rating": 2, "date": "3/7/2016"}, {"text": "I was fortunate to be able to go and eat before they open to the public, and I cannot believe how great it was.  The limited menu they offered was still bigger than a lot of restaurants total menu.  The portions are humongous!!!  From the appetizer to desert, my wife and I were unable to finish.  One could think that the quality would suffer with giant proportions, but it was all top quality, best food I have had in a long while.  The staff was great to a fault, even though it was chaotic due to training. When they open, GO, you will not be sorry!!!!", "rating": 5, "date": "2/19/2016"}, {"text": "Went there for lunch to celebrate my grown daughter&amp;#39;s birthday. The food was good but our waiter was slow and inattentive. There were long periods of time where we had no idea where he was. He only checked with us once during the meal to give us more water when our good arrived.", "rating": 3, "date": "4/11/2017"}, {"text": "I really wanted to like this place but can&amp;#39;t recommend it. I had the Sheila&amp;#39;s Chicken Avocado Salad. It was huge and very good. I have since discovered that -- despite being called a salad -- the thing was 3,000 calories!!! There were decidedly too many downsides to this place to warrant going back:<br&gt;1) Crowded <br&gt;2) Loud<br&gt;3) Pricey<br&gt;4) Discouraged from lingering <br&gt;I&amp;#39;ve never been in a restaurant with so many tables short of Chinese cafeteria-style dining. The consequent noise level was awful. The aisles between were so narrow and busy it took nearly 5 minutes to exit the place!  While the salad was tasty it cost nearly $20, certainly not worth the price. No reservations accepted. <br&gt;<br&gt;Won&amp;#39;t. Be. Back.", "rating": 2, "date": "4/5/2016"}, {"text": "Horrible experience got my order wrong didn&amp;#39;t even apologize nor take it off the bill. Waited extra 30 minutes until they fixed it while everyone at my table ate enjoyed and finished I finally just told her I didn&amp;#39;t even want to eat it there anymore and to just box it for me.", "rating": 1, "date": "6/15/2016"}, {"text": "Came here for our daughter&amp;#39;s 16th birthday. Food was great. Louie (manager) and Miranda (server) were awesome!!", "rating": 5, "date": "12/3/2016"}, {"text": "Here goes. Right off the bat, we were disappointed. When arriving at the hostess counter, I was asked if I would prefer an indoor or outdoor table. I said, &amp;#34;either, whichever is ready faster.&amp;#34; I had my service dog and my partner with me at the time. The hostess was very polite when she asked us to stand aside and wait. However, in the time that we were waiting 2 or 3 couples of just two individuals (like us) arrived without reservations and were not asked to wait. They were immediately shown to tables. When I asked why this was I was told that our table was being cleaned. Although I spotted several clean and empty tables inside. We continued to wait and heard our hostess whispering with another individual about seating us outside because of &amp;#34;the dog.&amp;#34; Little did she know, my SERVICE DOG, is a licensed medical device. We were ultimately seated outside. Other servers walked by, who were incredibly excited about the service dog. I feel that when it comes to dealing with disabled customers, all of their staff definitely needs more training, as they appear to have none and very little etiquette when it comes to such matters. <br&gt;The food itself was good, and they have a great veggie burger. However, their menu is very overwhelming. For being the place that is supposed to be known for their Cheesecake, it was quite underwhelming.", "rating": 2, "date": "6/28/2016"}, {"text": "Disappointing. Service was great as our waiter was patient and attentive. He even comped the birthday cheesecakes. However, the food was not worth the high price. Our chicken and shrimp dish had obviously been under the heat lamp for awhile.   The cheesecakes we got were not good. We ordered their 30th anniversary cheesecake.  The chocolate truffle topping was hard, the cake portion stale and the cheesecake well past its &amp;#34;best before&amp;#34; date. Obviously these cakes had been in the dessert case too long. Perhaps CF needs fewer cheesecake choices so they rotate their stock a little quicker to provide the customer a better experience. <br&gt;I&amp;#39;d recommend Flying Star or Range Cafe for a fresher, tastier dessert. <br&gt;<br&gt;UPDATE:  Cheesecake Factory asked me to contact them through the website so they could better respond to my comment. I did. No response from Cheesecake Factory.", "rating": 2, "date": "1/19/2017"}, {"text": "The service was horrible had to wait 30 mins for my drinks, another 45 mins for my food and addition to that another 45 mins for my cheesecake that was ordered to go. I hope this place gets better on serving people&amp;#39;s food instead of running around thinking what they need to do. Don&amp;#39;t get me wrong, I am glad ABQ finally has a cheesecake factory but jeez its just absolutely ridiculous on the wait for the food and drinks.", "rating": 3, "date": "2/24/2016"}, {"text": "Emmitt was our server this afternoon and I was very impressed with his professionalism.  The food was tasty but I can&amp;#39;t help but wonder why they need 22 pages of items? We sat outside and I was glad as the noise inside is a bit too much for me.", "rating": 3, "date": "8/24/2016"}, {"text": "My husband and I went on Monday night at 10pm, so the restaurant was empty. We ordered cheesecake to go. It took 10 minutes even though there were three people behind the counter and no other customers. I got the Oreo deluxe and my husband got the 30th anniversary chocolate cheesecake. My husband thought his had a strange after taste and did not finish it. The Oreos on mine were good, but the dessert was too sweet and tasted like it was made from low quality ingredients. I did not want to finish mine because it was not very good.  We both  miss Dee&amp;#39;s Cheesecake Factory. This is not a place for good cheesecake, it is a place for extravagant looking desserts that taste Meh.", "rating": 2, "date": "4/12/2016"}, {"text": "Don&amp;#39;t eat the Eggplant Parmesan!   It was very bitter and I had to send it back. They need to take it off the menu.   Got a burger instead.  However my wife&amp;#39;s fish n chips was good.  I ate some of hers.  A bit pricey for what you get.  Service was OK.  It was late.  But if you want cheesecake and go up and pay for it yourself instead of having the server bring it to you and add it to the bill, expect a 15 minute wait  as the orders go to the servers, not the counter customers.  We had the 30th Anniversary Cheesecake.  Wow, it was great.  Expensive but very good.", "rating": 2, "date": "3/19/2017"}, {"text": "One of my top favorite places in town (for a chain).  We have had excellent waitstaff and wonderful food.  And who can&amp;#39;t beat those deadly cheesecakes?  Haven&amp;#39;t tried a single one yet that we don&amp;#39;t care for.  Reese&amp;#39;s Peanut Butter is still our favorite.  Drinks (adult) are tasty, food is divine.  Patio for people watching and taking in the fresh air.  What is not to like about this place (except for the wait to get a table sometimes!)", "rating": 5, "date": "11/1/2016"}, {"text": "The problem with this place is the lack of consistency in both service and food prep. Starting with the hosts, sometimes the pagers work and sometimes they don&amp;#39;t. Sometimes they try and find you and sometimes they don&amp;#39;t and you end up waiting for a different table. Sometimes the waitstaff is good and sometimes they are lacking. Sometimes the food is what you remember from a cheesecake factory in a different city like Las Vegas (excellent) and sometimes it is definitely not. We&amp;#39;ve been here six times since they opened hoping that it would get better. It has not. We do not recommend this particular cheesecake factory.", "rating": 1, "date": "3/16/2017"}, {"text": "First time there, it was large, a decent wait but it was dinner time. The atmosphere was very pleasant! The colors, the mirrors and the lights really added a really &amp;#34;breakfast at Tiffany&amp;#39;s&amp;#34; touch. I was with a group of friends and it was our first time all together. The food portions are huge, which was great for the price. However, my one thing I found off putting was the price of the drinks. The prices were not listed, but they also were the most expensive thing on my bill. Considering I ordered food, a drink and cheesecake. The cheesecake was the cheapest and the absolute BEST! So many flavors to try and it was great! Definitely lived up to the hype for dessert. Plus there is a ton of parking where this location is which is a great plus. It was too hot sit outside, but the patio they have looks delightful.", "rating": 3, "date": "7/19/2016"}, {"text": "This Cheesecake Factory isn&amp;#39;t up to par as the other Cheesecake Factories I have had in other cities such as PHX, SLC and Las Vegas. The service is hit and miss. The Cheesecake is still good here but the factor of not knowing what type of service your going to get is troubling. I will return reluctantly because of the Cheesecake but I had better food and service at the Elephant Bar and the Melting Pot.", "rating": 3, "date": "10/13/2016"}, {"text": "I&amp;#39;ve been to Cheesecake Factory in Vegas. While shopping we decided to give this place a try.  I can&amp;#39;t really say anything bad, but I can&amp;#39;t really say anything wonderful. Service was average.  The food was average.  For the price I expected better. I will say it is very pretty.  There is a lot to choose from that&amp;#39;s for certain.  Hmmm.  Not much to say.  Average.", "rating": 3, "date": "6/29/2016"}, {"text": "Visited just a couple weeks back with my work team. It was very busy on a Thursday during lunch hours, so we ended up finding a spot at the bar for all 5 of us. The food was good and the bar staff was very friendly like you would expect if you were sitting at a table. I want to visit again once the hype slows, because I want to enjoy the overall experience, rather than just a quick midday lunch.", "rating": 5, "date": "4/15/2016"}, {"text": "Don&amp;#39;t waste your time with curbside. We were told 25 minutes but waited an hour. Finally received mediocre cold food. $50 for a couple of appetizers and 2 slices of cheesecake. I know they are busy right now but if it&amp;#39;s going to be an hour just tell people that.", "rating": 2, "date": "7/11/2016"}, {"text": "Okay food is obviously delicious. I&amp;#39;m only rating 3 stars because of the drink quality. I ordered the ultimate margarita and I tasted more triple sec than actual tequila. Kind of disappointing seeing that I was in Denver the week prior and dined at a cheese cake factory there and they made a really good ultimate marguerite there. My main disappointment stems from that because I&amp;#39;m in New Mexico and should only expect any top notch margarita or one that has at least an inkling taste of tequila.", "rating": 3, "date": "2/26/2016"}, {"text": "The veggie burger is hands down the best tasting veggie burger I have ever had. The strawberry cheese cake was pretty good too. The staff is friendly and the atmosphere is nice. Will definitely come back", "rating": 4, "date": "2/25/2018"}, {"text": "I went for my birthday and I had to wait 2 hours for a table then I go to ask if my table is ready and they asked me if I could wait a bit longer so I went across the street to the Elephant Bar this was on a Wednesday night thanks for ruining my birthday Cheesecake Factory", "rating": 1, "date": "4/16/2016"}, {"text": "Food wasn&amp;#39;t bad, the service sucked.  The hostess kept stepping on my daughter and didn&amp;#39;t bother to apologize,  the wait for the food was over an hour and request for drink refills took forever.  Dessert took another 30 mins.  For all the people that applied for a job there, looks like the top servers were not picked.  With a restaurant thats busy a long wait is expected but, almost 3 hours is a bit much.", "rating": 1, "date": "3/7/2016"}, {"text": "We came here for my mothers birthday. The wait was short, 10 minutes on a holiday. My dad is on a special diet so he can not have carbs and must eat low-sugar items. The waiter was kind enough to make sure his burger was lettuce wrapped and with a salad on the side. I asked for a medium well burger with no mushrooms. When we got our food, we realized we had no forks and asked for some. We asked three times and were nearly done with our meal before receiving them. Unfortunately my dads salad was sugar coated in a dressing that he didn&amp;#39;t ask for. He then asked for another one, which the waiter got no additional charge, but the new dressing was still sweet. My burger had no toppings at all and was well done. Moms/birthday girls meal was perfect so luckily she still ate happy. <br&gt;The dessert was good. No problems here and got what we wanted with free of charge coffee thanks to the waiter. <br&gt;The main issue was the price versus the quality. I think we would&amp;#39;ve had the same food made better elsewhere. Come for the dessert but maybe go have savory meals somewhere cheaper and local.", "rating": 2, "date": "9/5/2016"}, {"text": "Attended the soft opening on Friday, February 19.  Sat at the bar and ordered the wings to start, followed by the Cuban sandwich, with a slice of cheesecake to go.  Very tasty.  Staff all new, supplemented with managers transplanted from within the organization.  All are eager and motivated, given that this is the first CCF in New Mexico.  Within a week or two, you will start seeing quite a few five star reviews.", "rating": 4, "date": "2/24/2016"}, {"text": "The quality of the ingredients isn&amp;#39;t really worth the price of the food to be honest. I would rather spend the same amount at a nicer local establishment so I&amp;#39;m not supporting a huge chain. Their food is mediocre at best. I ordered a banana cheesecake (the selling point was the fresh bananas that supposedly come with) hoping they could at least get cheesecake right. Our server returned with a plain slice sans banana and dropped it off saying &amp;#34;Sorry, we are out of bananas but here is a slice of the same kind without them!&amp;#34; and walked off like she didn&amp;#39;t just commit what should be a crime. Had I known there weren&amp;#39;t fresh bananas obviously I wouldn&amp;#39;t have ordered a banana cheesecake. Won&amp;#39;t be coming back...", "rating": 2, "date": "2/6/2018"}, {"text": "We waited 7 months to visit this place because of long wait times. We arrived at 2pm (not exactly lunch time) and picked the bar because there was still a 20 minute wait time. Food was awesome which included fish tacos, pasta Bellagio and Tuscan chicken) but the best part of the visit was Ashley who was friendly, efficient and genuinely engaged with her customers. We&amp;#39;ll be back, but maybe at 3pm.", "rating": 5, "date": "6/23/2016"}, {"text": "Terrible treatment due to being in a wheelchair. Out of everything on a Saturday night. I&amp;#39;ve been to Cheesecake Factory&amp;#39;s all over the place. They just opened this place and I feel they would best served by just closing it. Doesn&amp;#39;t meet the standards their other locations set.", "rating": 1, "date": "10/1/2016"}, {"text": "The banana cheesecake is the bomb . The service could be better, but as far as food.. the chefs in the back keep me coming back!", "rating": 5, "date": "5/28/2016"}, {"text": "Waited an HOUR for our food to come out!  And purposely went at 2pm to miss the lunch crowd for my birthday!  Place was not busy at all and when our food came out very disappointing. My vegetable salad seemed half frozen half wilted!  Even my 8 year old niece said &amp;#34;I don&amp;#39;t want that tomato it looks old...&amp;#34; LOL My fiancé ordered a salad and all that came out was a bowl of mixed greens lettuce that&amp;#39;s it no dressing no carrots nothing just lettuce!  Could not believe it!  Never going back plus my birthday lunch was ruined.  Oh well....", "rating": 1, "date": "6/14/2017"}, {"text": "It would be 1 star if it weren&amp;#39;t for such a kind and understanding waitress.  The food itself was salty to the point where we had to return 2 dishes--Orange Beef, and Cashew Chicken. I&amp;#39;ll go to other Cheesecake Factory, but not this one.", "rating": 2, "date": "6/3/2016"}, {"text": "The food is always great. I will warn you it&amp;#39;s a little pricey however you get what you pay for. Love it! Service is ok it&amp;#39;s not too bad I feel like they could be a little friendlier but they aren&amp;#39;t rude so it&amp;#39;s great check it out!", "rating": 4, "date": "1/21/2018"}, {"text": "I love The Cheesecake Factory and am really glad my friend told me about this new location. I only come into town every so often, so who knows how long it would have taken me to figure it out.", "rating": 5, "date": "4/26/2016"}, {"text": "I ordered the mushroom burger. It was sooo good. The seasoning on the mushrooms was perfect. If you like garlic butter you will like this burger. The service was fast and friendly,  I will definitely come nack.", "rating": 5, "date": "5/13/2016"}, {"text": "Food is always great at The Cheesecake Factory, no matter what location you visit. However, Albuquerque has this amazingly unique talent to destroy the image and standards that major chains, such as The Cheesecake Factory, Nordstrom Rack and Ruth&amp;#39;s Chris steakhouse, just to name a few, work so hard to achieve. <br&gt;The service. The quality of people hired.  You can shine a penny over and over and over again but that sh*t will never be a dime. <br&gt;Suggestions: staff, loose all attitudes. Hold yourself to a higher standard. Try to look like you belong working at a high end restaurant not hookin&amp;#39; on Central. Don&amp;#39;t come to work high. Always respect your guests because they are the people that pay your rent! Don&amp;#39;t be easily irritated. Move with purpose! <br&gt;If you go, just be prepared to have the average Albuquerque service experience with top notch food. Maybe tip the cooks instead of the crappy servers.", "rating": 3, "date": "11/14/2016"}, {"text": "This was my first time in the cheesecake factory in albuquerque. I ordered and received a green chilie cheese burger. It was cooked exactly right and tasted fine.  My question is, how can you serve frozen French fries with a burger like that. That ruined the plate.  The atmosphere suggests higher end food but you serve frozen fries. Not difficult to serve fresh fries....bummer...", "rating": 3, "date": "10/25/2016"}, {"text": "I have been there twice a year apart the wait is ridiculous more than an hour.  Both times I have been my meal was not delivered everyone else in the party received their food I didn&amp;#39;t.  I don&amp;#39;t like the way they deliver the meal it doesn&amp;#39;t come out for a table at the same time it comes out so maybe half the table receives food and the other half waits.  Both times I have been there they delivered the wrong food to someone in our party.  It is awkward to sit for 15 minutes while the rest of the group eats waiting for food.  If it only happens once I could excuse it but for it to happen twice is inexcusable. Such a poorly managed place.", "rating": 2, "date": "10/13/2017"}, {"text": "The food was delicious I ordered the Louisiana chicken Pasta it was a very large portion I had leftovers and I did not let them go to waste.....the service was amazing! We did go on a week night which was not busy so there was no wait and everyone was very attentive and kind. I plan on going back again soon I probably will not go on a weekend because of the long wait time but I will be back!", "rating": 5, "date": "10/8/2016"}, {"text": "Great service .. Food was delicious, only down fall was the wait! Their Raspberry cheesecake was the best!", "rating": 4, "date": "3/31/2016"}, {"text": "Got a  to go order based strictly on the reviews about bad service. Cheesecake was great. I ordered the avocado egg rolls....they were good but they didn&amp;#39;t put a lid on the sauce served with them so it spilled all over the dish....how do they not have lids??? So that right there tells me a lot based on other reviews.", "rating": 3, "date": "5/15/2017"}, {"text": "this was a great Cheesecake Factory. the wait was 2 hours because it is a very new restaurant. the food was amazing &amp;amp; the staff was really nice. the bacon bacon cheeseburger was the best. everything was well prepared &amp;amp; yummy. everyone was nice. the Oreo milkshake was delicious and so was the vanilla bean cheesecake. this trip was definitely worth the wait. look for the gentleman with long hair &amp;amp; glasses. he is very nice. oh! and also the decor in the restaurant was so lovely!!! the low light and amazing art work was the best. :) when they tell you that your going to be waiting a certain amount of time you can shave off 15 minutes give or take. the atmosphere is great. I would assume that this is a great place to go on a date or double date. you have to get cheesecake. if you are too full from that chicken bellagio then get it to go.", "rating": 5, "date": "3/19/2016"}, {"text": "We weren&amp;#39;t happy with the quality of the food for the price.  The service was lacking as well..our order was mixed up with someone else&amp;#39;s after waiting for 25 minutes to get it.  Not a big fan, the best part was of course...the cheesecake.", "rating": 2, "date": "9/14/2016"}, {"text": "Everything was great, the food,  the service , etc. It was pretty busy , so the food took a little time to arrive, but is understandable. The fact that the buzzer works in a couple of stores in the mall is nice. One hour of waiting goes by fast when you are shopping!", "rating": 5, "date": "5/13/2016"}, {"text": "Amazing food with huge potions. The food taste homemade and the new Cheesecake Factory is beautiful. I can&amp;#39;t wait to go back!! 5 stars", "rating": 5, "date": "5/8/2016"}, {"text": "The food is very overpriced for the quality. The drinks are also pretty pricy. But the cheesecake is to die for... so good. The ambience is pretty nice too.", "rating": 3, "date": "9/15/2017"}, {"text": "So glad we finally got a chance to eat here!  They have a huge menu with a little  something for everyone and the service was great! Also very quick. Everyone should try the cheesecake factory at least once!!", "rating": 4, "date": "8/14/2016"}, {"text": "So excited for Albuquerque location to open.  We waited 3 hours first time....well worth it.  Have been here twice since, service great, food good and server (twice) Tyler is exceptional.  Only negative is that I have yet to have a cocktail that&amp;#39;s fixed correctly.....bartenders need help.  Try happy hour bar menu....it&amp;#39;s great!", "rating": 4, "date": "4/6/2016"}, {"text": "Always a reliable good meal. Definitely explains why this place is always so busy. I would love to return.", "rating": 4, "date": "7/26/2016"}, {"text": "Good food, large portions, not too expensive. Great cheesecake!Place was really busy and we had to wait for glasses to be washed to get our drinks. Our bread plates and a knife weren&amp;#39;t clean, they had caked on food still on them. The waitress exchanged them right away for clean ones.", "rating": 3, "date": "7/24/2016"}, {"text": "My friend and I went to get some cheese cake, we ended up ordering nachos and cheesecake and asked for it all to be sent out together at once. The nachos came out but we waited almost 20 minutes for the cheesecake to come out. My friend had to repeatedly ask for a glass of water and after waiting and waiting and waiting it only got filled when one of us had to yell out &amp;#34;excuse me&amp;#34; to our server or when we even asked another server if they could please refill our glasses. She had a big top right across from us that she had no problem refilling drinks constantly, and I get it sometimes big tops take a lot of your attention away from your other tables. But even after she refilled their drinks and still had water to spare in the pitcher for our drinks she walked right on by without even a glance over, knowing we asked for refills. But what was most irritating was when we cashed out my friend asked for one more refill and she acted like we weren&amp;#39;t even there. We waited about ten min, she walked by us with the water pitcher refilling all of her other tables  but not us, finally my friend just said forget it and we left. Our tab was only 38 dollars and we still tipped her 13, we are servers ourselves and we get how it can be sometimes but that was just the shittiest service ever. That nice tip was solely for the karma of server life not for the crappy service.", "rating": 3, "date": "10/27/2018"}, {"text": "I was blown away by how good the food is here!  We tried several different items from the extensive menu, and found everything to be absolutely delicious.  They put a lot of work into finding unique flavor combinations to please your palate.  The service was friendly and helpful.  The prices are pretty fair for the quality that you receive.  I can&amp;#39;t wait to go back.", "rating": 5, "date": "10/28/2016"}, {"text": "Went on friday.  Was told the wait would be 2 and a half hours.  I asked if I could make a reservation for Saturday.  I was told they do not take reservations.  Went to the standard dinner.  10 minute wait.  Great food.  I will try a different day but given the poor service reviews I am not expecting much. When the novelty wears off they better have their act together.", "rating": 1, "date": "3/13/2016"}, {"text": "When my party of three arrived at the Cheesecake Factory, we were seated right away.<br&gt;But then we waited. And waited. And waited. After twenty minutes, my friend went up to the hostess to tell her we hadn&amp;#39;t been helped yet. She said she got our server&amp;#39;s attention and that he&amp;#39;d be right over.<br&gt;But he wasn&amp;#39;t. We waited ten more minutes and in that time we saw people at the table next to us be seated and helped right away. So my friend alerted the hostess again. The hostess said she saw our server (named Kevin) lounging at the bar so she changed us to a table with their best server (Ty). <br&gt;After we were re-seated, everything was excellent.<br&gt;But I&amp;#39;ve never had to wait at a table for thirty minutes without being helped before.", "rating": 2, "date": "6/10/2016"}, {"text": "We went for Sunday brunch. Very expensive and food is average. Huevos rancheros with black beans? Black beans aren&amp;#39;t New Mexican, but restaurants continue to shove them at us instead of pinto beans. Know your customers. Very disappointing after all the hype. Cheesecake is their strength. We took home 1/2 original, 1/2 chocolate mousse, which were excellent. We&amp;#39;ll stick to Monica&amp;#39;s and The Range for Sunday brunch.", "rating": 2, "date": "7/22/2017"}, {"text": "We went on a Saturday night, which was understandably busy. We decided to skip dinner and order cheesecake to go. We placed our order, and waited for over an hour. Finally we asked about order, we were told it would only be five more minutes. Fifteen minutes later we were getting a little upset, another waitress in the cheesecake area noticed and asked us what order we were waiting for. As she looked into what was going on, it was discovered that they lost our order. The waitress that originally helped (and told us it would only be five minutes longer) had done absolutely nothing. The cheesecake was good, but be prepared to wait at least two hours, and don&amp;#39;t expect an apology from staff if they loose your order.", "rating": 2, "date": "5/1/2016"}, {"text": "We went on a busy Saturday evening and it was pretty pact, so the wait was a good 45 minutes, but it was worth it. The seats looked like cozy sofas and they were very comfortable.   We sat outside and it was chilly and started to rain, but the waitress was quick to turn on the heaters. The  restaurant is clean and beautiful and The service was awesome! The menu was an outstanding vast verity.  My husband had the meet loaf and I had one of their steaks.  It was cooked perfectly with a side of  fried green beans, sprouts and mashed potatoes with bacon in them.  Delicious! I had it with a glass of red wine, perfect combination!", "rating": 5, "date": "4/30/2016"}, {"text": "I forgot golden rule. Do not order anything other than dessert from The Factory.  Fettuccine was not worth it. Staff were great though.", "rating": 2, "date": "4/29/2016"}, {"text": "Very Las Vegas; giant, fancy, kinda pricey for the fare.", "rating": 2, "date": "8/1/2016"}, {"text": "First time at this or any CF in a long while. The wait we were given was 45-60 min, and it was on the long end, but they seated us quickly. The menu&amp;#39;s a lot longer than I remember, but everything sounds delicious. Got the Crispy Shrimp sandwich, which is a lot bigger than I anticipated. But the Chinese Chicken Salad my mother got is ridiculously huge (might get it next time lol). Our server, Brian, was very helpful and had an answer ready for our questions. Need to make sure I get a smaller plate so I have room for a slice of cheesecake next time!", "rating": 5, "date": "4/22/2016"}, {"text": "I had the lemon cheesecake and it was very good. The Chicken Bellagio is tasteless and not good at all, definitely not worth $17.99. The service was very good and the food came out quickly. I would recommend trying to go between meal hours or on Monday night; the wait can easily be 2 hours on a Friday night.", "rating": 4, "date": "7/21/2016"}, {"text": "Have eaten there twice since it opened and have been happy with their food and service. Try the vegan Cobb salad!", "rating": 5, "date": "3/31/2016"}, {"text": "Long wait for food. Loud loud atmosphere.   Lots of screaming children. Really hoped the food makes upfor this. The bread plates were dirty. The water tastes like pool water. Samosa app too salty. My dining companions liked the Asian salad and chicken tacos. I&amp;#39;m not a fan of chain restaurants. I guess some people like this.", "rating": 2, "date": "3/30/2016"}, {"text": "The server lady with the tattoos on her arms and near her hands ruined our entire dinner tonight. She was very rude and very passive aggressive. She was trying to rush us along. We didn&amp;#39;t feel welcomed at all and I think she was very anti-child even though our children are very well behaved. Listen, people have kids, you were a kid once. You chose to be a server and therefore you must work with families whether you like it or not. She strategically tried bringing my kids food out first to &amp;#34;distract&amp;#34; them, rookie move. We chose to not let our kids eat it until we all received our food, about 15-20 minutes later. Next time I will have her warm it all back up as we eat together as a family. Our tip would have been a lot higher than the standard 15% had she shown respect, but she isn&amp;#39;t about that. She was about herself, she was selfish. She is her own downfall. You&amp;#39;ll get better tips if you treat families nice overall. Don&amp;#39;t be selfish. Food was good.", "rating": 2, "date": "7/1/2018"}, {"text": "Went to this restaurant for the first time last weekend, and wasn&amp;#39;t very impressed. After a 20 minute wait the hostess showed us to our table, and we had to wait 10 minutes for our waiter to come (which was understandable since it was fairly busy). After we got our drinks we placed our orders,  and our waiter said he would bring some bread to the table. We had to wait 50 minutes for our food to arrive, and we never got our bread during our wait. I ordered the orange chicken and my husband ordered the fish and chips. Both of our meals were very bland, and not worth the cost.After we finished our meals we finally got our bread order, which we didn&amp;#39;t even want anymore by that point. I won&amp;#39;t be going back to any of these restaurants since I don&amp;#39;t feel the food is good enough to warrant the cost that it is.", "rating": 2, "date": "8/8/2017"}, {"text": "Came here for the first time and this place is pretty good! The atmosphere was very unique and the food was delicious.  Didn&amp;#39;t get to try any cheesecake but will definitely try next time.", "rating": 4, "date": "5/14/2016"}, {"text": "I didn&amp;#39;t want to love this place. &amp;#34;It&amp;#39;s an overpriced chain!&amp;#34;, I told myself. In truth, I was planning on eating here and feeling dirty after, like I was having a secret best friendship with my best friend&amp;#39;s cousin but she could never find out cause she&amp;#39;d be heartbroken. I was pleasantly surprised with the level of service I received a few Saturday evenings ago right around 5. We had a baby and a toddler with us so we were primed to pick apart anything we deemed unworthy of a yelp &amp;#39;whoohoo&amp;#39; review star. The menu itself is about 20 pages long so please bring your glasses if you need them and some patience;. If you&amp;#39;re not great at making up your mind even when looking at smaller menus, this may not be the place for you. My issue with expansive menus is that I can&amp;#39;t determine what it is they&amp;#39;re good at cooking if they make everything. In order for a place with a 20 page menu to succeed, all of the menu items have to be at least a little better than average.Their cheesecake meets my guidelines. The appetizer was an array of fried avocado and zucchini which I really enjoyed. For dinner, I had pasta dish made with garlic sauce and tossed with veggies--it made me happy. I have to say that the service towards the end was a bit spotty because the servers were in the midst of shift change so if I had feedback to offer it would be to wait until your last table is served to tag team in your partner. Other than that, I&amp;#39;d go back for the cheesecake alone. If you want to dine here but don&amp;#39;t want to pay an arm and a leg I suggest you visit during the week and dine on an appetizer and a split a slice of cheesecake.", "rating": 4, "date": "12/14/2016"}, {"text": "Hubby and I have dined at Cheesecake Factory restaurants all over the U.S.  Favorite menu items are Miso Salmon and soy sauce, sesame seed Edamame.  Hubby ordered a burger and I ordered my usual.  The Miso Salmon arrived with a huge trim of burned, black char around the entire piece of salmon and the driest inner salmon I&amp;#39;ve ever seen.  I looked at the server and explained that I order this item once a week at other CCF&amp;#39;s and it never arrives so overcooked as to have a char edge around it.  The server agreed and sent it back.  A manager came to apologize and said they were remedying the situation.  A new plate of Miso Salmon arrived.  I cut into it and it was like raw sushi, not cooked at all.  The edamame arrived and was undercooked.  First time that has ever happened.  How hard can it be to pan fry edamame?  I didn&amp;#39;t complain about the edamame as hubby said he&amp;#39;d bring it back and microwave the order.  I sent the salmon back and asked for it to be removed from the bill.  The manager came over again and apologized.  He said the Miso Salmon would be removed from the bill; however, he&amp;#39;d sent it back to be properly cooked.  The manager sounded confident they could get this right; thus, I agreed to wait. The waitress arrived next and presented the bill, Miso Salmon removed.  Since the bill arrived with the Miso Salmon removed as promised but without the Miso Salmon re-cooked, I figured the chef had screwed up a third time.  The manager showed up again, apologized, said there had been a misunderstanding of my instructions and the salmon would not be coming out.  I just wanted out of there at that point so I could go to the nearest Taco Bell, where they always present a perfect Taco Supreme.  This particular CCF needs to charge Taco Bell prices until they get their act together.  Additionally, given the myriad Yelp complaints about this CCF, their corporate management should terminate the manager/chef, bring in a new team overseen by someone from the Atlanta, GA or San Mateo, California CCF restaurants to oversee things until this locale lives up to the name.  At present, they are ruining the good will and solid reputation that other CCF&amp;#39;s have built over the years.", "rating": 1, "date": "3/27/2016"}, {"text": "I have a confession to make. I am a server myself and I considered applying here. Dodged that bullet because I really hate disappointing people. You know how people say, &amp;#34;KILL IT WITH FIRE!&amp;#34; when they see a large, hairy, evil spider or something equally repulsive? That&amp;#39;s how I feel when I think of The Cheesecake Factory. I was so excited when I heard they would be opening up a Cheesecake Factory here in Albuquerque. I have been to one in Seattle and both the food and service were great. Absolutely not the case here. I&amp;#39;ve tried this place three times and the only thing that has been consistent is the cheesecake. And that&amp;#39;s because it&amp;#39;s not even made here. Service sucks, food sucks. Very slow. Twice we waited for a very long time to even be acknowledged at our table. We told our waitress we needed one more minute with the menu and she didn&amp;#39;t return for 20 minutes!! She literally showed up one minute prior to when we said we were just going to get up and leave. Ordered nachos and they were cold. Boyfriends pasta tasted like it was boiled in chlorine/swimming pool water. He had to send it back one time because it was absolute mush. My spaghetti was BEYOND salty. The kind of salty that left us both gasping for water. I have never in my life sent a plate of food back, but we both had to do that here. I do like the macaroni and cheese burger but it is very salty as well. This place is overhyped and overpriced. I will only return for to-go cheesecake.", "rating": 1, "date": "6/14/2016"}, {"text": "Ok, I know this place just opened, but really!  Came here at 5:00 with my family.  Wait was quoted at 2 hours.  Decided to just get cheesecake to go, and eat dinner elsewhere.   Stood in line at the counter for 40 minutes just to place a to-go order of cheesecake.  Then was told I&amp;#39;d have to wait another 30 minutes to get my order.  Waited the 30 minutes and then could not get to the counter to pick up my order.  Counter was being blocked by hoardes of people.  What type of system is this?  People swamping the counter, pushing and shoving.  An hour and a half of my time and $40 later, I squeezed my way out.  Cheesecake was good, though.  We do live our chain restaurants in Albuquerque!", "rating": 2, "date": "3/19/2016"}, {"text": "This is an update to my earlier review, I should have exercised better judgement and not eaten the meal my server delivered, I puked my guts out later that evening. Today is Tuesday, I puked so hard my sides are still sore. Eating at this location is hazardous to your health.", "rating": 1, "date": "3/1/2016"}, {"text": "The Cheesecake factory is excellent! I am so glad we finally got one in NM. I had a minor problem with my burger (the bun was totally hard on one side, probably from the heat lamp) but I told my waitress and she gave me a new one right away. It&amp;#39;s always amazing tasting and the price is right for the quality and quantity of food you get. I always have to get a box since I can&amp;#39;t finish it all. The ambiance is great and I will be returning here again and again!", "rating": 4, "date": "1/31/2017"}, {"text": "I realize the Cheesecake Factory is new to town, but they could do a better job to accommodate the crowds wanting to try something new. I wasn&amp;#39;t that thrilled to go there in the first place having been in other states, but a large group of us wanted to try it out for someone&amp;#39;s birthday so I obliged. Two of us arrived early to reserve a spot for 10 people, and we were told we needed a manager&amp;#39;s approval for groups of that size, so I was pulled out of the line to wait. Meanwhile, they are accepting names for other parties pushing us further and further down the list. A manager eventually came up to us and told us it would be 2.5 to 3 hours for a group of 10. When we asked why they didn&amp;#39;t accept reservations, the manager told us it was because guests waiting in line get mad when they see empty tables being reserved for other guests. Hmm, I wonder how other restaurants get away with it? Perhaps they don&amp;#39;t have long lines of guests waiting and getting mad because they accept reservation for large parties to begin with. I may give Cheesecake another try, but it will be after a long, long period of time to let the newness wear off.", "rating": 2, "date": "3/14/2016"}, {"text": "Do you crave overpriced,  mass produced,  highly processed,  caloric intense &amp;#34;food&amp;#34; that you wait 3 hours to eat?  Well Albuquerque, does TCF have a treat for you!    Ever since they opened in Beverly Hills in the 70s this gem of an eatery had been churning out food for the masses.  They don&amp;#39;t have any professional tasters and why would you need those?  All of their food is chock full of sugar and sodium to mask the true taste.   A 21 page menu....imagine how fresh most of those items are?  Even the cheesecake is flat but oh so full of sugar.  I mean come on.  It is hard to make a good NY style cheesecake!!!   Sarcasm.   I often wonder why, in a city and state so full of culture, hundreds of years of the most unique and tasty food, some of the freshest and most storied ingredients that that we allow a fortune 500 business with subpar food onto the market.  Not only that a large majority of you will wait hours and endure crap service to ravenously give it a 5 star review.  Grow a pair and call it like it is....another corporate chain who got a coveted liquor license in a prime location that probably paid off a New Mexico family so you could drink a fritz sugary watered vodka drink on GNO.   We need to start blocking these places in uptown.   It is enough", "rating": 1, "date": "3/27/2016"}, {"text": "All I can say is this place is diabetic danger zone! Everything here is so sweet and I am not talking about the cheesecake! This is a dangerous place for diabetics and I&amp;#39;m sure many left in diabetic comas. Horrible, low quality, high sugar food.", "rating": 1, "date": "9/17/2016"}, {"text": "My wife and I have been here a couple of times. The servers have been nothing short of wonderful. The food has been outstanding every time we go. One of my favorites are the carne asada steak medallions. Really delicious, as are the chicken tacos. Looking forward to our next visit.", "rating": 5, "date": "5/13/2017"}, {"text": "We&amp;#39;ve been twice since The Cheesecake Factory opened in Albuquerque.  The first time, we waited over an hour to get in and once in, service was bad.  Because the restaurant just opened, we gave the bad service and wait time a pass.  But after being opened for over a month now, we decided to try the CCF again.  This time, we waited 30 minutes to get in and the service was HORRIBLE.  We waited 20 minutes after being seated at our table before a waitress (Kaitlyn or Caitlyn) showed up to get our drink order.  It took her 10 minutes more to bring us our drinks. During the course of the meal, our glasses were empty, and stayed empty.  The waitress passed our table several times and ignored the fact that they were empty.  The food took 20 minutes from order time to table time.  I got the fish and chips and the fish was mealy and chewy.  This tells me the fish wasn&amp;#39;t fresh.  It was not very good at.  We had fried Zucchini as an appetizer. The appetizer was cold.  How can an appetizer be cold?  This place with it&amp;#39;s high prices needs to vastly improve if they want to stay in business.  Our waitress was so bad that after we finished eating, we waited 20 more minutes before we got our check and another 10 minutes for her to return our credit card.  Drink glasses were empty most of the meal. It was a HORRIBLE EXPERIENCE.", "rating": 1, "date": "3/27/2016"}, {"text": "I don&amp;#39;t usually write a review but feel compelled to today. I ate there at lunch today with two coworkers. Although the line was long, it didn&amp;#39;t take too long to get in (about 20 min).  When we finally got it, we had a choice of the bar high top or the patio (it was a cold and windy day).  We went with the high top.  After a bit of waiting for food, a regular table opened up close to us. We asked to be moved and were promptly told &amp;#39;no.&amp;#39;  We just got our food and the waitress wanted to take the bread, we said &amp;#39;no.&amp;#39;  I asked for a doggie bag for my soup and she said she would box it. She started to pick up the bowl by sticking her finger down in it and realized she shouldn&amp;#39;t do that but piled dirty dishes on the plate as she took it off the table.  She also reached over my coworkers dish and almost put her arm in her food. The manager never came around to tables to see how folks were doing.  I was not impressed.  I won&amp;#39;t be back.", "rating": 2, "date": "4/8/2016"}, {"text": "The hostess was incredibly snotty and short tempered with my brother in law when we went to put our name in for waiting for a table. (I feel she judged him based on his clothing at the time...it was so terribly rude that I have never seen a potential customer treated this way in a very long time) She refused to let us put our name in, refused to give us a beeper for the wait and told us it would be &amp;#34;over 2 hours&amp;#34; to even be put on the waiting list that evening. When I got there, he and I went back to ask her a question about waiting, she obviously ignored us standing there and seemed to be talking to some personal friends instead. We decided to just grab some cheese cake while we were there and head home. (And also noticed that the wait line wasn&amp;#39;t nearly at &amp;#34;over 2 hours&amp;#34; capacity and many many booths and tables were in fact sitting empty!) Wait staff screaming  &amp;#34;out of the way&amp;#34; at customers as they were moving cakes to the counter. Children in the line to buy cake were touching orders left on the counter. Pushing and shoving, absolute chaos the whole time...almost took 45 minutes for 4 slices of cake to go! I probably won&amp;#39;t go back...being THAT rude to a potential customer is just unacceptable no matter what the circumstances.", "rating": 1, "date": "3/27/2016"}, {"text": "Extremely expensive the jambalaya was nasty the Linguini was nasty everything way too salty it&amp;#39;s like they didn&amp;#39;t even know what other spices could go in the food except salt. They put the utensils fork and knives on the table that rarely gets wiped sufficiently to be clean and they put the napkin in a cup the utensils should be in. an elevated place to eat fine.... dining.... I have never in my life seen my fork and knife directly on the table where other people spill food, drop food out of their mouth, spilled drinks, kids touch so unsanitary it&amp;#39;s ridiculous, that is the worst dining experience and the poorest most disgusting thing to do in a nice supposedly elevated restaurant. the only thing good about this place is the cheesecake and that is expensive and very small slice and their out of many different kinds it&amp;#39;s a Cheesecake Factory how can they be out of any kind of Cheesecake ridiculous. do not come here way better to go to crackin crab.", "rating": 1, "date": "7/23/2016"}, {"text": "I don&amp;#39;t care for Chain restaurants, but this place is one of my favorites to go to.  So far, everything has been really good...sometimes there is a wait, but worth it.", "rating": 4, "date": "4/3/2017"}, {"text": "Food was alright, overpriced but comes in very large portions. Also, thanks for the food poisoning! It&amp;#39;s too bad that chicken fettuccine Alfredo  didn&amp;#39;t taste as good coming out as it did going in. What a great way to spend my 20th birthday! The servers were very polite and well attending tho!", "rating": 2, "date": "4/25/2016"}, {"text": "I&amp;#39;ve been there 4 times and I love this place. They offer variety items on the menu. And I always take some cheese cakes to go after I finish my meal. Will be back soon!", "rating": 5, "date": "12/19/2016"}, {"text": "Food was ok, but it took nearly 4 hours for lunch, and the bill was over $100 for 4 people.  Won&amp;#39;t be going back anytime soon....", "rating": 1, "date": "4/1/2016"}, {"text": "I&amp;#39;ve only been here once because the wait time to be seated is ridiculous. We waited for about an hour or so. I think that&amp;#39;s only because it&amp;#39;s new, so it&amp;#39;s still a hype. Once that dies down, I&amp;#39;ll probably be back. It&amp;#39;s a bit pricey, but the serving size was pretty big. Our server was really nice; she even got in a conversation with my brother. However, we couldn&amp;#39;t get a hold of her often because of the crowd. I&amp;#39;m glad that we ordered an appetizer because it took a long time for our food to arrive. I ordered the carbonara, which was good. I already kind of lost my appetite by the time the food was served though so I ended up taking the rest of it to go.", "rating": 3, "date": "7/13/2016"}, {"text": "Food was mediocre at best.  Also, had them set up a large party next to us and separated them instead of moving the table on the other side of us to accommodate the party.  Large party also started giving us a hard time.  The Cheesecake Factory should be embarrassed about that.  So should the ridiculous ladies next to us.", "rating": 2, "date": "1/22/2017"}, {"text": "Not impressed with our overall experience. When we were seated, our booth had crumbs all over the seat, which I just used a napkin to wipe off. Our waiter was not very personable and we had to ask multiple times for things (like a replacement napkin and our appetizer...) We ordered the macaroni balls which were my favorite, falafel ball salad which was not good, the bang bang chicken and shrimp which was ok and the kids pizza, which my son enjoyed but it didn&amp;#39;t look very appetizing.. The falafel balls tasted microwaved and there was way too much kale in it. The dressing they used was good at least. The bang bang chicken and shrimp was mostly sauce and little bits of chicken and shrimp. It seemed as if they had made a big pot of it and we got the serving that was scraped out of the bottom of the pot. It would have been good if the chicken chunks were larger and they used whole shrimp instead of chopped up shrimp. There were also no vegetables which I thought was strange... The pepperonis on the pizza were all burned around the edges, which thankfully, my picky toddler did not complain about.  He had an upset stomach shortly after eating, which I am wondering could be related to the pizza he ate?? It might be worth it to go there just for dessert, since that is what they&amp;#39;re most known for, but if you are looking for a good quality meal, you might want to try elsewhere..", "rating": 2, "date": "9/5/2016"}, {"text": "New restaurant it is very clean and classy place. we were told that wait was 45 minutes but we were able to sit at the and order dinner. This only took about 15 minutes. The plates are huge and very tasty. I recommend the soups and the chicken parm. sandwich. The drinks are priced right as well. This place is a must-visit if you&amp;#39;re hungry for a good meal that&amp;#39;s priced reasonably. We&amp;#39;ll go back for sure!", "rating": 4, "date": "12/30/2016"}, {"text": "Our service was fantastic! The best experience  we have had here. Jonathon C was attentive but not hovering and very helpful with suggestions. Our food was great! Great experience!", "rating": 5, "date": "12/24/2016"}, {"text": "After waiting for over an hour to be seated we were met with a kind but overly harried server who, though she tried hard, really needed more training.  Her effort is the only reason why this Cheesecake Factory earned any rating whatsoever from us.  The food was absolutely, positively disgusting and we really do eat anything.  I honestly believe that there&amp;#39;s less salt in the Dead Sea than there was in our appetizers and main courses and this rendered the meal inedible.  We did not stay for dessert since, one, the place was packed and there was an overall sense of lingering not being welcomed and, two, we didn&amp;#39;t particularly wish to linger as we were hungry for something edible.  If you&amp;#39;re looking for a crowded, rushed environment, frantic waitstaff, and remarkably awful yet expensive food, this Cheesecake Factory has you covered on all aspects.  For their sake, I do hope the cheesecake is good, but I can&amp;#39;t recommend and won&amp;#39;t return.", "rating": 1, "date": "6/24/2016"}, {"text": "We ordered Avocado egg rolls one of them had a hair inside the avocado. My half chicken came out broken into pieces, dry, over cooked and cold. The skin on the chicken was shriveled up like it was old, definitely not freshly cooked, the mashed potatoes were somewhat warm. We were on a double date with another couple so I didn&amp;#39;t want to say anything. I&amp;#39;ve been to many different Cheesecake Factory&amp;#39;s in other states and haven&amp;#39;t had any problems before, sorry to say this one was disappointing.", "rating": 1, "date": "2/13/2017"}, {"text": "Great waitress, amazing food. A new favorite restaurant.", "rating": 5, "date": "4/1/2016"}, {"text": "We went yesterday evening; the wait wasn&amp;#39;t bad at all (party of 4), our server was extremely nice, and the food was good! Cheesecake to go was convenient (:", "rating": 5, "date": "5/12/2016"}, {"text": "Good food, delicious cheesecake, great service. Long wait as expected but worth it! Had the crispy fish tacos and an amazing white chocolate macadamia nut cheesecake.", "rating": 5, "date": "2/26/2016"}, {"text": "Poor service. I  went during lunch it wasn&amp;#39;t too packed yet had poor  service. The food was mediocre. Was very disappointing.", "rating": 2, "date": "8/16/2016"}, {"text": "First trip to this location... Have eaten at other locations in Arizona, Los Angeles, etc.  Food is as always, exceptional. The wait for the food however, is a bit ridiculous. Lots of servers standing around, but no real rush or explanation as to why it takes so long.  Our server had no help with food delivery. Two plates were delivered and we had to wait almost 8 minutes for the additional two plates.   We ordered a refill ice tea and we were done with the meal by the time the server appeared.  It seemed to me like a more expensive Applebee&amp;#39;s.  I&amp;#39;d rather have a mom and pop restaurant if this service is indicative of this location.", "rating": 3, "date": "7/25/2016"}, {"text": "in and out of there is no time, was totally impressed for picking up two slices of cheesecake for desert at dinner.", "rating": 5, "date": "7/24/2016"}, {"text": "Took 10 minutes to get a beer. The food was nominal compared to the price. And I have never written a review before in my life.", "rating": 1, "date": "3/20/2016"}, {"text": "Nothing tops off an afternoon of shopping better than a great meal at an amazing place... or so we thought. When we first walked in we expected the crowd at the front so we were ready to wait until we were told we could sit in the bar area which we took full advantage of and thought to ourselves SCORE!... no wait. A couple of minutes later our waitress greeted us and took our drink order. Ten minutes later we got our drinks and placed our order right away so there wouldn&amp;#39;t be too much of a delay since the place was getting busy. 35-40 minutes later we received our entrees, we could tell our waitress left them sitting for a while because the top was cold and it wasn&amp;#39;t until we stirred them that they actually were warm enough to eat. During the 35 minutes that we waited we saw our waitress a couple of times and she kept telling us they were still working on our order then she disappeared for a while--the adjacent waitress could probably tell we were becoming aggravated and she came over to check on us and offered to refill our drinks which we were thankful for since our own waitress didn&amp;#39;t do so. In fact, we waited so long, the tables that were seated after us received their food 10-15 minutes before we did. Our waitress never apologized for the wait nor did she offer anything else, she dropped off our food and disappeared again. Once we finished she promptly brought us our check, she wasted no time ringing us up--I wish she would have been that quick with our food. I have to give credit to this place for having an amazing atmosphere, the décor is beautiful and comfortable even though it was really busy during our visit. Also, once we received our food, the taste was great and the portion just right. I&amp;#39;m not sure what it&amp;#39;s going to take to fix the service and attitude of the workers at this location, none (except for the adjacent waitress) seemed to care, even the on duty manager didn&amp;#39;t seemed bothered by the mounting complaints as we saw him comping checks from other unhappy customers. I suppose we could have complained to him directly and maybe had our check comped as well but judging by his attitude and the way he disrespecfully rolled his eyes at the customers he comped, it would have been a waste and I would have had some choice words for him if he rolled his eyes at me as well so we instead called it a loss and left. This is by far the most mismanaged location I have ever been to-- there needs to be change from the top. Prior to posting this review I read previous reviews and more importantly the responses from the &amp;#34;business manager&amp;#34; to all the complaints posted on this forum which amounted to no more than a poor excuse for an apology to my fellow yelpers, I honestly expect the same lacking response to this posting. I challenge management to make a change, a lasting change that will save this location otherwise it is doomed to go the way of most big chain restaurants--mediocre and forgettable.", "rating": 3, "date": "7/16/2016"}, {"text": "We went with a party of five on a weekend without a reservation. Don&amp;#39;t do that! It took over an hour to be seated. The food was average at best. It took forever to get to us and didn&amp;#39;t taste all that good. It was very expensive too. I can think of better places to eat for the money. The cheesecake was great, but I&amp;#39;ll never eat anything but that there again.", "rating": 2, "date": "5/27/2016"}, {"text": "Try the lemon raspberry cheesecake. All of the fruity cheesecakes rock! The food is always yummy too.", "rating": 5, "date": "5/4/2016"}, {"text": "i&amp;#39;m giving this place a single star do to the service or the lack there of.  we were sitting here for almost 2 1/2 hours waiting for our order.  the kids were waiting even longer for the desert.  I find it really impossible for a place of this stature has this type of serviceus.   cheesecake used to be one of my favorite places until I came to albuquerque.", "rating": 1, "date": "6/10/2017"}, {"text": "The Cheesecake Factory  <br&gt;         In Albuquerque, New Mexico the state&amp;#39;s new restaurant the Cheesecake Factory that is well known around the United States recently opened. With a wait up to 3 hours for a party of two. That is the first thing the hostess told us when we walking in the door.  The city was excited for the new addition to the city restaurants. The outside of the building was eye drawing especially because it is in the Mall shopping center. It was the new hot spot that is now open from 11am-11pm and Friday - Saturday extender their closing till 12:30. <br&gt;         The week of opening I waiting two hours to be seated for a party of two. When I was seated I waited another 30 minutes for someone to take my drink order. I then began to get frustrated. Not being able to have service also well waiting that was irritating. Finally a server came to get our drink order by then I had asked to talk to a manager. <br&gt;        After waiting for service for almost 45 minutes, not having anyone ask what we wanted to drink or if we were ready to order, we began to get service fast and in a hurry. The food turned out amazing everything came fast and was just like it appeared to be in the picture. The service eventually turned out to be better. And well having our meals completely gave to us for free. Not having to pay even for a soda. We also received a 50 dollar gift card. <br&gt;                 The first week in a new state was crazy for the factory. New servers and a new business is a lot to take in. The company is a great company the servers, manager, hostess, and everyone else was very nice and welcoming. The manager you could see was very stressed out and just needed a break before he completely broke down. This issue was not in his control, he had a 3 hour wait waiting outside. There&amp;#39;s not more the man could do but stay calm and do what he did by making sure everyone was to be pleased and also happy. The meals we order was a chicken pasta which my mother got. I got a bacon cheese burger that had tasted like the most amazing bacon ever! I was very pleased with the burger.  <br&gt;The Cheesecake Factory in Albuquerque, New Mexico turned out to be a great dinner and a huge hit! The food was amazing. It came out looking just like it did on the menu for the restaurant.  Everyone in New Mexico loved it and online it had no bad reviews. We New Mexicans were happy to have something new and something only other states had. This turned out to be a benefiting change for the City. I will love to attend the Cheesecake Factory again in the future.  I give this The Cheese Cake Factory a rating of a 4 out of 5 just because after everything the food was still amazing. The restaurant was a great first time and love it shot. I look forward to going back and having their amazing famous cheesecake.", "rating": 4, "date": "4/25/2016"}, {"text": "I forgave waiting a while to order a drink. And the lack of knowledge our bartender had about the food menu. The salads came out wrong and he apologized and he fixed the check. But when my wife&amp;#39;s food got there and 45 more minutes went by before I had to make a scene to call attention that I had no food. It was crazy. Then the manager doesn&amp;#39;t even give us the courtesy of coming by. Just has the bartender to ask if I even want it.  Yeah! Still haven&amp;#39;t had dinner. I ate while drinking my wife&amp;#39;s water cause not only no water refill but no offer for another beer. He honestly hurt himself. I was ready to spend around $120 on dinner. But oh well the bill was 39 and we still have him 10. Never even met a manager. Never was offered dessert. Even though we were looking around at the cheesecakes. Just over all not good. I hope it&amp;#39;s growing pains but for me it will be another year before I even care to give them another shot. If at all. First time at any Cheesecake Factory. Don&amp;#39;t know that I care to go back. Plenty of great mom and pop places here. They treat people better and at least I meet someone besides the bartender. Obviously I don&amp;#39;t blame the bartender for the back of house mistake. But he didn&amp;#39;t wow me either. Nor did he even try", "rating": 2, "date": "3/14/2016"}, {"text": "Such a step down from the ones in Denver and Vegas.  The service was so slow, but I was going to let that slide because I know they&amp;#39;re pretty new.  But we did have to ask where our appetizer was.  It must have been sitting because when it got to us, it was lukewarm.  We&amp;#39;d ordered the same thing in Denver and Vegas and it was delicious, fried mac and cheese balls ($10.35).  Here, they were bad.  The mac and cheese tasted like it came out of a box, and it was very salty.  No one ate it.  Everyone thought the food was okay.  When the waitperson came back to the table at the end of our meal, I explained what was wrong with the appetizer, as it was clear no one ate it.  She replied, &amp;#34;Okay.  I&amp;#39;ll tell them.&amp;#34;  I assumed when the check came, there&amp;#39;d be no charge for it.  Wrong.  My experience in restaurants has always been that you order something that&amp;#39;s not good, you don&amp;#39;t eat, you tell staff, they will refund it.  I guess I should have just flat out asked.  Maybe my fault.  But we won&amp;#39;t be going back to Cheesecake Factory in Albuquerque.", "rating": 2, "date": "4/23/2016"}]}