{"address": ["12000 SE 82nd Ave", "Ste 2044", "Happy Valley, OR 97086"], "monthly_reviews": {"2019": [[0, 3.5], [1, 3.0], [2, 2.5], [3, 3.5], [4, 3.5], [5, 3.5], [6, 3.0], [7, 3.0], [8, 3.0], [9, 3.0], [10, 3.5], [11, 4.5]], "2017": [[11, 3.0]], "2020": [[0, 4.0], [1, 3.5], [2, 3.0], [3, 2.5], [4, 2.0], [5, 1.5], [6, 1.5], [7, 2.0], [8, 3.5], [9, 2.5], [10, 2.0], [11, 2.5]], "2018": [[0, 3.0], [1, 2.0], [2, 2.5], [3, 3.5], [4, 3.0], [5, 3.0], [6, 3.5], [7, 3.0], [8, 2.5], [9, 3.5], [10, 3.5], [11, 3.0]], "2021": [[0, 2.5], [1, 2.5]]}, "reviews": [{"text": "I had a really great time here the other night. The 10 dollar corking fee they charge is very reasonable, I thought the service was great as well. <br&gt;<br&gt;We were celebrating and I had a bottle of Moët still kicking around from NYs eve that didn&amp;#39;t get drank. So we figured we would bring it to the restaurant we were going to later that evening. <br&gt;<br&gt;The first dish we ordered was the tuna tartar. I thought it was a poor representation of what they had to offer. I&amp;#39;ve seen other reviews of it that are on par with my opinion...bland, small, an attempt at elegant food done poorly. The ring mold is meant for so much more in my opinion. It&amp;#39;s an easy trick that needs more, to remain elegant, than they are offering up. Maybe some black sesame seeds in the tartar, and a sprinkle of togarashi. Or wrap it in nori, pour ginger broth around it, anything to add something. <br&gt;<br&gt;The next plate we picked was the corn cakes. Those were good, and big, and tasty, and while I&amp;#39;m adding all these ands, and very well thought out. I could have ordered two of them. Flavorful and simple but refined. Pretty much perfect. <br&gt;<br&gt;The next course was the hibachi steak? I hope I&amp;#39;m not butchering the name of that dish because it was stellar. It was recommended by our server. She claimed it was her favorite and I see why. It was soft and juicy, and everything on that plate was done well. I highly recommend it and might just have to get it one more time because life is short and yolo. <br&gt;<br&gt;Last but not least, well at least last, was the cheesecake.. kind of the disappointment of the evening sorta but not all the way. I had mixed feelings I guess. <br&gt;<br&gt;So I figured I can get or make a simple cheesecake anywhere so try something cool. Caramel apple was what I decided on. The cheesecake part was great. Light and fluffy as it should be, the crust was perfect, whipped cream was awesome. The part I wasn&amp;#39;t fond of was the Apple part. When I think of a caramel apple I want a tart apple and sweet caramel to contrast. Instead this was apple that I would guess came out of a jar or pail of apple pie filling. It was mushy and tasted like cinnamon. Like the crap from the bucket in a bakery. That&amp;#39;s not caramel apple like at all. <br&gt;<br&gt;The math on those cakes works out to like 100 bucks a cake by the slice. I personally would want to make sure they make a pretty strong statement, especially since the place is named after them. <br&gt;<br&gt;Besides that it was a great night. I had a lager from hop valley that I am trying to find in stores it was so good, and I left happy. I&amp;#39;ll most likely be back soon because I really liked the ambiance.", "rating": 4, "date": "3/11/2020"}, {"text": "So we ordered Cheesecake Factory as a treat tonight.  I spent almost $30 on fettuccine alfredo with shrimp..  this is what showed up.  This is a joke.  How can this place charge that much for food and serve this?", "rating": 1, "date": "8/8/2020"}, {"text": "Oh, no<br&gt;See you eating out like it&amp;#39;s ephemeral<br&gt;Not so serious, Aperol Spritz cold<br&gt;We&amp;#39;re just getting started, mix and mingle<br&gt;<br&gt;Waistline killing masterpiece<br&gt;You should Reese&amp;#39;s and repeat <br&gt;You&amp;#39;re a dessert fantasy <br&gt;But you DNCE so dangerously <br&gt;Let&amp;#39;s start Cherry Ghirardelli<br&gt;<br&gt;Factory, baby<br&gt;I&amp;#39;m going blind from this sweet-sweet craving <br&gt;Whoa-oh<br&gt;Let&amp;#39;s lose our minds and go Key Lime crazy<br&gt;Ah ya ya ya ya <br&gt;I keep on hoping we&amp;#39;ll Cheesecake a commotion <br&gt;<br&gt;Father&amp;#39;s Day parfait<br&gt;I&amp;#39;ll be assembly, you&amp;#39;ll oversee QC, whoa-oh<br&gt;Let&amp;#39;s lose our minds and Brunch Brûléed crazy<br&gt;Ah ya ya ya ya <br&gt;We keep eloping to Cheesecake with emotion", "rating": 4, "date": "6/16/2019"}, {"text": "I&amp;#39;m not really into food chain restaurants but this place is the one chain that I absolutely love! I&amp;#39;ve been going to the one in Beaverton for years on special occasions and I was super excited to see one open on this side of town. What I like about this place is they have food for any kind of cravings you have! I always get something different when I come and I&amp;#39;ve never been disappointed. Plus you get a huge portion that you can save for leftovers! The cheesecake is so delicious and I like to try something new each time I&amp;#39;ve come. We are always too stuffed to eat dessert there so we bring it home. I especially like their complimentary brown bread that comes out warm and you can slather that sweet cream butter on it! I&amp;#39;ve been meaning to come here on the weekend when they have brunch...I will one of these days and let you know what I think.", "rating": 5, "date": "1/6/2020"}, {"text": "Great dishes, desserts and meals. I recommend you check this place out if you haven&amp;#39;t been here. Very clean!", "rating": 5, "date": "1/5/2021"}, {"text": "First time to the cheese cake factory but will definitely be coming back!! We had a gift card from last Christmas that we needed to use up. This restaurant is at the mall which l avoid like the plague! But there&amp;#39;s a pair of shoes on sale that my granddaughter wanted for Christmas, so we thought why not. Seating was prompt, the restaurant was large and busy. The menu was like a small novel soo many choices! We like to share to get more choices. Our server Rebecca was on point, and helpful. She brought bread and butter which was to die for!! ( found out later you can purchase) we order 3 appetizers, chicken sliders, there were 4, came with all the side fixing,  Fried calamari, lightly breaded,and wings. Wings were huge! With just enough spice. Servings were huge ended up taking wings home. Definitely going back, just not ordering as much and will buy bread!", "rating": 5, "date": "11/10/2019"}, {"text": "Ok so apparently this place is hit or miss. Last month when we came here we dropped about $70. And the service was great and the food was fantastic. I was even so satisfied that I asked to speak to the manager so I can give praise to the server and food. This time, the food was terrible. Fries were dry. Her burger came dry with no condiments. They left the sauce out. My chicken sandwhiches didn&amp;#39;t come with the sauces. Had to ask for them. And then realized they also didn&amp;#39;t give us tomatoes. So I had to ask for that as well. Also when we first got there they seated us in the regular area and I asked for a happy hour menu and they said we would have to move to order from that menu. Unsure why they didn&amp;#39;t ask if we wanted to sit in the bar. Literally the whole thing was a hot mess. The server was great. She offered for the manager to come by. Talked to her. Pretty sure it was the same manager I spoke to last time to leave a glowing review and she literally could have cared less. It was a pretty condescending conversation. No apology. She made a sad face and that was that.  So I guess I won&amp;#39;t be coming here again.", "rating": 1, "date": "2/25/2020"}, {"text": "My daughter and I went here in the mall. It was my first time. We got sat right away after being told to wear a mask during the walk to the table. We ordered our drinks. FYI cocktails do not have any pricing, you&amp;#39;ll see why. So I ordered a coconut mojito and Cajun pasta. My drink was pretty, although some of the mint had black spots. It was barely alcoholic. Much to my surprise it was $13.25...<br&gt;So my pasta comes and for 21.50 I honestly expected more. There was a giant chunk of clumpy pasta, see pictures, that when I told the waiter and the manager they asked if they could remove it for me... or if I wanted more pasta... why would I want more of something that you suck at? The managers excuse was that they make it fresh... I said to leave the clump for my yelp review. I got 2 pieces of cheesecake to go and they were yummy. Overall I wasn&amp;#39;t thrilled. Over priced and not customer service oriented. I won&amp;#39;t return next Portland trip.", "rating": 3, "date": "7/3/2020"}, {"text": "My review is based specifically off of our experience. We obviously had a great experience. Excellent service, excellent drinks, and excellent food.<br&gt;<br&gt;We started with the egg roll sampler. Delicious! Our least favorite item on the platter was the chicken taquitos. They had a delicious avocado sauce that was sweet. I don&amp;#39;t even like avocados!  I ordered a Mai Tai and my fiancé ordered a dirty martini. She said they have the best blue cheese olives ever. Both drinks were great!<br&gt;<br&gt;For dinner I ordered the Louisiana chicken pasta. It was spicy and good and a huge portion. The chicken wasn&amp;#39;t dry and had a crispy coating to it. Delicious! The fiancé ordered the chicken Parmesan pizza. Holy cow! It was huge! And of course we got cheesecake to go. That never disappoints! <br&gt;<br&gt;Our server, Tess was amazing! Super friendly! When we go back we will specifically ask to sit in her section!", "rating": 5, "date": "2/6/2019"}, {"text": "Update to my last review. I was contacted by a manager who apologized for the mistake and acknowledged the lack of staffing. She was very nice and sent me a gift card for the cheesecake. I have now been back twice and the service was great and both my order were correct.", "rating": 5, "date": "9/18/2020"}, {"text": "So under the circumstances of this virus and trying to help out restaurants,  going here tonight was a huge mistake.  They didnt include French fries in one order, and their corn succatash tasted as if it was from the day prior and was cold. Very, very Disappointed when I called and spoke with a manager all he could say was sorry we are under staffed and then hung up on me. Do Your Job! No excuses.", "rating": 1, "date": "3/27/2020"}, {"text": "I definitely find Cheesecake Factory to be on the expensive side, but I am a sucker for their happy hour. My Friday night movie night has turned into Cheesecake Factory/movie night. They do get busy so it is good to get there before 6, especially on the weekend. The HH prices aren&amp;#39;t bad and they have good food. My favorite things on the menu are the southern fried chicken sliders, the tex mex eggrolls and the greek salad. I like how diverse the menu is, I haven&amp;#39;t encountered any issues during my visits and the cheesecake is AMAZING. It has been a nice addition to Clackamas Town Center.", "rating": 4, "date": "2/18/2020"}, {"text": "5 stars for the cheesecake but 3 overall.  The food is tasty enough but the prices are out of control.  <br&gt;<br&gt;I ordered a meal, the stuffed mushrooms, and three pieces of cheesecake.  It was 70$.  Then I tipped 10$ to my delivery driver.  <br&gt;<br&gt;The stuffed mushrooms - 6 total.  $8.50 for 6 tiny mushrooms.  You guys need Jesus.  <br&gt;<br&gt;The cheesecake was phenomenal.  The pineapple upside down cheesecake is always a good choice.  The white chocolate macadamia was good, but really rich.  <br&gt;<br&gt;After our last order and the Brussel sprout fiasco, (there were no sprouts it was just their leafy shells - we figured it had to have been a mistake) and now the mushrooms I think we&amp;#39;ll stick to cheesecake only from now on.  <br&gt;<br&gt;Their menu is huge - but bigger is not always better.", "rating": 3, "date": "12/25/2019"}, {"text": "saddest looking meal i&amp;#39;ve ever had. looks worse than those frozen meals in black contains and red boxes. my salmon was so tiny! the cheesecake factory, are you guys running low on salmon?? lol talk about rationing! <br&gt;so disappointed!!!", "rating": 2, "date": "8/17/2020"}, {"text": "Update 1/20/19: After revisiting the Cheesecake Factory I&amp;#39;m increasing my rating to a full 5 stars. Every time that I&amp;#39;ve been back, the service &amp;amp; food has been terrific. I love the Chicken Madeira entree. And how can you go wrong with the Korean Cauliflower, Avocado Wraps, or Fried MAC &amp;amp; Cheese apps! Don&amp;#39;t forget to take a slice of cheesecake home too! It&amp;#39;s the bomb! <br&gt;<br&gt;I&amp;#39;m caught between a 3-4 for this rating. The reason I bumped it to a 4 is because I know the restaurant just recently opened and they are still trying to iron out all the kinks. It took way too long for bread &amp;amp; drinks to arrive. The bar was backed up. Our server, Mark, was excellent! Below is a rating on our food items on a 1-5 scale with 5 being the best.<br&gt;<br&gt;Chicken Madeira: 4, only because it wasn&amp;#39;t piping hot when it arrived. Seemed like it had sat waiting for other dishes. Asparagus was slightly over cooked too.<br&gt;<br&gt;Chicken Fettuccine Alfredo: 5, Rich &amp;amp; Creamy<br&gt;<br&gt;Orange Chicken: 5, Delicious!<br&gt;<br&gt;Chicken Romano: 3, slightly cold &amp;amp; hardly any sauce <br&gt;<br&gt;Thai Coconut Chicken: 3, flavor was good, way too spicy and menu said nothing about &amp;#34;heat&amp;#34; for this dish.<br&gt;<br&gt;We will be back, but will likely wait a month until things are running more smoothly.", "rating": 5, "date": "1/20/2019"}, {"text": "This is my favorite restaurant. Its consistently delicious no matter what I order. Food is fresh, great service.", "rating": 5, "date": "9/29/2020"}, {"text": "My wife and I tried this chain restaurant for the first time and were disappointed overall.<br&gt;<br&gt;The ambiance and service was fine - no complaints there.  Despite their huge menu, it was somewhat difficult to find something that sounded truly delicious; most of it was just different variations of chicken and pasta.<br&gt;<br&gt;We settled on drinks and an app to start: a pineapple moscow mule, a whiskey smash and the chicken pot stickers.  My whiskey smash was tasty but my wife&amp;#39;s moscow mule was anything but.  I realize that a &amp;#34;pineapple&amp;#34; moscow mule already ins&amp;#39;t traditional, but it wasn&amp;#39;t even served in the normal chilled copper mug that most mule&amp;#39;s are.  Also, the bottom of the glass was warm like it had just come from the dish washer.  The pot stickers were tasty enough and presented well, but the sauce would have been better on the side so each person can get the amount they want.<br&gt;<br&gt;My wife finally decided on the shrimp (jambalaya? don&amp;#39;t remember exactly) on their lighter-fare menu, while I got the Chicken Bellagio.  She liked her dish, even if it was a bit spicier than advertised.  When mine arrived, I was immediately surprised by the portion - it was enough for 2-3 people to split!  The presentation and plating was also odd.  The pasta on the bottom was not properly tossed in the sauce.  The chicken was on top of the pasta, which made it harder to cut because then you&amp;#39;re also cutting the noodles.  Then atop the chicken was an arugula salad inside a circle of prosciutto.  The was no dressing on the &amp;#34;salad&amp;#34;, so it was dry arugula.  the prosciutto was extremely difficult to cut and the whole thing was confusing.  I ended up scraping off the prosciutto and most of the arugula, but some of it ended up with the pasta which made for an odd texture.  The actual taste of the chicken and pasta was good, but not amazing.<br&gt;<br&gt;I ended up getting a cheesecake to-go, which was really good.<br&gt;<br&gt;I&amp;#39;d go back for dessert but the actual meal was underwhelming, overpriced and over-sized.  I&amp;#39;d say Olive Garden has equally or better food at more reasonable prices.", "rating": 2, "date": "9/3/2019"}, {"text": "Large menu reads like a road atlas. Many styles to choose from. Keto and vegan friendly. Kid friendly, too. All this under a weird amber glow. Crowded, but got a table in less than 15 minutes. Good selection of house cocktails, wine, beer paired with appetizers, small plates, full dinners, and kids menu. Oh.....and cheesecake. $30 to $50 for a 10&amp;#34;. Wow. Very wallet friendly with a family of 5, including teenagers.<br&gt;Sorry, I was so busy eating, I didn&amp;#39;t notice if they had Wi Fi.", "rating": 4, "date": "11/11/2018"}, {"text": "We ordered at 2pm for a 7pm curbside pickup. I had called and confirmed with the afternoon manager the online ordering. The order was accepted but when we arrived they had no order. Pretty frustrating. In the time it took to check all sources the manager could have taken our order to get it taken care of. No offer .  Lots of excuses. Manager went to check one last resource and never came back", "rating": 1, "date": "12/4/2020"}, {"text": "07/06/19:  3.0 out of 5 - It was my first time to The Cheesecake Factory (TCF) restaurant in Clackamas/Happy Valley area.  Now the last time I was at any Cheesecake Factory was well over 15 years ago...maybe even 20 years ago in Southern California.<br&gt;<br&gt;My Father-in-law wanted to go to TCF with the family.  I just happen to be, in a sense, collateral damage in this decision.<br&gt;<br&gt;As a fair warning, don&amp;#39;t expect to be seated right away on a Saturday and with more than 6 individuals in your party.  The host(ess) told us there would be a 50 minute wait, and this was at 8pm.  You&amp;#39;ll get a little buzzer thing that has a very, very short range.  So, don&amp;#39;t go to far...better yet, don&amp;#39;t go sitting outside.<br&gt;<br&gt;So come 9:25pm TCF finally sat us because they were waiting for a particular booth to open up, which we stated we would rather have a table to make it easier for the elders.  It was apparent, one of the host(ess) wasn&amp;#39;t listening to our request.  Another host understood our frustration and quickly tried his best to get us into a table.  His actions and level of service alone bumped my review up a star.<br&gt;<br&gt;After being resituated to a table that was suitable, it took another 12 minutes for being addressed by our food service person, followed by another 5 minutes for water and bread, and then followed by a few more minutes to get our drinks and dinner order in.<br&gt;<br&gt;Food came out, and it was okay.  My Father-in-law and I had the Rib Eye Steak dinner, my wife had the Shrimp Scampi, Mother-in-law had some sort of Chicken with Ribbon pasta, sister-in-law had something... can&amp;#39;t remember what it was, brother-in-law had a pork chop dinner, and the nephew had fish and chips.  <br&gt;<br&gt;Later, my Father-in-law wanted us to get desserts.  I shared my Tiramisu, which wasn&amp;#39;t bad.  Kudos to that!  We practically all left close to midnight...not quite how we wanted spend our evening.<br&gt;<br&gt;The food, for what you pay for it, was just not up to measure.  It could have and should have been better for TCF and for the price.  <br&gt;<br&gt;To be honest, TCF rides on the looks of the establishment, which is nice for most restaurant standards, but, although it is out of the staffs control, the noise level is at an ear ringing decibal...sorry I didn&amp;#39;t order tinnitus with my dinner and dessert.  The food is okay.  The staff was okay with the exception the one host and our food service person.  There&amp;#39;s definitely room for big improvements.<br&gt;<br&gt;So, one question I often ask myself is, &amp;#34;Would I go back?&amp;#34;  I suppose some day I may be collateral damage again, but I would prefer not to.<br&gt;<br&gt;Don&amp;#39;t take my words for it though.  If you had never tried TCF, then I would end this review with this, try it once and decide for yourself.<br&gt;<br&gt;Enjoy!", "rating": 3, "date": "7/7/2019"}, {"text": "Always such a great time! pricey but the portions are HUGE and the desserts are always delicious. they have a big menu with every kind of food you can want. great place for the family or date night. i recommend getting their pasta.", "rating": 5, "date": "2/5/2020"}, {"text": "I got pick-up and at one point I had my cheese cake slice upside down and somehow it&amp;#39;s still almost like it was just sliced off the cake", "rating": 5, "date": "9/9/2020"}, {"text": "Avocado egg rolls, good. Hazelnut crunch cheesecake, really good. If you&amp;#39;re wondering if the $10 slice of cheesecake with a bazillion calories is large enough to split, it is. We split it between two of us and still saved half for the next day. It was rich but delicious and the size made the price tag seem reasonable. <br&gt;We had food delivered, so can&amp;#39;t speak to service, but did appreciate the complimentary assorted breads that were sent with our order of an appetizer and dessert. The eggrolls were also presented in the container really nicely, I think replicating how they would have been served in the restaurant, which was a nice touch. <br&gt;When COVID is no longer a concern someday, I look forward to visiting this restaurant in person. I can tell they put care into our small order, so I would imagine dining in person to be at least as, if not more, enjoyable.", "rating": 5, "date": "9/6/2020"}, {"text": "We came here after i finally got paid from my new job. My wifr is starting a diet so what better place to over endulge before it starts. <br&gt;<br&gt;We got here and were seated right away. We got their signature strawberry lemonade (very good) and then they took our order. I got the bbq burger with sweet potato fries and she got the herb crusted salmon with mashed potatoes. We then got our complimentary bread. That was pretty good too.<br&gt;<br&gt;When our food came out i really wanted hers lol. Don&amp;#39;t get me wrong my burger was amazing. I would highly recommend it. My order came out with the wrong fries and it took them until i was almost done with my burger until i got my sweet potato fries. Once i got The sweet potato fries they were overdone and tasted funky. I only ate 1. I waited all that time for nothing. Pretty disappointed. <br&gt;<br&gt;My wife loved her food and let me try the salmon. It was way better than that burger. <br&gt;<br&gt;The service was alright. The fries took a while to come out. I was out of lemonade for quite a while and it took a while to get our cheesecake that we could see just sitting on the shelf.<br&gt;<br&gt;Although they were worth the wait. I got the red velvet and she got the strawberry cheesecake.<br&gt;<br&gt;All in all good experience. There were a number of issues but easily could be a 5 star with some polishing.", "rating": 3, "date": "6/17/2019"}, {"text": "I just came back from this establishment, and I have to say I&amp;#39;m quite impressed. My sister had the Thai salad, I had the Cajun jambalaya pasta, other sister had shrimp bistro and the kids had Mac and cheese. The Thai salad was delicious! Tastes as close as my moms Thai salad just missing the eggs. The jambalaya pasta needed a little more seasoning but other wise pretty good and a good big portion. The Mac and cheese was very good I almost ate all my daughters food before mine came out. I have to add the waitress was wonderful. Overall if I didn&amp;#39;t have a screaming toddler with me it would of been a great time!  Thank you Cheesecake Factory!", "rating": 4, "date": "8/1/2020"}, {"text": "Came here for a birthday party of 7. The waitress decided to seat us in a booth where surrounding booths had at most 4-5 people in one booth. We asked for a table, and we were told to ask the front desk. We did. They told us to wait- so we waited at the booth they originally gave us, a different waitress comes by tells us to wait at the front. We go to the front, another waitress comes by and tells us our table is ready. It seemed like a hassle for us just to get a table, nonetheless, we were seated and given water promptly. The waitress gives us bread to start with and then comes back and takes our order timely. <br&gt;<br&gt;We waited about 30 minutes for our food without anyone checking on us until near the end, asking if we wanted more bread. <br&gt;<br&gt;We finally received our food. I ordered the Cajun jambalaya pasta. It was very bland and the shrimp to pasta ratio was about 1 shrimp:3 bites of pasta. In total of about 5 shrimps. So if you want some shrimp with a bite, make sure to take 5 bites of pasta before consuming any shrimp or you&amp;#39;ll be left with just pasta.  <br&gt;<br&gt;The free &amp;#34;sundae&amp;#34; they had provided was just whip cream with a candle on top- for a fair warning. It&amp;#39;s free though, so I guess you can&amp;#39;t complain about a dish full of whip cream. <br&gt;<br&gt;Overall, food was bland, service was subpar but I read reviews prior to coming in and i set the bar a little lower than I usually do. Still giving this place a 3 star for food taste and subpar customer service.", "rating": 3, "date": "6/26/2018"}, {"text": "What a terrible visit we had on 2/8/20.  The grill was not working at all so many items from the menu were not available.  <br&gt;<br&gt;We ordered the avocado egg rolls which we always order as an appetizer.  They took 25 minutes to arrive and there was something off about them they did not taste nearly as good as they usually do.<br&gt;<br&gt;Our meal took 45 minutes to arrive.  I guess they were just having an off day.<br&gt;<br&gt;The only thing that was really good that day was the cheesecake which we took to go.", "rating": 2, "date": "2/16/2020"}, {"text": "People in the Portland Metro area really seem to hate chains. I don&amp;#39;t. I love them. I&amp;#39;m not sorry. :-) <br&gt;<br&gt;I actually really enjoyed my dinner here. The price for my Parmesan crusted chicken was $18.50 which was more than I was hoping to spend, but it was actually delicious and you&amp;#39;re really going to find these same prices all over Portland. Our waitress though, she was amazing. I couldn&amp;#39;t even finish my Diet Coke before she grabbed the  glass to refill it. She consistently checked in with us and was good at what she did. <br&gt;<br&gt;The best part is there is something here for everyone. I mean everyone. And to boot, they have like 50 desserts to choose from. <br&gt;<br&gt;Two meals, fountain drink, beer, and desert was around $60 with a tip. I&amp;#39;ve paid more for worse food, honestly. Not mad.", "rating": 5, "date": "5/19/2019"}, {"text": "I called to order two cheesecakes for a pick up and the hostess asked me to order online. I was in the middle of  running errands and asked if I could just over the phone since it&amp;#39;s still accepted and I had them on the line. The hostess was so hesitant and responded with &amp;#34;I guess.&amp;#34; He said he didn&amp;#39;t want to have to walk back and forth since they don&amp;#39;t take cards over the phone. I told him I was walking in and then he gladly took my order.", "rating": 1, "date": "10/14/2020"}, {"text": "Don&amp;#39;t order ribeye steak the worst steak ever it&amp;#39;s 1<br&gt;/2&amp;#34; before  the grille I&amp;#39;ve ordered medium not knowing the cut is so thin when I got it that thing it was a pice of over cooked dry jerky almost of course got a replacement a bit thicker I would say 3/4&amp;#34; medium well not my stile. Can&amp;#39;t say about other meals on the menu but yah don&amp;#39;t get steak", "rating": 1, "date": "1/31/2020"}, {"text": "I placed my cheese cake with strawberries order to be picked up today (5-10-20) at 12:30pm, my text that it was ready came at 1:30pm, I waited in line for one hour to pick up my cheese cake at 2:30pm and when I arrived home the strawberry was not in the package. <br&gt;They had ONE person outside handling all the orders, whoever was inside did not package the order correctly, the management failed and I will not give my business to the Cheese Cake Factory ever again.", "rating": 1, "date": "5/10/2020"}, {"text": "My boyfriend and I were excited to have a regular date night again after so long and we had a great time. We made reservations through yelp and were alerted when our table was ready for us. Our drinks and appetizers came in just in time and our service was great. Glad to see social distancing measures implemented in this facility. It made us feel more comfortable. Food was amazing too", "rating": 5, "date": "6/17/2020"}, {"text": "Super friendly and prompt server. <br&gt;Good food. <br&gt;Big portions. <br&gt;Great dessert. <br&gt;<br&gt;I&amp;#39;ve always loved The Cheesecake Factory and I was really happy when they put in this location. <br&gt;<br&gt;We came in for dinner and we were very quickly seated. The hostesses at the door weren&amp;#39;t the friendliest but I&amp;#39;ve come to realize that&amp;#39;s kind of the MO of a lot of hostesses in these type of restaurants. She sat us at a little tiny table squished in between 2 larger tables. It&amp;#39;s not the most comfortable place to sit my 6&amp;#39; 4&amp;#34; husband and there&amp;#39;s almost no table space once they serve the small bread basket and butter. We asked to move to one of the tall bar tables that were immediately behind us. <br&gt;<br&gt;Once we switched tables we were greeted by the friendliest server I&amp;#39;ve had in a long time, Kellen. Not only was he friendly and pleasant he was very quick to serve our drinks and bring us our bread and appetizers. <br&gt;<br&gt;We tried the tortilla soup, which I wasn&amp;#39;t a big fan of and the soft pretzels with cheese, to start. The soft pretzels were amazing! I&amp;#39;d come back just to order those any day! We ordered the chicken littles and the new orleans pasta for our entrees. Both were good and served in big portions. I personally think the mashed potatoes is one of the best things in the dinner menu! So good! <br&gt;<br&gt;For dessert we ordered to-go boxes of the key lime cheesecake and the snicker cheesecake. The snicker one was just average but the key lime was top notch!! I&amp;#39;ll be getting that again. <br&gt;<br&gt;Overall, our server &amp;amp; key lime cheesecake definitely earned the 5 stars here. Between the hostesses and dinner entrees I&amp;#39;d have rated just a 3 star, at best. CCF is definitely worth a try though and be sure to order those soft pretzels!", "rating": 5, "date": "4/27/2019"}, {"text": "If i could give this experience half a star i would. Every other time i have been to this location ive loved my experience. But today was just bad. The pasta noodles were nothing like what i asked for. We waited over an hour for our food. Our drinks didnt get refilled a single time. Overall it sucked. Which sucks because i almost went to olive garden instead. I shouldve. ‍", "rating": 1, "date": "6/29/2020"}, {"text": "This was a horrible and overpriced meal.  The brussel sprouts had no flavor or bacon.  The green beans tasted like they were out of a can.  The filling in the potstickers was mystery meat, and the orange chicken and cashew chicken was drenched in grease.  All the food must have MSG given how we feel.  They would have received 1 star, but the Godiva chocolate cheesecake is pretty good.  Don&amp;#39;t waste your money or your health here.", "rating": 2, "date": "4/16/2020"}, {"text": "If you have a big group I would definitely not recommend this place. The lady at the check in was a total &amp;#34;b&amp;#34; and had an attitude since the start when we asked how long the weight was. Definitely won&amp;#39;t be returning to this place in the future. This place definitely gets a  for service.", "rating": 1, "date": "6/15/2020"}, {"text": "Had the worst experience ever at this cheese cake factory. First we had really bad service trying to order our food inside. We stood there for 10 minutes and no one said a word to us. Just ignored us. And come to find out that the main person that ignored us was the manager. Second we get out take out and everything is burnt. There is barely any bread, there is no silverware or napkins. Bored.", "rating": 1, "date": "6/14/2020"}, {"text": "This is a great place. The portion sizes are very large, so expect leftovers. Aside from that, it&amp;#39;s quite yummy. They have plenty of room for a big party, but you can have an intimate setting too. This is probably the best restaurant in the mall. <br&gt;<br&gt;They have a really wide variety of things to get, everything from Asian to Itallian, to classic American. You can get just about anything you want to. But make sure you leave room for dessert. They aren&amp;#39;t the Cheesecake factory for nothing. The cheesecake is really very delishious", "rating": 4, "date": "3/3/2018"}, {"text": "I want to first off start by saying I do love the Cheesecake Factory, and have enjoyed going there for a good amount of time. The reason I&amp;#39;m giving this restaurant 3 stars is because of their inconsistency. Each time I go the staff is always very friendly and willing to answer any questions and even verify if necessary. Recently whoever the chef was made the food very hit or miss taste wise. I always get the same meal which is the wellness salad and the last time I went they didn&amp;#39;t even bother to cut the broccoli florets. The food has seemed to become less and less good which is disappointing because I have always enjoyed going here. One other thing I don&amp;#39;t quite understand is each time I&amp;#39;ve went the waitresses have said different things about whether or not some of the food I&amp;#39;m getting or my sisters getting is vegan, which is really concerning on our end, because it has made us sad that we can&amp;#39;t really trust what they say when the answer seems to be different each time. Not only this but the most recent time we went they charged us extra for bread to go! It&amp;#39;s not like we got a whole loaf we just wanted a couple slices to go which are supposed to be free throughout the visit. I honestly probably won&amp;#39;t go back very often because of the inconsistency.", "rating": 3, "date": "2/24/2020"}, {"text": "Still one star guys.  We showed up and were told a hour wait.  After 45 minutes of waiting I asked how much longer and was told at least an hour and a half.  We left.  All you had to do was take a name and number of people over the phone.  Great customer service!!  I&amp;#39;m not logging in to whatever site you want me to go to, it won&amp;#39;t make a difference as I&amp;#39;ll never go to any cheesecake factory again!  Probably should hire a manager that knows how to manage.", "rating": 1, "date": "9/29/2020"}, {"text": "We visited the Cheesecake Factory in Clackamas town center for the first time. Wait was 1 1/2 hours due to covid policies and busy time which is still not bad in my opinion considering there is usually a wait list. Amy was our server and she was awesome! Extremely attentive, she checked on us frequently, and was very kind and professional. Amy was wonderful! Food was decent, cheesecake was lovely", "rating": 5, "date": "9/26/2020"}, {"text": "Such as a good time for dinner here! They welcome us with a professional way. Great staffs and good price!<br&gt;I also like the decoration inside. It looks so fancy and special!", "rating": 5, "date": "4/8/2019"}, {"text": "Covid concerns<br&gt;Our server was good and our food was also good crab dip dinner salads shrimp jambalaya. However I had to return to my car from outside seating as I forgot my wallet. When I left the outside seating area I noticed a man in a white apron sitting on almost in the trash compactor. When I returned I came in the same way and he was still sitting in filth. I informed our server and we walked over to see the employee he jumped off of the trash compactor and scurried inside. I asked to talk to the manager he was very unprofessional and did not seem concerned as he played it off as it was probably a dishwasher. His lack of concern and lack of appreciativeness for us informing Him   It made us more concerned about the safety of the food coming from this kitchen. I don&amp;#39;t feel any employee should be sitting on the filth you could see on that dumpster from 50 yards away.  He also replied we do not have a break room because of COVID-19 and I stated surely there is a better place to take a break and sitting on almost in a filthy trash compactor then returning to a kitchen where my food is being prepared it may sound paranoid but I will spend the next two weeks wondering whether my food was virus free I would appreciate a response to this concern", "rating": 2, "date": "9/21/2020"}, {"text": "Cheesecake factory is reliable, that&amp;#39;s for sure. The food is always great and, of course, the cheesecake. So, the 3 star rating isn&amp;#39;t for the food, it was the service from the kitchen. While our server was attentive and prompt to take our order, it took over 30 minutes to get our dinner. Dessert was much quicker (since everything is in the case), but with so many great restaurants at and around the mall, I wouldn&amp;#39;t recommend this one during the dinner hour unless you&amp;#39;re not immediately hungry.", "rating": 3, "date": "8/17/2019"}, {"text": "First of all, we didn&amp;#39;t know there was one here in Clackamas Shopping Center! We thought we&amp;#39;d try it out.  <br&gt;<br&gt;This was our first time at this location. D H had the Steak Diane: Medallions of Steak Covered with Black Peppercorns and a Rich Mushroom Wine Sauce. Served with Mashed Potatoes and Grilled Onions.  I had a Cream of Chicken Soup, since this was the only thing I wanted today, our waiter recommend I get the cup &amp;#39;it will be big almost the size of a bowl&amp;#39; and I did.  I asked him, if it came with some crackers or bread, he said he could bring me sourdough, but I don&amp;#39;t like that, but he was gonna bring us bread &amp;amp; butter anyway, so I settle with that. And we split a house salad. <br&gt;<br&gt;The food was all wonderful. We had two types of bread, that he said, &amp;#39;just came out of the oven&amp;#39;.  They&amp;#39;re what reminds us about Europe, and the room reminds us of Europe.  No matter where we were in Europe: a simple bread &amp;amp; soft butter always made us dream &amp;amp; wonder everything around us, make for everything so relaxing &amp;amp; pleasant! (or that it was just about my husband and I falling in love all over again? not sure, but . . .the environment in the room, with all the &amp;#39;happy birthdays&amp;#39; going on, we&amp;#39;re feeling good vibes around us)!  Note:  The chicken was so tender, I thought I was eating salmon!<br&gt;<br&gt;BTW: our handsome American/Asian host told us the wait will be 15 mins. but we ate @ the bar side.  I&amp;#39;ve figured only the handsome people get to work as host! AND college students!<br&gt;<br&gt;Our server was exceptionally good, came back for each dish to ask us how our foods were. We had a take out Chocolate Hazelnut Crunch Cheesecake, we had that for lunch the following day! My 10 months old grandson got to enjoy a few tiny bites, too.  YUMMY!<br&gt;<br&gt;I like the idea of more bathrooms here, nice &amp;amp; clean, toilets flushes as soon as you get up (unlike the last restaurant we went to in Vancouver), and much much better!", "rating": 4, "date": "10/9/2018"}, {"text": "Trendy. Inconsistent. Solid wait staff. Our group had a Caesar Salad, chicken teriyaki, nacho, and fettuccine. $18.50 for a salad, what the heck. My buddy could not finish his chicken because of bad taste and texture. The Nacho was decent. The fettuccine was simple, to simple for the price. We went here because my buddy liked the chicken he had last time. The host, servers, and support staff were excellent. I won&amp;#39;t go back for the food. To many other great places. I would go back for the service though.", "rating": 2, "date": "8/11/2019"}, {"text": "I&amp;#39;ve been to multiple Cheesecake Factory locations and this particular location is by far the WORSE.<br&gt;My girlfriend and I have been to this location multiple times for different occasions and they have failed to win us back over and over again. <br&gt;One occasion, food came out cold and burnt. (They flipped the salmon upside so it wouldn&amp;#39;t reveal the burnt side.) <br&gt;Another occasion was for a birthday (party of 5), the food took 1hr, our waters were never since the beginning of our visit, the list goes on. <br&gt;They&amp;#39;re unprofessional, SLOW, not consistent. <br&gt;Not worth the money at all.", "rating": 1, "date": "5/19/2019"}, {"text": "It&amp;#39;s hard to believe that a chain restaurant could have such amazing food whether you&amp;#39;re coming for breakfast, lunch, dinner, or dessert, but somehow The Cheesecake Factory manages it. Their menu is a cazillion pages long. So far, I haven&amp;#39;t tried something I don&amp;#39;t like!<br&gt;<br&gt;My favorite cheesecake was made with peanut butter. And as I ate my piece of cake, I felt so sad for all of the Europeans who don&amp;#39;t get to experience peanut butter like we do in the US! <br&gt;<br&gt;Their breakfast burrito is so so good. It&amp;#39;s expensive (all their food is expensive) but it&amp;#39;s so darn delicious and filling!", "rating": 5, "date": "10/17/2018"}, {"text": "I went in with my friend for a late lunch &amp;#39;James&amp;#39; our server was absolutely a delight, he is a very nice man, attentive, clear and knowledgeable about the menu.<br&gt;Definitely will be going back for the Carne Asada.<br&gt;And the banana cheesecake it was perfect.", "rating": 5, "date": "8/25/2019"}, {"text": "Our 1st time here was great! The ambiance is great! Kellen, our server was on point and friendly. Dinner (tuna poke and mushroom burger)was good and the cheesecake (fresh strawberry &amp;amp; dulche de leche)were sooo good!<br&gt;<br&gt;Will cone back.", "rating": 4, "date": "10/13/2018"}, {"text": "Came only for happy hour on National Cheesecake Day. Not sure if all days are busy like this place definitely needs more staff, waiters that is. The greeter was confused and we waited for a while for the food, check, and waters. Anyways the key takeaways for the food was that the crab dip was the only thing worth getting. The rest are average. The complimentary bread was good. The calimari and chicken tenders which are on the regular menu was good for my taste.", "rating": 3, "date": "8/5/2018"}, {"text": "We picked up food on 8/24/2020 while we were at the mall. Surprise! The calamari was the best we&amp;#39;ve ever tasted and the other food was delish as well (salmon, Thai lettuce cups, Cobb salad). The food here is so good that it&amp;#39;s well worth the drive from WA even when you&amp;#39;re not going to the mall. Highest recommendation.", "rating": 5, "date": "8/25/2020"}, {"text": "Cheesecake Factory has its own unique appeal. Epic sized portions, the smell of butter fogging up your eyes and lots of menu options.  Stopped by for a late lunch, was seated promptly with very gracious staff.  The order consisted of happy hour items, avocado spring rolls, fried shrimp, tuna tartar, burger sliders, bistro shrimp pasta and burgers.  Sounds like a lot and it was  the flavors were familiar for this franchise. Fried items with dense strong flavors of oil butter and cheese. The dipping sauces were amazing.  Fries weren&amp;#39;t fresh, a bit stale.  Tuna tar tar didn&amp;#39;t have much flavor and Pasta dishes were good but could have been better is pasta was cooked al dente.  The bistro shrimp would have been better with sautéed shrimp instead of fried. The server at our table was truly amazing. She was courteous and attended requests very quickly.  5 stars  for her! she delivered a birthday sundae which was a nice touch. Overall a very pleasant dining experience.   The food is good but don&amp;#39;t compare it to an authentic Italian restaurant or artisanal burger joint. It&amp;#39;s a bit sad because all the ingredients are there, just needs the culinary expertise to level up.  The cheesecake of course steals the show, always decadent.  I think if you have a large group there&amp;#39;s a ton of options to satisfy everyone.<br&gt;<br&gt;To the manager who replied. On the contrary we were impressed by the service and the food was excellent. I was only citing comparisons to pasta and fried items prepared to a crispy texture.  Other than that y&amp;#39;all nailed it", "rating": 4, "date": "5/23/2019"}, {"text": "The service here (at the bar)  wasn&amp;#39;t very good and the kitchen didn&amp;#39;t put any silver in my to go dessert order. WTF, am I supposed to eat cheasecake with my hands?<br&gt;<br&gt;Once I closed my tab, I was invisible to the bartenders and couldn&amp;#39;t even get their attention to ask for some to go silver.<br&gt;<br&gt;While dining alone,  I still tend to have a large tab and tip very generously. I guess the staff here don&amp;#39;t care.", "rating": 3, "date": "2/29/2020"}, {"text": "Updated review.<br&gt;So this time just my husband and I went and we were seated immediately. The server was extremely attentive and on point so that was very nice. The food itself is good. Feel like everything is very consistent but it isn&amp;#39;t a wow factor. If you&amp;#39;re looking for a good meal at a reasonable price this is definitely a reliable place to go. I had a crispy chicken and shrimp, it was supposed to be a sweet and fiery sauce, but there was only sweet and it overwhelmed every bit of the dish. If the sweet was more subtle was and and some real heat added I think the vegetables would&amp;#39;ve had a chance to stand out. Since it is shrimp and chicken they were cooked separately and then combined in the dish. My shrimp itself was cooked perfectly but the frying was uneven and doughy raw in parts. The chicken was bland and unseasoned.<br&gt;My husband had the chicken enchiladas,  It is a pretty dish to look at, the beans still had some meat to them so they were good did you want, the rice is left really crispy almost like they re-Fried before they serve it which is surprisingly good. The enchilada sauce appear to be taken and have a good consistency but again the sweetness over took it. I&amp;#39;ve never had a sweet red sauce, the enchiladas have corn and that only adds to highlight the sweetness.<br&gt;<br&gt;Original:<br&gt;I wish I could post some glowing review with photos but we were given a 3  hour wait for our group of 10 on a Thursday night. Cheesecake Factory will not accept reservations. We sent someone in an hour early to hold our spot and 1/2 way through our 3 hour wait we changed our request from 10 folks to 8 and the manager told us it makes no difference because this location is smaller than Washington square and only has 3 &amp;#34;larger&amp;#34; tables. Parties of 2 are the ideal customer for this locational they were being told only a 20 minute wait. Cheesecake Factory will not combine along 3 small tables for 2 in order to create a space for 8.", "rating": 3, "date": "6/2/2018"}, {"text": "First off, food was amazing! Our server Kelly took care of us and explained everything in detail. Even when some food came out differently than intended he didn&amp;#39;t miss a beat to correct it and make us feel as if the mistake never happened. We will be back not just for the delicious food but the phenomenal service to servers like Kelly. Great job!!", "rating": 5, "date": "2/24/2020"}, {"text": "The service was fast, friendly and thorough, and the food was well prepared. My bf and I used to go to the Waikiki location often when we lived there, when we moved to San Diego we were disappointed and haven&amp;#39;t gone back to cheesecake factory in awhile. But the Happy valley location did not disappoint!", "rating": 5, "date": "11/30/2019"}, {"text": "Great variety of cheesecakes. Never wait long for service. Huge menu of variety of choices.", "rating": 4, "date": "2/22/2020"}, {"text": "Daniel, the bartender, was quite literally the best bartender I&amp;#39;ve ever had in my life. My lady and I came in late night, last night (02/18/2020), and the service was impeccable. Being in the industry myself, I tend to scrutinize even the smallest of mishaps, never report them just notice them during my personal experience. My man, Dan, was simply on point. Great recommendations, he recommended drinks, an app, an entree, and a dessert and we bought every single one, and they were all on point. Thanks Dan, we&amp;#39;ll be back!", "rating": 5, "date": "2/19/2020"}, {"text": "This place is awful!!! Only 4 pieces of shrimp when your paying how much!! And barely any sauce! Do not go here. We did take out and they even went way passed the time even when i ordered it 3 hours before.", "rating": 1, "date": "4/22/2020"}, {"text": "Great food and convenient location. This is a family favorite restaurant. The service has always been top notch. The food is excellent.", "rating": 5, "date": "12/30/2019"}, {"text": "I was told to wait for 1hr 15 for a party of 9. It was past that time and waited a total of 2hrs because the host said that another party was still using the table and were still talking. She said half of the party was still seating their and talking. People were getting seated before us and never was I asked if we could get accommodate differently. The Cheesecake Factory should start doing reservations to accommodate families.", "rating": 1, "date": "12/14/2019"}, {"text": "I&amp;#39;ve been going to The Cheesecake Factory for years and this time I chose it as my $100 tip night during my week of giving. I only do this if the service is good and it was great!  We had Melissa T, who I&amp;#39;ve had before and she always rocks it!  Fast, polite and with a smile!  Food was awesome. I stick with the chicken picatta. She also recommended the banana cheesecake which was amazing!  Keep up the good work Melissa and I hope you pay it forward!", "rating": 5, "date": "12/11/2019"}, {"text": "We are from out of town and stumbled upon this location. It was our Anniversary and we had an amazing dinner here. It was super busy but the service was great and the food was beyond delicious ! I had chicken costoletta and hubby had chicken bellagio . Our cheesecake was the best we had ever eaten.", "rating": 5, "date": "11/11/2019"}, {"text": "I ordered delivery tonight through door dash and the delivery people were very nice!  I ordered the Chinese chicken salad.  The first salad to arrive was only lettuce, rice noodles and dressing.  I contacted door dash and they reordered for me.  The second delivery had all of the vegs and crunchiest, but once again no chicken.  I don&amp;#39;t know if the restaurant is out of chicken or they are letting me know I should be a vegetarian.  Either way very disappointed!!", "rating": 1, "date": "5/28/2020"}, {"text": "This review is strictly for the Cheesecake! <br&gt;<br&gt;Discovered that I could place the order online and have it ready for me when I waked in. That is awesome because the worse thing about Cheesecake Factory is waiting for your order to be ready. <br&gt;<br&gt;The website was easy to navigate and there was an option to pay at the store so I didn&amp;#39;t have to enter my CC info online. Great options, fantastic Cheesecake, and always friendly service.", "rating": 4, "date": "4/15/2018"}, {"text": "Worst place ever, food is fine costumer service is horrible. Rude people who don&amp;#39;t care about the guest dining", "rating": 1, "date": "6/29/2020"}, {"text": "Bad service. Waited over an hour to get a table, than about another 45 minutes for a tiny soggy pizza &amp;amp; burger that was so sloppy... He ate half the burger &amp;amp; was done. I had returned the pizza &amp;amp; was only charged for the 15$ burger.. Place is a joke &amp;amp; waste of time.", "rating": 1, "date": "6/27/2020"}, {"text": "Honestly, based on all of the BAD reviews that I read upon coming... I didn&amp;#39;t expect a whole lot. My standards weren&amp;#39;t very high. Also, I thought the food probably wasn&amp;#39;t going to be that great because it&amp;#39;s a restaurant chain. Usually, I try to stay away from big food chains because the quality or flavor isn&amp;#39;t usually that great. To my dismay, I was quite happily surprised. <br&gt;<br&gt;My boyfriend&amp;#39;s parents got us gift cards to this place so we wanted to put it to good use. When we first walked in, it took a few mins to get greeted by anyone. But it didn&amp;#39;t take long for us to be acknowledged and seated right away. It wasn&amp;#39;t very busy. The servers are friendly and provide great service. Everyone we encountered were very prompt and attentive. We appreciated that very much. The ambiance is delightful. Romantic, dim lighting, and the noise wasn&amp;#39;t too loud. <br&gt;<br&gt;I always do my research before going anywhere new. I checked out the menu to see if they had offered Vegan options. They literally have a MENU BOOK! Lots &amp;amp; lots to choose from. It was a little overwhelming at first. <br&gt;<br&gt;They have something for everyone whether you&amp;#39;re vegan, gluten intolerant, pescatarian, love your steak, chicken, pork, etc. Everything sounded delicious! It was hard to choose, but we managed to narrow it down to the Avocado Egg rolls, Evelyn&amp;#39;s Favorite Pasta, and the Diane steak &amp;amp; Crusted Herb Salmon Combo. We were blown away by how good tasty everything was. We finished our plates lol.  The flavors were on point! The food came out at a very timely manner as well. Huge plus! Can&amp;#39;t wait to go back!", "rating": 4, "date": "1/10/2018"}, {"text": "Today Mother&amp;#39;s Day was not a good experience Cheesecake Factory I had it confirmed 12:30 p.m. pickup for a cheesecake at 1:30 I was text cheesecake is ready I&amp;#39;m waiting in line to pick up the cheesecake  its 1:50 not good", "rating": 1, "date": "5/10/2020"}, {"text": "So unhappy!  First, we waited two hours.  We were told 1 to 1 1/2.  Okay, I get that.  Can&amp;#39;t push people out the door..  but we were told multiple times that there were two people in front of us or that a table was being cleaned for us..  anyway, finally got seated.<br&gt;<br&gt;Ordered drinks, then ordered food.  Waited about 10 minutes while noticing that the table next to ours (seated AFTER us) was eating bread..  from previous visits to other locations, we knew we normally got bread.  Had to ask the server then she explained it was baking.  Okay, we&amp;#39;ll wait...<br&gt;<br&gt;Got our food..  husband ordered steak tacos without cilantro.  Menu said they came with tomatoes, avocado, rice and crispy onions.  His had only steak and some crispy onions, some marinated onions.  The rice that was served with it was green (cilantro rice, not mentioned in the menu).  To top it all off, everyone&amp;#39;s food was cold, especially my husband&amp;#39;s!<br&gt;<br&gt;Asked for a manager and when he finally got to our table several minutes later, he was apologetic and explained that what actually comes on the tacos is PICO DE GALLO and GUACAMOLE, both of which have cilantro in them.  He also told us about the CILANTRO rice.  He did get a new meal made for my husband, but it took at least another 20 minutes to get it, after the rest of the table was completely finished.  AND.. the fries were cold!<br&gt;<br&gt;I get that this place just recently opened.  Obviously lots of kinks to work out.  But we ended up being there, between waiting to get seated, waiting for our cold food (first round) and cold food again, it was close to four hours and almost 11 pm!  Manager did not come back to check on my husband&amp;#39;s replacement meal.  He did comp my husband food, but nothing else.  I feel like we should have at least been offered dessert!   We won&amp;#39;t be back for quite awhile!", "rating": 1, "date": "12/30/2017"}, {"text": "Great service, large portion sizes and very tasty food. Their menu is literally endless and I always have so many options to choose from. Order from their lunch sized pasta specials!", "rating": 5, "date": "5/16/2018"}, {"text": "Waited for about an hour until we were seated and ordered. First thing I noticed was dirty silverware...good thing I had two other spoons and a spare fork. Our waiter James offered delicious warm bread and butter. He was very nice and checked on us/filled our beverages very frequently. <br&gt;<br&gt;Before we got our food, we were brought 3 plates and two serving spoons that obviously weren&amp;#39;t washed very well... one of the plates had a grubby handprint on the top from grabbing it, and the other two were still greasy. One of the spoons had something stuck on it.<br&gt;<br&gt;We ordered the shepherds pie and the smokehouse bbq burger. They were both very satisfying. :-) <br&gt;<br&gt;Long story short, the food was good. I still need to try the cheesecake. I don&amp;#39;t enjoy eating off of dirty plates, its flat out gross... maybe they need to hire a more thorough dishwasher?? Lol", "rating": 3, "date": "2/11/2018"}, {"text": "The service I receive here has always been consistently good. The servers really seem to know the menu which can be overwhelming - and while it&amp;#39;s overwhelming it is fun trying new things and never getting bored with options. Ive never had a bad dish here and always look forward to returning.", "rating": 5, "date": "11/4/2019"}, {"text": "So happy that this location opened up as it us much closer than the Beaverton one. <br&gt;<br&gt;We went here for dinner yesterday and the food was amazing as usual. The menu is like the Torah but that&amp;#39;s a good thing because everything on it is AWESOME. You can get pretty much whatever you&amp;#39;re in the mood for.<br&gt;<br&gt;The only downside is going to be my bank account after how many times I come here.", "rating": 5, "date": "12/6/2017"}, {"text": "We went in with a group of 8 and they told us it would be a 1 1/2hour wait and that they would seat us together by putting 2 tables together. After 2 hours, we finally get seated. That&amp;#39;s was ok , we agreed to the time. When we get to our table, they would only allow 5 of us maximum to stay at one table and the other 3 had to stay at a separate table about 10 feet away.  COVID rules they say. We couldn&amp;#39;t even communicate with one another, which the whole point of us going out was to hang out with our family and friends. At the end, when we got our bill, they charged all of us gratuity because we were a group of 8. How are we a group of 8 if we are separated seating at completely different tables across the walkway??  Needless to say this will be our last time going to this place, as it defeats the purpose of why people go out... to actually enjoy a nice dinner with friends and family and have a great conversation. Good luck to you guys.", "rating": 1, "date": "10/3/2020"}, {"text": "I was in August of this year. My friend and I went there about a hour before they closed. The waiting time is about 20-30 minutes for dine in. We thought that reasonable and a lot of people wait for tables during that time. We got our table about half hour before they closed. We didn&amp;#39;t get our complimentary bread. The bread is one of the reason we went there. When we sat down they still have the bread serve the table close us. The waiter didn&amp;#39;t tell us they were out of bread until we got our meal and I asked him. We ordered one appetizer and one pasta. We didn&amp;#39;t get share plates until we were half way eating the pasta in small appetizer plates. I got hot water with lemon to drink but the water and the cup both were dirty. He already helped me change two times, but the water still have something inside.  Everything getting worse compared to our past experiences, hopefully it will change back.", "rating": 1, "date": "10/2/2020"}, {"text": "Was able to sit down right away at the bar. The drink I had - Georgia Peach was very cool but I do think almost $12.00 is a little expensive for what you get. The salad I had was very good and the portion size was a good size for lunch. I would definitely eat there again!", "rating": 3, "date": "4/15/2018"}, {"text": "Dear management and head chefs. I&amp;#39;ve LOVE the HH menu, had eat so many places but still love the food here.  2 weeks ago I&amp;#39;d when there w/my son for HH was sitting in the bar area for a really long time, there&amp;#39;s 2 server standing talking look at us and walk away. BAD services. Today we both still have to wait for server. PLEASE make its better with the services. OMG... I&amp;#39;ve always tell my friends my coworkers how&amp;#39;s wonderful your HH menu and food. Today as I always order my FAV. Chicken sliders and the Chicken nugget which I loved. The Chicken sliders and nuggets thin as a cracker. PLEASE change back to the way it&amp;#39;s was, the Chicken thick and juicy.", "rating": 2, "date": "9/2/2019"}, {"text": "Went. In with 2 others and had a to go order, total bill $94, was charged five cents for a bag that was too small to hold the take out food, tacky, tacky.  Went to Cinnabon after lunch for takeout dessert and was given a free bag for the food, classy store, will revisit Cinnabon , not the other place", "rating": 1, "date": "2/28/2020"}, {"text": "Ordered two entrees and it took thirty minutes for our food to come out. I ordered the bistro shrimp pasta and my boyfriend ordered the spicy chicken chipotle pasta. Mine was so plain I was really disappointed because it had all my favorites in it- mushrooms, shrimps, and greens. <br&gt;<br&gt;To help the flavor I added a bunch of salt and stole some of my boyfriend&amp;#39;s pasta sauce and mixed it in mine. The &amp;#34;sauce&amp;#34; from my pasta tasted like really watered down, something.. can&amp;#39;t really describe it cause there was no flavor/seasoning! I told my waitress that it was bland and I had to use another dish&amp;#39;s sauce and she shrugged it off and laughed.<br&gt;<br&gt;Two stars cause the spicy chicken chipotle pasta was so full of flavor, it helped give my pasta some flavor too and the service was decent but I wouldn&amp;#39;t expect tooooo much from this place.", "rating": 2, "date": "1/13/2019"}, {"text": "Sunday night, we arrived as a party of four adults and three kids (ages 4, 3, and 7 mos.) at 6:30.  Hostess says wait time is 40-50 minutes.  No biggie.  We caught up with some friends in the lobby for five minutes.  Regretfully, 40-50 minutes eventually was not the case.  Fifty minutes came and went. Still not a big deal.  By the time 7:45 came around, my kids sadly started complaining about being hungry and thirsty.  They had been so great at this point. I said to them, &amp;#34;I know it&amp;#39;s been an hour and 15 minutes. You&amp;#39;ve been so good.&amp;#34; That didn&amp;#39;t even faze the manager on duty who overheard me say this to my starving kids. By 8:06, it seemed the restaurant had emptied by the time we were seated.  At this point, our friends had already eaten and went home.  A 96-minute wait for a relatively small party to be seated.  Well done Cheesecake Factory. Glad you cared.<br&gt;<br&gt;*Updated 1/22/19 in response to the comment from the restaurant: The condescension in your reply was not helpful at all.  I sincerely hope that was not scripted by corporate.  Your patrons will come when they come. It is not always planned.", "rating": 1, "date": "1/22/2019"}, {"text": "Truly an amazing staff! From door to door was a great time for me and the family. I was my first time there and my Portland family goes once a month. <br&gt;<br&gt;The menu is impressive and almost too much to choose from. The food items are described well and i had so many things I wanted to try...but the fried mac n cheese burger got me and I was super happy with my choice. With a food allergy I have to be careful and ask questions and they went back to ask the cooks. A manager even came out to confirm the burger was OK and insured me I was going to have a safe meal and that was the extra mile they went for me. <br&gt;<br&gt;All our food was great and the smells of food around us was intoxicating. Only regret was that we were full and did not get cheesecake and a cheesecake factory??? Guess we should have taken some home, our loss :-( I will go back as I have many future choices to try and next time cheesecake will be on my plate at the end of the meal.", "rating": 5, "date": "12/4/2018"}, {"text": "I am giving three stars based upon my previous experiences with the Cheesecake Factory.  Their food is generally very good.  Portion sizes are pretty big, on this particular occasion I was hoping for the beet and goat cheese salad.  With the grilled artichoke as my second option.....  much to my dismay they didn&amp;#39;t have any beets which also eliminated two other dishes I was considering and the artichoke was out of season (can fault them for that).  However when you have at least three menu options that include beets you should<br&gt;Make sure that you have them on hand.  Their menu is extensive but in Jan I like most others are watching calories or at least making healthier choices when possible, so their fried options which were aplenty just weren&amp;#39;t on my list of &amp;#34;can eat&amp;#34;.  This is a new restaurant to the area but a chain where these things should all be ironed out already.", "rating": 3, "date": "1/9/2018"}, {"text": "Came here with family a few weeks ago and we all enjoyed it lunch meals. I got the veggie burger and was pleased with how filling it was! My partner got the appetizer Korean cauliflower bites and we both loved how crispy and spicy they were! Other members got steak which they seemed to enjoy and even took the potatoes home for left overs and another got the cashew chicken with brown rice which looked great as well. Wish we weren&amp;#39;t so full and had gotten a slice of cake!! All of the desert bar looked delicious!!", "rating": 4, "date": "2/17/2019"}, {"text": "Food was great and kinda pricey but good food great service I had a great time I even got a beer for a reasonable price it&amp;#39;s awesome", "rating": 5, "date": "12/2/2019"}, {"text": "The Cheesecake Factory&amp;#39;s menu is like an ENCYCLOPEDIA of things to eat.  Because their menu has such an enormous number of items, it&amp;#39;s fun to try different things whenever I go there.  Tonight, I was in the mood for dinner with a lot of variety so I decided to just get three separate items from the &amp;#34;Small Plates &amp;amp; Snacks&amp;#34; section of their menu.  I ordered Stuffed Mushrooms, Chicken Taquitos, and Cheeseburger Spring Rolls. . .which were all quite different from each other.  They all came out of the kitchen in a timely manner and I admired their &amp;#34;presentation&amp;#34; as they sat next to each other on my table. . .then I dug in.  I&amp;#39;ve had stuffed mushrooms at many other restaurants before and these were on a par with most others, well prepared and tasty.  The chicken taquitos were OK too.  The Cheeseburger Spring Rolls were unique, kind of like Chinese Egg Rolls filled with hamburger, cheese, and grill onions.  Well, all three items were pretty good and definitely &amp;#34;satisfying&amp;#34;, although they were all a little bit greasy.  However, I&amp;#39;m not going to hold a little bit of greasiness against them.  I figure that&amp;#39;s just the nature of these types of &amp;#34;finger foods&amp;#34;.  In fact, I&amp;#39;d probably go back and order these same three things together again some other time.  They go well together.", "rating": 4, "date": "8/23/2019"}, {"text": "Opened around Christmas, this place is happening. It&amp;#39;s the hottest spot in Clack-E-mas-Land. Go for the Vibe, the Service, the Portions OMG! More Cheesecake?<br&gt;<br&gt;Cheesecake Factory is an excellent addition for Clackamas Mall.  The Cheesecake crew is numerous, it&amp;#39;s moves fast.<br&gt;<br&gt;Endless menus...  there are actually 250 dishes for you to choose from.<br&gt;<br&gt;I&amp;#39;ve never seen so many people ordering up cheesecake in my life! Which one should I have? That IS the question...<br&gt;<br&gt;After your food? ... you can have a mall experience!<br&gt;<br&gt;Tip: This place is busy, plan your arrival time, if you don&amp;#39;t wanna wait.", "rating": 5, "date": "12/15/2017"}, {"text": "I used to love the Cheesecake Factory! Now I will explain why I gave them a 2 star rating . There food is ok- I went there last time and the food was so bland ! I waited 2 hours to be seated , no problem cuz my choice - but I was so sad to get such a small ( super small ) portion on my plate for such a huge price ! My expectations if this place went way down . <br&gt;Now there deserts are a different story ! Still super delicious!", "rating": 2, "date": "11/9/2018"}, {"text": "Dinner is such a wonderful moment of the day and to sweeten this moment, was the time of happy hour!  My destination was actually set to Laurelhurst Market as I&amp;#39;ve always wanted to try their famous steaks but traffic on I-205 North really got jammed and honestly I didn&amp;#39;t want to be a part of that anymore and decided to go to the Cheesecake Factory. I&amp;#39;m not really sure that I understand why the restaurant has some nasty reviews as I have never had a bad experience at this location or the one at Washington Square mall. I ordered the warm crab dip and the Steak Diane with Shrimp scampi and really enjoyed my meal. The service is always good with delivering hot food made to order and great ambiance for a nice casual meal or bringing a date. Lots of menu items to choose from and all reasonably priced. The restaurant can always make special accommodations within reason to suit your needs. Always a great place to go to for a large corporate restaurant. Definitely one of my top 3 places to go to.<br&gt;<br&gt;Crab Dip with toasted baguette -$6.50<br&gt;<br&gt;Steak Diane with Shrimp Scampi- $22.95", "rating": 4, "date": "1/31/2019"}, {"text": "Mmmm! Great caesar salad, garlicky goodness! Split a chicken avocado BLT with fries and that was great too.  Service was friendly and fast. I&amp;#39;m a fan@", "rating": 4, "date": "3/7/2020"}, {"text": "I have gone here for dinner multiple times and each time keep Giving them another chance because when the food and service is right this place could be my favorite place. But time and time again they have disappointed. I don&amp;#39;t even know why I kept giving them another chance.<br&gt;All the staff seems lazy and not attentive to their guests. From taking 10 minutes to bring water , to gathering all the staff to sing anniversary songs in the kitchen during business hours. They can&amp;#39;t even get the bread right and have it actually warm and toasted. I always get the $25 salmon and shrimp scampi, the last time I went it took 30 minutes for the food to come out and once it finally did the food was extremely burnt and they put the burnt side down on the plate so you couldn&amp;#39;t tell. It sucks because Cheesecake Factory has so much potential but it just seems like staffs minds / actions are elsewhere when they&amp;#39;re are at work. They have multiple employees walking around but no one is getting helped at least not in a timely manner or with quality in ANY WAY. Cheesecake Factory is supposed to be a nice/decent place to eat. I got better service at Dave and buster across the street. Not worth the money to get crappy service and crappy food , where I can&amp;#39;t even relax because I have to complain / send my food back / etc. if you want to pay some money for a crappy experience go here! ;)", "rating": 1, "date": "5/19/2019"}, {"text": "It was our zillionth time at Cheesecake Factory this afternoon. It was a Sunday, so it was crowded all day. We had the Meatball with spaghetti and Chickwn Riesling. Both were delicious.<br&gt;<br&gt;Food = outstanding = Meatball with spaghetti and Chickwn Riesling.<br&gt;Seating area = clean<br&gt;Service = excellent <br&gt;Restroom = clean<br&gt;Parking = plenty<br&gt;<br&gt;.", "rating": 4, "date": "1/20/2019"}, {"text": "First time at this location. Long wait for big party. Which is to be expected. Great food, great service. So many options and varieties. Cheesecake was heavenly. Lemon raspberry mmmmmm. Order chicken and biscuits for dinner very good", "rating": 5, "date": "10/28/2018"}, {"text": "I really enjoyed eating here. We had the greatest service, and the food was very tasty. Great bread basket,I also ordered a burger, it was juicy.  The carrot cake was perfection also. I would love to visit again and try so different deserts.", "rating": 4, "date": "10/19/2018"}, {"text": "The food is so fresh at The Cheesecake Factory. My understanding is that everything is made fresh daily. Also, they try to have as little waste as possible. My favorite item is the fried chicken sliders. Soooo good.", "rating": 4, "date": "7/18/2019"}, {"text": "The service is slow and the food isn&amp;#39;t hot after taking 45 minutes. The bread is cold and stale. The bang bang chicken and shrimp was very underwhelming, the chicken had a chalky texture and the sauce was very sweet especially considering the dish was supposed to be spicy. The shrimp was the only good part of the dish. <br&gt;<br&gt;The menu is way too big with almost 20 pages to the menu, good luck picking something. <br&gt;<br&gt;The cheese cake is good but the regular food seems like a joke. Also a mai tai is 12 bucks and menu doesn&amp;#39;t have prices on it.", "rating": 1, "date": "7/20/2018"}, {"text": "Server was GREAT! But the food was just down right awful and for being that expensive is why I&amp;#39;m making a bad review. Second time trying this place and it still was bad. Got the stuffed cheese burger with grilled onions and I swear there was ONE onion on it. My boyfriend then got the bbq burger and the bun was bigger than the meat party haha also both of our fries came out cold and we had to wait an abnormal amount of time for everything to come out. Just kinda sucked all together :/", "rating": 1, "date": "7/31/2019"}, {"text": "Very happy with everything I ordered. The cheddar stuffed burger reminded me of the juicy Lucy burgers in Minnesota. They were a bit messy to eat but really good.  The j.W. Pink lemonade is a great cocktail to have if you are looking for a good fruity drink.  I also ordered some chocolate mousse cheesecake for dessert because you can&amp;#39;t go to a Cheesecake Factory and not get cheesecake. I was too full to eat it so I&amp;#39;m saving it for tomorrow. I wouldn&amp;#39;t recommend coming here on a Friday night unless you want to wait 40 minutes because it&amp;#39;s packed.", "rating": 4, "date": "1/18/2019"}, {"text": "The food was pretty good. Consistency did very a little from other Cheesecake Factories have been to. Especially with the gluten-free shepherd&amp;#39;s pie. I definitely enjoy that better at other locations. Service was very slow but polite. After a long wait for dessert they did do a great job wishing happy birthday to my son.", "rating": 3, "date": "8/15/2018"}, {"text": "This place is great. Sometimes a little wait but it&amp;#39;s because it is good. The employees are great. The food is so good.  The waitress cat was very helpful with All her customers.  There breakfast on the weekends is great.", "rating": 5, "date": "1/18/2020"}, {"text": "I haven&amp;#39;t been to The Cheesecake Factory in almost 10 years. When they finally opens a location closer to me, I decided to go check it out. I forgot how amazing their food is! Good portions and so full of flavor. I love their pasta dishes! They also have some pretty delicious alcoholic beverages as well! Their food menu is full of variety, broken down in to sections; chicken, steak, pork, vegan options, specials. Will definitely be back again!", "rating": 4, "date": "5/3/2018"}, {"text": "Restaurant is in the shopping mall but you can avoid the mall scene if you want by just entering the nearest side entrance to the mall. Beautiful decor provides an escape from the ordinary. We like to go mid-day, when it is quiet and relaxed. Large menu, and it is possible to get a healthy (low fat) meal here! If you&amp;#39;re just looking for liquid refreshments, they have a very nice bar. We&amp;#39;ve experienced accomodating, friendly service throughout each visit.", "rating": 4, "date": "12/8/2018"}, {"text": "Two hour wait for bland food. Skip it! <br&gt;I had gift cards for this place and want it to try it out. The person in charge of seating said it would take 40 mins. I kept seeing people arrive and be seated within 20 mins, and every time I checked on the time she would say I was the next on like for a table of 4. Again people would get seated and even larger groups. After I asked to speak with the manager &amp;#34;surprisingly&amp;#34; there was an open table. The food was bland, nothing special. The food I buy at the hospital where I work has more seasoning.", "rating": 1, "date": "3/12/2018"}, {"text": "Place has great salmon and my favorite mashed potatoes from any restaurant. Add on top of the the red velvet cheesecake and its a perfect meal. The staff was friendly when i went and the wait was long but they cant control when they are busy so cant ding them on that.", "rating": 5, "date": "2/10/2018"}, {"text": "Been here a few times since it&amp;#39;s opened. Every time the floors are filthy. There is silverware and trash everywhere and the servers see it but don&amp;#39;t bother to pick it up. I&amp;#39;ve never had much of a wait time for a table but I can see how it could take awhile. The food is very underwhelming... not good enough for the price. I felt like I could have made it at home. We also ordered dessert and our slices tasted crusty on the outside- like they had been sitting out all day. The server was accommodating to my sisters severe nut allergy and said the kitchen was sanitizing stuff (who knows if that&amp;#39;s true). The service is blah but with the prices I feel like it should be held at a higher standard. <br&gt;<br&gt;Trust me, you can find a better place to eat around this area.", "rating": 2, "date": "2/22/2019"}, {"text": "We tried to make reservations for a Saturday evening as there would be 11 of us. We were told they don&amp;#39;t take reservations, so we had someone arrive at 5:30pm with hopes of being sat around 6:15pm.  We finally got a table a little after 7:30pm.  We all ordered sodas or drinks from the bar, my friend and I also ordered a couple appetizers at this time.  Nobody else was ever asked if they wanted any starters.  Our appetizers came out before the sodas and other drinks... the main portion of the meal was ok... my friend and I used the restroom after dinner and at this point the server asked if anyone wanted dessert, a few people ordered cheesecake to go...when my friend and I got back to the table we were given our checks, at that point I asked the server if I could get a slice of cheesecake to go as well.  He said of course and I gave him my payment, when he came back with credit card slip he said sorry I forgot your cheesecake, do you want me to go get it now or do you want to go up to the front and get it? I told him to forget about it because everyone else was ready to go at that point... by the time we all left it was 9:30pm...In my opinion I feel like a 2 hour wait time for a table is ridiculous!<br&gt;<br&gt;**edit: it seems that all of the responses from management are very cut and paste, not sure that they&amp;#39;ve actually addressed any issues", "rating": 2, "date": "3/31/2019"}, {"text": "Staff was super friendly and there patio area is awesome (for better lighting). Took my wife here in her birthday and went swell. Kudos to the staff for arranging her a birthday cheesecake.", "rating": 4, "date": "6/29/2019"}, {"text": "An hour wait to get in...though I&amp;#39;m not sure why I even thought coming here was a good idea. I&amp;#39;m just going to get right down to it. The only thing the Cheesecake Factory has going for it are the cheesecakes, nothing more! This is a shit show restaurant that fails in every regard when it comes to food preparation. Let&amp;#39;s begin with the frozen entrees that are reheated -over cooked and burnt. I went with the eggplant parmesan...the flavor your ask, well it&amp;#39;s a mix between licking a charcoal briquet and chewing on bark, void of any flavor! Meanwhile, you pay $18 for it...which really boils down to how much dogs shit can you eat. The crab bites, so I thought anyway, were equally over cooked and tough to stomach and just when you think they can&amp;#39;t screw up your cocktail drinks, guess again! Also, the margarita pizza, holy shit...you get 8 pounds of dough and everything clumped in the center with chucks of mozzarella that seemingly slide right off and take everything go with it, haha seriously?!?  STICK TO CHEESECAKES! <br&gt;<br&gt;The service was the thorn in my side, our waitress was horrible, rude and inattentive. When asked for cheese to be grated on my dish, she had a look of being pissed that you&amp;#39;d even ask such a thing. <br&gt;<br&gt;Bottomline, this location is a FAIL...it offers nothing for its patrons except for a big bill and possibly a gut ache! If I had to do it again, I would have opted for Claim Jumper across the way.", "rating": 2, "date": "1/22/2018"}, {"text": "Let me start off by saying that I NEVER leave negative experience reviews. However, after what my boyfriend and I experienced at this location, I felt like it was absolutely necessary. <br&gt;<br&gt;We were initially told it was going to be a 45-60 min wait until we were sedated. (Totally fine, we have no problem waiting for decent food and good service) <br&gt;<br&gt;We were eventually seated and our waitress Katlyn kindly greeted us and explained it may take longer than usual to get our food due to being so busy. My boyfriend ordered the herb crusted salmon and I ordered a BLT sandwich. <br&gt;<br&gt;After waiting about 45 minutes to receive our food, it was HORRIBLE. My fries were cold and had become soggy by the time they reached our table. The bread on my sandwich was so stale I felt like I was going to damage my teeth while eating it. My boyfriend (who had never been to any cheesecake factory before) Salmon was dowsed in lemon and was so potent he couldn&amp;#39;t even eat it. Our waitress asked us how our food was and we explained the quality issues. She kindly apologized and asked if we wanted something else instead. We have NEVER sent food back prior to this and it was extremely disheartening. <br&gt;<br&gt;At that point we asked for the check so we could go somewhere else to eat since it was 9:30 pm by then. The manager ended up coming to our table and asked about the issues with the food. My boyfriend explained to him how the salmon was too strong and acidic and the manager looks at him and word for word says, &amp;#34;Well then you&amp;#39;ve never had good salmon before&amp;#34; I was horrified. We have dined at some of Portlands most upscale restaurants where he only orders Salmon. Now mind you this is a chain restaurant so our expectations were not nearly as high. After arguing with us about how wonderful he thought the food was, I told him we would pay for it all and we needed the check immediately. <br&gt;<br&gt;Our waitress Caitlyn brought our check and only charged us for the beer my boyfriend had at dinner. We tipped her $30 on the bill, because in NO way was any of this her fault. So thank you again Caitlyn for the wonderful service and I hope the manager doesn&amp;#39;t treat his staff as poorly as he treats his customers. <br&gt;<br&gt;The Washington Square location is so much better and I have never had a bad experience there. If you want poor quality food, a ignorant manager in your face and a starving stomach by the end of the night then the Cheesecake Factory at Clackamas is your place. We will not be returning.", "rating": 2, "date": "1/19/2018"}, {"text": "I&amp;#39;ve been here many times with a party of two and even a big party of 10, and never really had an issue. The downside is they don&amp;#39;t accept reservations and they need majority of your party to be there if you guys would like a table right away. Honestly, the wait is not that bad either on busy nights. It is definitely pricey, but every time I come here I enjoy the food &amp;amp; the service is always great. The menu is so big so it&amp;#39;s hard to know what you want if it&amp;#39;s your first time here but there will definteky be something you will enjoy.", "rating": 4, "date": "11/13/2019"}, {"text": "The Cheesecake Factory offers the best cheesecake options in portland! The dining atmosphere Is suited for  both casual dining and romantic nights out. The staff were very friendly, and knew their steps of service very well! The entrees were defiantly delicious and definitely left us satisfied!", "rating": 5, "date": "1/28/2019"}, {"text": "This is my first time here...and probably my last. I tried to order the Seared Tuna Tataki Salad. The one they have on the Skinnilicious menu AND the regular menu. Nope. What? The waitress says they haven&amp;#39;t had it since they opened this location. Ummm, okay, but shouldn&amp;#39;t it be blocked out or have some indication that it&amp;#39;s not available? Fine. How about the French salad on the menu? Two minutes later, nope, we&amp;#39;re out. At this point, I expect a manager to come out and apologize or a comp for the inconvenience. Nope. All right, do you have the Greek salad? Yes. FINALLY. You have the appetizer sized salad. Which ended up being just OK.<br&gt;<br&gt;Our waitress was nice and polite, but personally, I would have let a manager know about the 2 orders for the table that were a no go and/or offered a dessert or something when I was clearly annoyed that they didn&amp;#39;t have my first two options available.", "rating": 2, "date": "1/16/2018"}, {"text": "Cheesecake factory is exactly what you would expect. The kids absolutely loved it, we went for dessert after a fun night out for our sons birthday.", "rating": 4, "date": "6/11/2019"}, {"text": "HORRIBLE FOOD!!<br&gt;Stay away from the food just stick with the cocktails and cheesecake you&amp;#39;ll be Ok<br&gt;Maybe a salad on a good day but that&amp;#39;s it !!<br&gt;To Bad one location can be so different than the other there just winging it over there in Clackamas Sad!!", "rating": 1, "date": "1/1/2018"}, {"text": "Their happy hour is so good! Half off some appetizers. Get the avocado egg roll and fried Mac and cheese balls, they are the best! We&amp;#39;ve been here for dinner as well and their pastas are really good. After dinner we decided to grab a cheesecake to go, TOOK 45 MIN FOR A SLICE OF CHEESECAKE TOGO.", "rating": 4, "date": "4/8/2018"}, {"text": "Had lunch here with a friend. We have been waiting for this place to open for months.  Food was fantastic and service was great. Great lunch specials that have huge portions. Great menu, something for everyone. Definitely gonna be regulars here!", "rating": 5, "date": "12/6/2017"}, {"text": "22$ for 3 small pieces of steak and 3 shrimps, the silverware was not clean and food overpriced for the that low of the quality; also 4$ bucks for a cup of soda?", "rating": 1, "date": "3/25/2019"}, {"text": "Had brunch there on 12/23.  Very disappointed - with all the wonderful places in Portland we had decided to try this place.   Food very average to below.   Not only that but at 10 am the bathroom had no soap in dispensers.... how does the waitress staff wash their hands when emptyContacted cheesecake with concern but never responded.   Sad<br&gt;-Chris", "rating": 3, "date": "12/26/2018"}, {"text": "i will never go to this cheesecake factory again nor would i recommend anyone to go.  i was out doing food deliveries tonight when i got one for this location. a $130. order mind you.  upon arrival staff were extremely unorganized and not helpful!!  all&amp;#39;s they kept telling me is its not scheduled for pickup yet!!  yes!!  i understand!!  listen!!  it&amp;#39;s been marked as ready for pickup!!!   it had been marked as ready about 12 minutes prior to my arrival!!  sometime later a while later they then proceed to tell me the order had been put outside on the table for deliveries and someone must have taken it!!!  okay well what are you going to do about this situation?!?  still very unorganized!!  i called through the app to speak to a customer service agent.  they assured me that said situation was fixed with the cheesecake factory and the order was being remade as we spoke!!!  fantastic!!! i then call the customer and apologize and give customer a heads up on the situation!!  customer was very understanding and humbled by my call.  a while passes approximately 25-30 minutes i asked another employee what we were looking at as a time frame on getting the customer her order?!?   still very unorganized, rude, put out that i&amp;#39;m asking about the order again!!  they then tell me the customer has to contact support that the cheesecake factory can&amp;#39;t do anything!!!   are you kidding me?!?   you knew i&amp;#39;ve been out here.  you knew the order was stolen by someone and you don&amp;#39;t believe in customer service?!?   i was at the cheesecake factory over an hour waiting to get a customer&amp;#39;s order that was stolen and you want to be rude, unprofessional, and act put to me and also to your was going to be paying customer?!?!?   that&amp;#39;s how you do business?!?   not only was one manager rude and unprofessional they both were.   the female manager was rude as f to the was going to be paying customer!!!   i&amp;#39;m disgusted that your business operates in such a terrible manner and even more so during these times!!!  .it&amp;#39;s not the customer&amp;#39;s fault then food was stolen off your unsupervised table!!  anybody can walk to that table and steal to go orders!!!   we are in times of you need business and should be 110% about customer service!!!  you need business but guess what!!   i don&amp;#39;t need your business!!!  shameful!!!!!", "rating": 1, "date": "10/1/2020"}, {"text": "Best server ever, five stars to Niranjan. Perfect suggestion and warm service. Food was exceptional, specially the grilled steak medallions and Godiva chocolate cheesecake.", "rating": 5, "date": "5/27/2019"}, {"text": "So happy about this location opening up! I had the honor of being invited to pre-opening night &amp;amp; it was such a great experience amazing food as I wouldn&amp;#39;t expect anything else from Cheesecake along with the outstanding service.", "rating": 5, "date": "12/6/2017"}, {"text": "Highly disappointed in the management staff at this location. What was supposed to be a lovely lunch with an out-of-town friend. Ended quite awkwardly when I was informed that I needed to move tables because a larger party needed to be seated.", "rating": 1, "date": "12/7/2018"}, {"text": "2+ hour wait just to be seated.  Food was ok.  Worth the crazy high prices?  Not a chance.  Although our server was a pleasant fella, the service in general was average.  Nothing about our experience validated the prices that we paid.  Unsure if we&amp;#39;ll go back.", "rating": 2, "date": "12/30/2018"}, {"text": "Very mixed experiences. First time had a great server and the last time we were there we had a server that clearly didn&amp;#39;t care. Never know if it&amp;#39;s been a bad day for them though. Very good food and huge portions. Love the drink and cheesecake options.", "rating": 4, "date": "4/23/2019"}, {"text": "As always, did not disappoint.... Clean, fast seating, good service, tasty meal, and worlds best Dulce de Leche cheesecake!!", "rating": 5, "date": "3/1/2019"}, {"text": "We took our grandchildren for brunch and although the service was ok the kids waffles had that had sat under the heat lamb so long their plates were too hot to touch and you could not cut the waffle. <br&gt;My ricotta pancakes were excellent. <br&gt;Maybe it is a conscious CORP decision not to be kid friendly but crayons and a kids menu you can draw on would be nice.", "rating": 2, "date": "2/24/2019"}, {"text": "Just a few weeks ago me and my mom went here for my birthday. I had gone recently with my husband and really liked it so I took my mom for lunch. I ordered Miso Salmon and that took 45 minutes, then it came out completely raw. Then that took another 30 minutes and at that point my 1 year old was crazy fussy and just done with lunch. I want to add as well that the table across from us order 2 plates of miso salmon, and so did the table behind us. And they got their food about 10 minutes after I told them mine was raw. Our server barely ever checked on us, and it took forever for her to ask us if we wanted boxes or our check. They didn&amp;#39;t comp my meal at all, I barely ate it after sipping on soup for so long. I understand accidents happen but they didn&amp;#39;t seem concerned.", "rating": 2, "date": "2/19/2019"}, {"text": "I&amp;#39;ve been here twice and my experience has been the same during both. Food is wonderful. The Tex Mex egg rolls are great and their fries and dipping sauce are unreal. But the service frankly sucks. Servers take forever to check on you, when they do they seem ditzy and unable to help... it&amp;#39;s just kind of a subpar place to eat. I see multiple reviews where people make the same complaint and management replies without even an idea that they&amp;#39;ll fix it. They just say &amp;#34;sorry about that&amp;#34;, with no offer to follow up. Wonder if they have so many complaints it&amp;#39;s unrealistic to follow up on them all.", "rating": 3, "date": "10/16/2018"}, {"text": "I live the cheese cake factory but this one sick ass!!! Worst service ever.y husband orders a burger and the party was dry to the max. The bun was all burnt. I ordered a shrimp with angle hair and my shrimps where all soggy and the flavor is just very different then the one at Washington sq. This place just sucks.", "rating": 1, "date": "11/18/2018"}, {"text": "Not sure how you could go wrong with all the options here! Everything that was brought to our table was delicious. Plenty of gluten free options! If you&amp;#39;re lucky you&amp;#39;ll get Jaylynn for your server, she was amazing &amp;amp; absolutely made our night.", "rating": 5, "date": "1/3/2018"}, {"text": "Our server was cool and helpful, but the food just wasn&amp;#39;t as good as I&amp;#39;d expected it to be. We had the Mac and cheese balls and they were okay, but bland. Not really my thing. We also tried the avacado rolls. They were good, if you like avocados. I don&amp;#39;t, so I didn&amp;#39;t enjoy them much.", "rating": 2, "date": "12/14/2018"}, {"text": "Always a fun place to take the family. Christy made our daughter Morgan&amp;#39;s Birthday special.<br&gt;<br&gt;We&amp;#39;ll be back in a month for Kenzie&amp;#39;s Birthday in April.", "rating": 5, "date": "3/20/2018"}, {"text": "This is not my first time at cheesecake factory but I can say I always have a great time here. The service was really good the food was really good and we went there right at 12 PM so there was a minimum amount of wait. The only thing I wish that cheesecake factory would do is lower their prices. The food is absolutely amazing but the prices are a bit too high. Me and my girlfriend Went around lunchtime and we got one appetizer, two entrées, and one soda and with tip it ended up costing us $60. Which is a little expensive specially for a college student like me. But overall I really enjoyed the food and I&amp;#39;ll be see the cheesecake is the best part.", "rating": 4, "date": "1/18/2018"}, {"text": "Of course like the many others I don&amp;#39;t even want to give you even one star because you don&amp;#39;t deserve it!!!  Puke !!  <br&gt;<br&gt;I go in there to get a cheesecake and I come out with Anything but a cheesecake!!  Scamie effin marketing !!  unbelievable bullshit !!  well I can&amp;#39;t eat the damn cake because I needed a &amp;#34;cheese&amp;#34; cake!!   And it&amp;#39;s not a cheesecake it&amp;#39;s a CAKE!!   it&amp;#39;s a layered wheat cake inside with fake frosting all through it and on top of it .... it&amp;#39;s enough to make me throw up!!   ‍ of all places I go to a cheesecake factory for a cheesecake and I come home with a wheat cake if that&amp;#39;s what I wanted I would&amp;#39;ve went to a damn bakery not to the Cheesecake Factory!!!!  <br&gt; No kidding !!  I&amp;#39;m completely done with your restaurant and any other restaurant who pulls the same shit!!  People are sick and tired of eating food that makes them sick and EFFIN tired !!!  Stop lying with your marketing and your help should tell the people that it&amp;#39;s not a cheesecake....  it is a cake!!!  Very very stupid for a restaurant that&amp;#39;s called the &amp;#34;Cheesecake Factory&amp;#34; to be selling anything other than cheesecake!   Bye-bye now!!i<br&gt;<br&gt;And I&amp;#39;ve been reading all your responses to your unhappy customers !!   .  you ought to be ashamed of yourself !!  ALL you are doing is blowing them off and you&amp;#39;re not changing a damn thing in your restaurant and you should be offering at least something to some of these people and you don&amp;#39;t... you just blow them off with your fake niceties it&amp;#39;s just more bullshit and another reason for me to never darken the doorway of this restaurant again!  Seems I&amp;#39;m not alone!!", "rating": 1, "date": "7/7/2019"}, {"text": "My servers name was Alex. He was super fast, kept checking the table to make sure everything was good, my drink was NEVER empty. Was there at 3:45ish. I ordered the Louisiana pasta and red velvet cheesecake, passion fruit mojoto and an amazing margarita! Alex is cute and great! I want him as a server again!", "rating": 5, "date": "12/29/2017"}, {"text": "So today 3/22/2019 went in to eat for my gfs bday me and her stayed there for about 45-60 minutes had a good time had a couple drinks after we ate and when we got home she had forgot her wallet on the table we was sitting at. Called and asked if her wallet was still there it was and everything was in it including $350 cash. So thankful there is actually still good people in the world. To the person or employee who turned it in god bless you.", "rating": 5, "date": "3/22/2019"}, {"text": "It is unbearably loud. The music needs to be turned way down. Servers can&amp;#39;t hear you. The loud music makes everyone talk louder amplifying the problem. I am out to eat not at a night club!", "rating": 1, "date": "8/19/2018"}, {"text": "Nice place to come with friends and hang. Lots of fun and good food, nice service, place with nice memories.", "rating": 5, "date": "3/13/2019"}, {"text": "Ahi Tartare was actually amazing. I would love just a big plate of that. Wife had Zuccinni fried (needs flavor) And I ate Gumbo. Also really good. Service was fine. Took a bit to get the cheesecake we ordered though.  Thats why a 4 n not 5 star", "rating": 4, "date": "2/5/2019"}, {"text": "Ordered the cheesecake factory on DoorDash app. Total came to $40 for a kids meal mini burgers (no cheese, no ketchup, no nothing!) Bread and meat, 2 items, about $10. I then got myself a salad and come to find that it had 3 big chunks of tomatoes and less than half of an avocado in slices. I felt impelled to remove the items to chop them up myself and I put them back in the salad. Also for the size of the salad, they gave me a pitiful amount of ranch dressing. I got one tiny little side of ranch dressing for this large salad so I was only able to eat about %40 of it. The rest was dry salad. The potato soup that I used to love, had no potatoes in it. Just creamy potato broth and pieces of carrots. ‍ I was pleased to find their delicious bread in my order, but NO butter.<br&gt;Just felt like some simple no brainer items to include in the to-go bag. Butter for the bread, cheese and ketchup for the kids burgers and extra side of ranch for my salad, would have made this meal a lot better. <br&gt;I would absolutely love a refund.", "rating": 1, "date": "8/25/2018"}, {"text": "Went here for dinner with my family. There were seven of us. It was a Sunday around 7pm. We waited only about 10 minutes to be seated. Once seated the service was slow. Long wait times to order, get our drinks, appetizers and entrees. At least 20 minutes between each. It took 20 minutes to get two cocktails two beers and two sodas. Plus we had to ask for water, glasses that were never refilled the entire time we were there. Food was okay although I was very disappointed with mine. I ordered the Cajun jambalaya pasta. I was looking forward to the extra spicy Cajun sauce and was sad to see none. It was a pile of pasta that was dry and stuck together like it had been sitting in the bowl and got cold. There were maybe five pieces each of chicken and shrimp that were good and seasoned with the Cajun seasoning but there was no sauce insight. When I order pasta I assume that sauce will come with the pasta especially when the description says in spicy Cajun sauce. the server was very accommodating even offering to give me another dish or to get me more sauce but the fact is I had waited over 45 minutes to get this meal and I didn&amp;#39;t want to wait any longer to eat. the best part of our meal was the dessert the Godiva chocolate cheesecake was very delicious and to be honest I would only go to this restaurant for the cheesecake because the food at least the dish I had wasn&amp;#39;t worth it and I don&amp;#39;t like to wait almost an hour for my entree. If I had been with just my husband we would have left already but we were with family from out of town and they chose the restaurant.<br&gt;We&amp;#39;ve been to the Seattle restaurant and loved it, who knows we may try this one again if only for the dessert.", "rating": 2, "date": "9/26/2018"}, {"text": "On a Saturday night it was about a 20 minute wait. Our waiter Harold was amazing. <br&gt;We had the egg roll sampler (which was delicious) and we got the mac n cheese burger and the chicken parmigiana &amp;#34;like a pizza&amp;#34;. Both dishes were much bigger than we expected, and were sooo good. With a mixed drink, appetizer and 2 entrees our bill was $64. Usually when it&amp;#39;s that high I&amp;#39;ll complain that restaurant was not worth it, but this time-- totally worth it! Good place for date night. High recommend, will be back.", "rating": 5, "date": "3/31/2018"}, {"text": "What a disappointment this was. The food was barely average. I had a chicken &amp;amp; avocado club sandwich. One small piece of chicken on Each half. Had to order fries separately.  My friend ordered a turkey club plus bacon. No bacon on the sandwich, the server made no attempt to fix the error. The server, Daniel, was not personable at all. The place was not full  so some more attentiveness on his part would have been greatly appreciated. I doubt seriously if I&amp;#39;ll go back to the cheesecake factory, there are a lot of other restaurants around the Portland area they give much better service and better food  than this.", "rating": 3, "date": "6/2/2019"}, {"text": "The food is good but the service is terrible. We waited 1 hour and 45 minutes for our group to be seated only to be served by a waitress who was obviously in a bad mood. I seriously have no clue why any of the Cheesecake Factory&amp;#39;s don&amp;#39;t take reservations. Anyways our kid was at the table with us and at one point the waitress sort of shoved my kid to get the food onto the table. She served our food and was gone the whole time, never came by to offer refills or ask if we wanted anything else. In the end we ended up asking for our checks and left. Don&amp;#39;t know if we&amp;#39;ll come back to this location again.", "rating": 1, "date": "8/27/2018"}, {"text": "Worst customer service. It took 25 mins to get 3 slices of cheese cake to-go on a Sunday night at 9 pm. Never again!!!", "rating": 1, "date": "11/19/2018"}, {"text": "We love this place, it&amp;#39;s the quality food we&amp;#39;ve come to expect from Cheesecake Factory. It&amp;#39;s nice to know that even cross country they&amp;#39;ve maintained standards so well. I highly recommend the Mac and cheese burger- it&amp;#39;s amazing!", "rating": 5, "date": "11/13/2018"}, {"text": "Great food, awesome cheesecake  good service! Very nice inside but kinda spendy so be prepared. But the cheesecake is yummmmmmmm!", "rating": 4, "date": "12/8/2018"}, {"text": "The atmosphere is good, though busy.  Ordered Crispy Pineapple and shrimp with white rice.  Way too much sauce and rice was crispy, meaning either old rice or reheated.  Either way not good.  My dad had the pork chops which were bright pink inside, not cooked fully, and mashed potatoes were lumpy.  Will not go here again.", "rating": 2, "date": "8/3/2018"}, {"text": "DON&amp;#39;T WASTE YOUR MONEY! We were so excited for Cheesecake Factory to open in Oregon because we enjoyed CF in Calif. and AZ when we traveled. We are sad to report that after 8-10 visits, most of the time; we leave disappointed with the service. <br&gt;Wait staff are distracted and elusive. One time the excuse was that he was meeting with the manager; my guests and I along with many other patrons in our section were sitting unattended for FOURTY MINUTES. Patrons were walking around to search for servers. The waiter said that he was sorry and that his co-workers were supposed to take care of his tables while he was meeting with his manager.  <br&gt;Tonight our server spent the night breezing by and avoiding eye contact with us as much as she coul. After we had been there an hour and a half (it was not busy; there were plenty of open tables) we had to get up from our table and interrupt her path to flag her down. She returned to our table smelling like cigarette smoke. We did not get bread (this was not the first time.) They ran out of turkey so one of my guests had to select a different entree. They often run out of ingredients, so when you select the perfect entree from the menu, I recommend that you have a back up plan because if you have ask for the menu again; you will have to re-wait for the elusive wait staff to re-appear, this will add at least 20 minutes onto your dining experience. <br&gt;One night we did get AMAZING waiter. If we could get him every time, we would return because we love the menu, but sadly one awesome guy can&amp;#39;t carry this place. Shelling out nearly $20 for a plate of pasta, is worth it in So Cal and AZ but in Oregon we have poor service on top of over priced apps and drinks. meh This chain is an epic fail in Oregon.", "rating": 1, "date": "5/3/2018"}, {"text": "Crab cakes were a little over cooked, Crispy and DARK brown on the outside, but the Pineapple Moscow mule I ordered was Amazing. Service was good with our first server only to be switched but our second server turned out to be better! I ordered the shrimp and sausage pasta, also amazing. I got the smaller Lunch special size witch was plenty of food after I ate the bread and an appetizer. Overall I was happy with my dining experience at the Clackamas Cheesecake Factory. I would recommend eating here. One thing... you&amp;#39;ll have a wait to get seated with a larger party but worth it.", "rating": 4, "date": "1/20/2018"}, {"text": "I had never been to this new Cheesecake Factory before and my husband and I wanted to go on a nice date. We got there and were seated. They provide you with great tasting bread that keeps coming and amazing service. I definitely enjoyed my server. My husband and I both got the &amp;#34;Four Cheese Pasta,&amp;#34; definitely an amazing choice I would recommend. The Oreo Cheesecake was also a delightful choice though I was too full to finish it all. You really get your moneys worth here and excellent service. I will be coming back!", "rating": 5, "date": "6/17/2018"}, {"text": "We have tried this location 3 times and we will not be spending our time or money here again. <br&gt;1st visit, while newly open, we ate at the bar and ordered a few appetizers. The buffalo wings and the egg roll sampler plate.  Not hard to make and should arrive in 10-15 min.  Well, it took almost 40 minutes for the food to arrive and when it did it was cold, not warm but cold.  We asked the waitress to have them redo the buffalo wings.  that&amp;#39;s exactly what they did. They put the already cooked wings back into the fryer and cooked them again.  <br&gt;Needless to say they were not Edible at all.<br&gt;<br&gt;The second visit wasn&amp;#39;t too bad it seemed like the restaurant was getting better with their service and food. Couple minor hiccups in our orders but nothing to really gripe about. The order of fish and chips were decent.<br&gt;<br&gt;The third visit was quite the opposite. It took over 25 minutes for someone to bring us water, And the waitress wasn&amp;#39;t even ours.  Our waitress came by with in 5 min of us being seated and said she would be right back. Never saw her again.  We were finally able to order and when the food came it was not even presentable.  My wife ordered the soft tocos an we could not eat them. It was like someone missed several of the toppings and the steak was hard as rocks....like they used beef jerky.  Didn&amp;#39;t have time to get anything else seeing how we just spent 1.5 hours sitting there with our empty glasses.  <br&gt;<br&gt;Not returning!", "rating": 1, "date": "6/9/2018"}, {"text": "OK I was totally excited that the Clackamas area cheesecake factory was coming and I was totally counting down the days since I love the cheesecake factory and I was upset that the one cheesecake factory that I know is all the way over at the Beaverton Mall so I am glad that they came into the Clackamas Town center, because their food and their cheesecake is the bomb and anyone who knows or has ate there knows that their bread especially the brown bread (sorry I don&amp;#39;t know what it&amp;#39;s called) but that bread is delicious I mean just the bread alone I could make it a meal. <br&gt;Now everyone knows that the cheesecake factory has the most delicious cheesecake and desserts hands-down the food is actually very good and the portions are mighty big so if you&amp;#39;re just an average size eater you will definitely take home half your meal but if you&amp;#39;re a big eater like my son the whole dish is no problem! So as for the food I seriously love their food! And the menu selection is a 10! <br&gt;but my reason for the minus one star is a incident that happened I believe several times now if this happened one time that would be OK but it happened twice and I did contact the manager about it and if things change on my next trip I will update this to 5 stars and I think that is what yelp is meant for! For us to do the social media thing and for the owners to see the negative reviews  written about their business and to actually reply if they can but at least the next time when you do go in cuz the food is good or the many other services went great, you should go back again but mention that you had a bad experience last time and that you let social media know but willing to change the negative to positive with a  hopefully blessings things changed. <br&gt;you can always go back and change your review but really come on I mean if you think about all the negative compared to all the positive it&amp;#39;s sad because people only read and base their will to<br&gt;Visit or not based on the negatives! <br&gt;you can have a business that has 1000 customers and only three customers who write a negative and bring that business down to a one star business even though it&amp;#39;s a great business because the 997 other happy customers are still going! <br&gt;But my docking of one star is due to their curb side service! I call in my order which is such confusion at times, and twice now they don&amp;#39;t come out forever! Then you gotta call again to remind them your there! Also several times I open the bag and there are no utensils or the condiments you asked for! <br&gt;One time my order was mixed up and the request I made not done.  So I called and asked for the manager, he was so nice and apologetic and even offered a free gift card but I said no need. So he said he will work on making sure orders do not get forgotten to come out and that all request are now more closely looked at and the silverware is always in the bags. <br&gt;<br&gt;Next time I go I shall surely see if there is change and if so then I would love to give them a five star! <br&gt;But I am glad that they finally came to the Clackamas side! And being a franchise of course food is always the same taste, cost is same and size of food is same. The inside set up is the same and nice and clean but just need to remember us disabled peeps like me that ask for to go orders for curb side! <br&gt;<br&gt;Thanks Suzy-Q is our!", "rating": 4, "date": "3/20/2018"}, {"text": "If not for good service I would of given the place a 2 Star. Food is not nearly as good as the other Cheesecake Factory. And to find a way between levels at the mall is annoying. To top it off some high class person keyed my trailer, I think they were upset I require two parking places when towing. They say keep Portland weird but I say you can keep Portland and the surrounding area.", "rating": 3, "date": "8/31/2018"}, {"text": "Fantastic desserts and good service but the music was sooooo loud we had to shout to visit and still could hardly hear each other.", "rating": 4, "date": "12/10/2018"}, {"text": "The food is amazing. Took my mother to dinner there with to announce we are expecting twins. And it was a great special moment. Then to sweeten the deal someone paid our mean in full anonymously or it was comped either way we have no idea why but it was a pleasant surprise and amazing dinner. My steak was cooked so perfect didn&amp;#39;t need steak sauce. Perfect in every way.", "rating": 5, "date": "11/19/2018"}, {"text": "This was our first time at any Cheesecake Factory Restaurant. We had a gift card and went for lunch, and I&amp;#39;ll admit that I didn&amp;#39;t have very high hopes since we eat mostly plant-based. They actually had several options to choose from, and we settled on the vegan club salad. It was really good and very large. I would plan on splitting it next time. We also ordered a fried cauliflower appetizer but they didn&amp;#39;t bring it until after the salads. This wasn&amp;#39;t a big deal to us at all and we said nothing, but the waitress and then manager came over and apologized repeatedly and then comped it! I was shocked. I would go back just for the customer service. That&amp;#39;s unheard of these days.", "rating": 5, "date": "8/7/2018"}, {"text": "Me and my man are regulars here and we always have the best experience here. I LOVE EVERYTHING HERE! THE FOOD, THE CHEESECAKES!! 6 stars", "rating": 5, "date": "11/10/2018"}, {"text": "Who knew that the Cheesecake Factory opened in the perimeter of the Clackamas mall? We stumbled across this place and have enjoyed eating there several times. We have been eating at Cheesecake Factory restaurants throughout the country starting with the original Beverly Hills location few decades ago. The experience and food are the best that you can get at a corporate kitchen and sit at the enclosed patio. You won&amp;#39;t be disappointed", "rating": 5, "date": "6/29/2018"}, {"text": "Terrible service, terrible management. Waited for water, the dressings for a long time, my relative had almost barely any chicken on her salad she ordered, the manager said no to my request of slightly changing the price of an item that I ordered without(!) the shrimp and looked at me like I&amp;#39;m totally out of alignment; well I have worked in restaurants for over 15 years and I&amp;#39;ve never had any manager ever say no to a customer. Ever. If I could give zero stars I would..", "rating": 1, "date": "3/16/2018"}, {"text": "The food at this location is very inconsistent. <br&gt;<br&gt;Today we ordered a Factory Burrito Grande to go without chicken and cilantro. The burrito was filled with white sticky rice and was inedible. We ordered the same same burrito twice before in the last few weeks and was fine.<br&gt;<br&gt;We called to complain. The first reaction I got was whether we ordered the burrito at Taco Bell, since the burrito is not on the menu. Then the manager came on the line and told us that the recipe changed in the last 6 months. Then the story changed that the rice was over cooked. <br&gt;<br&gt;We know what white sticky rice looks like, and don&amp;#39;t like to be lied to. There was no accountability. They did compensate us for the burrito, but the lies and behavior will result in us not coming back for awhile. It&amp;#39;s too bad, we love the Washington Square location and were really excited they finally opened up in Clackamas.", "rating": 1, "date": "2/9/2018"}, {"text": "If I could give this place no stars, I would. <br&gt;We went last night for my sisters birthday. We had a larger group (10 adults and one child), so we called ahead earlier in the week but they do not accept reservations. <br&gt;We arrived an hour early to get our name in before everyone showed up, and they told us it would be a TWO HOUR wait. That&amp;#39;s ridiculous, but it was my sister&amp;#39;s birthday, so we decided to wait it out. The time went by, and long story short, 2.5 hours later we left without even sitting down. There was another large party eating and they were loitering after their meal was done. For a LONG time. The management did nothing to remedy the situation. After waiting that long, nothing. They didn&amp;#39;t ask the other group to not loiter. They didn&amp;#39;t offer to seat us anywhere else or split our group (at that point we probably would have just done this!) or anything. We all left completely enraged and starving. Horrible experience. Their lack of customer service was disheartening and I don&amp;#39;t believe any of us will ever be back. Twelve thumbs down!!!", "rating": 1, "date": "1/13/2018"}, {"text": "Do yourself a favor and just drive to the Wash Square location, this place was terrible. Food was the worst that I&amp;#39;ve ever tasted and I&amp;#39;ve been to Cheesecake Factory many times at Washington square and others out of state. On top of it, I passed along feedback to manager and he could care less.", "rating": 1, "date": "1/8/2018"}, {"text": "The food was good. There was food and napkins under the table as well as crumbs on my seat I had to wipe off before sitting down. So the restaurant wasn&amp;#39;t properly cleaned. The service wasn&amp;#39;t great but I&amp;#39;ve had worse.", "rating": 3, "date": "5/29/2018"}, {"text": "Last night was good until the mgr Logan started criticizing an associate on the floor in front of her customers making her feel uncomfortable for her and us we didn&amp;#39;t need to hear that there is a time and place for that and that wasn&amp;#39;t the time are waitress was really nice and polite not sure what the manager problem was LOGAN food was good service was good this was only are second bad experience since it&amp;#39;s been open", "rating": 3, "date": "6/25/2018"}, {"text": "Waited 40 minutes to be seated and then a meal for two took 2 hours. As I write this review I&amp;#39;m watching my cheesecake sit on the counter where it has sat for 10 minutes while people walk by, look at it, and breath on it. The worst service I&amp;#39;ve ever had at a restaurant. The famous food and cheesecake doesn&amp;#39;t make up for the absolutely horrible and long service. Will not come back here.", "rating": 1, "date": "12/30/2017"}, {"text": "This is a really nice place. It&amp;#39;s new and inviting if you  are in town. The cheese cake is amazing with every king of variety to choose from.", "rating": 4, "date": "5/31/2018"}, {"text": "Excellent service and excellent food. Steak, chicken, pizza, chips, lemonades, all done perfect!! Will be going again!", "rating": 5, "date": "7/16/2018"}, {"text": "A huge wait poor service and bad food. <br&gt;This place is nothing like Washington square. Stay away.", "rating": 1, "date": "3/25/2018"}, {"text": "Been here multiple times first time was great wait staff has been great every time. Now I have to get to the negatives. Long weekend wait time had called ahead for my father in laws birthday was told 15 min wait took a hour to get seated and wait time for food was even longer. Next children and crying babies DO NOT belong in the bar area. The last thing I want on an adult date night is to be seated next to a couple with a crying baby. To make it worse despite specifying everything needed to be Gluten Free for celiac disease we where still glutened. Nothing puts a damper on date night like being sick and having a dermatitis heretiformis breakout.", "rating": 2, "date": "3/9/2018"}, {"text": "Had a great experience on my grandsons 4th birthday. No wait time, fast service the food was awesome! Strawberry lemonade was so refreshing on a hot day. Our waiter was attentive &amp;amp; did an amazing job relating to grandson. He felt so special when the crew sang happy birthday to him. Love this restaurant!", "rating": 5, "date": "7/12/2018"}, {"text": "Ordered on Grubhub. Order came stone cold, burger was literally burnt and had a thick layer of salt on top, didn&amp;#39;t come as described. Hardly worth the expensive prices.", "rating": 1, "date": "12/18/2017"}, {"text": "I have to say it&amp;#39;s one of the worst meals my wife and I have had. She ordered a pasta dish that sat under warning light way to long. The sauce was burnt, noodles dried out, and oil puddled at the bottom of the bowl. I ordered the grilled chicken/avocado/ bacon  sandwich. They brushed it with oil/butter and soaked the bottom layer of bread. It was a big greasy mess. It was bad. Not worth the wait time or money.", "rating": 1, "date": "1/3/2018"}, {"text": "I&amp;#39;m not a chain person but wow, the food is great here! They can be disorganized but it&amp;#39;s such a huge place. I hate when I have to wait but we try to go off peak hours. Shepherds pie and the pastas with breaded chicken are my favorite.", "rating": 5, "date": "5/29/2018"}, {"text": "Delicious food. Great place to go out and they even deliver now on grubhub and other delivery apps. The food is filling and tastes amazing. I recommend it!", "rating": 5, "date": "10/31/2018"}, {"text": "Food was great but not worth the wait. If you have nothing to do with your day you can spend it waiting for your food and drink. The waitress was very nice and apologetic. The manager came over and apologized too but it didn&amp;#39;t change the pace of the service. Checked in at 6:40, sat at 7:50 didn&amp;#39;t get out meal until 8:40. We knew it would be busy so we had selected our meals while we were waiting. Ordered desserts to go and added an additional wait.", "rating": 1, "date": "2/3/2018"}, {"text": "Had the worst service. Server monica came and took my order. Always good tell I waited 15 to 20 minutes. No drink water no customer service. Got up and left table 11 Sunday", "rating": 1, "date": "12/18/2017"}, {"text": "Tried this restaurant last Saturday <br&gt;Got right in and help was bountiful <br&gt;<br&gt;We ordered appetizers and they were good<br&gt;Husband got Shepherds Pie and I ordered lemon chicken <br&gt;I got 3 pieces of chicken and not all 3 pieces were completely done (yuck)<br&gt;We never were offered refills on our very expensive ice teas<br&gt;But, we would go here again as they are brand new and I am sure this was just a one time mistake plus I really did not need 3 pieces of chicken anyway<br&gt;Did not get dessert this trip", "rating": 3, "date": "12/15/2017"}, {"text": "Not impressed tonight. Once seated it took them about 15 to 20 minutes just to be greeted and to get water order. We chose to order food at this time. It was busy and the waitress apologized and guaranteed she was going to take good care of us the rest of the night. 50 minutes later a new server came to us and said the other server was going home and he was taking over and our food was on the way.  I was ready to cancel the rest of the order and as I was talking to the new server they brought out the food, which was cold, and felt like it sat under the lamps for 20 minutes. Oh the last 20 minutes we watched the original server basically twiddle their thumbs back and forth and no acknowledgment to us at all.  Not impressed tonight as we thought a drink, some dinner and cheesecake would be a good anniversary dinner....not at all. The only reason I am giving 2 stars is the fact that the second server was kind and tried to be pleasant.", "rating": 2, "date": "12/5/2018"}, {"text": "The Springs at Clackamas Woods usually has a restaurant outing once a month to give the residents a chance to try different venues and cuisine.  This evening there were two groups of diners with two servers, but we were seated at tables pushed together so we could sit in close proximity. <br&gt;<br&gt;Our server, Tessie, distributed the menus and took our drink orders, which were served in a timely manner.  After placing our dinner orders, we were told that the kitchen was out of some of the items that were ordered so some of us placed a different order. When the server took our orders she was very systematic in writing them down but when we were served there was an issue with the items ordered for each guest. <br&gt;Our dinners had ample servings and all of us agreed that they were tasty.  <br&gt;<br&gt;The problem occurred with the billings.  Each guest had an individual bill but the line items on each bill did not agree with the diner&amp;#39;s order.  There were so many mistakes on 12 of the bills that the server returned several times to clarify what each diner ordered.  The Springs representative asked to speak with the on site manager, Damon Johnston, who responded with the statement that he didn&amp;#39;t know what the issue was and it would take additional time to address this problem.<br&gt;At this point it had already been 30 minutes after dessert was served and there were still billing issues.  <br&gt;<br&gt;As we were leaving, the server was thanked and, under her breath, was heard to say she hoped our group never returned!  This was so unprofessional and uncalled for.  It turned a pleasant outing into one that left a bad taste in our resident&amp;#39;s mouths.  We are very disappointed in the attitude of the management staff and will be contacting your corporate office to express our displeasure.<br&gt;<br&gt;Mark J Taylor", "rating": 2, "date": "2/26/2018"}, {"text": "I honestly didn&amp;#39;t like the Cheesecake Factory the food was not good and the service was so bad they were arrogant and mean! I would not recommend this place!", "rating": 1, "date": "12/7/2018"}, {"text": "So......my father of 74 wanted to surprise our whole family by reserving a table at THE NEWLY OPEN CHEEEESE-CAAAAKE-FACTORYYYY YEEEEY!!!!!<br&gt;<br&gt;He got there on time 5:15 and got his mechanism and we all got there before 6, knowing that the table will be ready at 6:15/6:30... 6::51pm The mechanism buzzes and the lights go party!!!! We go in and to our surprise they have a table for 4 people instead of 14!!! The music is so loud that they don&amp;#39;t understand people with little accent! My dad has an accent and I&amp;#39;m sure they couldn&amp;#39;t hear him clearly but they didn&amp;#39;t mind lowering the MUSIC A LITTLE LOWER!!!!  SOME PEOPLE HAVE LOWER VOICES, SOME (yes!) HAVE ACCENTS!!!!!!<br&gt;But that&amp;#39;s not a complaint. The complaint is the managers attitude and unprofessional approach to the situation.. we are not trash we are humans that deserves respect!! So when you tell us to go home after two hours show some remorse show that you care!! <br&gt;EVEN CHICK-FIL-A SHOWED MORE RESPECT FOR BEING 5 MIN LATE!!!!!!!!!! <br&gt;&amp;#34;Here s 10% off for next time&amp;#34; or &amp;#34;free slice of cake for next time&amp;#34; etc..<br&gt;I think the managers name was Mr. Damon. Congratulations on your upgrade from Burger King to cheesecake factory!", "rating": 1, "date": "2/17/2018"}, {"text": "Pretty standard as Cheesecake Factories go. Enormous menu, relaxed contemporary environment, and good people. Enjoy.", "rating": 4, "date": "3/24/2018"}, {"text": "We were a group of 7 and were sat pretty quickly at our table, large portion (we had lots to take home) and everyone liked their food! There were a few mistakes on our orders though. Things like the way the meat was cooked, and what kind of shrimp. That&amp;#39;s why I was going to take a few stars off. However our server, Lloyd, was great! I&amp;#39;m a vegan so dining out can be complicated and he was extremely helpful! He went out of his way to personally check that the chefs didn&amp;#39;t add any animal products like butter. So he&amp;#39;s the reason I added and extra star! Thanks Lloyd!", "rating": 4, "date": "7/20/2018"}, {"text": "Cheesecake Factory restaurants are typically one of my favorite places to eat, but this is the worst one I have been to. First, they were out of a couple select steaks which we specifically went to Cheesecake Factory for. Then, when someone in my party gets their beer the beer glass has a broken rim which cuts his lip. After telling the hostess about this it still took over 10 minutes for the manager or waiter to come to our table. The manager apologized and offered to take care of the meal. When the meals finally showed up, our friend with the cut lip&amp;#39;s meal didn&amp;#39;t arrive with the rest because they forgot to make his mashed potatoes. He got a salad in the mean time and finally got his meal after about 10 more minutes, but it was cold and still without mashed potatoes. At the end, our friend gets the bill for his meal which included his salad and a drink beside the one with the cut glass. It took calling the manager over, then the manager arguing with our friend before the issue was settled. In the end our friend got his cold meal and drinks compensated, but the entire process was a nightmare. We will not be returning to this specific Cheesecake Factory ever again.", "rating": 1, "date": "2/27/2019"}, {"text": "Do not go here if you want a good nachos!! Burned my first serving after waiting a half hour and sent it back waited another half hour and came back the same! First time I&amp;#39;ve ever been and the last. Horrible nachos! Just awful", "rating": 1, "date": "12/29/2017"}, {"text": "We love going to the Washington square location. They always give realistic time expectations and food is always great. I know the Clackamas location is fairly new...but I&amp;#39;ve not been impressed...We ordered two pasta dishes over the phone. Went to pick it up 25 minutes later as the person taking our order suggested this timeframe. The girls in the to-go area told my boyfriend they were just waiting on the pasta. Pasta is literally all that was ordered. After my boyfriend had been waiting AN HOUR AFTER THE ORDER WAS PLACED, he checked in again and they said they were still waiting on the kids marinara pasta plate...they FINALLY gave him our order an hour and 15 minutes after the order was placed..this is the kids pasta dish that took them an hour and 15 minutes to make..", "rating": 1, "date": "1/6/2018"}, {"text": "If you&amp;#39;re looking for a really good dessert or cheesecake this place can&amp;#39;t be beat. As for dinner here it was just so meh. And for the price there are plenty more amazing restaurants to go to in Portland imo but I do love a good cheesecake lol", "rating": 3, "date": "3/29/2018"}, {"text": "I LOVE THIS PLACE. Love the service, and the food was not ridiculously expensive, our total price came out to be as average considering the amounts of plates we ordered, and the atmosphere is very nice. Sometimes it gets really busy and the parking lot gets really crowded. Also there could be a long list of the waiting line", "rating": 5, "date": "3/3/2018"}, {"text": "The celebration cake was so good we went back two days in a row we can&amp;#39;t get enough of it. would love to come back every day for the celebration. Can  I marry the cake, is that legal in Oregon?", "rating": 5, "date": "2/17/2018"}, {"text": "Went on a Thursday afternoon around 3pm. Friendly and fast. The enivorment was chill it was just me and my boyfriend. I loved that we had a one and one booth very cute. We had the stuffed mushrooms and fried mac and cheese for appetizers. They were both yummy and hot. I had the Steak Diane &amp;amp; Salmon and My boyfriend had the Lasagna. It was delicious. Oh goodness definitely coming back. Also our server was nice.", "rating": 5, "date": "8/9/2018"}, {"text": "This truly is a Factory. Step on the conveyor belt and ride through the machine. Edible food served by adequately trained staff. Airport quality cocktails. A churn and burn chain from the 90s that has not evolved. Meh. They get an extra star for consistency.", "rating": 2, "date": "6/10/2018"}, {"text": "The food here is great and the vast selection of cheesecake is to die for. But I&amp;#39;d say service is a hit or miss. The last time I came in, it was definitely a miss.  It wasn&amp;#39;t very busy when my sister and I came in on a Monday night around 9:20. The hostess was friendly and seated us promptly outside. After 5-10 minutes of no one coming to our table, a different server came over with a couple waters and informed us that our server was a little backed up.  That was fine, I understand it can be easy to fall behind when tables want to check out at the same time or want their food boxed up. But then more time passed by and our server still hasn&amp;#39;t approached our table at all(she even walked by a few times without acknowledging us).  No matter how backed up you are, all it takes is a few seconds to at the very least greet your table. When she finally came over to take our order(which took around 20mins), her attitude just wasn&amp;#39;t very great. Even a simple &amp;#34;sorry for the wait&amp;#34; would&amp;#39;ve made things better. During our meal, she was behind us with another employee griping about wanting to get phased. Well it definitely showed.  Overall, the food was good, but we felt neglected and the bad service really took away from everything. Our server might have just been having a bad day, but it was just one of those dining experiences you wouldn&amp;#39;t want to put your family in.", "rating": 3, "date": "9/4/2019"}, {"text": "Food is always good here! A bit pricey but it&amp;#39;s a great place to splurge. It&amp;#39;s romantic and has dim lighting but also good for kids. We were seated by the kitchen and it was very loud so I took a star away for that. If you want a quiet dinner, ask to be seated away from the kitchen. But you may not be able to be picky. The wait is always about an hour when we go.", "rating": 4, "date": "2/24/2018"}, {"text": "Great service but $11.50 for a Long Island ice tea? Ridiculous. Just because it&amp;#39;s &amp;#39;skinny&amp;#39; and/or brunch?! Not cool. Lovely restaurant and great waiter but way too spendy.", "rating": 2, "date": "2/20/2018"}, {"text": "Food is decent. Not anything spectacular. Always super busy when I go. Not a place I&amp;#39;d travel out of the way to eat at but good if you live in the area and wanna stop in for a quick bite. They have a good selection of healthier meals as well.", "rating": 3, "date": "5/31/2018"}, {"text": "I went to the Cheesecake Factory and Alla was our server. Oh my god not only was the food amazing but the service was so fast and she was so knowledgeable about everything. I had no idea what I wanted to eat and took forever to decide but she was so patient even asking about my food interests, what I was in the mood for and if I had any allergies. I told her something Mediterranean and she instantly suggested three of her favorite things that would get that craving. She was so attentive, so sweet with all of our kids and even made sure to ask them how their food was and how they were doing. She knew all the paw patrol characters and the kids just loved her. She really knew her stuff and she was so fast frankly she must have wings cuz our food was flying out so fast!!! That woman is a goddess and a life saver if you ever go to Cheesecake Factory askfor Alla and bring a little extra cash cuz she&amp;#39;s gonna earn every dime. Wow!", "rating": 5, "date": "10/2/2019"}, {"text": "First off the started to seat us and then made us go back because they made a mistake.  Second I orders a hamburger no cheese.  When it came it had cheese.  We had no silverware no bread.  Worst place ever.  Will never go back.", "rating": 1, "date": "3/10/2018"}, {"text": "Way to expensive for what you receive.  I know portions size is big, but customer service and prices are way to much for what anyone imagines.  They will rip you of both food and beverages!", "rating": 2, "date": "10/13/2018"}, {"text": "There is no mozzarella sticks on the appetizer menu. Post meal, still no damn bread. &amp;#34;It&amp;#39;s in the oven&amp;#34; the man says (for an hour and a half). Basics people, basics. #sickofthis", "rating": 2, "date": "10/15/2018"}, {"text": "Great service! Great food! Our waiter was super nice and friendly. Everyone was very helpful and friendly. Got my usual the baja chicken tacos and they were great as usual. The white chocolate peppermint bark Cheesecake!!! Yum!!", "rating": 5, "date": "12/9/2017"}, {"text": "I had went for my birthday a couple months ago and went in a big party, I had went in a couple hours earlier (they were already so busy, line out to the door) and put my name on the list and when I came back they said that I was never on the list and were so rude about it, and I was bs because I had their buzzer... Not only was getting a table horrible but my service was not great as well.. my server tried her best and I don&amp;#39;t blame her but our food had come out at different times and my friend even got the wrong the dish.. and had to wait another 20 minutes to get her meal.. just ridiculous to get seated and just to get food.", "rating": 2, "date": "6/1/2018"}, {"text": "This was our first visit to this location in Happy Valley- very impressed! We were seated promptly considering it was Easter Sunday. Our waiter, Tom, was very helpful in assisting with the menu choosing among pages and pages of enticing options. The food came faster than expected, and exceeded our expectations. Overall, it was exemplary service and excellent food. Can&amp;#39;t wait to go back!", "rating": 5, "date": "4/1/2018"}, {"text": "Wait wasn&amp;#39;t long at all. However food took forever and one plate took so long (lettuce wraps) that we all finished our food before it arrived. Then we were told they hoped we didn&amp;#39;t want cheesecake because the bakery was super far behind on orders. Food is always good. Just not a very quick or relaxing place to eat.", "rating": 3, "date": "4/1/2018"}, {"text": "I always look forward to eating at the Cheesecake Factory, I love the avocado egg rolls.  I took my family last night, my wife and I&amp;#39;s anniversary.  I ordered the New York steak.   Well, my medium steak was taken to a different table as a rare steak.  At least they told me this as everyone else is eating except me but when I did get my steak 10 minutes after everyone else got theirs, the potatoes and green beans were so dry I could take a couple of bites.  They had to have been under the heat lamp while remaking my steak or changing the guys rare steak to my medium more likely.   I told the server, who offered to get me new potatoes to go since I was thru eating by that time but just didn&amp;#39;t sound appetizing.   Our first time at the Clackamas Cheesecake Factory and maybe our last.  For $150 when 4 of the meals out of 6 were kids&amp;#39; meals, just expected more.", "rating": 2, "date": "3/30/2018"}, {"text": "I had a great experience here tonight wonderful Coconut lime chicken. My friend had wonderful salmon ! Big portions and the Adams peanut butter cheesecake was delicious!!!", "rating": 4, "date": "3/28/2018"}, {"text": "Shitty shitty service. Took 3 hours to be seated on sunday. Took over an hour hour to bring out food. Burger was extra burnt. Had to ask waiter to refill our waters.  Appetizers came along with the meal not before.  They kept forgetting some of the items we ordered. The manager argues over a mistake they made on the order. Ew never want to come here again", "rating": 1, "date": "3/25/2018"}, {"text": "5 stars due to the positive experience and service we received yesterday!  We reluctantly sat at the bar since the wait was a bit.  We were warmly greeted right away by Joe (i think that was his name).  The food was good, not out of this world, but tasty and portions were generous.  The salad had a bit too much dressing and fries came cold.  Joe was very busy tending to the entire bar area and fixing the bar drinks but stayed attentive and quickly offered to get mom warm fries.  A bit through the meal, I saw him realize she didn&amp;#39;t have her fries and he personally ran from behind the bar to get her her hot fries.  Joe also spoke kindly about the employers of The Cheesecake factory which is so refreshing to hear that employers and employees alike are valued.  You don&amp;#39;t hear those kind of compliments regarding employers often enough these days.  Thanks for a nice positive experience to our lunch outing!", "rating": 5, "date": "1/14/2019"}, {"text": "The to go cheesecake counter was disorganized and to be honest a joke:/ not very capable abs not well trained staff. Not the usual Cheesecake Factory experience. Very disappointing", "rating": 3, "date": "11/11/2018"}, {"text": "Wasn&amp;#39;t a fan at all. Service was awful. Took 15 minutes just to get greeted, messed up something as simple as a salad, didn&amp;#39;t get refills when asked. Also they placed a hot plate right in front of my child who&amp;#39;s 18 months so reaches for everything. My pasta was crunchy and dry and my,boyfriends pizza was burnt and falling apart. I was so disappointed:/", "rating": 2, "date": "3/17/2018"}, {"text": "Gathered for a birthday celebration for my grandson Bryson. I was the designated arrive early to place our name. At 5:25 I expressed my desire for a table of 11. I was asked to step to the side and the manager would provide me a timeline. Approximately 10 minutes later the manager stated &amp;#34; it will be 3 hours.&amp;#34; I asked if I could change my request to a table of 6 and a table of 5. The change was made and I was told it would be an hour. I asked if she( the adorable young girl putting in the information) had placed me in line according to my previous request, as they were told 40 minutes and 10 had already gone by. I was told no because it is first come no reservations are allowed.<br&gt;Are you kidding me. This is a joke and a bad one, We opted to through in the towel.  There is a better way to do business.  Sadly they have such great cheesecake this yelp will do nothing to change a bad practice.", "rating": 1, "date": "3/4/2018"}, {"text": "First, the good:<br&gt;1. My dinner was excellent.<br&gt;2. Water and bread came quickly. <br&gt;3. Drinks were tasty. <br&gt;4. We were seated quickly. <br&gt;Boy, I wish there was more to say on the &amp;#34;good&amp;#34; side<br&gt;<br&gt;On the middling side of the fence:<br&gt;1. Waitress was nice, but WAAAYYY too chatty. <br&gt;2. Food was priced reasonably. <br&gt;3. Drinks were a bit on the expensive side. <br&gt;<br&gt;The bad:<br&gt;1. Our food took 35-40 minutes to get to the table after ordering, while other diners who were seated after us were already eating. <br&gt;2. Wife&amp;#39;s burger was not great, nor was it delivered as advertised, but she was famished, so she ate the patty only and two bites of her side salad. We told the waitress she was unhappy, but decided not to send it back due to time constraints. <br&gt;3. When she came back to offer dessert menu we declined and asked to speak to the manager to voice our dissatisfaction with her meal. He came, we said our piece and he argued with us. Wife finally said she was DONE arguing and we just wanted the check immediately so we could go. <br&gt;4. Getting the check took 10 more minutes. Wife was upset so I told her to go to the car and I would handle everything.<br&gt;5. Got the check and I was amazed to find the manager had not comped the burger. Waitress offered cheesecake to appease us, but I declined, as we had already made it clear wife was gluten free, therefore, cheesecake is not possible. I placed my full 20% cash tip on the table and asked to speak to the manager once again as I was NOT going to pay for a meal that we were dissatisfied with. Manager came by, I said I was happy to pay for everything except the burger and he refused to comp, as she had eaten the patty. I told him that was all that was edible and said again that I would pay for everything but not the burger while holding my credit card right in front of him. Again, he refused. I told him we were at an impasse and he was forcing my hand to walk out without paying AT ALL if that was his decision, and still he refused to budge.  He told me to smile for the camera as I walked out so he could call security.  I told him he was being a dick, he then called ME the dick, so I got up, smiled for the camera and gladly walked away from a horrible experience. <br&gt;<br&gt;Both the wife and I have well over thirty years of working in the food service industry in fine dining and upper casual establishments and I have never witnessed such a rude, unbending manager in all my years. Whatever happened to &amp;#34;the customer is always right&amp;#34;? Obviously, this particular Cheesecake Factory does not adhere to this edict.  As much as I was pleased with MY meal, I&amp;#39;ll now find it difficult to return to this location to try another.  How unfortunate. It could have turned out completely differently had the manager been more customer-centric.", "rating": 1, "date": "5/22/2018"}, {"text": "It started off terribly with them telling my fiance and I it was a 15 minute wait. Not bad....but 30 minutes go by and I see people that walking after us and they go to a table before us. When we finally get a table they completely forget about us and we don&amp;#39;t get any service until 30 mins after sitting down. Food was bland and service was ok but not great. Cheesecake was good but we didn&amp;#39;t get to try the one we wanted cause they were out. Never going to go back. It was not worth our time. Waste of time and money", "rating": 1, "date": "2/17/2018"}, {"text": "Saturday night arrived at 5:50pm, Party of 7 for a birthday dinner, 4 adults 3 children, A total of 2-1/2 hour wait time before we were seated, after being there waiting for 1.5 hours we were being told every 15 minutes that &amp;#34;we were next&amp;#34; or &amp;#34;the table is being set&amp;#34;, we were finally seated, took another 20 min just to get the server to take our order, took another 15 minutes just to find out they were &amp;#34;out&amp;#34; of bread and a few other items on the menu, nobody who worked there could give us a straight answer on why everything was so unorganized, the manager and assistant manger are completely incompetent and rude, horrible customer service and the worst attitudes, won&amp;#39;t be coming back ever, save yourself the frustration and take your business elsewhere.", "rating": 1, "date": "3/11/2018"}, {"text": "Sooo happy they just opened this location! And of course they did not disappoint! Christy, our server, did a great job! She has an eye for details. Her and the host&amp;#39;s upfront were delightful to interact with. Same great wonderful food you expect from Cheesecake Factory. Thanks everyone!!!", "rating": 5, "date": "1/14/2018"}, {"text": "Posting a one star review because our recent trip last weekend was a bust. Not only did they quote us the wrong wait time (had to wait an extra 45 minutes past what we were originally quoted) but the chicken piccata was not good. The avocado egg rolls were good though, as always. My daughter had food poisoning from the dulce de leche cheesecake. Would have thought it was a fluke if someone else I know hadn&amp;#39;t supported it with their own story of food poisoning from the cheesecake, too.", "rating": 1, "date": "1/12/2019"}, {"text": "Went here on a Friday night and of course packed (plus it opened a couple weeks ago) but totally worth the wait! Their menu has a variety of dishes for meat eaters to vegan. My fiancé and I tried four cheese pasta, guacamole avocado salad, cauliflower honey bbq appetizer and pot sticker appetizer. All amazing especially the cauliflower appetizer. The cheesecake was lemon raspberry. Everything was awesome! Will go back! Plus when they seat you, you receive bread. :)", "rating": 5, "date": "12/31/2017"}, {"text": "Very disappointing. Service was good and helpful but I came here for the Tuna Tartare appetizer (during lunch and it wasn&amp;#39;t even packed) and they ran out of it. I drove out here from Vancouver just to eat here and mainly for that dish and was let down. I&amp;#39;m not sure if I&amp;#39;ll come back here again. The food here to me is mediocre.", "rating": 2, "date": "12/27/2017"}, {"text": "Probably i was too expected of foods?<br&gt;Cheese cakes are absolutely good but<br&gt;I got lunch time spaghetti and pizza<br&gt;Horrible taste... especially spaghetti was really bad", "rating": 3, "date": "12/27/2017"}, {"text": "REEDEM YOURSELVES I DON&amp;#39;T WANT TO LOSE YOU!<br&gt;The Cheesecake Factory has always been one of my favourite places. My family and I have been regulars for years at the Summerlin location as well as on the Strip. The employees at the Vegas locations embody everything that Cheesecake stands for (In my opinion). That being said...I have had some terrible experiences at this location. My first visit, I was there waiting for 3+hours. I understand some dishes got mixed up, you&amp;#39;re busy with other tables, food comes out cold or whatever. That&amp;#39;s a part of the food industry...things happen. BUT when it takes about 45 mins to get some water, I&amp;#39;m confused. I have blocked out part of that experience, it was pretty bad. I am not a quitter though! I gave it another shot. The second time I went in I brought my family, this time it was the complete opposite problem. Everything was running very smoothly up until our waiter was telling us to &amp;#34;hurry up&amp;#34; because we were taking too long to order. He then WALKED AWAY WHILE WE WERE ASKING HIM A QUESTION...WALKED AWAY! He went to go talk to this girl who was another server she was on her phone by the POS system laughing and talking. We tried to get his attention after about 15 mins he came back and told us to order now. SO we tried again to ask him some questions he just said &amp;#34;I don&amp;#39;t know&amp;#34; rolled his eyes. We were a little stunned. we just decided order. He then came back about an hour later saying they didn&amp;#39;t have what we wanted...so we ordered something else. Thats fine. Our dinner came and went, he then threw our to-go boxes on the table and asked if we wanted dessert. Dessert is supposed to bring this already FABULOUS dining experience to a close. We went for it. Everyone ordered a piece of cheesecake, granted I do take a minute to decide what I want...HE RUSHED IT OUT OF ME. I TOLD HIM TO GIVE ME A MINTUE! He came back and I told him I was ready then he said &amp;#34;oh now you&amp;#39;re ready?&amp;#34;. <br&gt;Have a thick skin walking in...never thought I would say that. I&amp;#39;ll return to the VEGAS locations...not too stoked about this one though. <br&gt;THE BAKERS/CASHIERS (in the bakery section) ARE WHAT SAVE THIS LOCATION!", "rating": 2, "date": "5/4/2018"}, {"text": "Good food and better desert! Service is a bit slow usually but the servers are always nice.", "rating": 4, "date": "12/28/2017"}, {"text": "If I could give this place negative stars I would. My roommate and I live about 5 minutes drive away from this location and placed a delivery order through Grubhub at 11:45 am today. She received a message from The Cheesecake factory at 12:30pm saying the food wouldn&amp;#39;t arrive till 1pm and they were throwing in some free food for taking so long. The food arrived at 1:03 pm and it was just my salad. A cold salad with nothing but lettuce, chopped veggies, some cheese and dressing. She ordered several appetizer items and none of her items were in the bag. She called both Grubhub and Cheesecake factory to complain Grubhub was wonderful and gave her a full refund. What was the Cheesecake factorys response? &amp;#34; oh well we ran out so that&amp;#39;s why we didn&amp;#39;t send the rest of your order.&amp;#34; A direct quote. Why wouldn&amp;#39;t they send another message like they did before saying they were out of her items? Where is the &amp;#34; free&amp;#34; stuff that was supposedly coming with the food? Why did it take over an hour to send out a cold salad if they ran out of her items? By the way my salad was disgusting and had several pieces of dark brown salad going bad. You suck cheesecake factory and I hope you go out of business.", "rating": 1, "date": "12/21/2017"}, {"text": "I have been to several Cheesecake Factories and I would always give 5 stars however this is the worst restaurant experience I have ever experienced.  First off our waiter was excellent and the food was good.  My rating is for the experience.  It starts by being out of two of the main dishes that 2 out of 4 of our table ordered on a Tuesday night being not available because they were out of steak.  ??  So two of us ordered something else which included myself.  My buddy ordered a drink and we he took a sip he cut his lip on the glass that had a crack about a 1/4 of the way around the top of the glass.  So after his lip was bleeding we finally got the manager over to replace the drink.  Food service was slow and when the food showed up, everyone received their order except my buddy who had cut his lip and he was told they ran out of mashed potatoes and they would be brought out once they made more.  He was given French fries to hold him over with his meal.  Once he and everyone was done eating, the mashed potatoes showed up.  Needless to say we had enough at this point and the Cheesecake we hoped to have after our meal, was not going to happen. The manager did initially comp part of my buddies meal at first and once he was advised of the multiple incidents to start off with that we couldn&amp;#39;t order what we wanted, his meal was fully comped.  I think a little more should have been done but it is what it is.  Not likely to return.", "rating": 1, "date": "2/26/2019"}, {"text": "Can&amp;#39;t actually comment on food because I&amp;#39;ve never had the patience to wait 40+ minutes for a table. Came by tonight to see about 20 open tables and still a 30+ min wait!! Why?? They shut down tables because they had a couple bigger parties to handle and they were admittedly understaffed.  What a joke!  Skip this place entirely and go to Nordstrom&amp;#39;s cafe. Food and service are excellent and there is usually NO wait!!!", "rating": 1, "date": "7/25/2018"}, {"text": "First time going to the cheesecake factory, and let me say it was not a good experience. Waited 1 hour for a seat for 2. Then waited almost as long for our food. When I was ready to order cheesecake to go I asked to have my meal boxed up and instead of just giving me a box, the waitress had someone else take it to get boxed. He comes back and told me that my food was thrown out instead of boxed. A pasta that was almost 20$ and half left was thrown out. Then he tells me to talk to my waitress when I asked about getting a new one or getting alittle taken off my bill. The waitress comes and tells me she will talk to her manager and see what he says, the manager who&amp;#39;s name was David as I later found out gave me 3$ off a 20$ pasta. When instead of being boxed up for a customer was thrown out. So I just go and order my cheesecake and leave. I get home and go to eat my cheesecake and open the box to find a half eaten steak and mash potatoes. So I call and ask for the manager. After having a discussion with him over the cheesecakes he tells me he will give me the money back. I call to see and he only put 1 cheesecake back on my card, so I call back again and I&amp;#39;m told by the manager David that he only seen one and he can&amp;#39;t do nothing more. When I have the receipt and it clearly has 2 cheesecakes on it. Horrible customer service and a horrible experience. Will be talking to the higher ups about it.<br&gt;<br&gt;Edit- I got both cheesecakes refunded. Still was not a delightful experience.", "rating": 1, "date": "1/11/2018"}, {"text": "Service is horrible. They told us it will be a 30-45 minute wait, waited for 1 hour and 15 minutes. After the waiter finally decided to show up and take our order, we waited for another 45 minutes to get our food. Waiter was annoyed from the simplest request. Music is loud, the place is small and the service is horrible.", "rating": 1, "date": "8/26/2018"}, {"text": "Great visit to Cheesecake Factory. Food quality and wait times are much better than the one at Washington Square in Tigard.", "rating": 4, "date": "6/17/2018"}, {"text": "Great experience today. Came in after a husband wife date day. Had the egg rolls and salad with two glasses of wine. Fantastic service from Lloyd. Usually go to Washington Square location but I think our new favorite is Llord and the Clackamas Town Center location. Thanks Lloyd!!", "rating": 5, "date": "8/20/2018"}, {"text": "Worst experience I&amp;#39;ve ever had at Cheesecake Factory. Hoping it&amp;#39;s because it&amp;#39;s a brand new location at Clackamas Town Center and they&amp;#39;re still working out the kinks. We walked in and was told it would be a 20 minute wait (even though there were several empty tables) or we could sit in the bar. We proceeded to a table in the bar and sat down. A waitress immediately told us we couldn&amp;#39;t sit there. I explained that the gal at the front told us we could. Not even 15 seconds later, another waitress came back with the first one in tow, to tell us we couldn&amp;#39;t sit there. I again explained that we were told we could sit in the bar. Long story short, we just got up and left, instead of arguing with the 2 ladies! So sad, because I was hoping to have my birthday dinner there later this month. I don&amp;#39;t know what the big deal was, especially since there were several available tables in the restaurant and in the bar!!", "rating": 1, "date": "12/16/2017"}, {"text": "This review is for Amy the manager, unfortunately our stay was cut short due to our appetizer the delicious Tex mex egg rolls, before my spouse bit into the second one we seen a &amp;#34;hair like&amp;#34; string hanging off the waiter watched us pull it off.. he proceeded to take it from us and we asked if it was a hair and his response was &amp;#34;looks like it&amp;#34; he walked off and said he would handle this immediately, he then stated his manger would come over and helped us expeditiously, Amy came over and asked us what happens we told her and we ask if we can just get a fresh batch because it didn&amp;#39;t sit well with us and she said &amp;#34;Not for free, you can pay for another batch even if you don&amp;#39;t finish these&amp;#34; I said and why is that she said because &amp;#34;I know it wasn&amp;#39;t a hair&amp;#34;  being that you have no laboratory in the back to check the easier thing to do was to just replace the egg rolls with fresh ones and so we can get ready for us pasta plates. I asked for her name and she left. The nice waiter came back and asked if she took care of it and we said no, and decided to leave because it&amp;#39;s simple customer service I come from a family of restaurant owners and we would never do that because we take pride in our food!  Regardless if you think it isn&amp;#39;t a hair or not just for the customers sake. He than said that&amp;#39;s weird she should&amp;#39;ve and brought another manager and after telling her the story for the 3rd time we lost our appetite by now and decided to leave we asked for receipt to pay for egg rolls and she said I can&amp;#39;t make you pay for those and offered fresh ones we politely declined. And there you have it all of this for what?  Something so simple went on for 20 mins because the manager didn&amp;#39;t &amp;#34;believe the customer was right&amp;#34; it&amp;#39;s a simple task.. maybe next time you&amp;#39;ll make customers feel like there appreciated.. Thank a lot to the wonderful waiter and kind 2nd manager... hope there&amp;#39;s not a lot of &amp;#34;Amy&amp;#39;s&amp;#34; working you&amp;#39;ll lose out on a lot of revenue. Have a good day!", "rating": 1, "date": "6/8/2019"}, {"text": "Worst service ever this is the second time I go there and they manage to treat customers like garbage. They look to see who is more likely to give a big tip and when they see someone without brand clothing expected we can&amp;#39;t give a tip. When we arrived they took 30 minutes then asked us what kind of drink we wanted then with no bread I was like fine then the guy switched our server because he didn&amp;#39;t want to take our order. And I told my family we were leaving because we were going to spend money on a b.s place that doesn&amp;#39;t respect there customers. And the only reason they came up was because I popped up the yelp add because they knew it wasn&amp;#39;t right.", "rating": 1, "date": "2/5/2018"}, {"text": "2 PM on a Saturday and no wait. Factory chop salad chicken avocado club and Cuban sand were awesome. Very friendly staff.", "rating": 5, "date": "8/11/2018"}, {"text": "Not worth it. I&amp;#39;m the guy that almost always leaves great reviews. I&amp;#39;m not the &amp;#34;debbie downer&amp;#34; type. But, this latest visit was disappointing, to put it lightly. The food was as expected, leaning towards &amp;#34;meh.&amp;#34; The service and staff were disorganized. Starting from the beginning, we were told it&amp;#39;d be an hour wait, which is to be expected for a premium restaurant. We arrived at 6:00pm on a Saturday night. We were seated around 7:20pm. We asked the hostess for a high-chair, and she said she was grabbing one, but it never came.  After being seated and realizing a high-chair wasn&amp;#39;t coming, we asked a random staff member to grab one for us.  Our waitress was Mariah.  She was friendly, but obviously overwhelmed.  Not her fault.  She was doing her best and hustling all night.  We didn&amp;#39;t have to wait very long for our food.  My father-in-laws Fish and Chips came out slightly cold and greasy.  I decided to go all out and ordered the Filet Mignon with Erath Vineyards Pinot Noir.  We received our entrees, but my filet did not include a steak knife.  Actually, there were no knives on the table.  We buttered our bread with our spoons and forks.  I was almost done with my potatoes and green beans before we were able to flag down another random staff member to bring us a steak knife for my filet.  Once Mariah returned...(it appeared she was having a problem with an eight-top across from us who kept sending their food back to the kitchen)...but after she finally returned, she realized we had not received the Pinot Noir...which I wanted to pair with my filet.  She rushed it out to the table, but...by this point...we were halfway thru dinner.  My in-laws were disappointed at the fragmented dinner service, because no one wants to start eating dinner until everyone is ready.  And while waiting on a steak knife, and then the Pinot...we all seemed to be eating at different times.  For a premium price, this visit didn&amp;#39;t own up to the cost...and unfortunately...we&amp;#39;re likely to choose somewhere else next time.  The experience was so hectic and disorganized, I doubt I would reconsider a second-chance.  Had I checked Yelp first, I may not have gone at all to begin with.  I wish the location and future patrons better luck in the future.", "rating": 2, "date": "3/5/2018"}, {"text": "Very sad to get fish and chips to go with no tartar sauce. Can do without ketchup for the fries but NO tartar sauce? Really?  No lemon? What???", "rating": 1, "date": "1/23/2018"}, {"text": "And I&amp;#39;m being nice because the service and the waitress was amazing. The food..... not so much. My niece ordered chicken tenders and it was 90% batter.... I ordered tater tot appetizers and they were so soggy. I didn&amp;#39;t catch the girls name but she was super sweet and attentive. I hope she kept the full tip.", "rating": 2, "date": "6/18/2018"}, {"text": "Service from other people say that it&amp;#39;s very slow. But in my recent experience, it was fast, but a little too fast. We sat down within 5 minutes. Got our water and some bread to eat. We placed our order and then decided to go check out what cheesecake to have for dessert. We got back to our table about 3 minutes later and our table was cleared off. Only thing left on the table was a salt and pepper shaker. I guess they didn&amp;#39;t notice the jacket sitting on the bench.  We asked the for order was still in the kitchen they said yes. But after seeing that the table next to us ordering the same time as we did already had their meal. And we waited another 15 minutes or so. So they probly had to re order. Even though the food there is so so, love the cheesecake. Service was super super super fast for the 1st 15 minutes. I didn&amp;#39;t think they had to turn tables that fast. Mentioned to the host and they said meh, oh well.", "rating": 2, "date": "3/30/2018"}, {"text": "HUGE menu. I prefer happy hour just because you can try lots of small plates from the length menu. Of course you have to get some cheesecake to go with all their choices.", "rating": 4, "date": "5/27/2018"}, {"text": "Had a really good experience! Took my gal out for a late lunch. We were sat immediately. I had the steak Diane which was amazing! Definitely recommend it. My gal had the New York steak. Great flavor, but I have to knock off a star because she wanted it cooked medium rare and it arrived medium well. It was also a very thinly cut steak. Overall, we were both pleased and will definitely be back. Glad they opened at this location!", "rating": 4, "date": "1/7/2018"}, {"text": "We ate here on a Friday night and it was packed. We were told a 45 minute wait, they gave us one of those alert buzzers and we wondered off. Their wait estimate was close -about 40 minutes in, our buzzer went off and we were seated in a two person booth. (Note: the booth was small and there&amp;#39;s no coat hooks). The overall feel of the restaurant felt small to me, verging on uncomfortable. Prepare yourself to yell-speak. You&amp;#39;ll walk out of there to the parking lot&amp;#39;s &amp;#34;quiet&amp;#34; and realize how all the noise made your ears numb. I also didn&amp;#39;t like that they let people waiting pretty much wonder through the whole front of the restaurant. It&amp;#39;s like you gotta fight to get in and fight to get out. We had two friendly servers (one was shadowing the other for training). We ordered two chicken pasta dishes- one good, the other okay. Cheesecake was yummy (we had the Godiva). Overall, if you can deal with the craziness of the atmosphere then try it. But for me, I can&amp;#39;t say it&amp;#39;s worth going back.", "rating": 3, "date": "1/16/2018"}, {"text": "Service was very slow. Took forever to get our food and they are way over priced for what you get.", "rating": 1, "date": "2/25/2018"}, {"text": "With only a party of four it took about two hours to get our food. We were never told it would take that long. I had my 2 year old daughter with me and she was hungry. I had to ask the waitress how much longer because my little one was hungry and it seemed like she was avoiding us and walking away when I would ask her questions. The food was ok but am pretty disappointed in the service. It kind of ruined my Cheesecake Factory experience that I&amp;#39;m used to having at Washington Square. I don&amp;#39;t think I&amp;#39;ll be going back. As for all the terrible reviews on here..,.I am a business owner myself and don&amp;#39;t take them lightly. This is my first bad review I&amp;#39;ve ever given... do to the customer service and lack of care showed by the management.  It&amp;#39;s concerning to see all the negative reviews and see the same response from the management.  It seems they may need new management.  It&amp;#39;s not the staff... it comes from the management. Good luck!", "rating": 1, "date": "2/19/2018"}, {"text": "We have always loved cheesecake factory and it has been a go to for me and my husband on date night. We decided to take my family out for a nice brunch and specifically chose CF because my son has an egg allergy, and I figured that they would be able to accommodate us since most places we go that are big chains have direct access to their ingredients. I trusted the server when I asked what menu items my son could eat specifically wondering about breads, pasta and pizza. I had told my son that he would be able to have some sort of toast since most breads do not have eggs in them. I was surprised when the server came back to tell me that all of the food that I inquired about had eggs in it...my son was stuck eating a side of avocado, side of potatoes and a small bowl of fruit. I decided to look more into this because it didn&amp;#39;t seem correct and to my surprise I found out that all of the items that I had specifically asked about were actually vegan (egg free). I cannot believe that the kitchen staff and my server would be so negligent and not try to accommodate me or my family. It was so sad not being able to order anything for my son and being that he is only two he does not understand why everyone else around him is eating and he&amp;#39;s not allowed to eat anything. Never again, heartbreaking.", "rating": 1, "date": "1/14/2018"}, {"text": "Told would be 55 minutes. 2 hours later we still were not seated!  Will reserve judgment until get our food. Wonder how long that will take.", "rating": 3, "date": "1/13/2018"}, {"text": "We were highly disappointed with our very short experience tonight. A friend of ours is in town from California and being that none of us have been here before, we hoped for a great night out. We were wrong. We arrived here around 8pm, and two of our party members arrived separately and each put their name down. One of them got a 50 minute wait-time quote, and the other got no quote at all. We had been sitting down waiting patiently and enjoying each other&amp;#39;s company for only about 10-15 minutes when the manager came over to greet us, and told us that now, given the amount of large parties that are seated right now, it was estimated a 4 1/2 - 5 HOUR wait time. His name is Ashton. He spoke to us in a very condescending tone, and given that we were a group of 7 young adults with a baby, we very strongly feel that the estimation he gave us was EXTREMELY exaggerated. Never before have I ever received a wait time of more than an hour and a half. We are extremely disappointed in him for speaking to us the way he did. It gave us no reason to doubt that he only said that in hopes that we would leave, given that a party of 7 should not have to wait 5 HOURS at 8pm to get a table. We ALL work in customer service, and we know that there is absolutely no way that every single table sitting in that restaurant was going to stay at their table for over 4 more hours. No way. Extremely irritated and disappointed with how he treated us.", "rating": 1, "date": "3/9/2019"}, {"text": "I had ordered take out and received the wrong thing. Contacted the manager Eddie and he was amazing to work with and compensated me for the mess up . Was very easy going to work with and will 100% be going back due to this great experience.  Thank you Eddie !", "rating": 5, "date": "12/30/2017"}, {"text": "They do not take reservations for large groups. Come on people we need to be smarter no restaurant is worth an hour or more wait. There are too many good options out there.", "rating": 1, "date": "4/7/2018"}, {"text": "Jeremy was the best waiter we had ever had! The food was amazing.... so happy to have found this location!", "rating": 5, "date": "3/31/2018"}, {"text": "As a HUGE Cheesecake Factory fan, I was extremely disappointed with our first experience here last week. We had a larger party (13) but called ahead (at 1pm) and went early to check in at 2:15. We were told we had to speak to a manager due to our parties size... then we<br&gt;were told about a 1-2 hour wait (which is a large time slot window but we were ok waiting a bit). At 4:45 (2 1/2 hours later) we were finally seated. It went from bad to worse. Service was ok, didn&amp;#39;t seem to hurry to get us ordered or bring anything. We waited for bread, waited even longer for drinks and then apps. Our drinks were empty and all apps/bread gone LONG before our food finally arrived. We finally got out of there at 6:45 (2 HOURS after sitting down) and didn&amp;#39;t even want to eat dessert. I ordered a piece of cheesecake to go and was told a manager would have to add it to our bill because they&amp;#39;d totaled it already. Very weird. I would not recommend this location because the management/service/wait time. Also the food was smaller portioned than past cheesecake experiences. Maybe once they get better service/management or have been there some time I might try it again. Not worth the time commitment!", "rating": 2, "date": "1/5/2018"}, {"text": "Let me start off by saying that I am typically a major fan of The Cheesecake Factory and writing this review is disheartening. I love their menu and their atmosphere. The location in Washington Square Mall turned me on to the place, however this location seems to be slacking. I have been three times since this location has opened and sadly each time seems to go worse than the last. I understand that this is a new location and it takes some time to get the gears in motion, however I think that the grace period for that has ended. All three times I attended, I have had friendly service. The hosts/hostesses and servers are pleasant. The food is usually decent as well, especially for being a chain restaurant. What I am not a fan of, however, is their lack of attention. The first two times, I recall waiting for the server for upwards of 10 minutes after being seated and nearly 30 minutes waiting for the bill. Most recently, I had to wait an hour for a table for two when the hostess let us know that it would be only be 30 minutes. Unfortunately, that is unacceptable. I am hoping that they will get it together eventually as this is the closest location to me, but until then I will just stick with the The Cheesecake Factory at Washington Square Mall.", "rating": 2, "date": "3/14/2018"}, {"text": "Had an amazing birthday lunch with my momma! The server, whose name I forget but whose face I will always remember, was wonderful! Clearly very experienced (with serving and with the Cheesecake Factory menu), he took his time with us, helped us figure out what we wanted, chatted in a super friendly fashion, and generally just made the lunch that much better. We both had the Bow tie pasta with chicken and roasted garlic cream sauce-Amazing! Will most definitely order that again! Got two slices of cheesecake to go- I am sure they will be great as well, but for now my tummy is full of delicious pasta. Overall, a terrific experience. Now, this is a BUSY location with mostly two and four top tables. You will not get in and out of this place fast. We were there close to the opening and it was still busy, so I imagine that during the dinner rush it will be kinda insane. If you are ordering from grub hub, pick things you would enjoy eating when cooled....cause the food isn&amp;#39;t going to get to you fast and hot. If you are there during the dinner rush, just sit back and relax. Even lunch was a good hour, and dinner I could see lasting two. I would go back here in a second, and I will definitely order this through Grub hub in the future as well. And again, a super high five to my server- you deserve a raise!", "rating": 5, "date": "1/12/2018"}, {"text": "First time going to Cheesecake Factory!  Very nice service.  Lots of choices, something for everyone.  Workers trained very well.  Typical Cheesecake Factory with the lots of cheesecakes.  Waiter gives a recommendation for which Cheesecake also.", "rating": 5, "date": "1/11/2018"}, {"text": "Good portions.. a little pricey for what it is but great atmosphere.. one thing is we went on a opening day and the trainers were literally staring at us eating.. was very awkward.. standing right next to me and giggling every time I told my wife a joke.. weird but the food was great lol", "rating": 5, "date": "1/3/2018"}, {"text": "I haven&amp;#39;t been seated yet and I&amp;#39;m already disappointed when I arrived with a party of 9 they told me it would be two hours but I had to &amp;#34;stand aside to talk to the manager&amp;#34; it took him another 20 minutes to come tell me it was actually a 3 hour wait because they don&amp;#39;t put me in the system until he talks to me ... I said ok well we are here and it my daughters 13th birthday and he was very rude and said IF I wanted to wait it would be 3 hours ..it was his attitude that put me off ..and why wouldn&amp;#39;t they actually start trying to make room when I arrived ? I&amp;#39;ll update if it&amp;#39;s worth it...", "rating": 1, "date": "2/24/2018"}, {"text": "My family of five tried your new establishment today for lunch. We were quoted a 50 minute wait time &amp;amp; chose to do so. We were seated within that time. We ordered our food &amp;amp; our 3 kids food. Theirs arrived in under 20 minutes (Mac &amp;amp; cheese) but ours took over 30 minutes and our kids were completely finished by then. We ordered the Chicken &amp;amp; Waffles Benedict and the Fish Tacos. The syrup that came with the waffles was straight oil. We waited for some normal syrup. The hollandaise sauce was disgusting &amp;amp; inedible! The manager removed it from our bill. When we ordered the Fish Tacos we specifically asked if they had cabbage or lettuce on them. It was not an ingredient in the description but common. Our waiter said no. They arrived with red cabbage. I removed it but along with it came most of the sauce &amp;amp; avocado. The fish was soggy (maybe thawed too quickly) &amp;amp; tasteless. They were not good &amp;amp; I have been burping fish all afternoon. I DO NOT recommend eating at this location until their wait staff had been properly trained on the menu and their kitchen staff can figure out how to decently fry fish &amp;amp; anticipate the amount of customers. The wait was way too long for a seat &amp;amp; way too long for food &amp;amp; very disappointing once it arrived. Our waiter was friendly &amp;amp; apologetic but for their prices I want good food!", "rating": 1, "date": "12/30/2017"}, {"text": "I&amp;#39;ve always liked this restaurant, but once the one in clackamas opened up I got a shrimp pasta, unfortunately the shrimp still had that translucent color and was cold to the bite.", "rating": 2, "date": "12/26/2017"}, {"text": "Do not, under any circumstances get delivery from this location. The order my wife made was missing items from the food that was delivered and then we were missing our entire dessert order. The manager was beyond rude when called to ask about how this situation might be rectified, actually hanging up on my wife. I don&amp;#39;t care how good their food may or may not be, the customer service is non existent. We will not be using this establishment again.", "rating": 1, "date": "12/21/2017"}, {"text": "Awesome service! Awesome food! Awesome atmosphere! I&amp;#39;m so glad they finally came to this side of town.  I had a great &amp;#34;skinny&amp;#34; salad and then indulged on the fresh banana cream cheese cake....yummmm! Love this place! Go...you won&amp;#39;t regret it!", "rating": 5, "date": "12/12/2017"}, {"text": "My 9 year old son and I went for dinner tonight. We checked in at 5pm and were told there was an hour wait. No problem, we walked around the mall and returned at 6pm. The waitress (Sarah L.) seated us and came back to take our orders. It was 45 minutes later and we had not received our food and not a word from our waitress. I noticed a couple of tables of people that were seated after us had already received their food. I waved Sarah down and asked her to check on our order. She came back 5 minutes later with my son&amp;#39;s kid menu pepperoni pizza and said they were still working on my burger order. After my son finished his dinner another 20 minutes had now gone by. Sarah never checked on us or gave any updates. I asked for our bill and she said they were still working on my order. I told her to please bring the check. The manager then came by and very quickly said my order had been delivered to another table. (He did comp the burger so I wasn&amp;#39;t charged for it). Our server should have been honest about what happened and should have come back to give us updates. I ended up getting my meal to go. The burger was over cooked and tasted burnt, the bottom bun was completely wet and soggy and the fries were cold. This is a $14 burger on the menu, I would expect much better quality.  I was really looking forward to having a Cheesecake Factory restaurant close by. I normally would give a restaurant a second chance but due to bad service and poor food quality I won&amp;#39;t be back.", "rating": 1, "date": "3/10/2018"}]}